RhinoCommon API
DisplayPipeline.DrawOverlay Event
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DrawEventArgs> DrawOverlay
Public Shared Event DrawOverlay As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace