RhinoCommon API
GetCancel.TaskCompleted Event
[Missing <summary> documentation for "E:Rhino.Input.Custom.GetCancel.TaskCompleted"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler<TaskCompleteEventArgs> TaskCompleted
Public Event TaskCompleted As EventHandler(Of TaskCompleteEventArgs)
Value
Type: System.EventHandler<TaskCompleteEventArgs>
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace