RhinoCommon API
RhinoDoc.MaterialTableEvent Event
 Called when any modification happens to a document's material table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<MaterialTableEventArgs> MaterialTableEvent
Public Shared Event MaterialTableEvent As EventHandler(Of MaterialTableEventArgs)
Value
Type: System.EventHandler<MaterialTableEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoDoc Class
Rhino Namespace