RhinoCommon API
RhinoApp.RdkPlugInUnloading Event
 Monitors when RDK client plugins are unloaded.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler RdkPlugInUnloading
Public Shared Event RdkPlugInUnloading As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RhinoApp Class
Rhino Namespace