RhinoCommon API
RhinoView.SetActive Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.SetActive"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<ViewEventArgs> SetActive
Public Shared Event SetActive As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoView Class
Rhino.Display Namespace