RhinoCommon API
RhinoApp.RdkCacheImageChanged Event
 Monitors when the RDK thumbnail cache images are changed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler RdkCacheImageChanged
Public Shared Event RdkCacheImageChanged As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoApp Class
Rhino Namespace