RhinoCommon SDK
RenderContent.ContentAdded Event
 Used to monitor render content addition to the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentEventArgs> ContentAdded
Public Shared Event ContentAdded As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace