RhinoCommon API
RhinoApp.Closing Event
 Is raised when the application is about to close.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler Closing
Public Shared Event Closing As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoApp Class
Rhino Namespace