RhinoCommon API
RhinoApp.RdkGlobalSettingsChanged Event
 Monitors when RDK global settings are modified.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler RdkGlobalSettingsChanged
Public Shared Event RdkGlobalSettingsChanged As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoApp Class
Rhino Namespace