RhinoCommon API
DisplayPipeline.ViewportProjectionChanged Event
 Called when the projection changes for a viewport being drawn.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DrawEventArgs> ViewportProjectionChanged
Public Shared Event ViewportProjectionChanged As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace