RhinoCommon API
RenderContent.ContentUpdatePreview Event
 Used to monitor render content preview updates.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentEventArgs> ContentUpdatePreview
Public Shared Event ContentUpdatePreview As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContent Class
Rhino.Render Namespace