RhinoCommon API
RhinoApp.RdkUpdateAllPreviews Event
 Monitors when RDK thumbnails are updated.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler RdkUpdateAllPreviews
Public Shared Event RdkUpdateAllPreviews As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoApp Class
Rhino Namespace