RhinoCommon API
Panels.Closed Event
 This event is raised when a panel host is closed
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<PanelEventArgs> Closed
Public Shared Event Closed As EventHandler(Of PanelEventArgs)
Value
Type: System.EventHandler<PanelEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Panels Class
Rhino.UI Namespace