RhinoCommon API
RenderContent.ContentReplacing Event
 Used to monitor render content replacing in the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentEventArgs> ContentReplacing
Public Shared Event ContentReplacing As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContent Class
Rhino.Render Namespace