RhinoCommon API
RhinoDoc.NewDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.NewDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DocumentEventArgs> NewDocument
Public Shared Event NewDocument As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoDoc Class
Rhino Namespace