RhinoCommon API
RhinoDoc.LayerTableEvent Event
 Called when any modification happens to a document's layer table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<LayerTableEventArgs> LayerTableEvent
Public Shared Event LayerTableEvent As EventHandler(Of LayerTableEventArgs)
Value
Type: System.EventHandler<LayerTableEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoDoc Class
Rhino Namespace