RhinoCommon SDK
DisplayPipeline.PreDrawObject Event
 Called right before an individual object is being drawn. NOTE: Do not use this event unless you absolutely need to. It is called for every object in the document and can slow disply down if a large number of objects exist in the document
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<DrawObjectEventArgs> PreDrawObject
Public Shared Event PreDrawObject As EventHandler(Of DrawObjectEventArgs)
Value
Type: System.EventHandler<DrawObjectEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace