RhinoCommon API
Command.UndoRedo Event
 Used to monitor Rhino's built in undo/redo support.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<UndoRedoEventArgs> UndoRedo
Public Shared Event UndoRedo As EventHandler(Of UndoRedoEventArgs)
Value
Type: System.EventHandler<UndoRedoEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Command Class
Rhino.Commands Namespace