RhinoCommon API
Skylight.Changed Event
 This event is raised when a Skylight property value is changed.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderPropertyChangedEvent> Changed
Public Shared Event Changed As EventHandler(Of RenderPropertyChangedEvent)
Value
Type: System.EventHandler<RenderPropertyChangedEvent>
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Skylight Class
Rhino.Render Namespace