RhinoCommon API
RenderContent.CurrentEnvironmentChanged Event
 Event fired when changes to current environments have been made. This will be one of Background, ReflectionAndRefraction or Skylighting Since 6.11
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentEventArgs> CurrentEnvironmentChanged
Public Shared Event CurrentEnvironmentChanged As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderContent Class
Rhino.Render Namespace