RhinoCommon API
RhinoApp.RendererChanged Event
 Monitors when Rhino's current renderer changes.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler RendererChanged
Public Shared Event RendererChanged As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoApp Class
Rhino Namespace