RhinoCommon API
RhinoView.Create Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Create"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<ViewEventArgs> Create
Public Shared Event Create As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoView Class
Rhino.Display Namespace