RhinoCommon SDK
ThumbData.PropertyChanged Event
[Missing <summary> documentation for "E:Rhino.UI.Controls.ThumbnailUI.ThumbData.PropertyChanged"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event PropertyChangedEventHandler PropertyChanged
Public Event PropertyChanged As PropertyChangedEventHandler
Value
Type: System.ComponentModel.PropertyChangedEventHandler
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace