RhinoCommon API
DisplayPipeline.CalculateBoundingBox Event
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.CalculateBoundingBox"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<CalculateBoundingBoxEventArgs> CalculateBoundingBox
Public Shared Event CalculateBoundingBox As EventHandler(Of CalculateBoundingBoxEventArgs)
Value
Type: System.EventHandler<CalculateBoundingBoxEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace