RhinoCommon API
DisplayPipeline.PostDrawObjects Event
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DrawEventArgs> PostDrawObjects
Public Shared Event PostDrawObjects As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace