RhinoCommon API
RhinoPageView.PageViewSpaceChange Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoPageView.PageViewSpaceChange"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<PageViewSpaceChangeEventArgs> PageViewSpaceChange
Public Shared Event PageViewSpaceChange As EventHandler(Of PageViewSpaceChangeEventArgs)
Value
Type: System.EventHandler<PageViewSpaceChangeEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace