RhinoCommon API
RhinoDoc.EndSaveDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.EndSaveDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DocumentSaveEventArgs> EndSaveDocument
Public Shared Event EndSaveDocument As EventHandler(Of DocumentSaveEventArgs)
Value
Type: System.EventHandler<DocumentSaveEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDoc Class
Rhino Namespace