RhinoCommon SDK
RealtimeDisplayMode.HudStatusTextPressed Event
 Listen tot his event if you want to handle a press on the status text component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler HudStatusTextPressed
Public Event HudStatusTextPressed As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace