RhinoCommon API
RhinoApp.KeyboardEvent Event
 Can add or removed delegates that are raised by a keyboard event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event RhinoApp.KeyboardHookEvent KeyboardEvent
Public Shared Event KeyboardEvent As RhinoApp.KeyboardHookEvent
Value
Type: Rhino.RhinoApp.KeyboardHookEvent
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoApp Class
Rhino Namespace