RhinoCommon API
RealtimeDisplayMode.HudPauseButtonPressed Event
 Listen tot his event if you want to handle the pause button control
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler HudPauseButtonPressed
Public Event HudPauseButtonPressed As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace