RhinoCommon API
RhinoDoc.ReplaceRhinoObject Event
 Called if an object is about to be replaced. If both RhinoDoc.UndoActive() and RhinoDoc.RedoActive() return false, then immediately after the ReplaceObject event, there will be a DeleteObject event followed by an AddObject event. If either RhinoDoc.UndoActive() or RhinoDoc::RedoActive() return true, then immediately after the ReplaceObject event, there will be a DeleteObject event followed by an UndeleteObject event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoReplaceObjectEventArgs> ReplaceRhinoObject
Public Shared Event ReplaceRhinoObject As EventHandler(Of RhinoReplaceObjectEventArgs)
Value
Type: System.EventHandler<RhinoReplaceObjectEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace