RhinoCommon API
DisplayPipeline.CalculateBoundingBoxZoomExtents Event
 Calculate a bounding to include in the Zoom Extents command.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<CalculateBoundingBoxEventArgs> CalculateBoundingBoxZoomExtents
Public Shared Event CalculateBoundingBoxZoomExtents As EventHandler(Of CalculateBoundingBoxEventArgs)
Value
Type: System.EventHandler<CalculateBoundingBoxEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace