RhinoCommon SDK
ThumbData.PropertyChanged Event
[Missing <summary> documentation for "E:Rhino.UI.Controls.ThumbData.PropertyChanged"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public event PropertyChangedEventHandler PropertyChanged
Public Event PropertyChanged As PropertyChangedEventHandler
Value
Type: System.ComponentModel.PropertyChangedEventHandler
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace