RhinoCommon API
RhinoDoc.LightTableEvent Event
 Called when any modification happens to a document's light table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<LightTableEventArgs> LightTableEvent
Public Shared Event LightTableEvent As EventHandler(Of LightTableEventArgs)
Value
Type: System.EventHandler<LightTableEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoDoc Class
Rhino Namespace