RhinoCommon API
RealtimeDisplayMode.HudProductNamePressed Event
 Listen tot his event if you want to handle a press on the product name component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler HudProductNamePressed
Public Event HudProductNamePressed As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace