RhinoCommon API
Notification.PropertyChanged Event
 Triggered whenever a visible property of the instance changes.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event PropertyChangedEventHandler PropertyChanged
Public Event PropertyChanged As PropertyChangedEventHandler
Value
Type: System.ComponentModel.PropertyChangedEventHandler
Implements
INotifyPropertyChanged.PropertyChanged
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace