RhinoCommon API
CollapsibleSectionImpl.ViewModelActivated Event
[Missing <summary> documentation for "E:Rhino.UI.Controls.CollapsibleSectionImpl.ViewModelActivated"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler ViewModelActivated
Public Event ViewModelActivated As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace