RhinoCommon API
RhinoDoc.ModifyObjectAttributes Event
 Called when all object attributes are changed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoModifyObjectAttributesEventArgs> ModifyObjectAttributes
Public Shared Event ModifyObjectAttributes As EventHandler(Of RhinoModifyObjectAttributesEventArgs)
Value
Type: System.EventHandler<RhinoModifyObjectAttributesEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDoc Class
Rhino Namespace