RhinoCommon API
DisplayPipeline.ObjectCulling Event
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.ObjectCulling"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<CullObjectEventArgs> ObjectCulling
Public Shared Event ObjectCulling As EventHandler(Of CullObjectEventArgs)
Value
Type: System.EventHandler<CullObjectEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace