RhinoCommon API
RealtimeDisplayMode.HudLockButtonPressed Event
 Listen tot his event if you want to handle the lock button control
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler HudLockButtonPressed
Public Event HudLockButtonPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace