RhinoCommon API
UndoRedo.UndoRedoChanged Event
 This event is raised when undo/redo occurs in rdk.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderPropertyChangedEvent> UndoRedoChanged
Public Shared Event UndoRedoChanged As EventHandler(Of RenderPropertyChangedEvent)
Value
Type: System.EventHandler<RenderPropertyChangedEvent>
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
UndoRedo Class
Rhino.Render Namespace