RhinoCommon API
RealtimeDisplayMode.HudPlayButtonPressed Event
 Listen to this event if you want to handle the play button control.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler HudPlayButtonPressed
Public Event HudPlayButtonPressed As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace