RhinoCommon API
RenderWindow.Cloned Event
[Missing <summary> documentation for "E:Rhino.Render.RenderWindow.Cloned"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderWindowClonedEventArgs> Cloned
Public Shared Event Cloned As EventHandler(Of RenderWindowClonedEventArgs)
Value
Type: System.EventHandler<RenderWindowClonedEventArgs>
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderWindow Class
Rhino.Render Namespace