RhinoCommon API
RhinoDoc.EndOpenDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.EndOpenDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DocumentOpenEventArgs> EndOpenDocument
Public Shared Event EndOpenDocument As EventHandler(Of DocumentOpenEventArgs)
Value
Type: System.EventHandler<DocumentOpenEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoDoc Class
Rhino Namespace