RhinoCommon API
RhinoApp.Idle Event
 Occurs when the application finishes processing and is about to enter the idle state
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler Idle
Public Shared Event Idle As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoApp Class
Rhino Namespace