RhinoCommon API
RhinoDoc.DeselectAllObjects Event
 Called when all objects are deselected.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoDeselectAllObjectsEventArgs> DeselectAllObjects
Public Shared Event DeselectAllObjects As EventHandler(Of RhinoDeselectAllObjectsEventArgs)
Value
Type: System.EventHandler<RhinoDeselectAllObjectsEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoDoc Class
Rhino Namespace