RhinoCommon API
RenderContent.ContentDeleted Event
 Used to monitor render content deletion from the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentEventArgs> ContentDeleted
Public Shared Event ContentDeleted As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContent Class
Rhino.Render Namespace