RhinoCommon API
RhinoDoc.UndeleteRhinoObject Event
Called if an object is un-deleted.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoObjectEventArgs> UndeleteRhinoObject
Public Shared Event UndeleteRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDoc Class
Rhino Namespace