RhinoCommon API
RhinoDoc.BeginSaveDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.BeginSaveDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DocumentSaveEventArgs> BeginSaveDocument
Public Shared Event BeginSaveDocument As EventHandler(Of DocumentSaveEventArgs)
Value
Type: System.EventHandler<DocumentSaveEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDoc Class
Rhino Namespace