RhinoCommon API
RhinoView.Rename Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Rename"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<ViewEventArgs> Rename
Public Shared Event Rename As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoView Class
Rhino.Display Namespace