RhinoCommon API
RealtimeDisplayMode.HudTimePressed Event
 Listen tot his event if you want to handle a press press on the time component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler HudTimePressed
Public Event HudTimePressed As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace