RhinoCommon API
RhinoView.Destroy Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Destroy"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<ViewEventArgs> Destroy
Public Shared Event Destroy As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoView Class
Rhino.Display Namespace