RhinoCommon API
RhinoDoc.GroupTableEvent Event
 Called when any modification happens to a document's group table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<GroupTableEventArgs> GroupTableEvent
Public Shared Event GroupTableEvent As EventHandler(Of GroupTableEventArgs)
Value
Type: System.EventHandler<GroupTableEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoDoc Class
Rhino Namespace