RhinoCommon API
FilePdf.PreWrite Event
 Fired immediately before a Pdf is written
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<FilePdfEventArgs> PreWrite
Public Shared Event PreWrite As EventHandler(Of FilePdfEventArgs)
Value
Type: System.EventHandler<FilePdfEventArgs>
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace