RhinoCommon API
HostUtils.OnSendLogMessageToCloud Event
 Is raised when an exception is reported with one of the method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event HostUtils.SendLogMessageToCloudDelegate OnSendLogMessageToCloud
Public Shared Event OnSendLogMessageToCloud As HostUtils.SendLogMessageToCloudDelegate
Value
Type: Rhino.Runtime.HostUtils.SendLogMessageToCloudDelegate
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace