RhinoCommon API
DisplayPipeline.InitFrameBuffer Event
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.InitFrameBuffer"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<InitFrameBufferEventArgs> InitFrameBuffer
Public Shared Event InitFrameBuffer As EventHandler(Of InitFrameBufferEventArgs)
Value
Type: System.EventHandler<InitFrameBufferEventArgs>
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace