RhinoCommon API
RhinoDoc.EndOpenDocumentInitialiViewUpdate Event
 This event is raised after EndOpenDocument when the documents initial views have been created and initialized.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DocumentOpenEventArgs> EndOpenDocumentInitialiViewUpdate
Public Shared Event EndOpenDocumentInitialiViewUpdate As EventHandler(Of DocumentOpenEventArgs)
Value
Type: System.EventHandler<DocumentOpenEventArgs>
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDoc Class
Rhino Namespace