RhinoCommon API
RhinoApp.AppSettingsChanged Event
 Is raised when settings are changed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler AppSettingsChanged
Public Shared Event AppSettingsChanged As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoApp Class
Rhino Namespace