RhinoCommon API
DisplayPipeline.PreDrawObjects Event
 Called before objects are been drawn. Depth writing and testing are on.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DrawEventArgs> PreDrawObjects
Public Shared Event PreDrawObjects As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace