RhinoCommon API
DisplayPipeline Events
The DisplayPipeline type exposes the following members.
Events
Name | Description
CalculateBoundingBox
CalculateBoundingBoxZoomExtents
 Calculate a bounding to include in the Zoom Extents command.
DisplayModeChanged
DrawForeground
 Called after all non-highlighted objects have been drawn and PostDrawObjects has been called. Depth writing and testing are turned OFF. If you want to draw with depth writing/testing, see PostDrawObjects.
DrawOverlay
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
InitFrameBuffer
ObjectCulling
PostDrawObjects
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
PreDrawObject
 Called right before an individual object is being drawn. NOTE: Do not use this event unless you absolutely need to. It is called for every object in the document and can slow disply down if a large number of objects exist in the document
PreDrawObjects
 Called before objects are been drawn. Depth writing and testing are on.
PreDrawTransparentObjects
 Called before transparent objects have been drawn. Depth writing and testing are on.
ViewportProjectionChanged
 Called when the projection changes for a viewport being drawn.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace