RhinoCommon API
RhinoApp Events
The RhinoApp type exposes the following members.
Events
Name | Description
AppSettingsChanged
 Is raised when settings are changed.
Closing
 Is raised when the application is about to close.
EscapeKeyPressed
 Can add or removed delegates that are raised when the escape key is clicked.
Idle
 Occurs when the application finishes processing and is about to enter the idle state
Initialized
 Is raised when the apllication is fully initialized.
KeyboardEvent
 Can add or removed delegates that are raised by a keyboard event.
RdkCacheImageChanged
 Monitors when the RDK thumbnail cache images are changed.
RdkGlobalSettingsChanged
 Monitors when RDK global settings are modified.
RdkNewDocument
 Monitors when RDK document information is rebuilt.
RdkPlugInUnloading
 Monitors when RDK client plugins are unloaded.
RdkUpdateAllPreviews
 Monitors when RDK thumbnails are updated.
RendererChanged
 Monitors when Rhino's current renderer changes.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace