RhinoCommon API
PlugIn Events
The PlugIn type exposes the following members.
Events
Name | Description
SettingsSaved
 This event is raised when an instance of Rhino has modified the external settings file associated with this plug-in's Settings property.
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace