RhinoCommon API
RealtimeDisplayMode Events
The RealtimeDisplayMode type exposes the following members.
Events
Name | Description
HudLockButtonPressed
 Listen tot his event if you want to handle the lock button control
HudPauseButtonPressed
 Listen tot his event if you want to handle the pause button control
HudPlayButtonPressed
 Listen to this event if you want to handle the play button control.
HudProductNamePressed
 Listen tot his event if you want to handle a press on the product name component
HudStatusTextPressed
 Listen tot his event if you want to handle a press on the status text component
HudTimePressed
 Listen tot his event if you want to handle a press press on the time component
HudUnlockButtonPressed
 Listen tot his event if you want to handle the unlock button control
MaxPassesChanged
 Listen to this if you want to handle changes in maximum pass count through the HUD.
OnDisplayPipelineSettingsChanged
OnDrawMiddleground
OnInitFramebuffer
Top
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace