RhinoCommon API
RhinoDoc Events
The RhinoDoc type exposes the following members.
Events
Name | Description
ActiveDocumentChanged
 This event is raised when the active document used by modeless user interface changes. On Mac Rhino this will get raised before the NewDocument, BeginOpenDocument and EndOpenDocument events. Mac Rhino will also raise this event with 0 for the document Id and a null document pointer when the last document is closed. Windows Rhino will raise this event after the NewDocument, BeginOpenDocument and EndOpenDocument events when a new or existing model is opened.
AddRhinoObject
Called if a new object is added to the document.
BeforeTransformObjects
 Called before objects are being transformed
BeginOpenDocument
 This event is raised when the document open operation begins. NOTE: On Windows, this event will be fired when a clipboard paste operation occurs, as Rhino opens a .tmp file in the User's Local folder with the contents of the pasted document.
BeginSaveDocument
CloseDocument
DeleteRhinoObject
 Called if an object is deleted. At some later point the object can be un-deleted.
DeselectAllObjects
 Called when all objects are deselected.
DeselectObjects
 Called when object(s) are deselected.
DimensionStyleTableEvent
 Called when any modification happens to a document's dimension style table.
DocumentPropertiesChanged
EndOpenDocument
EndOpenDocumentInitialiViewUpdate
 This event is raised after EndOpenDocument when the documents initial views have been created and initialized.
EndSaveDocument
GroupTableEvent
 Called when any modification happens to a document's group table.
InstanceDefinitionTableEvent
 Called when any modification happens to a document's light table.
LayerTableEvent
 Called when any modification happens to a document's layer table.
LightTableEvent
 Called when any modification happens to a document's light table.
MaterialTableEvent
 Called when any modification happens to a document's material table.
ModifyObjectAttributes
 Called when all object attributes are changed.
NewDocument
PurgeRhinoObject
 Called if an object is being purged from a document. The object will cease to exist forever.
RenderEnvironmentTableEvent
RenderMaterialsTableEvent
RenderTextureTableEvent
 Called when the RenderTextureTable has been loaded, is about to be cleared or has been cleared. See RhinoDoc.RenderContentTableEventType for more information.
ReplaceRhinoObject
 Called if an object is about to be replaced. If both RhinoDoc.UndoActive() and RhinoDoc.RedoActive() return false, then immediately after the ReplaceObject event, there will be a DeleteObject event followed by an AddObject event. If either RhinoDoc.UndoActive() or RhinoDoc::RedoActive() return true, then immediately after the ReplaceObject event, there will be a DeleteObject event followed by an UndeleteObject event.
SelectObjects
 Called when object(s) are selected.
TextureMappingEvent
 Called when any modification happens to a document objects texture mapping.
UndeleteRhinoObject
Called if an object is un-deleted.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace