RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_GEOMETRY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_GEOMETRY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_GEOMETRY = 65536
Public Const TCODE_LEGACY_GEOMETRY As UInteger = 65536
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace