RhinoCommon API
File3dmTypeCodes.TCODE_DISP_MAXLENGTH Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DISP_MAXLENGTH"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DISP_MAXLENGTH = 4194339
Public Const TCODE_DISP_MAXLENGTH As UInteger = 4194339
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace