RhinoCommon API
File3dmTypeCodes.TCODE_TEXTURE_MAPPING_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TEXTURE_MAPPING_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_TEXTURE_MAPPING_TABLE = 268435493
Public Const TCODE_TEXTURE_MAPPING_TABLE As UInteger = 268435493
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace