RhinoCommon API
File3dmTypeCodes.TCODE_OLD_FULLMESH Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OLD_FULLMESH"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OLD_FULLMESH = 1048596
Public Const TCODE_OLD_FULLMESH As UInteger = 1048596
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace