RhinoCommon API
File3dmTypeCodes.TCODE_LAYERSNAPABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERSNAPABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYERSNAPABLE = 2151678001
Public Const TCODE_LAYERSNAPABLE As UInteger = 2151678001
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace