RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_SPLSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_SPLSTUFF"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_SPLSTUFF = 65801
Public Const TCODE_LEGACY_SPLSTUFF As UInteger = 65801
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace