RhinoCommon API
File3dmTypeCodes.TCODE_USER_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_USER_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_USER_RECORD = 536871041
Public Const TCODE_USER_RECORD As UInteger = 536871041
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace