RhinoCommon API
File3dmTypeCodes.TCODE_OBJECT_RECORD_ATTRIBUTES_USERDATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_ATTRIBUTES_USERDATA"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OBJECT_RECORD_ATTRIBUTES_USERDATA = 33554547
Public Const TCODE_OBJECT_RECORD_ATTRIBUTES_USERDATA As UInteger = 33554547
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace