RhinoCommon API
File3dmTypeCodes.TCODE_RENDER Field
0x0080000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RENDER = 8388608
Public Const TCODE_RENDER As UInteger = 8388608
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace