RhinoCommon API
File3dmTypeCodes.TCODE_MATERIAL_TABLE Field
rendering materials.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_MATERIAL_TABLE = 268435472
Public Const TCODE_MATERIAL_TABLE As UInteger = 268435472
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace