RhinoCommon API
File3dmTypeCodes.TCODE_RENDERMESHPARAMS Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RENDERMESHPARAMS"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RENDERMESHPARAMS = 4194336
Public Const TCODE_RENDERMESHPARAMS As UInteger = 4194336
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace