RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY_DATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY_DATA"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OBJECT_RECORD_HISTORY_DATA = 33587318
Public Const TCODE_OBJECT_RECORD_HISTORY_DATA As UInteger = 33587318
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace