RhinoCommon API
RhinoMath.UnsetIntIndex Field
When signed int values are used in a context where 0 and small negative values are valid indices and there needs to be a value that indicates the index is not set, OpenNURBS uses this index. This value is -2147483647, or Int32.MinValue + 1. This value paralles ON_UNSET_INT_INDEX.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const int UnsetIntIndex = -2147483647
Public Const UnsetIntIndex As Integer = -2147483647
Field Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoMath Class
Rhino Namespace