RhinoCommon API
File3dmTypeCodes.TCODE_LAYER_OBSELETE_2 Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER_OBSELETE_2"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYER_OBSELETE_2 = 2151677972
Public Const TCODE_LAYER_OBSELETE_2 As UInteger = 2151677972
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace