RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_DISPLAYMODE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_DISPLAYMODE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_VIEW_DISPLAYMODE = 2684356923
Public Const TCODE_VIEW_DISPLAYMODE As UInteger = 2684356923
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace