RhinoCommon SDK
File3dmTypeCodes.TCODE_RHINOIO_OBJECT_BREP Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RHINOIO_OBJECT_BREP"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_RHINOIO_OBJECT_BREP = 131083
Public Const TCODE_RHINOIO_OBJECT_BREP As UInteger = 131083
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace