RhinoCommon API
File3dmTypeCodes.TCODE_LIGHT_RECORD_END Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LIGHT_RECORD_END"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LIGHT_RECORD_END = 2181038191
Public Const TCODE_LIGHT_RECORD_END As UInteger = 2181038191
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace