RhinoCommon SDK
File3dmTypeCodes.TCODE_BITMAPPREVIEW Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_BITMAPPREVIEW"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_BITMAPPREVIEW = 33554452
Public Const TCODE_BITMAPPREVIEW As UInteger = 33554452
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace