RhinoCommon API
File3dmTypeCodes.TCODE_DISP_CPLINES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DISP_CPLINES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DISP_CPLINES = 2151677986
Public Const TCODE_DISP_CPLINES As UInteger = 2151677986
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace