RhinoCommon SDK
File3dmTypeCodes.TCODE_TOLERANCE Field
0x08000000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_TOLERANCE = 134217728
Public Const TCODE_TOLERANCE As UInteger = 134217728
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace