RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_PNTSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_PNTSTUFF"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LEGACY_PNTSTUFF = 65802
Public Const TCODE_LEGACY_PNTSTUFF As UInteger = 65802
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace