RhinoCommon API
File3dmTypeCodes.TCODE_LINETYPE_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LINETYPE_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LINETYPE_TABLE = 268435491
Public Const TCODE_LINETYPE_TABLE As UInteger = 268435491
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace