RhinoCommon API
File3dmTypeCodes.TCODE_PROPERTIES_PREVIEWIMAGE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_PREVIEWIMAGE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PROPERTIES_PREVIEWIMAGE = 536903715
Public Const TCODE_PROPERTIES_PREVIEWIMAGE As UInteger = 536903715
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace