RhinoCommon API
TexturedValue<T>.Amount Field
[Missing <summary> documentation for "F:Rhino.Render.TexturedValue`1.Amount"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Amount
Public Amount As Single
Field Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
TexturedValue<T> Class
Rhino.Render Namespace