RhinoCommon SDK
SubDFacePtr.Default Field
[Missing <summary> documentation for "F:Rhino.Geometry.SubDFacePtr.Default"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static readonly SubDFacePtr Default
Public Shared ReadOnly Default As SubDFacePtr
Field Value
Type: SubDFacePtr
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace