RhinoCommon API
File3dmTypeCodes.TCODE_PROPERTIES_REVISIONHISTORY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_REVISIONHISTORY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PROPERTIES_REVISIONHISTORY = 536903713
Public Const TCODE_PROPERTIES_REVISIONHISTORY As UInteger = 536903713
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace