RhinoCommon API
File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY_HEADER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY_HEADER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OBJECT_RECORD_HISTORY_HEADER = 33587317
Public Const TCODE_OBJECT_RECORD_HISTORY_HEADER As UInteger = 33587317
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace