RhinoCommon API
File3dmTypeCodes.TCODE_INTERFACE Field
0x02000000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_INTERFACE = 33554432
Public Const TCODE_INTERFACE As UInteger = 33554432
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace