RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEWPORT_DISPLAY_MODE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEWPORT_DISPLAY_MODE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEWPORT_DISPLAY_MODE = 2181038101
Public Const TCODE_VIEWPORT_DISPLAY_MODE As UInteger = 2181038101
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace