RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_WALLPAPER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_WALLPAPER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_WALLPAPER = 536905531
Public Const TCODE_VIEW_WALLPAPER As UInteger = 536905531
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace