RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_TOL_ANGLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_TOL_ANGLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_TOL_ANGLE = 134217730
Public Const TCODE_LEGACY_TOL_ANGLE As UInteger = 134217730
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace