RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYERLOCKED Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERLOCKED"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LAYERLOCKED = 2151677976
Public Const TCODE_LAYERLOCKED As UInteger = 2151677976
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace