RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_PRT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_PRT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_PRT = 65538
Public Const TCODE_LEGACY_PRT As UInteger = 65538
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace