RhinoCommon API
File3dmTypeCodes.TCODE_OLD_MESH_VERTEX_NORMALS Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OLD_MESH_VERTEX_NORMALS"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OLD_MESH_VERTEX_NORMALS = 1048594
Public Const TCODE_OLD_MESH_VERTEX_NORMALS As UInteger = 1048594
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace