RhinoCommon API
RhinoMath.DefaultAngleTolerance Field
 Represents the default angle tolerance, used when no other values are provided.
This is one degree, expressed in radians.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double DefaultAngleTolerance = 0.0174532925199433
Public Const DefaultAngleTolerance As Double = 0.0174532925199433
Field Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoMath Class
Rhino Namespace