RhinoCommon API
File3dmTypeCodes.TCODE_SHOWWORLDAXES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SHOWWORLDAXES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SHOWWORLDAXES = 2181038089
Public Const TCODE_SHOWWORLDAXES As UInteger = 2181038089
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace