RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_RENDER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_RENDER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_RENDER = 536903741
Public Const TCODE_SETTINGS_RENDER As UInteger = 536903741
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace