RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_ASM Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_ASM"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_ASM = 65537
Public Const TCODE_LEGACY_ASM As UInteger = 65537
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace