RhinoCommon SDK
File3dmTypeCodes.TCODE_OPENNURBS_OBJECT Field
0x00020000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_OPENNURBS_OBJECT = 131072
Public Const TCODE_OPENNURBS_OBJECT As UInteger = 131072
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace