RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_RENDERMESH Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_RENDERMESH"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_RENDERMESH = 536903730
Public Const TCODE_SETTINGS_RENDERMESH As UInteger = 536903730
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace