RhinoCommon SDK
SubDVertexPtr.Default Field
[Missing <summary> documentation for "F:Rhino.Geometry.SubDVertexPtr.Default"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static readonly SubDVertexPtr Default
Public Shared ReadOnly Default As SubDVertexPtr
Field Value
Type: SubDVertexPtr
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace