RhinoCommon API
File3dmTypeCodes.TCODE_ANONYMOUS_CHUNK Field
(TCODE_USER | TCODE_CRC | 0x0000)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_ANONYMOUS_CHUNK = 1073774592
Public Const TCODE_ANONYMOUS_CHUNK As UInteger = 1073774592
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace