RhinoCommon API
File3dmTypeCodes.TCODE_FONT_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_FONT_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_FONT_TABLE = 268435481
Public Const TCODE_FONT_TABLE As UInteger = 268435481
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace