RhinoCommon API
File3dmTypeCodes.TCODE_LAYERSTATE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERSTATE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYERSTATE = 2151678003
Public Const TCODE_LAYERSTATE As UInteger = 2151678003
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace