RhinoCommon API
File3dmTypeCodes.TCODE_SHOWGRIDAXES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SHOWGRIDAXES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SHOWGRIDAXES = 2181038088
Public Const TCODE_SHOWGRIDAXES As UInteger = 2181038088
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace