RhinoCommon API
MeshPointDataStruct.m_Triangle Field
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public char m_Triangle
Public m_Triangle As Char
Field Value
Type: Char
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshPointDataStruct Structure
Rhino.Runtime.InteropWrappers Namespace