RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_SHOWCONAXES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_SHOWCONAXES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_SHOWCONAXES = 2684355643
Public Const TCODE_VIEW_SHOWCONAXES As UInteger = 2684355643
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace