RhinoCommon API
File3dmTypeCodes.TCODE_RADIAL_DIMENSION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RADIAL_DIMENSION"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RADIAL_DIMENSION = 2097160
Public Const TCODE_RADIAL_DIMENSION As UInteger = 2097160
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace