RhinoCommon API
File3dmTypeCodes.TCODE_NAME Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_NAME"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_NAME = 33554433
Public Const TCODE_NAME As UInteger = 33554433
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace