RhinoCommon API
File3dmTypeCodes.TCODE_RHINOIO_OBJECT_NURBS_SURFACE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RHINOIO_OBJECT_NURBS_SURFACE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RHINOIO_OBJECT_NURBS_SURFACE = 131081
Public Const TCODE_RHINOIO_OBJECT_NURBS_SURFACE As UInteger = 131081
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace