RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_SRF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_SRF"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_SRF = 65543
Public Const TCODE_LEGACY_SRF As UInteger = 65543
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace