RhinoCommon API
File3dmTypeCodes.TCODE_GROUP_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_GROUP_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_GROUP_TABLE = 268435480
Public Const TCODE_GROUP_TABLE As UInteger = 268435480
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace