RhinoCommon API
File3dmTypeCodes.TCODE_DIMSTYLE_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DIMSTYLE_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DIMSTYLE_RECORD = 536903797
Public Const TCODE_DIMSTYLE_RECORD As UInteger = 536903797
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace