RhinoCommon API
File3dmTypeCodes.TCODE_LEGACY_BNDSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_BNDSTUFF"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_BNDSTUFF = 65797
Public Const TCODE_LEGACY_BNDSTUFF As UInteger = 65797
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace