RhinoCommon API
File3dmTypeCodes.TCODE_OLD_MESH_UV Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OLD_MESH_UV"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OLD_MESH_UV = 1048595
Public Const TCODE_OLD_MESH_UV As UInteger = 1048595
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace