RhinoCommon API
RhinoMath.ZeroTolerance Field
 Gets the Zero Tolerance constant (1.0e-12).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double ZeroTolerance = 1E-12
Public Const ZeroTolerance As Double = 1E-12
Field Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoMath Class
Rhino Namespace