RhinoCommon API
File3dmTypeCodes.TCODE_OBSOLETE_LAYERSET_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBSOLETE_LAYERSET_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OBSOLETE_LAYERSET_RECORD = 536903801
Public Const TCODE_OBSOLETE_LAYERSET_RECORD As UInteger = 536903801
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace