RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_WALLPAPER_V3 Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_WALLPAPER_V3"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_WALLPAPER_V3 = 536905547
Public Const TCODE_VIEW_WALLPAPER_V3 As UInteger = 536905547
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace