RhinoCommon API
File3dmTypeCodes.TCODE_INSTANCE_DEFINITION_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_INSTANCE_DEFINITION_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_INSTANCE_DEFINITION_TABLE = 268435489
Public Const TCODE_INSTANCE_DEFINITION_TABLE As UInteger = 268435489
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace