RhinoCommon API
File3dmTypeCodes.TCODE_DISP_AM_RESOLUTION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DISP_AM_RESOLUTION"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DISP_AM_RESOLUTION = 2151677957
Public Const TCODE_DISP_AM_RESOLUTION As UInteger = 2151677957
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace