RhinoCommon SDK
SubDEdgePtr.Default Field
[Missing <summary> documentation for "F:Rhino.Geometry.SubDEdgePtr.Default"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static readonly SubDEdgePtr Default
Public Shared ReadOnly Default As SubDEdgePtr
Field Value
Type: SubDEdgePtr
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace