RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_MATERIAL_INDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_MATERIAL_INDEX"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_CURRENT_MATERIAL_INDEX = 536903737
Public Const TCODE_SETTINGS_CURRENT_MATERIAL_INDEX As UInteger = 536903737
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace