RhinoCommon API
File3dmTypeCodes.TCODE_UNIT_AND_TOLERANCES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_UNIT_AND_TOLERANCES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_UNIT_AND_TOLERANCES = 33554448
Public Const TCODE_UNIT_AND_TOLERANCES As UInteger = 33554448
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace