RhinoCommon API
File3dmTypeCodes.TCODE_ANNOTATION_SETTINGS Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ANNOTATION_SETTINGS"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_ANNOTATION_SETTINGS = 2097153
Public Const TCODE_ANNOTATION_SETTINGS As UInteger = 2097153
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace