RhinoCommon API
RhinoMath.SqrtEpsilon Field
 Represents a default value that is used when comparing square roots.
This value is several orders of magnitude larger than ZeroTolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const double SqrtEpsilon = 1.490116119385E-08
Public Const SqrtEpsilon As Double = 1.490116119385E-08
Field Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoMath Class
Rhino Namespace