RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_TRACEIMAGE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_TRACEIMAGE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_TRACEIMAGE = 536905275
Public Const TCODE_VIEW_TRACEIMAGE As UInteger = 536905275
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace