RhinoCommon API
File3dmTypeCodes.TCODE_RENDER_MATERIAL_ID Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RENDER_MATERIAL_ID"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RENDER_MATERIAL_ID = 4194311
Public Const TCODE_RENDER_MATERIAL_ID As UInteger = 4194311
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace