RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_VIEWPORT_USERDATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_VIEWPORT_USERDATA"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_VIEWPORT_USERDATA = 536907067
Public Const TCODE_VIEW_VIEWPORT_USERDATA As UInteger = 536907067
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace