RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_SHOWWORLDAXES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_SHOWWORLDAXES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_SHOWWORLDAXES = 2684355899
Public Const TCODE_VIEW_SHOWWORLDAXES As UInteger = 2684355899
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace