RhinoCommon API
File3dmTypeCodes.TCODE_OPENNURBS_CLASS_DATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_CLASS_DATA"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OPENNURBS_CLASS_DATA = 196604
Public Const TCODE_OPENNURBS_CLASS_DATA As UInteger = 196604
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace