RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_NAMED_CPLANE_LIST Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_NAMED_CPLANE_LIST"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_NAMED_CPLANE_LIST = 536903733
Public Const TCODE_SETTINGS_NAMED_CPLANE_LIST As UInteger = 536903733
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace