RhinoCommon API
File3dmTypeCodes.TCODE_LAYER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYER = 4194320
Public Const TCODE_LAYER As UInteger = 4194320
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace