RhinoCommon SDK
SubDEdgePtr.UnsetSectorWeight Field
[Missing <summary> documentation for "F:Rhino.Geometry.SubDEdgePtr.UnsetSectorWeight"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static readonly double UnsetSectorWeight
Public Shared ReadOnly UnsetSectorWeight As Double
Field Value
Type: Double
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace