RhinoCommon SDK
File3dmTypeCodes.TCODE_ENDOFTABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ENDOFTABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_ENDOFTABLE = 4294967295
Public Const TCODE_ENDOFTABLE As UInteger = 4294967295
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace