RhinoCommon SDK
File3dmTypeCodes.TCODE_COMMENTBLOCK Field
 (0x00000001) The TCODE_COMMENTBLOCK is the first chunk in the file, starts 32 bytes into the file, and contains text information terminated with a ^m_z. This ^m_z and contents of this chunk were expanded in February 2000. Files written with code released earlier than this will not have the ^m_z.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_COMMENTBLOCK = 1
Public Const TCODE_COMMENTBLOCK As UInteger = 1
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace