RhinoCommon API
MeshPointDataStruct.m_et Field
 This is only needed when passing values to the Rhino C++ core, ignore for .NET plug-ins.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double m_et
Public m_et As Double
Field Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshPointDataStruct Structure
Rhino.Runtime.InteropWrappers Namespace