RhinoCommon SDK
File3dmTypeCodes.TCODE_NEAR_CLIP_PLANE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_NEAR_CLIP_PLANE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_NEAR_CLIP_PLANE = 33554445
Public Const TCODE_NEAR_CLIP_PLANE As UInteger = 33554445
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace