RhinoCommon API
File3dmTypeCodes.TCODE_VIEW Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW = 33554434
Public Const TCODE_VIEW As UInteger = 33554434
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace