RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_SHOWCONGRID Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_SHOWCONGRID"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_SHOWCONGRID = 2684355387
Public Const TCODE_VIEW_SHOWCONGRID As UInteger = 2684355387
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace