RhinoCommon SDK
File3dmTypeCodes.TCODE_RH_POINT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RH_POINT"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_RH_POINT = 1048577
Public Const TCODE_RH_POINT As UInteger = 1048577
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace