RhinoCommon SDK
File3dmTypeCodes.TCODE_GEOMETRY Field
0x0010000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_GEOMETRY = 1048576
Public Const TCODE_GEOMETRY As UInteger = 1048576
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace