RhinoCommon API
File3dmTypeCodes.TCODE_OBJECT_RECORD_ATTRIBUTES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_ATTRIBUTES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OBJECT_RECORD_ATTRIBUTES = 33587314
Public Const TCODE_OBJECT_RECORD_ATTRIBUTES As UInteger = 33587314
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace