RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYERTHAWED Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERTHAWED"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LAYERTHAWED = 2151677975
Public Const TCODE_LAYERTHAWED As UInteger = 2151677975
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace