RhinoCommon SDK
SubDEdgePtr Fields
The SubDEdgePtr type exposes the following members.
Fields
Name | Description
Default
UnsetSectorWeight
Top
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace