RhinoCommon API
RhinoMath Fields
The RhinoMath type exposes the following members.
Fields
Name | Description
DefaultAngleTolerance
 Represents the default angle tolerance, used when no other values are provided.
This is one degree, expressed in radians.
SqrtEpsilon
 Represents a default value that is used when comparing square roots.
This value is several orders of magnitude larger than ZeroTolerance.
UnsetIntIndex
When signed int values are used in a context where 0 and small negative values are valid indices and there needs to be a value that indicates the index is not set, OpenNURBS uses this index. This value is -2147483647, or Int32.MinValue + 1. This value paralles ON_UNSET_INT_INDEX.
UnsetSingle
 Gets the single precision floating point number that is considered 'unset' in Rhino.
UnsetValue
 Gets the Rhino standard Unset value. Use this value rather than Double.NaN when a bogus floating point value is required.
ZeroTolerance
 Gets the Zero Tolerance constant (1.0e-12).
Top
See Also
Reference
RhinoMath Class
Rhino Namespace