RhinoCommon SDK
Curve.IsArc Method (Double)
 Test a curve to see if it can be represented by an arc or circle within the given tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsArc(
	double tolerance
)
Public Function IsArc (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
 true if the curve can be represented by an arc or a circle within tolerance.
See Also
Reference
Curve Class
IsArc Overload
Rhino.Geometry Namespace