RhinoCommon API
Vector3d.PerpendicularTo Method
 Sets this vector to be perpendicular to another vector. Result is not unitized.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PerpendicularTo(
	Vector3d other
)
Public Function PerpendicularTo (
	other As Vector3d
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector3d
Vector to use as guide.
Return Value
Type: Boolean
true on success, false if input vector is zero or invalid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace