RhinoCommon API
Transform.Linearize Method
 Affineize() and replaces the last column with (0 0 0 1)^T, discarding any translation part of this transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Linearize()
Public Sub Linearize
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Transform Structure
Rhino.Geometry Namespace