RhinoCommon API
PersistentSettings Constructor (SerializationInfo, StreamingContext)
Initializes a new instance of the PersistentSettings class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PersistentSettings(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
[Missing <param name="info"/> documentation for "M:Rhino.PersistentSettings.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
context
Type: System.Runtime.Serialization.StreamingContext
[Missing <param name="context"/> documentation for "M:Rhino.PersistentSettings.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PersistentSettings Class
PersistentSettings Overload
Rhino Namespace