RhinoCommon SDK
Surface.Offset Method
 Constructs a new surface which is offset from the current surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface Offset(
	double distance,
	double tolerance
)
Public Function Offset (
	distance As Double,
	tolerance As Double
) As Surface
Parameters
distance
Type: System.Double
Distance (along surface normal) to offset.
tolerance
Type: System.Double
Offset accuracy.
Return Value
Type: Surface
The offsetted surface or null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace