RhinoCommon API
MeshNgonList.RemoveNgons Method
 Remove one or more ngons from the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RemoveNgons(
	IEnumerable<int> indices
)
Public Function RemoveNgons (
	indices As IEnumerable(Of Integer)
) As Integer
Parameters
indices
Type: System.Collections.Generic.IEnumerable<Int32>
An array of ngon indices.
Return Value
Type: Int32
The number of deleted ngons.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace