RhinoCommon SDK
Mesh.GetPartition Method
 Retrieves a partition. See CreatePartitions(Int32, Int32) for details.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshPart GetPartition(
	int which
)
Public Function GetPartition (
	which As Integer
) As MeshPart
Parameters
which
Type: System.Int32
The partition index.
Return Value
Type: MeshPart
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.GetPartition(System.Int32)"]
See Also
Reference
Mesh Class
Rhino.Geometry Namespace