RhinoCommon API
RdkSelectionNavigator.Dispose Method
Releases all resources used by the RdkSelectionNavigator
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace