RhinoCommon API
Surface.Domain Method
Gets the domain in a direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval Domain(
	int direction
)
Public Function Domain (
	direction As Integer
) As Interval
Parameters
direction
Type: System.Int32
0 gets first parameter, 1 gets second parameter.
Return Value
Type: Interval
An interval value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Surface Class
Rhino.Geometry Namespace