RhinoCommon API
Mesh.Offset Method (Double)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Same as Mesh.Offset(distance, false)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh Offset(
	double distance
)
Public Function Offset (
	distance As Double
) As Mesh
Parameters
distance
Type: System.Double
A distance value to use for offsetting.
Return Value
Type: Mesh
A new mesh on success, or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Mesh Class
Offset Overload
Rhino.Geometry Namespace