RhinoCommon API
Rectangle3d.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EpsilonEquals(
	Rectangle3d other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Rectangle3d,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Rectangle3d
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace