RhinoCommon API
StringHolder Constructor
 Constructor
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StringHolder()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace