RhinoCommon API
DisplayPipeline.DrawBox Method (BoundingBox, Color)
 Draws the edges of a BoundingBox.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawBox(
	BoundingBox box,
	Color color
)
Public Sub DrawBox (
	box As BoundingBox,
	color As Color
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw in.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipeline Class
DrawBox Overload
Rhino.Display Namespace