RhinoCommon API
WorldMapDayNight.SetEnabled Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetEnabled(System.Boolean)"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetEnabled(
	bool bEnabled
)
Public Sub SetEnabled (
	bEnabled As Boolean
)
Parameters
bEnabled
Type: System.Boolean
[Missing <param name="bEnabled"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.SetEnabled(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace