RhinoCommon SDK
GetBaseClass.AcceptNumber Method
 If you want to allow the user to be able to type in a number during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptNumber() beforehand. If the user chooses to type in a number, then the result code GetResult.Number is returned and you can use RhinoGet.Number() to get the value of the number. If you are using GetPoint and you want "0" to return (0,0,0) instead of the number zero, then set acceptZero = false.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AcceptNumber(
	bool enable,
	bool acceptZero
)
Public Sub AcceptNumber (
	enable As Boolean,
	acceptZero As Boolean
)
Parameters
enable
Type: System.Boolean
true if user is able to type a number.
acceptZero
Type: System.Boolean
 If you are using GetPoint and you want "0" to return (0,0,0) instead of the number zero, then set acceptZero = false.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace