RhinoCommon API
Box.ToExtrusion Method
 Constructs an extrusion representation of this box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Extrusion ToExtrusion()
Public Function ToExtrusion As Extrusion
Return Value
Type: Extrusion
An Extrusion representation of this box or null.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Box Structure
Rhino.Geometry Namespace