RhinoCommon API
Curve.ClosedCurveOrientation Method (Plane)
 Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane. Only works with simple (no self intersections) closed, planar curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CurveOrientation ClosedCurveOrientation(
	Plane plane
)
Public Function ClosedCurveOrientation (
	plane As Plane
) As CurveOrientation
Parameters
plane
Type: Rhino.Geometry.Plane
 The plane in which to solve the orientation.
Return Value
Type: CurveOrientation
The orientation of this curve in the given plane.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Curve Class
ClosedCurveOrientation Overload
Rhino.Geometry Namespace