RhinoCommon SDK
File3dmObjectTable.AddLine Method (Point3d, Point3d)
Adds a line object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLine(
	Point3d from,
	Point3d to
)
Public Function AddLine (
	from As Point3d,
	to As Point3d
) As Guid
Parameters
from
Type: Rhino.Geometry.Point3d
A line start point.
to
Type: Rhino.Geometry.Point3d
A line end point.
Return Value
Type: Guid
A unique identifier of new rhino object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObjectTable Class
AddLine Overload
Rhino.FileIO Namespace