RhinoCommon SDK
BoundingBox.Contains Method (BoundingBox, Boolean)
 Determines whether this boundingbox contains another boundingbox.
The user can choose how to treat boundingboxes with coincidents surfaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	BoundingBox box,
	bool strict
)
Public Function Contains (
	box As BoundingBox,
	strict As Boolean
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to test.
strict
Type: System.Boolean
If true, the box needs to be fully on the inside of the boundingbox. I.e. coincident boxes will be considered 'outside'.
Return Value
Type: Boolean
true if the box is (strictly) on the inside of this BoundingBox.
See Also
Reference
BoundingBox Structure
Contains Overload
Rhino.Geometry Namespace