RhinoCommon API
DisplayMaterial.SetEnvironmentTexture Method (Texture, Boolean)
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.SetEnvironmentTexture(Rhino.DocObjects.Texture,System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetEnvironmentTexture(
	Texture texture,
	bool front
)
Public Function SetEnvironmentTexture (
	texture As Texture,
	front As Boolean
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.Display.DisplayMaterial.SetEnvironmentTexture(Rhino.DocObjects.Texture,System.Boolean)"]
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.SetEnvironmentTexture(Rhino.DocObjects.Texture,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayMaterial.SetEnvironmentTexture(Rhino.DocObjects.Texture,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayMaterial Class
SetEnvironmentTexture Overload
Rhino.Display Namespace