RhinoCommon API
TextureGraphInfo.SetAmountW Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.SetAmountW(System.Double)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetAmountW(
	double d
)
Public Sub SetAmountW (
	d As Double
)
Parameters
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Render.TextureGraphInfo.SetAmountW(System.Double)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace