RhinoCommon API
Cone.ToRevSurface Method
 Constructs a RevSurface representation of this Cone. This is synonymous with calling RevSurface.CreateFromCone().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RevSurface ToRevSurface()
Public Function ToRevSurface As RevSurface
Return Value
Type: RevSurface
A RevSurface representation of the cone or null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Cone Structure
Rhino.Geometry Namespace