RhinoCommon API
PointCloud.ClearNormals Method
 Destroys the normal vector information in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearNormals()
Public Sub ClearNormals
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace