RhinoCommon API
MeshFaceNormalList.ComputeFaceNormals Method
 Computes all the face normals for this mesh based on the physical shape of the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ComputeFaceNormals()
Public Function ComputeFaceNormals As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace