RhinoCommon API
Brep.CreateBooleanUnion Method (IEnumerable<Brep>, Double)
 Compute the Boolean Union of a set of Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreateBooleanUnion(
	IEnumerable<Brep> breps,
	double tolerance
)
Public Shared Function CreateBooleanUnion (
	breps As IEnumerable(Of Brep),
	tolerance As Double
) As Brep()
Parameters
breps
Type: System.Collections.Generic.IEnumerable<Brep>
Breps to union.
tolerance
Type: System.Double
Tolerance to use for union operation.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Brep Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace