RhinoCommon API
RTree.CreateFromPointArray Method
 Constructs a new tree with an element for each pointcloud point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RTree CreateFromPointArray(
	IEnumerable<Point3d> points
)
Public Shared Function CreateFromPointArray (
	points As IEnumerable(Of Point3d)
) As RTree
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points.
Return Value
Type: RTree
A new tree, or null on error.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RTree Class
Rhino.Geometry Namespace