RhinoCommon API
ComponentFunctionInfo.EvaluateSilenceWarnings Method
 Infrastructure method that simplifies output and performs warning checks.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Object EvaluateSilenceWarnings(
	IEnumerable args
)
Protected Function EvaluateSilenceWarnings (
	args As IEnumerable
) As Object
Parameters
args
Type: System.Collections.IEnumerable
Arguments.
Return Value
Type: Object
Items.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace