RhinoCommon API
RenderPrimitiveList.Add Method (Mesh, RenderMaterial)
 Add mesh and material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Mesh mesh,
	RenderMaterial material
)
Public Sub Add (
	mesh As Mesh,
	material As RenderMaterial
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to add.
material
Type: Rhino.Render.RenderMaterial
 Material to add, may be null if not needed.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderPrimitiveList Class
Add Overload
Rhino.Render Namespace