RhinoCommon API
PersistentSettingsConverter.TryParseEnum Method (Type, String, Int32)
 Converts an enum value name to its integer equivalent.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool TryParseEnum(
	Type type,
	string enumValueName,
	out int value
)
Public Shared Function TryParseEnum (
	type As Type,
	enumValueName As String,
	<OutAttribute> ByRef value As Integer
) As Boolean
Parameters
type
Type: System.Type
The enum type
enumValueName
Type: System.String
Enum value name as string
value
Type: System.Int32
Output value, will get set to -1 on error
Return Value
Type: Boolean
 Returns true if the the successfully converted or false if not.
See Also
Reference
PersistentSettingsConverter Class
TryParseEnum Overload
Rhino Namespace