RhinoCommon API
MeshVertexList.GetEnumerator Method
 Gets an enumerator that yields all mesh vertices (points) in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Point3f> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Point3f)
Return Value
Type: IEnumerator<Point3f>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace