RhinoCommon API
BrepFace.UnderlyingSurface Method
 Gets the untrimmed surface that is the base of this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface UnderlyingSurface()
Public Function UnderlyingSurface As Surface
Return Value
Type: Surface
A surface, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace