RhinoCommon API
CustomDisplay.AddText Method (Text3d, Color)
 Adds a new 3D text object to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddText(
	Text3d text,
	Color color
)
Public Sub AddText (
	text As Text3d,
	color As Color
)
Parameters
text
Type: Rhino.Display.Text3d
Text object to add.
color
Type: System.Drawing.Color
Color of text object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomDisplay Class
AddText Overload
Rhino.Display Namespace