RhinoCommon API
Point3dList.SetAllY Method
 Set all the Y values for the points to a single value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetAllY(
	double yValue
)
Public Sub SetAllY (
	yValue As Double
)
Parameters
yValue
Type: System.Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Point3dList Class
Rhino.Collections Namespace