RhinoCommon API
RhinoViewport.GetCameraExtents Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetCameraExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox GetCameraExtents(
	IEnumerable<Point3d> points
)
Public Function GetCameraExtents (
	points As IEnumerable(Of Point3d)
) As BoundingBox
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="points"/> documentation for "M:Rhino.Display.RhinoViewport.GetCameraExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Return Value
Type: BoundingBox
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetCameraExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace