RhinoCommon SDK
IDialogService.WrapAsIWin32Window Method
[Missing <summary> documentation for "M:Rhino.UI.IDialogService.WrapAsIWin32Window(System.IntPtr)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
Object WrapAsIWin32Window(
	IntPtr handle
)
Function WrapAsIWin32Window (
	handle As IntPtr
) As Object
Parameters
handle
Type: System.IntPtr
[Missing <param name="handle"/> documentation for "M:Rhino.UI.IDialogService.WrapAsIWin32Window(System.IntPtr)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IDialogService.WrapAsIWin32Window(System.IntPtr)"]
See Also
Reference
IDialogService Interface
Rhino.UI Namespace