RhinoCommon SDK
BinaryArchiveReader.ReadGuid Method
 Reads a Guid from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid ReadGuid()
Public Function ReadGuid As Guid
Return Value
Type: Guid
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace