RhinoCommon API
IndexPair.GetEnumerator Method
 Gets an enumerator that goes over I and J, in this order.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<int> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Integer)
Return Value
Type: IEnumerator<Int32>
The needed enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
IndexPair Structure
Rhino Namespace