RhinoCommon API
SurfaceObject.DuplicateSurfaceGeometry Method
 Constructs a new deep copy of the surface geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface DuplicateSurfaceGeometry()
Public Function DuplicateSurfaceGeometry As Surface
Return Value
Type: Surface
The copy of the geometry.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
SurfaceObject Class
Rhino.DocObjects Namespace