RhinoCommon API
ObjectAttributes.GetHideInDetailOverrides Method
 Get list of details that this object is supposed to be hidden in
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] GetHideInDetailOverrides()
Public Function GetHideInDetailOverrides As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.GetHideInDetailOverrides"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace