RhinoCommon SDK
RenderContent.OpenInModalEditor Method
 Call this method to open the content in the a modal version of the editor. The content must be in the document or the call will fail.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool OpenInModalEditor()
Public Function OpenInModalEditor As Boolean
Return Value
Type: Boolean
 Returns true on success or false on error.
See Also
Reference
RenderContent Class
Rhino.Render Namespace