RhinoCommon API
PointObject.DuplicatePointGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.PointObject.DuplicatePointGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point DuplicatePointGeometry()
Public Function DuplicatePointGeometry As Point
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.DocObjects.PointObject.DuplicatePointGeometry"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace