RhinoCommon API
Vector2d.Multiply Operator (Vector2d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2d operator *(
	Vector2d vector,
	double t
)
Public Shared Operator * (
	vector As Vector2d,
	t As Double
) As Vector2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector.
t
Type: System.Double
A number.
Return Value
Type: Vector2d
A new vector that is the original vector coordinatewise multiplied by t.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Vector2d Structure
Multiply Overload
Rhino.Geometry Namespace