RhinoCommon API
PythonScript.GetVariable Method
 Gets the object associated with a variable name in the main scripting context.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Object GetVariable(
	string name
)
Public MustOverride Function GetVariable (
	name As String
) As Object
Parameters
name
Type: System.String
A variable name.
Return Value
Type: Object
The variable object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace