RhinoCommon SDK
PointCloud.ClosestPoint Method
 Returns index of the closest point in the point cloud to a given test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Integer
Parameters
testPoint
Type: Rhino.Geometry.Point3d
.
Return Value
Type: Int32
Index of point in the point cloud on success. -1 on failure.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace