RhinoCommon SDK
GripsDrawEventArgs.DrawControlPolygonLine Method (Point3d, Point3d, Int32, Int32)
 Draws the lines in a control polygons.
This is an helper function.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawControlPolygonLine(
	Point3d start,
	Point3d end,
	int startStatus,
	int endStatus
)
Public Sub DrawControlPolygonLine (
	start As Point3d,
	end As Point3d,
	startStatus As Integer,
	endStatus As Integer
)
Parameters
start
Type: Rhino.Geometry.Point3d
The point start.
end
Type: Rhino.Geometry.Point3d
The point end.
startStatus
Type: System.Int32
Index of Grip status at start of line defined by start and end.
endStatus
Type: System.Int32
Index if Grip status at end of line defined by start and end.
See Also
Reference
GripsDrawEventArgs Class
DrawControlPolygonLine Overload
Rhino.DocObjects.Custom Namespace