RhinoCommon API
Vector3f.Multiply Method (Vector3f, Vector3f)
 Multiplies two Vector3f together, returning the dot (internal) product of the two. This is not the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double Multiply(
	Vector3f vector1,
	Vector3f vector2
)
Public Shared Function Multiply (
	vector1 As Vector3f,
	vector2 As Vector3f
) As Double
Parameters
vector1
Type: Rhino.Geometry.Vector3f
[Missing <param name="vector1"/> documentation for "M:Rhino.Geometry.Vector3f.Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)"]
vector2
Type: Rhino.Geometry.Vector3f
[Missing <param name="vector2"/> documentation for "M:Rhino.Geometry.Vector3f.Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)"]
Return Value
Type: Double
A value that results from the coordinatewise multiplication of point1 and point2.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Vector3f Structure
Multiply Overload
Rhino.Geometry Namespace