RhinoCommon API
File3dmPlugInDataTable.Dump Method
Prepares a text dump of table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
A string containing the dump.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace