RhinoCommon SDK
SubDVertexSectorIterator.IncrementFace Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFace"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IncrementFace()
Public Function IncrementFace As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFace"]
See Also
Reference
SubDVertexSectorIterator Class
IncrementFace Overload
Rhino.Geometry Namespace