RhinoCommon API
IRhRdkThumbnail.Id Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Id"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid Id()
Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Id"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace