RhinoCommon API
CustomDisplay.AddPoint Method (Point3d, Color)
 Adds a new colored point to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddPoint(
	Point3d point,
	Color color
)
Public Sub AddPoint (
	point As Point3d,
	color As Color
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to add.
color
Type: System.Drawing.Color
Color of point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CustomDisplay Class
AddPoint Overload
Rhino.Display Namespace