RhinoCommon API
Layer.IsParentOf Method (Int32)
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.IsParentOf(System.Int32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsParentOf(
	int layerIndex
)
Public Function IsParentOf (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
[Missing <param name="layerIndex"/> documentation for "M:Rhino.DocObjects.Layer.IsParentOf(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.IsParentOf(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Layer Class
IsParentOf Overload
Rhino.DocObjects Namespace