RhinoCommon SDK
Mesh.CreateRefinedLoopMesh Method
 Instantiates a new mesh that represents a Loop subdivision of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Mesh CreateRefinedLoopMesh(
	Mesh mesh,
	LoopFormula formula = LoopFormula.WarrenWeimer,
	RefinementSettings settings = null
)
Public Shared Function CreateRefinedLoopMesh (
	mesh As Mesh,
	Optional formula As LoopFormula = LoopFormula.WarrenWeimer,
	Optional settings As RefinementSettings = Nothing
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
The mesh to subdivide.
formula (Optional)
Type: Rhino.Geometry.MeshRefinements.LoopFormula
The Loop subdivision formula.
settings (Optional)
Type: Rhino.Geometry.MeshRefinements.RefinementSettings
An instance of the settings class, or null for defaults.
Return Value
Type: Mesh
A new mesh. null is never returned.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace