RhinoCommon API
LightManagerSupportClient.GroupLights Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.GroupLights(Rhino.Render.LightArray)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void GroupLights(
	LightArray lights
)
Public Sub GroupLights (
	lights As LightArray
)
Parameters
lights
Type: Rhino.Render.LightArray
[Missing <param name="lights"/> documentation for "M:Rhino.Render.LightManagerSupportClient.GroupLights(Rhino.Render.LightArray)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace