RhinoCommon API
LinetypeTable.GetUnusedLinetypeName Method (Boolean)
 Obsolete. Use the other overload. Gets unused linetype name used as default when creating new linetypes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetUnusedLinetypeName(
	bool ignoreDeleted
)
Public Function GetUnusedLinetypeName (
	ignoreDeleted As Boolean
) As String
Parameters
ignoreDeleted
Type: System.Boolean
 If this is true then a name used by a deleted linetype is allowed.
Return Value
Type: String
The unused linetype name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.27
See Also
Reference
LinetypeTable Class
GetUnusedLinetypeName Overload
Rhino.DocObjects.Tables Namespace