RhinoCommon API
ManifestTable.GetEnumerator Method
 Visits all model components in the document, including default ones.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual IEnumerator<ModelComponent> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of ModelComponent)
Return Value
Type: IEnumerator<ModelComponent>
An enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ManifestTable Class
GetEnumerator Overload
Rhino.FileIO Namespace