RhinoCommon API
CollapsibleSectionImpl.__InternalSetParent Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.__InternalSetParent(System.IntPtr)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void __InternalSetParent(
	IntPtr parent
)
Public Sub __InternalSetParent (
	parent As IntPtr
)
Parameters
parent
Type: System.IntPtr
[Missing <param name="parent"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.__InternalSetParent(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace