RhinoCommon API
StackedDialogPage.OnActivate Method
Called when this page is activated/deactivated.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool OnActivate(
	bool active
)
Public Overridable Function OnActivate (
	active As Boolean
) As Boolean
Parameters
active
Type: System.Boolean
If true then this page is on top otherwise it is about to be hidden.
Return Value
Type: Boolean
 If true then the page is hidden and the requested page is not activated otherwise will not allow you to change the current page. Default returns true
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace