RhinoCommon API
RenderContentCollection.Add Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.Add(Rhino.Render.RenderContentCollection)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	RenderContentCollection collection
)
Public Sub Add (
	collection As RenderContentCollection
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
[Missing <param name="collection"/> documentation for "M:Rhino.Render.RenderContentCollection.Add(Rhino.Render.RenderContentCollection)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace