RhinoCommon API
RenderPipeline.ResumeRendering Method
 Implement to resume current render session
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void ResumeRendering()
Public Overridable Sub ResumeRendering
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace