RhinoCommon API
RhinoObject.GetGrips Method
 Returns grips for this object If grips are enabled. If grips are not enabled, returns null.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GripObject[] GetGrips()
Public Function GetGrips As GripObject()
Return Value
Type: GripObject[]
An array of grip objects; or null if there are no grips.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace