RhinoCommon API
HatchPatternTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<HatchPattern> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of HatchPattern)
Return Value
Type: IEnumerator<HatchPattern>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace