RhinoCommon API
RenderTexture.NewBitmapTexture Method (SimulatedTexture, RhinoDoc)
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.NewBitmapTexture(Rhino.Render.SimulatedTexture,Rhino.RhinoDoc)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderTexture NewBitmapTexture(
	SimulatedTexture texture,
	RhinoDoc doc
)
Public Shared Function NewBitmapTexture (
	texture As SimulatedTexture,
	doc As RhinoDoc
) As RenderTexture
Parameters
texture
Type: Rhino.Render.SimulatedTexture
[Missing <param name="texture"/> documentation for "M:Rhino.Render.RenderTexture.NewBitmapTexture(Rhino.Render.SimulatedTexture,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderTexture.NewBitmapTexture(Rhino.Render.SimulatedTexture,Rhino.RhinoDoc)"]
Return Value
Type: RenderTexture
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.NewBitmapTexture(Rhino.Render.SimulatedTexture,Rhino.RhinoDoc)"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderTexture Class
NewBitmapTexture Overload
Rhino.Render Namespace