RhinoCommon SDK
ColorHSL.CreateFromLCH Method
 Create the nearest HSL equivalent of a LCH color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorHSL CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorHSL
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorHSL
The HSL equivalent of the LCH color.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace