RhinoCommon SDK
Matrix Constructor (Transform)
 Initializes a new instance of the matrix based on a 4x4 matrix Transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Matrix(
	Transform xform
)
Public Sub New (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
A 4x4 matrix to copy from.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Matrix Class
Matrix Overload
Rhino.Geometry Namespace