RhinoCommon API
Polyline Constructor (Int32)
 Initializes a new empty polyline with an initial capacity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline(
	int initialCapacity
)
Public Sub New (
	initialCapacity As Integer
)
Parameters
initialCapacity
Type: System.Int32
Number of vertices this polyline can contain without resizing.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace