RhinoCommon API
RhinoViewport.SetProjection Method
 Set viewport to a defined projection.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetProjection(
	DefinedViewportProjection projection,
	string viewName,
	bool updateConstructionPlane
)
Public Function SetProjection (
	projection As DefinedViewportProjection,
	viewName As String,
	updateConstructionPlane As Boolean
) As Boolean
Parameters
projection
Type: Rhino.Display.DefinedViewportProjection
The "standard" projection type.
viewName
Type: System.String
If not null or empty, the name is set.
updateConstructionPlane
Type: System.Boolean
If true, the construction plane is set to the viewport plane.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace