RhinoCommon SDK
SweepTwoRail.PerformSweepRefit Method (Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Double)
[Missing <summary> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweepRefit(
	Curve rail1,
	Curve rail2,
	IEnumerable<Curve> crossSections,
	IEnumerable<double> crossSectionParametersRail1,
	IEnumerable<double> crossSectionParametersRail2,
	double refitTolerance
)
Public Function PerformSweepRefit (
	rail1 As Curve,
	rail2 As Curve,
	crossSections As IEnumerable(Of Curve),
	crossSectionParametersRail1 As IEnumerable(Of Double),
	crossSectionParametersRail2 As IEnumerable(Of Double),
	refitTolerance As Double
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
[Missing <param name="rail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
rail2
Type: Rhino.Geometry.Curve
[Missing <param name="rail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
crossSections
Type: System.Collections.Generic.IEnumerable<Curve>
[Missing <param name="crossSections"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
crossSectionParametersRail1
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="crossSectionParametersRail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
crossSectionParametersRail2
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="crossSectionParametersRail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
refitTolerance
Type: System.Double
[Missing <param name="refitTolerance"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
See Also
Reference
SweepTwoRail Class
PerformSweepRefit Overload
Rhino.Geometry Namespace