RhinoCommon SDK
SubDVertexPtr.ClearFaces Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.ClearFaces"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearFaces()
Public Sub ClearFaces
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace