RhinoCommon API
MeshFaceList.GetFaceCenter Method
 Gets the center point of a face.
For a triangular face, this is the centroid or barycenter.
For a quad, this is the avarage of four coner points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d GetFaceCenter(
	int faceIndex
)
Public Function GetFaceCenter (
	faceIndex As Integer
) As Point3d
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Point3d
The center point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace