RhinoCommon API
SnapShotsClient.LightsCategory Method
 Predefined lights category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string LightsCategory()
Public Shared Function LightsCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.LightsCategory"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace