RhinoCommon API
Surface.IsSphere Method (Double)
 Determines if the surface is a portion of a sphere within a given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSphere(
	double tolerance
)
Public Function IsSphere (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a sphere.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Surface Class
IsSphere Overload
Rhino.Geometry Namespace