RhinoCommon API
Command.RunCommand Method
 Executes the command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract Result RunCommand(
	RhinoDoc doc,
	RunMode mode
)
Protected MustOverride Function RunCommand (
	doc As RhinoDoc,
	mode As RunMode
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
The current document.
mode
Type: Rhino.Commands.RunMode
The command running mode.
Return Value
Type: Result
The command result code.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Command Class
Rhino.Commands Namespace