RhinoCommon API
ISettingsService.ReadSettings Method
 Read settings XML contents into a Stream which will get passed to a XML document for parsing.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Stream ReadSettings(
	string fileName
)
Function ReadSettings (
	fileName As String
) As Stream
Parameters
fileName
Type: System.String
File name.
Return Value
Type: Stream
 Returns null if the file does not exist or could not be read, a valid Stream otherwise.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace