RhinoCommon SDK
File3dm.Write Method (String, Int32)
 Writes contents of this model to an openNURBS archive. I STRONGLY suggested that you call Polish() before calling Write so that your file has all the "fluff" that makes it complete. If the model is not valid, then Write will refuse to write it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Write(
	string path,
	int version
)
Public Function Write (
	path As String,
	version As Integer
) As Boolean
Parameters
path
Type: System.String
The file name to use for writing.
version
Type: System.Int32
 Version of the openNURBS archive to write. Must be 2, 3, 4, or 5. Rhino 2.x can read version 2 files. Rhino 3.x can read version 2 and 3 files. Rhino 4.x can read version 2, 3 and 4 files. Rhino 5.x can read version 2, 3, 4, and 5 files. Use version 5 when possible.
Return Value
Type: Boolean
 true if archive is written with no error. false if errors occur.
See Also
Reference
File3dm Class
Write Overload
Rhino.FileIO Namespace