RhinoCommon API
ObjRef.Hatch Method
 Gets the hatch if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Hatch Hatch()
Public Function Hatch As Hatch
Return Value
Type: Hatch
A hatch; or null if the referenced object is not a hatch
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace