RhinoCommon API
MeshFaceList.GetDuplicateFaces Method
 Finds all of the duplicate faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] GetDuplicateFaces()
Public Function GetDuplicateFaces As Integer()
Return Value
Type: Int32[]
 The indexes that are duplicates of other indexes if successful. If there are no duplicate, then an empty array is returned.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace