RhinoCommon SDK
SupportOptions.ShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.ShowDocuments"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowDocuments()
Public Shared Function ShowDocuments As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.ShowDocuments"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace