RhinoCommon API
MeshFaceList.AddFace Method (MeshFace)
 Appends a new mesh face to the end of the mesh face list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddFace(
	MeshFace face
)
Public Function AddFace (
	face As MeshFace
) As Integer
Parameters
face
Type: Rhino.Geometry.MeshFace
Face to add.
Return Value
Type: Int32
The index of the newly added face.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshFaceList Class
AddFace Overload
Rhino.Geometry.Collections Namespace