RhinoCommon API
AngularDimension Constructor
Initializes a new instance of the AngularDimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AngularDimension()
Public Sub New
See Also
Reference
AngularDimension Class
AngularDimension Overload
Rhino.Geometry Namespace