RhinoCommon API
ArchivableDictionary.GetPoint3f Method (String)
 Get value as Point3f, will only succeed if value was created using Set(string key, Point3f value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3f GetPoint3f(
	string key
)
Public Function GetPoint3f (
	key As String
) As Point3f
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3f(System.String)"]
Return Value
Type: Point3f
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3f(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ArchivableDictionary Class
GetPoint3f Overload
Rhino.Collections Namespace