RhinoCommon SDK
HatchPatternTable.Delete Method (HatchPattern, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	HatchPattern item,
	bool quiet
)
Public Function Delete (
	item As HatchPattern,
	quiet As Boolean
) As Boolean
Parameters
item
Type: Rhino.DocObjects.HatchPattern
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern,System.Boolean)"]
quiet
Type: System.Boolean
[Missing <param name="quiet"/> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HatchPatternTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace