RhinoCommon API
Interval.Grow Method
 Grows the Interval to include the given number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Grow(
	double value
)
Public Sub Grow (
	value As Double
)
Parameters
value
Type: System.Double
Number to include in this interval.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Interval Structure
Rhino.Geometry Namespace