RhinoCommon SDK
RTree.Insert Method (Point2d, Int32)
Inserts an element into the tree.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Insert(
	Point2d point,
	int elementId
)
Public Function Insert (
	point As Point2d,
	elementId As Integer
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
elementId
Type: System.Int32
A number.
Return Value
Type: Boolean
true if element was successfully inserted.
See Also
Reference
RTree Class
Insert Overload
Rhino.Geometry Namespace