RhinoCommon API
PersistentSettings.GetValidator Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetValidator(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public EventHandler<PersistentSettingsEventArgs> GetValidator(
	string key
)
Public Function GetValidator (
	key As String
) As EventHandler(Of PersistentSettingsEventArgs)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetValidator(System.String)"]
Return Value
Type: EventHandler<PersistentSettingsEventArgs>
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetValidator(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
PersistentSettings Class
GetValidator Overload
Rhino Namespace