RhinoCommon API
HostUtils.GetActivePlugInVersionFolders Method
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static IEnumerable<DirectoryInfo> GetActivePlugInVersionFolders(
	bool currentUser
)
Public Shared Function GetActivePlugInVersionFolders (
	currentUser As Boolean
) As IEnumerable(Of DirectoryInfo)
Parameters
currentUser
Type: System.Boolean
Current user (true) or machine (false).
Return Value
Type: IEnumerable<DirectoryInfo>
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetActivePlugInVersionFolders(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace