RhinoCommon SDK
SubDVertexDirPair Constructor
Initializes a new instance of the SubDVertexDirPair class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexDirPair(
	SubDVertexPtr value,
	bool flipped
)
Public Sub New (
	value As SubDVertexPtr,
	flipped As Boolean
)
Parameters
value
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="value"/> documentation for "M:Rhino.Geometry.SubDVertexDirPair.#ctor(Rhino.Geometry.SubDVertexPtr,System.Boolean)"]
flipped
Type: System.Boolean
[Missing <param name="flipped"/> documentation for "M:Rhino.Geometry.SubDVertexDirPair.#ctor(Rhino.Geometry.SubDVertexPtr,System.Boolean)"]
See Also
Reference
SubDVertexDirPair Structure
Rhino.Geometry Namespace