RhinoCommon SDK
OptionDouble.Dispose Method (Boolean)
Releases the unmanaged resources used by the OptionDouble and optionally releases the managed resources
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected void Dispose(
	bool disposing
)
Protected Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
OptionDouble Class
Dispose Overload
Rhino.Input.Custom Namespace