RhinoCommon API
Texture Constructor
 Initializes a new texture.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Texture Class
Texture Overload
Rhino.DocObjects Namespace