RhinoCommon SDK
PointCloudObject.DuplicatePointCloudGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloud DuplicatePointCloudGeometry()
Public Function DuplicatePointCloudGeometry As PointCloud
Return Value
Type: PointCloud
[Missing <returns> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace