RhinoCommon API
Vector3d.Multiply Operator (Double, Vector3d)
 Multiplies a vector by a number, having the effect of scaling it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d operator *(
	double t,
	Vector3d vector
)
Public Shared Operator * (
	t As Double,
	vector As Vector3d
) As Vector3d
Parameters
t
Type: System.Double
A number.
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Vector3d
A new vector that is the original vector coordinatewise multiplied by t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3d Structure
Multiply Overload
Rhino.Geometry Namespace