RhinoCommon SDK
ReplayHistoryResult.UpdateToText Method (TextEntity, ObjectAttributes)
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToText(
	TextEntity text,
	ObjectAttributes attributes
)
Public Function UpdateToText (
	text As TextEntity,
	attributes As ObjectAttributes
) As Boolean
Parameters
text
Type: Rhino.Geometry.TextEntity
[Missing <param name="text"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
UpdateToText Overload
Rhino.DocObjects Namespace