RhinoCommon API
AreaMassProperties.Compute Method (Brep)
 Computes an AreaMassProperties for a brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AreaMassProperties Compute(
	Brep brep
)
Public Shared Function Compute (
	brep As Brep
) As AreaMassProperties
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given Brep or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When brep is null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace