RhinoCommon API
RenderContent.Create Method (Type, RenderContent, String, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Constructs a new content of the specified type and add it to the persistent content list. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RenderContentType.NewContentFromType().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderContent Create(
	Type type,
	RenderContent parent,
	string childSlotName,
	RenderContent.ShowContentChooserFlags flags,
	RhinoDoc doc
)
Public Shared Function Create (
	type As Type,
	parent As RenderContent,
	childSlotName As String,
	flags As RenderContent.ShowContentChooserFlags,
	doc As RhinoDoc
) As RenderContent
Parameters
type
Type: System.Type
is the type of the content to add.
parent
Type: Rhino.Render.RenderContent
Parent is the parent content. If not NULL, this must be an RDK-owned content that is in the persistent content list (either top-level or child). The new content then becomes its child. If NULL, the new content is added to the top-level content list instead.
childSlotName
Type: System.String
ChildSlotName is the unique child identifier to use for the new content when creating it as a child of pParent (i.e., when pParent is not NULL)
flags
Type: Rhino.Render.RenderContent.ShowContentChooserFlags
Options for the tab.
doc
Type: Rhino.RhinoDoc
The current Rhino document.
Return Value
Type: RenderContent
A new persistent render content.
See Also
Reference
RenderContent Class
Create Overload
Rhino.Render Namespace