RhinoCommon API
Point2d.Divide Method
 Divides a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d Divide(
	Point2d point,
	double t
)
Public Shared Function Divide (
	point As Point2d,
	t As Double
) As Point2d
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point2d
A new point that is coordinatewise divided by t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace