RhinoCommon SDK
NameHash.CreateFilePathHash Method
 Creates a new NameHash, representing the name of a file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static NameHash CreateFilePathHash(
	string path
)
Public Shared Function CreateFilePathHash (
	path As String
) As NameHash
Parameters
path
Type: System.String
A path. This can be null and can refer to a nonexisting path.
Return Value
Type: NameHash
[Missing <returns> documentation for "M:Rhino.FileIO.NameHash.CreateFilePathHash(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NameHash Class
Rhino.FileIO Namespace