RhinoCommon SDK
Command.GetCommandStack Method
 Determines if Rhino is currently running a command. Because Rhino allow for transparent commands (commands that can be run from inside of other commands), this method returns the total ids of active commands.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid[] GetCommandStack()
Public Shared Function GetCommandStack As Guid()
Return Value
Type: Guid[]
 Ids of running commands or null if no commands are currently running. The "active" command is at the end of this list.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Command Class
Rhino.Commands Namespace