RhinoCommon API
Mesh.CreateFromCurvePipe Method
 Constructs a new mesh pipe from a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateFromCurvePipe(
	Curve curve,
	double radius,
	int segments,
	int accuracy,
	MeshPipeCapStyle capType,
	bool faceted,
	IEnumerable<Interval> intervals = null
)
Public Shared Function CreateFromCurvePipe (
	curve As Curve,
	radius As Double,
	segments As Integer,
	accuracy As Integer,
	capType As MeshPipeCapStyle,
	faceted As Boolean,
	Optional intervals As IEnumerable(Of Interval) = Nothing
) As Mesh
Parameters
curve
Type: Rhino.Geometry.Curve
A curve to pipe.
radius
Type: System.Double
The radius of the pipe.
segments
Type: System.Int32
The number of segments in the pipe.
accuracy
Type: System.Int32
The accuracy of the pipe.
capType
Type: Rhino.Geometry.MeshPipeCapStyle
The type of cap to be created at the end of the pipe.
faceted
Type: System.Boolean
Specifies whether the pipe is faceted, or not.
intervals (Optional)
Type: System.Collections.Generic.IEnumerable<Interval>
A series of intervals to pipe. This value can be null.
Return Value
Type: Mesh
A new mesh, or null on failure.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Mesh Class
Rhino.Geometry Namespace