RhinoCommon API
SnapShotsClient.Dispose Method
 SnapShotsClient Dispose
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace