RhinoCommon SDK
Circle.Rotate Method (Double, Vector3d)
 Rotates the circle through a given angle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Rotate(
	double angle,
	Vector3d axis
)
Public Function Rotate (
	angle As Double,
	axis As Vector3d
) As Boolean
Parameters
angle
Type: System.Double
Angle (in radians) of the rotation.
axis
Type: Rhino.Geometry.Vector3d
Rotation axis.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Circle Structure
Rotate Overload
Rhino.Geometry Namespace