RhinoCommon API
MeshExtruder.ExtrudedMesh Method
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExtrudedMesh(
	out Mesh extrudedMeshOut
)
Public Function ExtrudedMesh (
	<OutAttribute> ByRef extrudedMeshOut As Mesh
) As Boolean
Parameters
extrudedMeshOut
Type: Rhino.Geometry.Mesh
Extruded mesh
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.MeshExtruder.ExtrudedMesh(Rhino.Geometry.Mesh@)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace