RhinoCommon API
Polyline.PointAt Method
 Gets the point on the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Polyline parameter.
Return Value
Type: Point3d
The point on the polyline at t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Polyline Class
Rhino.Geometry Namespace