RhinoCommon SDK
Interop.TryCopyToOnArc Method
 Attempts to copy the contents of a Rhino.Geometry.Arc to a RMA.OpenNURBS.OnArc.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool TryCopyToOnArc(
	Arc source,
	Object destination
)
Public Shared Function TryCopyToOnArc (
	source As Arc,
	destination As Object
) As Boolean
Parameters
source
Type: Rhino.Geometry.Arc
A source arc.
destination
Type: System.Object
A destination OnArc.
Return Value
Type: Boolean
true if the operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interop Class
Rhino.Runtime Namespace