RhinoCommon API
Transform.IsSimilarity Method
 Gets a value indicating whether or not the Transform maintains similarity. A similarity transformation can be broken into a sequence of a dialation, translation, rotation, and a reflection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TransformSimilarityType IsSimilarity(
	double tolerance
)
Public Function IsSimilarity (
	tolerance As Double
) As TransformSimilarityType
Parameters
tolerance
Type: System.Double
The evaluation tolerance.
Return Value
Type: TransformSimilarityType
The similarity type.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Transform Structure
Rhino.Geometry Namespace