RhinoCommon API
MouseCursor.SetToolTip Method
 Sets a cursor tooltip string shown next to the mouse cursor. Overrides all cursor tooltip panes.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetToolTip(
	string tooltip
)
Public Shared Sub SetToolTip (
	tooltip As String
)
Parameters
tooltip
Type: System.String
The text to show.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MouseCursor Class
Rhino.UI Namespace