RhinoCommon API
HostUtils.CreateCommands Method (PlugIn)
 Parses a plugin and create all the commands defined therein.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void CreateCommands(
	PlugIn plugin
)
Public Shared Sub CreateCommands (
	plugin As PlugIn
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
Plugin to harvest for commands.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
HostUtils Class
CreateCommands Overload
Rhino.Runtime Namespace