RhinoCommon API
AnnotationBase.FormatRtfString Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string FormatRtfString(
	string rtf_in,
	bool clear_bold,
	bool set_bold,
	bool clear_italic,
	bool set_italic,
	bool clear_underline,
	bool set_underline,
	bool clear_facename,
	bool set_facename,
	string facename
)
Public Shared Function FormatRtfString (
	rtf_in As String,
	clear_bold As Boolean,
	set_bold As Boolean,
	clear_italic As Boolean,
	set_italic As Boolean,
	clear_underline As Boolean,
	set_underline As Boolean,
	clear_facename As Boolean,
	set_facename As Boolean,
	facename As String
) As String
Parameters
rtf_in
Type: System.String
[Missing <param name="rtf_in"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
clear_bold
Type: System.Boolean
[Missing <param name="clear_bold"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
set_bold
Type: System.Boolean
[Missing <param name="set_bold"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
clear_italic
Type: System.Boolean
[Missing <param name="clear_italic"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
set_italic
Type: System.Boolean
[Missing <param name="set_italic"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
clear_underline
Type: System.Boolean
[Missing <param name="clear_underline"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
set_underline
Type: System.Boolean
[Missing <param name="set_underline"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
clear_facename
Type: System.Boolean
[Missing <param name="clear_facename"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
set_facename
Type: System.Boolean
[Missing <param name="set_facename"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
facename
Type: System.String
[Missing <param name="facename"/> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace