RhinoCommon API
BrepTrim.SetTrimCurve Method (Int32)
 Set 2d curve geometry used by a b-rep trim.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTrimCurve(
	int curve2dIndex
)
Public Function SetTrimCurve (
	curve2dIndex As Integer
) As Boolean
Parameters
curve2dIndex
Type: System.Int32
index of 2d curve in m_C2[] array
Return Value
Type: Boolean
true if successful
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepTrim Class
SetTrimCurve Overload
Rhino.Geometry Namespace