RhinoCommon API
PersistentSettings.HideSettingFromUserInterface Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.HideSettingFromUserInterface(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void HideSettingFromUserInterface(
	string key
)
Public Sub HideSettingFromUserInterface (
	key As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.HideSettingFromUserInterface(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PersistentSettings Class
Rhino Namespace