RhinoCommon SDK
ObjectTable.AddExtrusion Method (Extrusion)
Adds an extrusion object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddExtrusion(
	Extrusion extrusion
)
Public Function AddExtrusion (
	extrusion As Extrusion
) As Guid
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
A duplicate of this extrusion is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddExtrusion Overload
Rhino.DocObjects.Tables Namespace