RhinoCommon API
MeshFaceNormalList.GetEnumerator Method
 Gets an enumerator that yields all normals (vectors) in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Vector3f> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Vector3f)
Return Value
Type: IEnumerator<Vector3f>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace