RhinoCommon API
Polyline.BreakAtAngles Method
 Breaks this polyline into sections at sharp kinks. Closed polylines will also be broken at the first and last vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline[] BreakAtAngles(
	double angle
)
Public Function BreakAtAngles (
	angle As Double
) As Polyline()
Parameters
angle
Type: System.Double
Angle (in radians) between adjacent segments for a break to occur.
Return Value
Type: Polyline[]
An array of polyline segments, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Polyline Class
Rhino.Geometry Namespace