RhinoCommon API
BinaryArchiveReader.ReadRectangleF Method
 Reads a RectangleF from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RectangleF ReadRectangleF()
Public Function ReadRectangleF As RectangleF
Return Value
Type: RectangleF
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace