RhinoCommon API
AnnotationBase.IsAllBold Method
 Returns true if all of the text in the annotation is Bold, otherwise returns false
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsAllBold()
Public Function IsAllBold As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.IsAllBold"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace