RhinoCommon API
RenderContent.SetChildSlotOn Method
 Sets the on-ness property for the texture in the specified child slot.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetChildSlotOn(
	string childSlotName,
	bool bOn,
	RenderContent.ChangeContexts cc
)
Public Sub SetChildSlotOn (
	childSlotName As String,
	bOn As Boolean,
	cc As RenderContent.ChangeContexts
)
Parameters
childSlotName
Type: System.String
Child slot name for the child
bOn
Type: System.Boolean
Value for the on-ness property.
cc
Type: Rhino.Render.RenderContent.ChangeContexts
Context of the change
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderContent Class
Rhino.Render Namespace