RhinoCommon API
DisplayModeDescription.FindByName Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.FindByName(System.String)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static DisplayModeDescription FindByName(
	string englishName
)
Public Shared Function FindByName (
	englishName As String
) As DisplayModeDescription
Parameters
englishName
Type: System.String
[Missing <param name="englishName"/> documentation for "M:Rhino.Display.DisplayModeDescription.FindByName(System.String)"]
Return Value
Type: DisplayModeDescription
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.FindByName(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace