RhinoCommon API
PersistentSettings.ClearChangedFlag Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.ClearChangedFlag"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearChangedFlag()
Public Sub ClearChangedFlag
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
PersistentSettings Class
Rhino Namespace