RhinoCommon API
NurbsSurface Constructor (NurbsSurface)
 Initializes a new NURBS surface by copying the values from another surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsSurface(
	NurbsSurface other
)
Public Sub New (
	other As NurbsSurface
)
Parameters
other
Type: Rhino.Geometry.NurbsSurface
Another surface.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
NurbsSurface Class
NurbsSurface Overload
Rhino.Geometry Namespace