RhinoCommon API
BinaryArchiveReader.ReadInterval Method
 Reads a Interval from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval ReadInterval()
Public Function ReadInterval As Interval
Return Value
Type: Interval
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace