RhinoCommon SDK
Brep.CopyTrimCurves Method
 Copy all trims from a Brep face onto a surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CopyTrimCurves(
	BrepFace trimSource,
	Surface surfaceSource,
	double tolerance
)
Public Shared Function CopyTrimCurves (
	trimSource As BrepFace,
	surfaceSource As Surface,
	tolerance As Double
) As Brep
Parameters
trimSource
Type: Rhino.Geometry.BrepFace
Brep face which defines the trimming curves.
surfaceSource
Type: Rhino.Geometry.Surface
The surface to trim.
tolerance
Type: System.Double
Tolerance to use for rebuilding 3D trim curves.
Return Value
Type: Brep
A brep with the shape of surfaceSource and the trims of trimSource or null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace