RhinoCommon SDK
Command.GetCommandNames Method
 Gets list of command names in Rhino. This list does not include Test, Alpha, or System commands.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string[] GetCommandNames(
	bool english,
	bool loaded
)
Public Shared Function GetCommandNames (
	english As Boolean,
	loaded As Boolean
) As String()
Parameters
english
Type: System.Boolean
 if true, retrieve the english name for every command. if false, retrieve the local name for every command.
loaded
Type: System.Boolean
 if true, only get names of currently loaded commands. if false, get names of all registered (may not be currently loaded) commands.
Return Value
Type: String[]
An array instance with command names. This array could be empty, but not null.
See Also
Reference
Command Class
Rhino.Commands Namespace