RhinoCommon API
CurveList.Insert Method (Int32, IEnumerable<Point3d>)
 Inserts a polyline at a given index of this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	IEnumerable<Point3d> polyline
)
Public Sub Insert (
	index As Integer,
	polyline As IEnumerable(Of Point3d)
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
The polyline enumerable from which to construct a copy curve.
This argument can be null, an array, a list or any enumerable set of Point3d.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace