RhinoCommon SDK
BinaryArchiveReader.ReadLine Method
 Reads a Line from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line ReadLine()
Public Function ReadLine As Line
Return Value
Type: Line
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace