RhinoCommon API
MeshNgon.GetHashCode Method
 Returns a runtime-stable hashcode for the current mesh ngon. You are not allowed to rely on persistance of this hashcode in serialization, but for each instance of the application, this hashcode will be the same for ngons with identical vertex and face lists.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this mesh ngon.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace