RhinoCommon API
Arc.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EpsilonEquals(
	Arc other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Arc,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Arc
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Arc.EpsilonEquals(Rhino.Geometry.Arc,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Arc.EpsilonEquals(Rhino.Geometry.Arc,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Arc.EpsilonEquals(Rhino.Geometry.Arc,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Arc Structure
Rhino.Geometry Namespace