RhinoCommon API
Matrix Constructor (Int32, Int32)
 Initializes a new instance of the matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Matrix(
	int rowCount,
	int columnCount
)
Public Sub New (
	rowCount As Integer,
	columnCount As Integer
)
Parameters
rowCount
Type: System.Int32
A positive integer, or 0, for the number of rows.
columnCount
Type: System.Int32
A positive integer, or 0, for the number of columns.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If either rowCount, or columnCount or both are negative.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Matrix Class
Matrix Overload
Rhino.Geometry Namespace