RhinoCommon API
RenderWindow.Channel.SetValue Method (Int32, Int32, Single)
 If x or y are out of range, the function will fail and may crash Rhino.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetValue(
	int x,
	int y,
	float value
)
Public Sub SetValue (
	x As Integer,
	y As Integer,
	value As Single
)
Parameters
x
Type: System.Int32
The horizontal pixel position. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer.
y
Type: System.Int32
the vertical pixel position. No validation is done on this value. The caller is responsible for ensuring that it is within the frame buffer.
value
Type: System.Single
The value to store in the channel at the specified position.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderWindow.Channel Class
SetValue Overload
Rhino.Render Namespace