RhinoCommon API
File3dm.Polish Method
 This function is only kept for forward assembly compatibility.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Polish()
Public Sub Polish
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.26
See Also
Reference
File3dm Class
Rhino.FileIO Namespace