RhinoCommon API
TextLog.Print Method (String, Object)
 Send formatted text to the textlog
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Print(
	string format,
	Object arg0
)
Public Sub Print (
	format As String,
	arg0 As Object
)
Parameters
format
Type: System.String
[Missing <param name="format"/> documentation for "M:Rhino.FileIO.TextLog.Print(System.String,System.Object)"]
arg0
Type: System.Object
[Missing <param name="arg0"/> documentation for "M:Rhino.FileIO.TextLog.Print(System.String,System.Object)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
TextLog Class
Print Overload
Rhino.FileIO Namespace