RhinoCommon SDK
IDialogService.ShowListBox Method
[Missing <summary> documentation for "M:Rhino.UI.IDialogService.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
Object ShowListBox(
	string title,
	string message,
	IList items,
	Object selectedItem
)
Function ShowListBox (
	title As String,
	message As String,
	items As IList,
	selectedItem As Object
) As Object
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IDialogService.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IDialogService.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)"]
items
Type: System.Collections.IList
[Missing <param name="items"/> documentation for "M:Rhino.UI.IDialogService.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)"]
selectedItem
Type: System.Object
[Missing <param name="selectedItem"/> documentation for "M:Rhino.UI.IDialogService.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IDialogService.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)"]
See Also
Reference
IDialogService Interface
Rhino.UI Namespace