RhinoCommon API
DisplayPipeline.DrawBoxCorners Method (BoundingBox, Color)
 Draws corner widgets of a world aligned boundingbox. Widget size will be 5% of the Box diagonal.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawBoxCorners(
	BoundingBox box,
	Color color
)
Public Sub DrawBoxCorners (
	box As BoundingBox,
	color As Color
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw with.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayPipeline Class
DrawBoxCorners Overload
Rhino.Display Namespace