RhinoCommon API
PickContext.Dispose Method
Releases all resources used by the PickContext
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PickContext Class
Dispose Overload
Rhino.Input.Custom Namespace