RhinoCommon API
ArchivableDictionary.Set Method (String, Int16)
 Sets a Int16.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	short val
)
Public Function Set (
	key As String,
	val As Short
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.Int16
A Int16.
Because Int16 has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace