RhinoCommon SDK
SubDVertexSectorIterator.Reset Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Reset(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDFacePtr,System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Reset(
	SubDVertexPtr vertex,
	SubDFacePtr face,
	bool ccw
)
Public Function Reset (
	vertex As SubDVertexPtr,
	face As SubDFacePtr,
	ccw As Boolean
) As Boolean
Parameters
vertex
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="vertex"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Reset(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDFacePtr,System.Boolean)"]
face
Type: Rhino.Geometry.SubDFacePtr
[Missing <param name="face"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Reset(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDFacePtr,System.Boolean)"]
ccw
Type: System.Boolean
[Missing <param name="ccw"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Reset(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDFacePtr,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Reset(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDFacePtr,System.Boolean)"]
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace