RhinoCommon SDK
Panels.PanelDockBar Method (Type)
 Will always return Guid.Emty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid PanelDockBar(
	Type panelType
)
Public Shared Function PanelDockBar (
	panelType As Type
) As Guid
Parameters
panelType
Type: System.Type
 Panel class for of the panel to look for.
Return Value
Type: Guid
 Always returns Guid.Empty on Mac Rhino. On Windows Rhino it will return the Id for the dock bar which host the specified panel or Guid.Empty if the panel is not currently visible.
See Also
Reference
Panels Class
PanelDockBar Overload
Rhino.UI Namespace