RhinoCommon API
GetBaseClass.GotDefault Method
 Returns true if user pressed Enter to accept a default point, number, or string set using SetDefaultPoint, SetDefaultNumber, or SetDefaultString.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GotDefault()
Public Function GotDefault As Boolean
Return Value
Type: Boolean
true if the result if the default point, number or string set. Otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace