RhinoCommon API
AppearanceSettings.GetPaintColor Method
 Gets the .Net library color that is currently associated with a paint color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color GetPaintColor(
	PaintColor whichColor
)
Public Shared Function GetPaintColor (
	whichColor As PaintColor
) As Color
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
A color association.
Return Value
Type: Color
A .Net library color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace