RhinoCommon SDK
StringTable.GetKey Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetKey(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetKey(
	int i
)
Public Function GetKey (
	i As Integer
) As String
Parameters
i
Type: System.Int32
[Missing <param name="i"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetKey(System.Int32)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetKey(System.Int32)"]
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace