RhinoCommon API
LineCurve Constructor (LineCurve)
 Initializes a new instance of the LineCurve class, by copying values from another linear curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LineCurve(
	LineCurve other
)
Public Sub New (
	other As LineCurve
)
Parameters
other
Type: Rhino.Geometry.LineCurve
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.LineCurve.#ctor(Rhino.Geometry.LineCurve)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace