RhinoCommon API
MeshFaceList.RemoveAt Method (Int32)
 Removes a face from the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
The index of the face that will be removed.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is < 0 or >= Count.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshFaceList Class
RemoveAt Overload
Rhino.Geometry.Collections Namespace