RhinoCommon API
RdkUndo.Dispose Method
 Dispose for RdkUndo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RdkUndo Class
Rhino.Render Namespace