RhinoCommon API
PlugIn.GetInstalledPlugInNames Method
 Returns the names of all installed Rhino plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] GetInstalledPlugInNames()
Public Shared Function GetInstalledPlugInNames As String()
Return Value
Type: String[]
The names if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PlugIn Class
GetInstalledPlugInNames Overload
Rhino.PlugIns Namespace