RhinoCommon API
Box.RepositionBasePlane Method
 Repositions the origin of the Base plane for this box without affecting the physical dimensions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RepositionBasePlane(
	Point3d origin
)
Public Sub RepositionBasePlane (
	origin As Point3d
)
Parameters
origin
Type: Rhino.Geometry.Point3d
The new base plane origin.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Box Structure
Rhino.Geometry Namespace