RhinoCommon SDK
MeshTextureCoordinateList.SetTextureCoordinates Method (TextureMapping)
 Set all texture coordinates based on a texture mapping function
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTextureCoordinates(
	TextureMapping mapping
)
Public Function SetTextureCoordinates (
	mapping As TextureMapping
) As Boolean
Parameters
mapping
Type: Rhino.Render.TextureMapping
The new mapping type.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshTextureCoordinateList Class
SetTextureCoordinates Overload
Rhino.Geometry.Collections Namespace