RhinoCommon API
DimensionStyle.Duplicate Method
 Construct a deep (full) copy of this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle Duplicate()
Public Function Duplicate As DimensionStyle
Return Value
Type: DimensionStyle
An object of the same type as this, with the same properties and behavior.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DimensionStyle Class
Duplicate Overload
Rhino.DocObjects Namespace