RhinoCommon API
UserInterfaceSection.Show Method
 Show or hide this content section.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Show(
	bool visible
)
Public Sub Show (
	visible As Boolean
)
Parameters
visible
Type: System.Boolean
If true then show the content section otherwise hide it.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace