RhinoCommon API
LicenseUtils.ShowRhinoExpiredMessage Method (Int32, Int32)
 Show Rhino or Beta expired message
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowRhinoExpiredMessage(
	int mode,
	ref int result
)
Public Shared Function ShowRhinoExpiredMessage (
	mode As Integer,
	ByRef result As Integer
) As Boolean
Parameters
mode
Type: System.Int32
[Missing <param name="mode"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(System.Int32,System.Int32@)"]
result
Type: System.Int32
[Missing <param name="result"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(System.Int32,System.Int32@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(System.Int32,System.Int32@)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LicenseUtils Class
ShowRhinoExpiredMessage Overload
Rhino.PlugIns Namespace