RhinoCommon API
PolyCurve.SegmentCurve Method
 Gets the segment curve at the given index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve SegmentCurve(
	int index
)
Public Function SegmentCurve (
	index As Integer
) As Curve
Parameters
index
Type: System.Int32
Index of segment to retrieve.
Return Value
Type: Curve
The segment at the given index or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace