RhinoCommon API
GetPoint.Constrain Method (Circle)
Constrains the picked point to lie on a circle.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Constrain(
	Circle circle
)
Public Function Constrain (
	circle As Circle
) As Boolean
Parameters
circle
Type: Rhino.Geometry.Circle
A circle to use as constraint.
Return Value
Type: Boolean
true if constraint could be applied.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace