RhinoCommon API
ArchivableDictionary Constructor (Int32, String)
Initializes an instance of a dictionary for writing to a 3dm archive.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArchivableDictionary(
	int version,
	string name
)
Public Sub New (
	version As Integer,
	name As String
)
Parameters
version
Type: System.Int32
 custom version used to help the plug-in developer determine which version of a dictionary is being written. One good way to write version information is to use a date style integer (YYYYMMDD)
name
Type: System.String
 Optional name to associate with this dictionary. NOTE: if this dictionary is set as a subdictionary, the name will be changed to the subdictionary key entry
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace