RhinoCommon SDK
Brep.SetTrimIsoFlags Method
 This function can be used to set the BrepTrim::m_iso flag. It is intended to be used when creating a Brep from a definition that does not include compatible parameter space type information.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetTrimIsoFlags()
Public Sub SetTrimIsoFlags
See Also
Reference
Brep Class
Rhino.Geometry Namespace