RhinoCommon API
NameHash Constructor (String, Guid)
 Creates a new NameHash, representing a piece of text.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NameHash(
	string name,
	Guid parentId
)
Public Sub New (
	name As String,
	parentId As Guid
)
Parameters
name
Type: System.String
A name. This can be null and can refer to a nonexisting path.
parentId
Type: System.Guid
The id of the parent layer. This is only useful with layers.
Return Value
Type:
A new hash
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
NameHash Class
NameHash Overload
Rhino.FileIO Namespace