RhinoCommon API
CustomObjectGrips.Dispose Method
Releases all resources used by the CustomObjectGrips
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
CustomObjectGrips Class
Dispose Overload
Rhino.DocObjects.Custom Namespace