RhinoCommon API
RenderContentKindList.SingleKind Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentKindList.SingleKind"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentKind SingleKind()
Public Function SingleKind As RenderContentKind
Return Value
Type: RenderContentKind
[Missing <returns> documentation for "M:Rhino.Render.RenderContentKindList.SingleKind"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace