RhinoCommon API
RhinoList<T>.Sort Method
 Sorts the elements in the entire List using the default comparer.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Sort()
Public Sub Sort
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoList<T> Class
Sort Overload
Rhino.Collections Namespace