RhinoCommon SDK
RhinoGet.GetBox Method (Box)
 Asks the user to select a Box in the viewport.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetBox(
	out Box box
)
Public Shared Function GetBox (
	<OutAttribute> ByRef box As Box
) As Result
Parameters
box
Type: Rhino.Geometry.Box
If the result is Success, this parameter will be filled out.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
GetBox Overload
Rhino.Input Namespace