RhinoCommon SDK
IRhRdkContentThumbnail.ChildContent Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnail.ChildContent"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RenderContent ChildContent()
Function ChildContent As RenderContent
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnail.ChildContent"]
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls Namespace