RhinoCommon SDK
SumSurface.Create Method
 Constructs a new sum surface by extruding a curve A along a path B.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static SumSurface Create(
	Curve curveA,
	Curve curveB
)
Public Shared Function Create (
	curveA As Curve,
	curveB As Curve
) As SumSurface
Parameters
curveA
Type: Rhino.Geometry.Curve
The curve used as extrusion profile.
curveB
Type: Rhino.Geometry.Curve
The curve used as path.
Return Value
Type: SumSurface
A new sum surface on success; null on failure.
See Also
Reference
SumSurface Class
Rhino.Geometry Namespace