RhinoCommon API
PreviewAppearance.Dispose Method
 Dispose for previewappearance
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace