RhinoCommon API
ObjRef.Edge Method
 Gets the edge if this reference geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepEdge Edge()
Public Function Edge As BrepEdge
Return Value
Type: BrepEdge
A boundary representation edge; or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace