RhinoCommon SDK
DisplayPipeline.DrawHatch Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawHatch(
	Hatch hatch,
	Color hatchColor,
	Color boundaryColor
)
Public Sub DrawHatch (
	hatch As Hatch,
	hatchColor As Color,
	boundaryColor As Color
)
Parameters
hatch
Type: Rhino.Geometry.Hatch
[Missing <param name="hatch"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,System.Drawing.Color)"]
hatchColor
Type: System.Drawing.Color
[Missing <param name="hatchColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,System.Drawing.Color)"]
boundaryColor
Type: System.Drawing.Color
[Missing <param name="boundaryColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,System.Drawing.Color)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace