RhinoCommon API
ICollapsibleSectionHolder.UpdateAllViews Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.UpdateAllViews(System.Int32)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void UpdateAllViews(
	int flags
)
Sub UpdateAllViews (
	flags As Integer
)
Parameters
flags
Type: System.Int32
[Missing <param name="flags"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.UpdateAllViews(System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace