RhinoCommon SDK
SubDVertexPtr.AddEdge Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.AddEdge(Rhino.Geometry.SubDEdgePtr,System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void AddEdge(
	SubDEdgePtr edge,
	bool flip
)
Public Sub AddEdge (
	edge As SubDEdgePtr,
	flip As Boolean
)
Parameters
edge
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="edge"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.AddEdge(Rhino.Geometry.SubDEdgePtr,System.Boolean)"]
flip
Type: System.Boolean
[Missing <param name="flip"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.AddEdge(Rhino.Geometry.SubDEdgePtr,System.Boolean)"]
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace