RhinoCommon API
MeshVertexList.ToFloatArray Method
 Copies all vertices to a linear array of float in x,y,z order
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float[] ToFloatArray()
Public Function ToFloatArray As Single()
Return Value
Type: Single[]
The float array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace