RhinoCommon API
Worksession.FileNameFromRuntimeSerialNumber Method
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string FileNameFromRuntimeSerialNumber(
	uint runtimeSerialNumber
)
Public Shared Function FileNameFromRuntimeSerialNumber (
	runtimeSerialNumber As UInteger
) As String
Parameters
runtimeSerialNumber
Type: System.UInt32
[Missing <param name="runtimeSerialNumber"/> documentation for "M:Rhino.DocObjects.Worksession.FileNameFromRuntimeSerialNumber(System.UInt32)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Worksession.FileNameFromRuntimeSerialNumber(System.UInt32)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace