RhinoCommon API
FilePdf.Write Method (String)
 Write pdf to a file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void Write(
	string filename
)
Public MustOverride Sub Write (
	filename As String
)
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.FilePdf.Write(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
FilePdf Class
Write Overload
Rhino.FileIO Namespace