RhinoCommon API
RhinoObject.OnSelectionChanged Method
 Called when the selection state of this object has changed
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnSelectionChanged()
Protected Overridable Sub OnSelectionChanged
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace