RhinoCommon API
MeshTopologyEdgeList.CollapseEdge Method
 Replaces a mesh edge with a vertex at its center and update adjacent faces as needed.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CollapseEdge(
	int topologyEdgeIndex
)
Public Function CollapseEdge (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace