RhinoCommon SDK
MeshVertexList.ShowAll Method
 Shows all vertices in the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ShowAll()
Public Sub ShowAll
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace