RhinoCommon SDK
SubDVertexPtr.GetSectorIterator Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.GetSectorIterator"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexSectorIterator GetSectorIterator()
Public Function GetSectorIterator As SubDVertexSectorIterator
Return Value
Type: SubDVertexSectorIterator
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.GetSectorIterator"]
See Also
Reference
SubDVertexPtr Structure
GetSectorIterator Overload
Rhino.Geometry Namespace