RhinoCommon API
Color4f.Equals Method
[Missing <summary> documentation for "M:Rhino.Display.Color4f.Equals(System.Object)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.Display.Color4f.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.Color4f.Equals(System.Object)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Color4f Structure
Rhino.Display Namespace