RhinoCommon API
InstanceDefinition.CreatePreviewBitmap Method (DefinedViewportProjection, Size, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,System.Drawing.Size,System.Boolean)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap CreatePreviewBitmap(
	DefinedViewportProjection definedViewportProjection,
	Size bitmapSize,
	bool applyDpiScaling
)
Public Function CreatePreviewBitmap (
	definedViewportProjection As DefinedViewportProjection,
	bitmapSize As Size,
	applyDpiScaling As Boolean
) As Bitmap
Parameters
definedViewportProjection
Type: Rhino.Display.DefinedViewportProjection
[Missing <param name="definedViewportProjection"/> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,System.Drawing.Size,System.Boolean)"]
bitmapSize
Type: System.Drawing.Size
[Missing <param name="bitmapSize"/> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,System.Drawing.Size,System.Boolean)"]
applyDpiScaling
Type: System.Boolean
[Missing <param name="applyDpiScaling"/> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,System.Drawing.Size,System.Boolean)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,System.Drawing.Size,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
InstanceDefinition Class
CreatePreviewBitmap Overload
Rhino.DocObjects Namespace