RhinoCommon API
MeshFace Constructor (Int32, Int32, Int32)
 Constructs a new triangular Mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshFace(
	int a,
	int b,
	int c
)
Public Sub New (
	a As Integer,
	b As Integer,
	c As Integer
)
Parameters
a
Type: System.Int32
Index of first corner.
b
Type: System.Int32
Index of second corner.
c
Type: System.Int32
Index of third corner.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshFace Structure
MeshFace Overload
Rhino.Geometry Namespace