RhinoCommon API
AppearanceSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void UpdateFromState(
	AppearanceSettingsState state
)
Public Shared Sub UpdateFromState (
	state As AppearanceSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.AppearanceSettingsState
A joined settings object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace