RhinoCommon API
GetBaseClass.AcceptCustomMessage Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.AcceptCustomMessage(System.Boolean)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AcceptCustomMessage(
	bool enable
)
Public Sub AcceptCustomMessage (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.AcceptCustomMessage(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace