RhinoCommon API
Quaternion.Equals Method (Quaternion)
 Determines whether this quaternion has the same value of another quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Quaternion other
)
Public Function Equals (
	other As Quaternion
) As Boolean
Parameters
other
Type: Rhino.Geometry.Quaternion
Another quaternion to compare.
Return Value
Type: Boolean
true if the quaternions have exactly equal coefficients; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Quaternion Structure
Equals Overload
Rhino.Geometry Namespace