RhinoCommon SDK
LOC.STR Method (String)
 Strings that need to be localized should call this function. The STR function doesn't actually do anything but return the original string. The LocalizationProcessor application walks through the source code of a project and looks for LOC.STR. The function is then replaced with a call to Localization.LocalizeString using a unique context ID.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string STR(
	string english
)
Public Shared Function STR (
	english As String
) As String
Parameters
english
Type: System.String
[in] The English string to localize.
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.LOC.STR(System.String)"]
See Also
Reference
LOC Class
STR Overload
Rhino.UI Namespace