RhinoCommon SDK
BitmapTable.Delete Method
 Removes the bitmap from the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Delete(
	BitmapEntry item
)
Public Overrides Function Delete (
	item As BitmapEntry
) As Boolean
Parameters
item
Type: Rhino.DocObjects.BitmapEntry
The item to remove. Null will always return false.
Return Value
Type: Boolean
True if the item could be deleted; otherwise, false.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace