RhinoCommon API
ContentFactory.Dispose Method
Releases all resources used by the ContentFactory
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace