RhinoCommon API
RhinoApp.CommandLineTextWriter Constructor
Initializes a new instance of the RhinoApp.CommandLineTextWriter class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CommandLineTextWriter()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Rhino Namespace