RhinoCommon API
SimpleArrayGeometryPointer Constructor
 Initializes a new SimpleArrayGeometryPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayGeometryPointer()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
SimpleArrayGeometryPointer Class
SimpleArrayGeometryPointer Overload
Rhino.Runtime.InteropWrappers Namespace