RhinoCommon API
DisplayPipelineAttributes.Dispose Method (Boolean)
Releases the unmanaged resources used by the DisplayPipelineAttributes and optionally releases the managed resources
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayPipelineAttributes Class
Dispose Overload
Rhino.Display Namespace