RhinoCommon API
PreviewBackground Constructor
 Constructor for PreivewLighting
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewBackground(
	IntPtr pPreviewBackground
)
Public Sub New (
	pPreviewBackground As IntPtr
)
Parameters
pPreviewBackground
Type: System.IntPtr
[Missing <param name="pPreviewBackground"/> documentation for "M:Rhino.Render.PreviewBackground.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace