RhinoCommon API
ComponentFunctionInfo.ToString Method
 Returns a string represetning this function.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The namespace and the name.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace