RhinoCommon SDK
BrepLoopList.Add Method (BrepLoopType)
 Create a new outer boundary loop that runs along the edges of the underlying surface.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoop Add(
	BrepLoopType loopType
)
Public Function Add (
	loopType As BrepLoopType
) As BrepLoop
Parameters
loopType
Type: Rhino.Geometry.BrepLoopType
[Missing <param name="loopType"/> documentation for "M:Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType)"]
Return Value
Type: BrepLoop
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType)"]
See Also
Reference
BrepLoopList Class
Add Overload
Rhino.Geometry.Collections Namespace