RhinoCommon SDK
Ellipse Constructor (Point3d, Point3d, Point3d)
 Initializes a new ellipse from a center point and the two semiaxes intersections.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Ellipse(
	Point3d center,
	Point3d second,
	Point3d third
)
Public Sub New (
	center As Point3d,
	second As Point3d,
	third As Point3d
)
Parameters
center
Type: Rhino.Geometry.Point3d
A center for the ellipse. The avarage of the foci.
second
Type: Rhino.Geometry.Point3d
The intersection of the ellipse X axis with the ellipse itself.
third
Type: Rhino.Geometry.Point3d
A point that determines the radius along the Y semiaxis.
If the point is at right angle with the (center - second point) vector, it will be the intersection of the ellipse Y axis with the ellipse itself.
See Also
Reference
Ellipse Structure
Ellipse Overload
Rhino.Geometry Namespace