RhinoCommon API
Intersection.CurveSelf Method
 Finds the places where a curve intersects itself.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CurveIntersections CurveSelf(
	Curve curve,
	double tolerance
)
Public Shared Function CurveSelf (
	curve As Curve,
	tolerance As Double
) As CurveIntersections
Parameters
curve
Type: Rhino.Geometry.Curve
Curve for self-intersections.
tolerance
Type: System.Double
Intersection tolerance. If the curve approaches itself to within tolerance, an intersection is assumed.
Return Value
Type: CurveIntersections
A collection of intersection events.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace