RhinoCommon API
NamedConstructionPlaneTable.Delete Method (Int32)
 Remove named construction plane from the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	int index
)
Public Function Delete (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
NamedConstructionPlaneTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace