RhinoCommon API
Thumbnail.Id Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Id"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Id"]
Implements
IRhRdkThumbnail.Id()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace