RhinoCommon API
ClassIdAttribute Constructor
Initializes a class id attrbute.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClassIdAttribute(
	string id
)
Public Sub New (
	id As String
)
Parameters
id
Type: System.String
String in the form of a Guid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ClassIdAttribute Class
Rhino.DocObjects.Custom Namespace