RhinoCommon API
GetLine Constructor
Initializes a new instance of the GetLine class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetLine()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace