RhinoCommon API
CustomBrepObject Constructor (Brep)
Initializes a new instance of the CustomBrepObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomBrepObject(
	Brep brep
)
Protected Sub New (
	brep As Brep
)
Parameters
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.DocObjects.Custom.CustomBrepObject.#ctor(Rhino.Geometry.Brep)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomBrepObject Class
CustomBrepObject Overload
Rhino.DocObjects.Custom Namespace