RhinoCommon SDK
BoundingBox Constructor (Double, Double, Double, Double, Double, Double)
 Constructs a boundingbox from numeric extremes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox(
	double minX,
	double minY,
	double minZ,
	double maxX,
	double maxY,
	double maxZ
)
Public Sub New (
	minX As Double,
	minY As Double,
	minZ As Double,
	maxX As Double,
	maxY As Double,
	maxZ As Double
)
Parameters
minX
Type: System.Double
Lower extreme for box X size.
minY
Type: System.Double
Lower extreme for box Y size.
minZ
Type: System.Double
Lower extreme for box Z size.
maxX
Type: System.Double
Upper extreme for box X size.
maxY
Type: System.Double
Upper extreme for box Y size.
maxZ
Type: System.Double
Upper extreme for box Z size.
See Also
Reference
BoundingBox Structure
BoundingBox Overload
Rhino.Geometry Namespace