RhinoCommon API
ScaleValue Constructor
 Default constructor
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ScaleValue()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ScaleValue Class
Rhino Namespace