RhinoCommon API
AngularDimension.Create Method (DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AngularDimension Create(
	DimensionStyle dimStyle,
	Plane plane,
	Vector3d horizontal,
	Point3d centerpoint,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	plane As Plane,
	horizontal As Vector3d,
	centerpoint As Point3d,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d
) As AngularDimension
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's DimensionStyle
plane
Type: Rhino.Geometry.Plane
Dimension's Plane
horizontal
Type: Rhino.Geometry.Vector3d
Horizontal reference direction
centerpoint
Type: Rhino.Geometry.Point3d
Dimension centerpoint
defpoint1
Type: Rhino.Geometry.Point3d
First definition point
defpoint2
Type: Rhino.Geometry.Point3d
Second definition point
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
Return Value
Type: AngularDimension
[Missing <returns> documentation for "M:Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AngularDimension Class
Create Overload
Rhino.Geometry Namespace