RhinoCommon API
LightArray.Dispose Method
Releases all resources used by the LightArray
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LightArray Class
Rhino.Render Namespace