RhinoCommon API
IZooClientUtilities.LoginToCloudZoo Method
 Logs the user in to the cloud zoo. This logs out the current user and voids any existing leases.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool LoginToCloudZoo()
Function LoginToCloudZoo As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.LoginToCloudZoo"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace