RhinoCommon API
EdgeAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static EdgeAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As EdgeAnalysisSettingsState
Return Value
Type: EdgeAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EdgeAnalysisSettings.GetDefaultState"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace