RhinoCommon API
Surface.CreatePeriodicSurface Method (Surface, Int32)
 Constructs a periodic surface from a base surface and a direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Surface CreatePeriodicSurface(
	Surface baseSurface,
	int direction
)
Public Shared Function CreatePeriodicSurface (
	baseSurface As Surface,
	direction As Integer
) As Surface
Parameters
baseSurface
Type: Rhino.Geometry.Surface
[Missing <param name="baseSurface"/> documentation for "M:Rhino.Geometry.Surface.CreatePeriodicSurface(Rhino.Geometry.Surface,System.Int32)"]
direction
Type: System.Int32
The direction to make periodic, either 0 = U, or 1 = V.
Return Value
Type: Surface
A Surface on success or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Surface Class
CreatePeriodicSurface Overload
Rhino.Geometry Namespace