RhinoCommon API
GetTransform.GetXform Method
 Gets the Transformation.
Call this after having set up options and so on.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetResult GetXform()
Public Function GetXform As GetResult
Return Value
Type: GetResult
The result based on user choice.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace