RhinoCommon API
IRhRdkThumbnailList.GetSize Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetSize"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IRhRdkContentThumbnailList_Sizes GetSize()
Function GetSize As IRhRdkContentThumbnailList_Sizes
Return Value
Type: IRhRdkContentThumbnailList_Sizes
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetSize"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace