RhinoCommon API
ColorXYZ.CreateFromLAB Method
 Create the nearest XYZ equivalent of a Lab color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorXYZ CreateFromLAB(
	ColorLAB lab
)
Public Shared Function CreateFromLAB (
	lab As ColorLAB
) As ColorXYZ
Parameters
lab
Type: Rhino.Display.ColorLAB
Target color in LAB space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the LAB color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace