RhinoCommon SDK
AnnotationObjectBase.DimScale Method
 I really would like to change the name of this function to something more descriptive
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DimScale(
	RhinoViewport viewport
)
Public Function DimScale (
	viewport As RhinoViewport
) As Double
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.DimScale(Rhino.Display.RhinoViewport)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.DimScale(Rhino.Display.RhinoViewport)"]
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace