RhinoCommon API
Point4d Constructor (Point3d)
 Initializes a new instance of the Point4d class from the coordinates of a point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point4d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Point4d Structure
Point4d Overload
Rhino.Geometry Namespace