RhinoCommon SDK
IRhRdkContentThumbnail.TopLevelContent Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnail.TopLevelContent"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RenderContent TopLevelContent()
Function TopLevelContent As RenderContent
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnail.TopLevelContent"]
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls Namespace