RhinoCommon API
PersistentSettings.SetPoint3d Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetPoint3d(System.String,Rhino.Geometry.Point3d)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPoint3d(
	string key,
	Point3d value
)
Public Sub SetPoint3d (
	key As String,
	value As Point3d
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetPoint3d(System.String,Rhino.Geometry.Point3d)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetPoint3d(System.String,Rhino.Geometry.Point3d)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PersistentSettings Class
Rhino Namespace