RhinoCommon SDK
Polyline.Trim Method
 Constructs a polyline out of a parameter subdomain in this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Polyline
Parameters
domain
Type: Rhino.Geometry.Interval
The subdomain of the polyline. The integer part of the domain parameters indicate the index of the segment.
Return Value
Type: Polyline
The polyline as defined by the subdomain, or null on failure.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace