RhinoCommon API
ObjectAttributes.AddToGroup Method
 Adds object to the group with specified index by appending index to group list.
If the object is already in group, nothing is changed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddToGroup(
	int groupIndex
)
Public Sub AddToGroup (
	groupIndex As Integer
)
Parameters
groupIndex
Type: System.Int32
The index that will be added.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace