RhinoCommon API
IStackedDialogPageService.RedrawPageControl Method
 Redraw the specified control.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void RedrawPageControl(
	Object pageControl
)
Sub RedrawPageControl (
	pageControl As Object
)
Parameters
pageControl
Type: System.Object
 Control to redraw
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace