RhinoCommon API
ViewSettings.UpdateFromState Method
 Updates from a particular setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void UpdateFromState(
	ViewSettingsState state
)
Public Shared Sub UpdateFromState (
	state As ViewSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.ViewSettingsState
The new state that will be set.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace