RhinoCommon API
Vector2d.GreaterThan Operator
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator >(
	Vector2d a,
	Vector2d b
)
Public Shared Operator > (
	a As Vector2d,
	b As Vector2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2d
First vector.
b
Type: Rhino.Geometry.Vector2d
Second vector.
Return Value
Type: Boolean
true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace