RhinoCommon SDK
BinaryArchiveReader.ReadSizeF Method
 Reads a SizeF from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SizeF ReadSizeF()
Public Function ReadSizeF As SizeF
Return Value
Type: SizeF
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace