RhinoCommon API
GetCylinder Constructor
Initializes a new instance of the GetCylinder class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetCylinder()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace