RhinoCommon API
CreatePreviewEventArgs.SkipInitialisation Method
 Call this if you don't want the argument to handle data initialisation. This is for use with the ChangeQueue
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SkipInitialisation()
Public Sub SkipInitialisation
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace