RhinoCommon API
LightArray.ElementAt Method
[Missing <summary> documentation for "M:Rhino.Render.LightArray.ElementAt(System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light ElementAt(
	int index
)
Public Function ElementAt (
	index As Integer
) As Light
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Render.LightArray.ElementAt(System.Int32)"]
Return Value
Type: Light
[Missing <returns> documentation for "M:Rhino.Render.LightArray.ElementAt(System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
LightArray Class
Rhino.Render Namespace