RhinoCommon API
ArchivableDictionary.GetBool Method (String)
 Get value as bool, will only succeed if value was created using Set(string key, bool value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetBool(
	string key
)
Public Function GetBool (
	key As String
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetBool(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetBool(System.String)"]
See Also
Reference
ArchivableDictionary Class
GetBool Overload
Rhino.Collections Namespace