RhinoCommon API
RenderContent.SetChildSlotAmount Method
 Sets the amount property for the texture in the specified child slot. Values are typically from 0.0 - 100.0
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetChildSlotAmount(
	string childSlotName,
	double amount,
	RenderContent.ChangeContexts cc
)
Public Sub SetChildSlotAmount (
	childSlotName As String,
	amount As Double,
	cc As RenderContent.ChangeContexts
)
Parameters
childSlotName
Type: System.String
Child slot name for the child
amount
Type: System.Double
Texture amount. Values are typically from 0.0 - 100.0
cc
Type: Rhino.Render.RenderContent.ChangeContexts
Context of the change.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContent Class
Rhino.Render Namespace