RhinoCommon SDK
Rectangle3d.Transform Method
 Transforms this rectangle. Note that rectangles cannot be skewed or tapered.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Rectangle3d.Transform(Rhino.Geometry.Transform)"]
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace