RhinoCommon API
Circle Constructor (Double)
 Initializes a circle with center (0,0,0) in the world XY plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle(
	double radius
)
Public Sub New (
	radius As Double
)
Parameters
radius
Type: System.Double
Radius of circle, should be a positive number.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace