RhinoCommon API
Surface.InterpolatedCurveOnSurfaceUV Method (IEnumerable<Point2d>, Double)
 Returns a curve that interpolates points on a surface. The interpolant lies on the surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve InterpolatedCurveOnSurfaceUV(
	IEnumerable<Point2d> points,
	double tolerance
)
Public Function InterpolatedCurveOnSurfaceUV (
	points As IEnumerable(Of Point2d),
	tolerance As Double
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point2d>
List of at least two UV parameter locations on the surface.
tolerance
Type: System.Double
Tolerance used for the fit of the pushup curve. Generally, the resulting interpolating curve will be within tolerabce of the surface.
Return Value
Type: NurbsCurve
A new NURBS curve if successful, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Surface Class
InterpolatedCurveOnSurfaceUV Overload
Rhino.Geometry Namespace