RhinoCommon API
LayerTable.ForceLayerVisible Method (Int32)
 Makes a layer and all of its parent layers visible.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ForceLayerVisible(
	int layerIndex
)
Public Function ForceLayerVisible (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
The layer index to be made visible.
Return Value
Type: Boolean
true if the operation succeeded.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
LayerTable Class
ForceLayerVisible Overload
Rhino.DocObjects.Tables Namespace