RhinoCommon API
BinaryArchiveReader.ReadBool Method
 Reads a Boolean from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReadBool()
Public Function ReadBool As Boolean
Return Value
Type: Boolean
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace