RhinoCommon API
PersistentSettings.GetByte Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetByte(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public byte GetByte(
	string key
)
Public Function GetByte (
	key As String
) As Byte
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetByte(System.String)"]
Return Value
Type: Byte
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetByte(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
PersistentSettings Class
GetByte Overload
Rhino Namespace