RhinoCommon API
ObjectTable.AddPoint Method (Double, Double, Double)
 Adds a point object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPoint(
	double x,
	double y,
	double z
)
Public Function AddPoint (
	x As Double,
	y As Double,
	z As Double
) As Guid
Parameters
x
Type: System.Double
X component of point coordinate.
y
Type: System.Double
Y component of point coordinate.
z
Type: System.Double
Z component of point coordinate.
Return Value
Type: Guid
A unique identifier for the object..
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectTable Class
AddPoint Overload
Rhino.DocObjects.Tables Namespace