RhinoCommon API
City.CityAt Method
 Returns city at given index.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static City CityAt(
	int index
)
Public Shared Function CityAt (
	index As Integer
) As City
Parameters
index
Type: System.Int32
index.
Return Value
Type: City
City at index.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
City Class
Rhino.Render Namespace