RhinoCommon API
Mesh.Split Method (IEnumerable<Mesh>)
 Split a mesh with a collection of meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh[] Split(
	IEnumerable<Mesh> meshes
)
Public Function Split (
	meshes As IEnumerable(Of Mesh)
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to split with.
Return Value
Type: Mesh[]
An array of mesh segments representing the split result.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace