RhinoCommon API
PixelBuffer Constructor
 Create a new PixelBuffer pointing to the (unmanaged) pixel data buffer behind IntPtr
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PixelBuffer(
	IntPtr bufferPointer
)
Public Sub New (
	bufferPointer As IntPtr
)
Parameters
bufferPointer
Type: System.IntPtr
IntPtr to the unmanaged pixel data buffer
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
PixelBuffer Class
Rhino.Render Namespace