RhinoCommon SDK
NurbsSurface.CreateFromCylinder Method
 Constructs a new NURBS surfaces from cylinder data.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateFromCylinder(
	Cylinder cylinder
)
Public Shared Function CreateFromCylinder (
	cylinder As Cylinder
) As NurbsSurface
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
A cylinder value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace