RhinoCommon SDK
SnapShotsClient.ClientId Method
 The unique id of this client.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid ClientId()
Public MustOverride Function ClientId As Guid
Return Value
Type: Guid
The unique id of this client.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace