RhinoCommon API
LicenseData Constructor
 Public constructor.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseData()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LicenseData Class
LicenseData Overload
Rhino.PlugIns Namespace