RhinoCommon API
MeshVertexList.AddVertices Method (IEnumerable<Point3f>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddVertices(
	IEnumerable<Point3f> vertices
)
Public Sub AddVertices (
	vertices As IEnumerable(Of Point3f)
)
Parameters
vertices
Type: System.Collections.Generic.IEnumerable<Point3f>
A list, an array or any enumerable set of Point3f.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshVertexList Class
AddVertices Overload
Rhino.Geometry.Collections Namespace