RhinoCommon API
ObjectTable.AddArc Method (Arc)
Adds a curve object to the document representing an arc.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddArc(
	Arc arc
)
Public Function AddArc (
	arc As Arc
) As Guid
Parameters
arc
Type: Rhino.Geometry.Arc
An arc value.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectTable Class
AddArc Overload
Rhino.DocObjects.Tables Namespace