RhinoCommon API
Rectangle3d.Contains Method (Point3d)
 Determines if a point is included in this rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointContainment Contains(
	Point3d pt
)
Public Function Contains (
	pt As Point3d
) As PointContainment
Parameters
pt
Type: Rhino.Geometry.Point3d
Point to test. The point will be projected onto the Rectangle plane before inclusion is determined.
Return Value
Type: PointContainment
Point Rectangle relationship.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rectangle3d Structure
Contains Overload
Rhino.Geometry Namespace