RhinoCommon SDK
DisplayPipeline.DrawArrow Method (Line, Color)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawArrow(
	Line line,
	Color color
)
Public Sub DrawArrow (
	line As Line,
	color As Color
)
Parameters
line
Type: Rhino.Geometry.Line
Arrow shaft.
color
Type: System.Drawing.Color
Color of arrow.
See Also
Reference
DisplayPipeline Class
DrawArrow Overload
Rhino.Display Namespace