RhinoCommon API
Curve.ChangeClosedCurveSeam Method
 If this curve is closed, then modify it so that the start/end point is at curve parameter t.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ChangeClosedCurveSeam(
	double t
)
Public Function ChangeClosedCurveSeam (
	t As Double
) As Boolean
Parameters
t
Type: System.Double
 Curve parameter of new start/end point. The returned curves domain will start at t.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Curve Class
Rhino.Geometry Namespace