RhinoCommon SDK
IPanelsService.OpenPanel Method (Guid, Boolean)
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void OpenPanel(
	Guid panelId,
	bool makeSelectedTab
)
Sub OpenPanel (
	panelId As Guid,
	makeSelectedTab As Boolean
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Boolean)"]
makeSelectedTab
Type: System.Boolean
[Missing <param name="makeSelectedTab"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IPanelsService Interface
OpenPanel Overload
Rhino.UI Namespace