RhinoCommon SDK
IStackedDialogPageService.SelectedObjectAt Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectAt(System.Object,System.Int32,System.UInt32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IntPtr SelectedObjectAt(
	Object data,
	int index,
	uint filter
)
Function SelectedObjectAt (
	data As Object,
	index As Integer,
	filter As UInteger
) As IntPtr
Parameters
data
Type: System.Object
[Missing <param name="data"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectAt(System.Object,System.Int32,System.UInt32)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectAt(System.Object,System.Int32,System.UInt32)"]
filter
Type: System.UInt32
[Missing <param name="filter"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectAt(System.Object,System.Int32,System.UInt32)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectAt(System.Object,System.Int32,System.UInt32)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace