RhinoCommon API
Mesh.ComputeAutoCreaseInformation Method
 Do not use this method. Length: top.Mesh.Vertices.Count
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public byte[] ComputeAutoCreaseInformation()
Public Function ComputeAutoCreaseInformation As Byte()
Return Value
Type: Byte[]
An array that is bound to change.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Mesh Class
Rhino.Geometry Namespace