RhinoCommon API
GroundPlane.CopyFrom Method
[Missing <summary> documentation for "M:Rhino.Render.GroundPlane.CopyFrom(Rhino.Render.FreeFloatingBase)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override void CopyFrom(
	FreeFloatingBase src
)
Public Overrides Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.GroundPlane.CopyFrom(Rhino.Render.FreeFloatingBase)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
GroundPlane Class
Rhino.Render Namespace