RhinoCommon SDK
StringTable.GetEntryNames Method
 Return list of all entry names for a given section of user data strings in the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] GetEntryNames(
	string section
)
Public Function GetEntryNames (
	section As String
) As String()
Parameters
section
Type: System.String
The section from which to retrieve section names.
Return Value
Type: String[]
An array of section names. This can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace