RhinoCommon API
SceneServerData Constructor
 Constructor for SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SceneServerData(
	PreviewGeometry geo,
	PreviewBackground back,
	PreviewLighting light,
	SceneServerDataUsage usage
)
Public Sub New (
	geo As PreviewGeometry,
	back As PreviewBackground,
	light As PreviewLighting,
	usage As SceneServerDataUsage
)
Parameters
geo
Type: Rhino.Render.PreviewGeometry
[Missing <param name="geo"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
back
Type: Rhino.Render.PreviewBackground
[Missing <param name="back"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
light
Type: Rhino.Render.PreviewLighting
[Missing <param name="light"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
usage
Type: Rhino.Render.SceneServerDataUsage
[Missing <param name="usage"/> documentation for "M:Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
SceneServerData Class
Rhino.Render Namespace