RhinoCommon API
SplopSpaceMorph Constructor (Plane, Surface, Point2d)
 Constructs a flow space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SplopSpaceMorph(
	Plane plane,
	Surface surface,
	Point2d surfaceParam
)
Public Sub New (
	plane As Plane,
	surface As Surface,
	surfaceParam As Point2d
)
Parameters
plane
Type: Rhino.Geometry.Plane
Source plane of deformation.
surface
Type: Rhino.Geometry.Surface
Surface to wrap objects onto.
surfaceParam
Type: Rhino.Geometry.Point2d
U,V parameter on surface used for orienting.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
SplopSpaceMorph Class
SplopSpaceMorph Overload
Rhino.Geometry.Morphs Namespace