RhinoCommon API
Arc.Equals Method (Arc)
 Determines whether another arc has the same value as this arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Arc other
)
Public Function Equals (
	other As Arc
) As Boolean
Parameters
other
Type: Rhino.Geometry.Arc
An arc.
Return Value
Type: Boolean
true if obj is equal to this arc; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Arc Structure
Equals Overload
Rhino.Geometry Namespace