RhinoCommon SDK
ColorLAB Implicit Conversion (ColorLAB to Color)
 Implicitly converts a LAB color into a .Net library color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static implicit operator Color (
	ColorLAB lab
)
Public Shared Widening Operator CType (
	lab As ColorLAB
) As Color
Parameters
lab
Type: Rhino.Display.ColorLAB
A LAB color.
Return Value
Type: Color
A ARGB .Net library color.
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace