RhinoCommon SDK
SubDVertexAccess.TryFind Method
[Missing <summary> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.TryFind(System.Int32,Rhino.Geometry.SubDVertexPtr@)"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TryFind(
	int vertexIndex,
	out SubDVertexPtr vertex
)
Public Function TryFind (
	vertexIndex As Integer,
	<OutAttribute> ByRef vertex As SubDVertexPtr
) As Boolean
Parameters
vertexIndex
Type: System.Int32
[Missing <param name="vertexIndex"/> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.TryFind(System.Int32,Rhino.Geometry.SubDVertexPtr@)"]
vertex
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="vertex"/> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.TryFind(System.Int32,Rhino.Geometry.SubDVertexPtr@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.TryFind(System.Int32,Rhino.Geometry.SubDVertexPtr@)"]
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace