RhinoCommon API
TimeZone.TimeZones Method
 Returns number of available time zones.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int TimeZones()
Public Shared Function TimeZones As Integer
Return Value
Type: Int32
Time zone count.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
TimeZone Class
Rhino.Render Namespace