RhinoCommon API
RhinoViewport.GetNearRect Method
Get corners of near clipping plane rectangle.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] GetNearRect()
Public Function GetNearRect As Point3d()
Return Value
Type: Point3d[]
 [left_bottom, right_bottom, left_top, right_top] points on success null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace