RhinoCommon API
CachedTextureCoordinates.Clear Method
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace