RhinoCommon API
PolyCurve.Duplicate Method
 Duplicates this polycurve.
When not overridden in a derived class, this calls DuplicatePolyCurve().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
An exact duplicate of this curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace