RhinoCommon API
RealtimeDisplayMode.IsCompleted Method
 Implement to tell if your render engine has completed a frame for drawing into the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool IsCompleted()
Public MustOverride Function IsCompleted As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.IsCompleted"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace