RhinoCommon SDK
GripObject.UndoMove Method
 Undoes any grip moves made by calling Move.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void UndoMove()
Public Sub UndoMove
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace