RhinoCommon API
Plane.ClosestPoint Method
 Gets the point on the plane closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to get close to.
Return Value
Type: Point3d
 The point on the plane that is closest to testPoint, or Point3d.Unset on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Plane Structure
Rhino.Geometry Namespace