RhinoCommon SDK
ComponentStatus.GetHashCode Method
 Serves as a special hash function. The inner value is used for the purpose.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
An integer deriving from a bit mask.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace