RhinoCommon API
Vector3d.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EpsilonEquals(
	Vector3d other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Vector3d,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector3d
epsilon
Type: System.Double
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Vector3d.EpsilonEquals(Rhino.Geometry.Vector3d,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace