RhinoCommon API
DisplayPipeline.DrawMeshFalseColors Method
 Draws the mesh faces as false color patches. The mesh must have Vertex Colors defined for this to work.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawMeshFalseColors(
	Mesh mesh
)
Public Sub DrawMeshFalseColors (
	mesh As Mesh
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace