RhinoCommon API
ArchivableDictionary.Set Method (String, Ray3d)
 Sets a Ray3d.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	Ray3d val
)
Public Function Set (
	key As String,
	val As Ray3d
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Ray3d
A value for that key.
Because Ray3d has value semantics and is immutable, no changes to this object are possible.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Ray3d)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace