RhinoCommon SDK
DisplayPipeline.DrawPolygon Method
 Draws a filled polygon.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawPolygon(
	IEnumerable<Point3d> points,
	Color color,
	bool filled
)
Public Sub DrawPolygon (
	points As IEnumerable(Of Point3d),
	color As Color,
	filled As Boolean
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
 Collection of world coordinate points that are connected by lines to form a closed shape. Collection must contain at least 3 points.
color
Type: System.Drawing.Color
Color to draw with.
filled
Type: System.Boolean
 true if the closed area should be filled with color. false if you want to draw just the border of the closed shape.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace