RhinoCommon API
FileReference.Finalize Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileReference.Finalize"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
FileReference Class
Rhino.FileIO Namespace