RhinoCommon API
Curve.TryGetEllipse Method (Ellipse, Double)
 Try to convert this curve into an Ellipse using a custom tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetEllipse(
	out Ellipse ellipse,
	double tolerance
)
Public Function TryGetEllipse (
	<OutAttribute> ByRef ellipse As Ellipse,
	tolerance As Double
) As Boolean
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
On success, the Ellipse will be filled in.
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
true if the curve could be converted into an Ellipse.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Curve Class
TryGetEllipse Overload
Rhino.Geometry Namespace