RhinoCommon API
InternalRdkViewModelFactory Constructor
Initializes a new instance of the InternalRdkViewModelFactory class
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InternalRdkViewModelFactory()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
InternalRdkViewModelFactory Class
Rhino.UI.Controls Namespace