RhinoCommon API
PlugIn.RegisterCommand Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.RegisterCommand(Rhino.Commands.Command)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected bool RegisterCommand(
	Command command
)
Protected Function RegisterCommand (
	command As Command
) As Boolean
Parameters
command
Type: Rhino.Commands.Command
[Missing <param name="command"/> documentation for "M:Rhino.PlugIns.PlugIn.RegisterCommand(Rhino.Commands.Command)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.RegisterCommand(Rhino.Commands.Command)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace