RhinoCommon API
ObjectTable.Select Method (IEnumerable<ObjRef>)
 Selects a collection of objects.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Select(
	IEnumerable<ObjRef> objRefs
)
Public Function Select (
	objRefs As IEnumerable(Of ObjRef)
) As Integer
Parameters
objRefs
Type: System.Collections.Generic.IEnumerable<ObjRef>
References to objects to select.
Return Value
Type: Int32
Number of objects successfully selected.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace