RhinoCommon API
RdkUndo.NewUndoRecord Method
 Get a new UndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RdkUndoRecord NewUndoRecord()
Public Function NewUndoRecord As RdkUndoRecord
Return Value
Type: RdkUndoRecord
[Missing <returns> documentation for "M:Rhino.Render.RdkUndo.NewUndoRecord"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RdkUndo Class
Rhino.Render Namespace