RhinoCommon API
NurbsCurve.GrevillePoints Method
 Gets all Greville (Edit) points for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList GrevillePoints()
Public Function GrevillePoints As Point3dList
Return Value
Type: Point3dList
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevillePoints"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace