RhinoCommon API
BlockEditCommand.ReplaceWith Method
 Call this method to register your replacement command, the last command registered will be called.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ReplaceWith(
	BlockEditCommand replacementCommand
)
Public Shared Sub ReplaceWith (
	replacementCommand As BlockEditCommand
)
Parameters
replacementCommand
Type: Rhino.Commands.BlockEditCommand
[Missing <param name="replacementCommand"/> documentation for "M:Rhino.Commands.BlockEditCommand.ReplaceWith(Rhino.Commands.BlockEditCommand)"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace