RhinoCommon API
ContentCollectionIterator.First Method
[Missing <summary> documentation for "M:Rhino.Render.ContentCollectionIterator.First"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent First()
Public Function First As RenderContent
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.ContentCollectionIterator.First"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace