RhinoCommon API
GetLine.EnableFromMidPointOption Method
 If true, the the "MidPoint" options shows up
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableFromMidPointOption(
	bool on
)
Public Sub EnableFromMidPointOption (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Input.Custom.GetLine.EnableFromMidPointOption(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace