RhinoCommon SDK
SubDVertexAccess.RemoveVertexAndConnections Method (Int32[])
 Removes some vertices from the subD.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool RemoveVertexAndConnections(
	int[] vertexIndices
)
Public Function RemoveVertexAndConnections (
	vertexIndices As Integer()
) As Boolean
Parameters
vertexIndices
Type: System.Int32[]
The array of vertices. If null, no vertices are removed and the method succeeds.
Return Value
Type: Boolean
True if the method succeeds; false otherwise.
See Also
Reference
SubDVertexAccess Class
RemoveVertexAndConnections Overload
Rhino.Geometry.Collections Namespace