RhinoCommon SDK
Point2f Constructor (Single, Single)
 Initializes a new two-dimensional point from two components.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2f(
	float x,
	float y
)
Public Sub New (
	x As Single,
	y As Single
)
Parameters
x
Type: System.Single
X component of vector.
y
Type: System.Single
Y component of vector.
See Also
Reference
Point2f Structure
Point2f Overload
Rhino.Geometry Namespace