RhinoCommon API
ZBufferCapture.ShowText Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowText(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ShowText(
	bool on
)
Public Sub ShowText (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowText(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace