RhinoCommon SDK
IntersectionEvent.SurfacePointParameter Method
 If this instance records a Curve|Surface intersection event, and the intersection type is point, then use this function to get the U and V parameters on the surface where the intersection occurs.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SurfacePointParameter(
	out double u,
	out double v
)
Public Sub SurfacePointParameter (
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double
)
Parameters
u
Type: System.Double
Parameter on surface u direction where the intersection occurs.
v
Type: System.Double
Parameter on surface v direction where the intersection occurs.
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace