RhinoCommon API
Dialogs.ShowLineTypes Method
 Displayes Rhino's Linetype list and returns the ID of the selected line type as a string.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Object ShowLineTypes(
	string title,
	string message,
	RhinoDoc doc
)
Public Shared Function ShowLineTypes (
	title As String,
	message As String,
	doc As RhinoDoc
) As Object
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
See Also
Reference
Dialogs Class
Rhino.UI Namespace