RhinoCommon API
DisplayPipeline.IsVisible Method (Point3d)
 Test a given 3d world coordinate point for visibility inside the view frustum under the current viewport and model transformation settings.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsVisible(
	Point3d worldCoordinate
)
Public Function IsVisible (
	worldCoordinate As Point3d
) As Boolean
Parameters
worldCoordinate
Type: Rhino.Geometry.Point3d
Point to test for visibility.
Return Value
Type: Boolean
true if the point is visible, false if it is not.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipeline Class
IsVisible Overload
Rhino.Display Namespace