RhinoCommon API
AppearanceSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AppearanceSettingsState GetCurrentState()
Public Shared Function GetCurrentState As AppearanceSettingsState
Return Value
Type: AppearanceSettingsState
An instance of a class that represents all the settings as they appear in the Rhino _Options dialog, joined in a single class.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace