RhinoCommon API
DisplayPipeline.DrawBox Method (BoundingBox, Color, Int32)
 Draws the edges of a BoundingBox.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawBox(
	BoundingBox box,
	Color color,
	int thickness
)
Public Sub DrawBox (
	box As BoundingBox,
	color As Color,
	thickness As Integer
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw in.
thickness
Type: System.Int32
Thickness (in pixels) of box edges.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipeline Class
DrawBox Overload
Rhino.Display Namespace