RhinoCommon API
Transform.TransformList Method
 Given a list, an array or any enumerable set of points, computes a new array of tranformed points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] TransformList(
	IEnumerable<Point3d> points
)
Public Function TransformList (
	points As IEnumerable(Of Point3d)
) As Point3d()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of points to be left untouched and copied.
Return Value
Type: Point3d[]
A new array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Transform Structure
Rhino.Geometry Namespace