RhinoCommon SDK
RhinoObject.HighlightSubObject Method
 Highlights a subobject.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HighlightSubObject(
	ComponentIndex componentIndex,
	bool highlight
)
Public Function HighlightSubObject (
	componentIndex As ComponentIndex,
	highlight As Boolean
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
A subobject component index.
highlight
Type: System.Boolean
true if the subobject should be highlighted.
Return Value
Type: Boolean
true if the subobject is now highlighted.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace