RhinoCommon API
SimpleArrayLine.ToArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line[] ToArray()
Public Function ToArray As Line()
Return Value
Type: Line[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimpleArrayLine Class
Rhino.Runtime.InteropWrappers Namespace