RhinoCommon API
RenderMaterial Constructor
Initializes a new instance of the RenderMaterial class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderMaterial()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace