RhinoCommon SDK
RenderContent.Create Method (Type, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Constructs a new content of the specified type and add it to the persistent content list. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderContent Create(
	Type type,
	RenderContent.ShowContentChooserFlags flags,
	RhinoDoc doc
)
Public Shared Function Create (
	type As Type,
	flags As RenderContent.ShowContentChooserFlags,
	doc As RhinoDoc
) As RenderContent
Parameters
type
Type: System.Type
Is the type of the content to add.
flags
Type: Rhino.Render.RenderContent.ShowContentChooserFlags
Options for the tab.
doc
Type: Rhino.RhinoDoc
The current Rhino document.
Return Value
Type: RenderContent
A new persistent render content.
See Also
Reference
RenderContent Class
Create Overload
Rhino.Render Namespace