RhinoCommon API
Box.Contains Method (Box)
 Test a box for Box inclusion. This is the same as calling Contains(box,false)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	Box box
)
Public Function Contains (
	box As Box
) As Boolean
Parameters
box
Type: Rhino.Geometry.Box
Box to test.
Return Value
Type: Boolean
true if the box is on the inside of or coincident with this Box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace