RhinoCommon SDK
Vector3d.IsTiny Method
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTiny()
Public Function IsTiny As Boolean
Return Value
Type: Boolean
true if vector is very small, otherwise false.
See Also
Reference
Vector3d Structure
IsTiny Overload
Rhino.Geometry Namespace