RhinoCommon SDK
VisualAnalysisMode.DrawCurveObject Method
 If Style==Wireframe, then the default decomposes the curve object into nurbs curve segments and calls the virtual DrawNurbsCurve for each segment.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawCurveObject(
	CurveObject curve,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawCurveObject (
	curve As CurveObject,
	pipeline As DisplayPipeline
)
Parameters
curve
Type: Rhino.DocObjects.CurveObject
A document curve object.
pipeline
Type: Rhino.Display.DisplayPipeline
The drawing pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace