RhinoCommon API
MeshVertexList.Remove Method (IEnumerable<Int32>, Boolean)
 Removes the vertices at the given indices and all faces that reference those vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Remove(
	IEnumerable<int> indices,
	bool shrinkFaces
)
Public Function Remove (
	indices As IEnumerable(Of Integer),
	shrinkFaces As Boolean
) As Boolean
Parameters
indices
Type: System.Collections.Generic.IEnumerable<Int32>
Vertex indices to remove.
shrinkFaces
Type: System.Boolean
If true, quads that reference the deleted vertex will be converted to triangles.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshVertexList Class
Remove Overload
Rhino.Geometry.Collections Namespace