RhinoCommon API
HostUtils.InitializeZooClient Method
 Initializes the ZooClient and Rhino license manager, this should get called automatically when RhinoCommon is loaded so you probably won't have to call this method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void InitializeZooClient()
Public Shared Sub InitializeZooClient
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace