RhinoCommon API
Sphere.LatitudeDegrees Method
 Computes the parallel at a specific latitude angle.
The angle is specified in degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle LatitudeDegrees(
	double degrees
)
Public Function LatitudeDegrees (
	degrees As Double
) As Circle
Parameters
degrees
Type: System.Double
An angle in degrees for the meridian.
Return Value
Type: Circle
A circle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace