RhinoCommon SDK
Transform.Mirror Method (Point3d, Vector3d)
 Create mirror transformation matrix The mirror transform maps a point Q to Q - (2*(Q-P)oN)*N, where P = pointOnMirrorPlane and N = normalToMirrorPlane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Mirror(
	Point3d pointOnMirrorPlane,
	Vector3d normalToMirrorPlane
)
Public Shared Function Mirror (
	pointOnMirrorPlane As Point3d,
	normalToMirrorPlane As Vector3d
) As Transform
Parameters
pointOnMirrorPlane
Type: Rhino.Geometry.Point3d
Point on the mirror plane.
normalToMirrorPlane
Type: Rhino.Geometry.Vector3d
Normal vector to the mirror plane.
Return Value
Type: Transform
A transformation matrix which mirrors geometry in a specified plane.
See Also
Reference
Transform Structure
Mirror Overload
Rhino.Geometry Namespace