RhinoCommon API
ReplayHistoryData.Dispose Method
Releases all resources used by the ReplayHistoryData
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace