RhinoCommon SDK
NurbsSurface.MakeRational Method
 Makes this surface rational.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace