RhinoCommon API
Hatch.Get3dCurves Method
 Gets 3d curves that define the boundaries of the hatch
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] Get3dCurves(
	bool outer
)
Public Function Get3dCurves (
	outer As Boolean
) As Curve()
Parameters
outer
Type: System.Boolean
true to get the outer curves, false to get the inner curves
Return Value
Type: Curve[]
[Missing <returns> documentation for "M:Rhino.Geometry.Hatch.Get3dCurves(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Hatch Class
Rhino.Geometry Namespace