RhinoCommon API
IRhRdkThumbnailList.Shape Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Shape"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IRhRdkThumbnailList_Shapes Shape()
Function Shape As IRhRdkThumbnailList_Shapes
Return Value
Type: IRhRdkThumbnailList_Shapes
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Shape"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace