RhinoCommon API
PersistentSettingsConverter.TryParseEnum Method (Type, String, String)
 Converts an enum value string (integer as string) to a enum value name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool TryParseEnum(
	Type type,
	string intValueAsString,
	out string value
)
Public Shared Function TryParseEnum (
	type As Type,
	intValueAsString As String,
	<OutAttribute> ByRef value As String
) As Boolean
Parameters
type
Type: System.Type
The enum type
intValueAsString
Type: System.String
enum integer value as string
value
Type: System.String
Output value, will be null on error
Return Value
Type: Boolean
 Returns true if the the successfully converted or false if not.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PersistentSettingsConverter Class
TryParseEnum Overload
Rhino Namespace