RhinoCommon SDK
Brep.Flip Method
 Reverses entire brep orientation of all faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Flip()
Public Sub Flip
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace