RhinoCommon API
RhinoObject.HasTextureMapping Method
 Returns true if this object has a texture mapping form any source (pluginId)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasTextureMapping()
Public Function HasTextureMapping As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.HasTextureMapping"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace