RhinoCommon API
IPanel.PanelClosing Method (UInt32)
[Missing <summary> documentation for "M:Rhino.UI.IPanel.PanelClosing(System.UInt32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void PanelClosing(
	uint documentSerialNumber
)
Sub PanelClosing (
	documentSerialNumber As UInteger
)
Parameters
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanel.PanelClosing(System.UInt32)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
IPanel Interface
PanelClosing Overload
Rhino.UI Namespace