RhinoCommon API
CommandAliasList.Clear Method
Removes all aliases from the list.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void Clear()
Public Shared Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace