RhinoCommon API
DisplayPipeline.DrawArrows Method (Line[], Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawArrows(
	Line[] lines,
	Color color
)
Public Sub DrawArrows (
	lines As Line(),
	color As Color
)
Parameters
lines
Type: Rhino.Geometry.Line[]
Arrow shafts.
color
Type: System.Drawing.Color
Color of arrows.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipeline Class
DrawArrows Overload
Rhino.Display Namespace