RhinoCommon API
LicenseUtils.Initialize Method
 Initializes the license manager.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int Initialize()
Public Shared Function Initialize As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.Initialize"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace