RhinoCommon API
ArcCurve Constructor (Circle)
 Initializes a new ArcCurve instance, copying the shape of a Circle.
Parameterization will be [0;circle.Circumference]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArcCurve(
	Circle circle
)
Public Sub New (
	circle As Circle
)
Parameters
circle
Type: Rhino.Geometry.Circle
The original circle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace