RhinoCommon SDK
RenderContentCollection Constructor (IntPtr)
Initializes a new instance of the RenderContentCollection class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentCollection(
	IntPtr nativePtr
)
Public Sub New (
	nativePtr As IntPtr
)
Parameters
nativePtr
Type: System.IntPtr
[Missing <param name="nativePtr"/> documentation for "M:Rhino.Render.RenderContentCollection.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContentCollection Class
RenderContentCollection Overload
Rhino.Render Namespace