RhinoCommon API
PythonScript.ExecuteFile Method
 Executes a Python file.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool ExecuteFile(
	string path
)
Public MustOverride Function ExecuteFile (
	path As String
) As Boolean
Parameters
path
Type: System.String
The path to the file.
Return Value
Type: Boolean
true if the file executed. This method can throw scripting-runtime based exceptions.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace