RhinoCommon API
ArcCurve Constructor (Circle, Double, Double)
 Initializes a new ArcCurve instance, copying values from a Circle and specifying the needed parametrization of the arc.
Circle will not be newly cut at these parameterizations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArcCurve(
	Circle circle,
	double t0,
	double t1
)
Public Sub New (
	circle As Circle,
	t0 As Double,
	t1 As Double
)
Parameters
circle
Type: Rhino.Geometry.Circle
A circle.
t0
Type: System.Double
A new Domain.T0 value.
t1
Type: System.Double
A new Domain.T1 value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace