RhinoCommon SDK
IRhRdkContentThumbnail.GroupId Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnail.GroupId"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Guid GroupId()
Function GroupId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnail.GroupId"]
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls Namespace