RhinoCommon API
DisplayPipeline.EnableDepthTesting Method
 Enable or disable the DepthTesting behaviour of the engine. When DepthTesting is disabled, objects in front will no longer occlude objects behind them.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableDepthTesting(
	bool enable
)
Public Sub EnableDepthTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable DepthTesting, false to disable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace