RhinoCommon SDK
PointCloud Constructor (SerializationInfo, StreamingContext)
 Binds with the Rhino default serializer to support object persistence.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected PointCloud(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Some storage.
context
Type: System.Runtime.Serialization.StreamingContext
The source and destination of the stream.
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace