RhinoCommon API
BinaryArchiveReader.ReadCompressedBuffer Method
 Reads an array of compressed Byte information from the archive and uncompresses it.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public byte[] ReadCompressedBuffer()
Public Function ReadCompressedBuffer As Byte()
Return Value
Type: Byte[]
The array that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace