RhinoCommon API
SupportOptions.SetPreferredUnpackFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetPreferredUnpackFolder(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetPreferredUnpackFolder(
	string path
)
Public Shared Sub SetPreferredUnpackFolder (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetPreferredUnpackFolder(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SupportOptions Class
Rhino.Render Namespace