RhinoCommon SDK
SubDEdgePtr.Equals Method (SubDEdgePtr)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDEdgePtr.Equals(Rhino.Geometry.SubDEdgePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Equals(
	SubDEdgePtr other
)
Public Function Equals (
	other As SubDEdgePtr
) As Boolean
Parameters
other
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.Equals(Rhino.Geometry.SubDEdgePtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgePtr.Equals(Rhino.Geometry.SubDEdgePtr)"]
Implements
IEquatable<T>.Equals(T)
See Also
Reference
SubDEdgePtr Structure
Equals Overload
Rhino.Geometry Namespace