RhinoCommon API
InstanceDefinitionTable.Compact Method
 Purge deleted instance definition information that is not in use. This function is time consuming and should be used in a thoughtful manner.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Compact(
	bool ignoreUndoReferences
)
Public Sub Compact (
	ignoreUndoReferences As Boolean
)
Parameters
ignoreUndoReferences
Type: System.Boolean
 If false, then deleted instance definition information that could possibly be undeleted by the Undo command will not be deleted. If true, then all deleted instance definition information is deleted.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace