RhinoCommon API
NamedParametersEventArgs.SetString Method
 Set a string value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetString(
	string name,
	string value
)
Public Sub SetString (
	name As String,
	value As String
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetString(System.String,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetString(System.String,System.String)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace