RhinoCommon SDK
ObjectAttributes.DrawColor Method (RhinoDoc)
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color DrawColor(
	RhinoDoc document
)
Public Function DrawColor (
	document As RhinoDoc
) As Color
Parameters
document
Type: Rhino.RhinoDoc
[Missing <param name="document"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc)"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc)"]
See Also
Reference
ObjectAttributes Class
DrawColor Overload
Rhino.DocObjects Namespace