RhinoCommon SDK
IStackedDialogPageService.SetGetTreeItemBold Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemBold(Rhino.UI.StackedDialogPage,System.Boolean@,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetGetTreeItemBold(
	StackedDialogPage page,
	ref bool value,
	bool set
)
Sub SetGetTreeItemBold (
	page As StackedDialogPage,
	ByRef value As Boolean,
	set As Boolean
)
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemBold(Rhino.UI.StackedDialogPage,System.Boolean@,System.Boolean)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemBold(Rhino.UI.StackedDialogPage,System.Boolean@,System.Boolean)"]
set
Type: System.Boolean
[Missing <param name="set"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemBold(Rhino.UI.StackedDialogPage,System.Boolean@,System.Boolean)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace