RhinoCommon API
Polyline.ClosestPoint Method
 Gets the point on the polyline which is closest to a test-point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to approximate.
Return Value
Type: Point3d
The point on the polyline closest to testPoint.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Polyline Class
Rhino.Geometry Namespace