RhinoCommon API
Cylinder Constructor (Circle)
 Constructs a new cylinder with infinite height.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Cylinder(
	Circle baseCircle
)
Public Sub New (
	baseCircle As Circle
)
Parameters
baseCircle
Type: Rhino.Geometry.Circle
Base circle for infinite cylinder.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Cylinder Structure
Cylinder Overload
Rhino.Geometry Namespace