RhinoCommon API
Point3d Implicit Conversion (Point3d to ControlPoint)
 Converts a point in a control point, without needing casting.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator ControlPoint (
	Point3d pt
)
Public Shared Widening Operator CType (
	pt As Point3d
) As ControlPoint
Parameters
pt
Type: Rhino.Geometry.Point3d
The point.
Return Value
Type: ControlPoint
The control point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Point3d Structure
Implicit Overload
Rhino.Geometry Namespace