RhinoCommon SDK
SubD.CreateFromMesh Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubD.InteriorCreaseOption)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static SubD CreateFromMesh(
	Mesh mesh,
	SubD.InteriorCreaseOption interiorCreaseOption
)
Public Shared Function CreateFromMesh (
	mesh As Mesh,
	interiorCreaseOption As SubD.InteriorCreaseOption
) As SubD
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubD.InteriorCreaseOption)"]
interiorCreaseOption
Type: Rhino.Geometry.SubD.InteriorCreaseOption
[Missing <param name="interiorCreaseOption"/> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubD.InteriorCreaseOption)"]
Return Value
Type: SubD
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubD.InteriorCreaseOption)"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace