RhinoCommon API
PreviewAppearance.SetSize Method
 SetSize
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetSize(
	double d
)
Public Sub SetSize (
	d As Double
)
Parameters
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Render.PreviewAppearance.SetSize(System.Double)"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace