RhinoCommon SDK
CustomObjectGrips.NeighborGrip Method
Get neighbors.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual GripObject NeighborGrip(
	int gripIndex,
	int dr,
	int ds,
	int dt,
	bool wrap
)
Protected Overridable Function NeighborGrip (
	gripIndex As Integer,
	dr As Integer,
	ds As Integer,
	dt As Integer,
	wrap As Boolean
) As GripObject
Parameters
gripIndex
Type: System.Int32
index of grip where the search begins.
dr
Type: System.Int32
1 = next grip in the first parameter direction.
-1 = prev grip in the first parameter direction.
ds
Type: System.Int32
1 = next grip in the second parameter direction.
-1 = prev grip in the second parameter direction.
dt
Type: System.Int32
1 = next grip in the third parameter direction.
-1 = prev grip in the third parameter direction.
wrap
Type: System.Boolean
If true and object is "closed", the search will wrap.
Return Value
Type: GripObject
Pointer to the desired neighbor or NULL if there is no neighbor.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace