RhinoCommon API
Mesh.GetNgonAndFacesCount Method
 Retrieves the count of items that GetNgonAndFacesEnumerable() will provide.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GetNgonAndFacesCount()
Public Function GetNgonAndFacesCount As Integer
Return Value
Type: Int32
The amount of faces that are not part of an ngon + the amount of ngons.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Mesh Class
Rhino.Geometry Namespace