RhinoCommon API
Panels.GetPanels Method (Guid, RhinoDoc)
 Gets the panels.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Object[] GetPanels(
	Guid panelId,
	RhinoDoc doc
)
Public Shared Function GetPanels (
	panelId As Guid,
	doc As RhinoDoc
) As Object()
Parameters
panelId
Type: System.Guid
Panel identifier.
doc
Type: Rhino.RhinoDoc
Document.
Return Value
Type: Object[]
The panels.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Panels Class
GetPanels Overload
Rhino.UI Namespace