RhinoCommon API
RealtimeDisplayMode.HudRendererLocked Method
 Implement to support locking in the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool HudRendererLocked()
Public Overridable Function HudRendererLocked As Boolean
Return Value
Type: Boolean
Return true if the render engine is locked.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace