RhinoCommon SDK
BinaryArchiveReader.ReadShort Method
 Reads a Int16 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public short ReadShort()
Public Function ReadShort As Short
Return Value
Type: Int16
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace