RhinoCommon API
Plane Constructor (Plane)
Copy constructor.
This is nothing special and performs the same as assigning to another variable.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane(
	Plane other
)
Public Sub New (
	other As Plane
)
Parameters
other
Type: Rhino.Geometry.Plane
The source plane value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Plane Structure
Plane Overload
Rhino.Geometry Namespace