RhinoCommon API
Point3f.Inequality Operator
 Determines whether two points have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Point3f a,
	Point3f b
)
Public Shared Operator <> (
	a As Point3f,
	b As Point3f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point3f
The first point.
b
Type: Rhino.Geometry.Point3f
The second point.
Return Value
Type: Boolean
true if the two points differ in any coordinate; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace