RhinoCommon SDK
DisplayMaterial Constructor (Color)
 Constructs a default material with a specific diffuse color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayMaterial(
	Color diffuse
)
Public Sub New (
	diffuse As Color
)
Parameters
diffuse
Type: System.Drawing.Color
Diffuse color of material. The alpha component of the Diffuse color is ignored.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace