RhinoCommon SDK
Point3d.FromPoint3f Method
 Converts a single-precision point in a double-precision point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d FromPoint3f(
	Point3f point
)
Public Shared Function FromPoint3f (
	point As Point3f
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3f
A point.
Return Value
Type: Point3d
The resulting point.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace