RhinoCommon API
Surface.Extend Method
 Extends an untrimmed surface along one edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface Extend(
	IsoStatus edge,
	double extensionLength,
	bool smooth
)
Public Function Extend (
	edge As IsoStatus,
	extensionLength As Double,
	smooth As Boolean
) As Surface
Parameters
edge
Type: Rhino.Geometry.IsoStatus
 Edge to extend. Must be North, South, East, or West.
extensionLength
Type: System.Double
distance to extend.
smooth
Type: System.Boolean
 true for smooth (C-infinity) extension. false for a C1- ruled extension.
Return Value
Type: Surface
New extended surface on success.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Surface Class
Rhino.Geometry Namespace