RhinoCommon API
Interop.ToOnXform Method
 Constructs a Rhino_DotNet OnXform from a given RhinoCommon Transform.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Object ToOnXform(
	Transform source
)
Public Shared Function ToOnXform (
	source As Transform
) As Object
Parameters
source
Type: Rhino.Geometry.Transform
A RhinoCommon source transform.
Return Value
Type: Object
 Rhino_DotNet object on success. This will be an independent copy.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Interop Class
Rhino.Runtime Namespace