RhinoCommon SDK
Intersection.PlaneSphere Method
 Intersects a plane with a sphere using exact calculations.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static PlaneSphereIntersection PlaneSphere(
	Plane plane,
	Sphere sphere,
	out Circle intersectionCircle
)
Public Shared Function PlaneSphere (
	plane As Plane,
	sphere As Sphere,
	<OutAttribute> ByRef intersectionCircle As Circle
) As PlaneSphereIntersection
Parameters
plane
Type: Rhino.Geometry.Plane
Plane to intersect.
sphere
Type: Rhino.Geometry.Sphere
Sphere to intersect.
intersectionCircle
Type: Rhino.Geometry.Circle
Intersection result.
Return Value
Type: PlaneSphereIntersection
If None is returned, the intersectionCircle has a radius of zero and the center point is the point on the plane closest to the sphere.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace