RhinoCommon API
Thumbnail Constructor
 Constructor for Thumbnail
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Thumbnail(
	IntPtr pRdkThumbnail
)
Public Sub New (
	pRdkThumbnail As IntPtr
)
Parameters
pRdkThumbnail
Type: System.IntPtr
[Missing <param name="pRdkThumbnail"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace