RhinoCommon SDK
Surface.GetSpanVector Method
 Gets array of span "knots".
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] GetSpanVector(
	int direction
)
Public Function GetSpanVector (
	direction As Integer
) As Double()
Parameters
direction
Type: System.Int32
 0 gets first parameter's domain, 1 gets second parameter's domain.
Return Value
Type: Double[]
An array with span vectors; or null on error.
See Also
Reference
Surface Class
Rhino.Geometry Namespace