RhinoCommon API
CustomDisplay.AddArc Method (Arc)
 Adds a new, black arc to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddArc(
	Arc arc
)
Public Sub AddArc (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to add.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CustomDisplay Class
AddArc Overload
Rhino.Display Namespace