RhinoCommon API
InstanceDefinitionTable.Undelete Method
 Undeletes an instance definition that has been deleted by Delete()
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Undelete(
	int idefIndex
)
Public Function Undelete (
	idefIndex As Integer
) As Boolean
Parameters
idefIndex
Type: System.Int32
 zero based index of instance definition to delete. This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
Return Value
Type: Boolean
true if successful
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace