RhinoCommon API
MeshFace.Flip Method
 Reverses the orientation of the face by swapping corners. The first corner is always maintained.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshFace Flip()
Public Function Flip As MeshFace
Return Value
Type: MeshFace
[Missing <returns> documentation for "M:Rhino.Geometry.MeshFace.Flip"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace