RhinoCommon SDK
Thumbnail.Label Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.Thumbnail.Label"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Label()
Public Function Label As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Controls.Thumbnail.Label"]
Implements
IRhRdkThumbnail.Label()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace