RhinoCommon API
GetBaseClass.Point2d Method
 Returns location in view of point in selected in GetPoint::Get() or GetPoint::Get2dPoint(). (0,0) = upper left corner of window.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point Point2d()
Public Function Point2d As Point
Return Value
Type: Point
The location.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace