RhinoCommon API
Surface.Transpose Method (Boolean)
 Transposes surface parameterization (swap U and V)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface Transpose(
	bool inPlace
)
Public Function Transpose (
	inPlace As Boolean
) As Surface
Parameters
inPlace
Type: System.Boolean
[Missing <param name="inPlace"/> documentation for "M:Rhino.Geometry.Surface.Transpose(System.Boolean)"]
Return Value
Type: Surface
New transposed surface on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Surface Class
Transpose Overload
Rhino.Geometry Namespace