RhinoCommon API
CustomCurveObject Constructor
Initializes a new instance of the CustomCurveObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomCurveObject()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
CustomCurveObject Class
CustomCurveObject Overload
Rhino.DocObjects.Custom Namespace