RhinoCommon API
ISettingsWriteErrorService.GeErrorInfo Method
 Gets the number of failed write attempts as well as successful writes since the first reported failure.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void GeErrorInfo(
	string fileName,
	out int successCount,
	out int failureCount
)
Sub GeErrorInfo (
	fileName As String,
	<OutAttribute> ByRef successCount As Integer,
	<OutAttribute> ByRef failureCount As Integer
)
Parameters
fileName
Type: System.String
 Used to generate registry key unique to this file name
successCount
Type: System.Int32
 Successful write events since first failure
failureCount
Type: System.Int32
 Number
Return Value
Type:
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ISettingsWriteErrorService Interface
Rhino.Runtime Namespace