RhinoCommon API
RhinoDoc.GetRenderPrimitives Method (Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<RenderPrimitive> GetRenderPrimitives(
	bool forceTriangleMeshes,
	bool quietly
)
Public Function GetRenderPrimitives (
	forceTriangleMeshes As Boolean,
	quietly As Boolean
) As IEnumerable(Of RenderPrimitive)
Parameters
forceTriangleMeshes
Type: System.Boolean
 If true all mesh faces will be triangulated
quietly
Type: System.Boolean
 Iterate quietly, if true then no user interface will be displayed
Return Value
Type: IEnumerable<RenderPrimitive>
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetRenderPrimitives(System.Boolean,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc Class
GetRenderPrimitives Overload
Rhino Namespace