RhinoCommon API
RhinoObject.InVisualAnalysisMode Method
 Reports if any visual analysis mode is currently active for an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InVisualAnalysisMode()
Public Function InVisualAnalysisMode As Boolean
Return Value
Type: Boolean
true if an analysis mode is active; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoObject Class
InVisualAnalysisMode Overload
Rhino.DocObjects Namespace