RhinoCommon SDK
RhinoViewport.PushConstructionPlane Method
 Pushes the current construction plane on the viewport's construction plane stack and sets the construction plane to cplane.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PushConstructionPlane(
	ConstructionPlane cplane
)
Public Sub PushConstructionPlane (
	cplane As ConstructionPlane
)
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The constuction plane to push.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace