RhinoCommon SDK
ViewportInfo Constructor (RhinoViewport)
 Copies all of the ViewportInfo data from an existing RhinoViewport.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ViewportInfo(
	RhinoViewport rhinoViewport
)
Public Sub New (
	rhinoViewport As RhinoViewport
)
Parameters
rhinoViewport
Type: Rhino.Display.RhinoViewport
A viewport to copy.
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace