RhinoCommon API
RenderPrimitiveList.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitiveList.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace