RhinoCommon SDK
Thumbnail.IsHot Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.Thumbnail.IsHot"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsHot()
Public Function IsHot As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.Thumbnail.IsHot"]
Implements
IRhRdkThumbnail.IsHot()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace