RhinoCommon SDK
SubD.GetLimitSurfaceInPatches Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.GetLimitSurfaceInPatches(Rhino.Geometry.SubDDisplayParameters,Rhino.Geometry.PatchGetter)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void GetLimitSurfaceInPatches(
	SubDDisplayParameters limitSurfaceDisplayParameters,
	PatchGetter patchGetter
)
Public Sub GetLimitSurfaceInPatches (
	limitSurfaceDisplayParameters As SubDDisplayParameters,
	patchGetter As PatchGetter
)
Parameters
limitSurfaceDisplayParameters
Type: Rhino.Geometry.SubDDisplayParameters
[Missing <param name="limitSurfaceDisplayParameters"/> documentation for "M:Rhino.Geometry.SubD.GetLimitSurfaceInPatches(Rhino.Geometry.SubDDisplayParameters,Rhino.Geometry.PatchGetter)"]
patchGetter
Type: Rhino.Geometry.PatchGetter
[Missing <param name="patchGetter"/> documentation for "M:Rhino.Geometry.SubD.GetLimitSurfaceInPatches(Rhino.Geometry.SubDDisplayParameters,Rhino.Geometry.PatchGetter)"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace