RhinoCommon SDK
RhinoViewport.ClientToWorld Method (Point)
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(System.Drawing.Point)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line ClientToWorld(
	Point clientPoint
)
Public Function ClientToWorld (
	clientPoint As Point
) As Line
Parameters
clientPoint
Type: System.Drawing.Point
[Missing <param name="clientPoint"/> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(System.Drawing.Point)"]
Return Value
Type: Line
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(System.Drawing.Point)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
ClientToWorld Overload
Rhino.Display Namespace