RhinoCommon SDK
CustomObjectGrips.OnReset Method
 Resets location of all grips to original spots and cleans up stuff that was created by dynamic dragging. This is required when dragging is canceled or in the Copy command when grips are "copied". The override should clean up dynamic workspace stuff.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnReset()
Protected Overridable Sub OnReset
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace