RhinoCommon SDK
BoundingBox.Transform Method
 Updates this boundingbox to be the smallest axis aligned boundingbox that contains the transformed result of its 8 original corner points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
A transform.
Return Value
Type: Boolean
true if this operation is sucessfull; otherwise false.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace