RhinoCommon API
LinetypeTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Linetype> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Linetype)
Return Value
Type: IEnumerator<Linetype>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LinetypeTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace