RhinoCommon SDK
PatchGetter Constructor
Initializes a new instance of the PatchGetter class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PatchGetter(
	SubD subd,
	int nurbsDisplayDensity,
	RhinoDoc doc
)
Public Sub New (
	subd As SubD,
	nurbsDisplayDensity As Integer,
	doc As RhinoDoc
)
Parameters
subd
Type: Rhino.Geometry.SubD
[Missing <param name="subd"/> documentation for "M:Rhino.Geometry.PatchGetter.#ctor(Rhino.Geometry.SubD,System.Int32,Rhino.RhinoDoc)"]
nurbsDisplayDensity
Type: System.Int32
[Missing <param name="nurbsDisplayDensity"/> documentation for "M:Rhino.Geometry.PatchGetter.#ctor(Rhino.Geometry.SubD,System.Int32,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Geometry.PatchGetter.#ctor(Rhino.Geometry.SubD,System.Int32,Rhino.RhinoDoc)"]
See Also
Reference
PatchGetter Class
Rhino.Geometry Namespace