RhinoCommon API
RhinoMath.ParseNumber Method
 Evaluates command line math expression.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double ParseNumber(
	string expression
)
Public Shared Function ParseNumber (
	expression As String
) As Double
Parameters
expression
Type: System.String
Return Value
Type: Double
result
Exceptions
Exception | Condition
ArgumentNullException | expression is null.
FormatException | expression cannot be parsed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoMath Class
Rhino Namespace