RhinoCommon API
RhinoViewport.WorldToClient Method
 Convert a point from world coordinates in the viewport to a 2d screen point in the local coordinates of the viewport (X/Y of point is relative to top left corner of viewport on screen)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d WorldToClient(
	Point3d worldPoint
)
Public Function WorldToClient (
	worldPoint As Point3d
) As Point2d
Parameters
worldPoint
Type: Rhino.Geometry.Point3d
The 3D point in world coordinates.
Return Value
Type: Point2d
The 2D point on the screen.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace