RhinoCommon API
RhinoView.CaptureToBitmap Method (Size)
 Capture View contents to a bitmap.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap CaptureToBitmap(
	Size size
)
Public Function CaptureToBitmap (
	size As Size
) As Bitmap
Parameters
size
Type: System.Drawing.Size
Size of Bitmap to capture to.
Return Value
Type: Bitmap
The bitmap of the specified part of the view.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace