RhinoCommon SDK
ParticleSystem.Update Method
 Calls Update on every particle in the system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void Update()
Public Overridable Sub Update
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace