RhinoCommon API
SHA1OpenNURBS Constructor
 Constructs a new instance of the SHA1 algorithm.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SHA1OpenNURBS()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace