RhinoCommon SDK
File3dmObjectTable.AddText Method (Text3d, ObjectAttributes)
 Adds an annotation text object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddText(
	Text3d text3d,
	ObjectAttributes attributes
)
Public Function AddText (
	text3d As Text3d,
	attributes As ObjectAttributes
) As Guid
Parameters
text3d
Type: Rhino.Display.Text3d
The text object to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link to the object.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
File3dmObjectTable Class
AddText Overload
Rhino.FileIO Namespace