RhinoCommon API
MeshFaceList.ConvertQuadsToTriangles Method
Splits all quads along the short diagonal.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ConvertQuadsToTriangles()
Public Function ConvertQuadsToTriangles As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace