RhinoCommon API
File3dmObjectTable.AddTextDot Method (String, Point3d)
Adds a text dot object to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddTextDot(
	string text,
	Point3d location
)
Public Function AddTextDot (
	text As String,
	location As Point3d
) As Guid
Parameters
text
Type: System.String
The text.
location
Type: Rhino.Geometry.Point3d
The location.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace