RhinoCommon API
PreviewAppearance.RotationY Method
 RotationY
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double RotationY()
Public Function RotationY As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.RotationY"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace