RhinoCommon SDK
ColorLAB.CreateFromLCH Method
 Create the nearest LAB equivalent of an LCH color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorLAB CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorLAB
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorLAB
The LAB equivalent of the LCH color.
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace