RhinoCommon API
ObjectTable.Delete Method (ObjRef, Boolean)
 Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	ObjRef objref,
	bool quiet
)
Public Function Delete (
	objref As ObjRef,
	quiet As Boolean
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
objref.Object() will be deleted.
quiet
Type: System.Boolean
If false, a message box will appear when an object cannot be deleted.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjectTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace