RhinoCommon API
BrepFace.ShrinkFace Method
 Shrinks the underlying surface of this face. Sometimes the surface used by a face extends far beyond the face's outer boundary. This function remove portions of the surface that extend beyond the face's outer boundary loop.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShrinkFace(
	BrepFace.ShrinkDisableSide disableSide
)
Public Function ShrinkFace (
	disableSide As BrepFace.ShrinkDisableSide
) As Boolean
Parameters
disableSide
Type: Rhino.Geometry.BrepFace.ShrinkDisableSide
The side(s) of the surface to not shrink.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace