RhinoCommon API
MeshNgonList.GetNgonCenter Method (MeshNgon)
 Gets the center point of an ngon.
This the avarage of the corner points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d GetNgonCenter(
	MeshNgon ngon
)
Public Function GetNgonCenter (
	ngon As MeshNgon
) As Point3d
Parameters
ngon
Type: Rhino.Geometry.MeshNgon
An ngon.
Return Value
Type: Point3d
The center point.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshNgonList Class
GetNgonCenter Overload
Rhino.Geometry.Collections Namespace