RhinoCommon API
ViewCaptureSettings Constructor (RhinoView, Size, Double)
Initializes a new instance of the ViewCaptureSettings class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewCaptureSettings(
	RhinoView sourceView,
	Size mediaSize,
	double dpi
)
Public Sub New (
	sourceView As RhinoView,
	mediaSize As Size,
	dpi As Double
)
Parameters
sourceView
Type: Rhino.Display.RhinoView
[Missing <param name="sourceView"/> documentation for "M:Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.RhinoView,System.Drawing.Size,System.Double)"]
mediaSize
Type: System.Drawing.Size
[Missing <param name="mediaSize"/> documentation for "M:Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.RhinoView,System.Drawing.Size,System.Double)"]
dpi
Type: System.Double
[Missing <param name="dpi"/> documentation for "M:Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.RhinoView,System.Drawing.Size,System.Double)"]
See Also
Reference
ViewCaptureSettings Class
ViewCaptureSettings Overload
Rhino.Display Namespace