RhinoCommon SDK
Line.Transform Method
 Transform the line using a Transformation matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transform to apply to this line.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Line Structure
Rhino.Geometry Namespace