RhinoCommon API
RenderContent.Dispose Method
Releases all resources used by the RenderContent
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContent Class
Dispose Overload
Rhino.Render Namespace