RhinoCommon API
File3dmPlugInDataTable.Clear Method
 Remove all entries from this table
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace