RhinoCommon SDK
DisplayPipeline.PushDepthTesting Method
 Push a DepthTesting flag on the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PushDepthTesting(
	bool enable
)
Public Sub PushDepthTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
DepthTesting flag.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace