RhinoCommon API
BoundingBox.Inflate Method (Double)
 Inflates the box with equal amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
Invalid boxes can not be inflated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Inflate(
	double amount
)
Public Sub Inflate (
	amount As Double
)
Parameters
amount
Type: System.Double
Amount (in model units) to inflate this box in all directions.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BoundingBox Structure
Inflate Overload
Rhino.Geometry Namespace