RhinoCommon API
RhinoPageView.Duplicate Method
 Copy a page view
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoPageView Duplicate(
	bool duplicatePageGeometry
)
Public Function Duplicate (
	duplicatePageGeometry As Boolean
) As RhinoPageView
Parameters
duplicatePageGeometry
Type: System.Boolean
[Missing <param name="duplicatePageGeometry"/> documentation for "M:Rhino.Display.RhinoPageView.Duplicate(System.Boolean)"]
Return Value
Type: RhinoPageView
[Missing <returns> documentation for "M:Rhino.Display.RhinoPageView.Duplicate(System.Boolean)"]
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace