RhinoCommon API
RhinoList<T> Constructor
 Initializes a new, empty list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoList<T> Class
RhinoList<T> Overload
Rhino.Collections Namespace