RhinoCommon API
Sphere.ToRevSurface Method
 Converts this Sphere to a RevSurface representation. This is synonymous with calling RevSurface.CreateFromSphere().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RevSurface ToRevSurface()
Public Function ToRevSurface As RevSurface
Return Value
Type: RevSurface
A surface of revolution representation of this sphere or null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace