RhinoCommon API
TextEntity.GetTextTransform Method
 Get the transform for this text object's text geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GetTextTransform(
	double textscale,
	DimensionStyle dimstyle
)
Public Function GetTextTransform (
	textscale As Double,
	dimstyle As DimensionStyle
) As Transform
Parameters
textscale
Type: System.Double
[Missing <param name="textscale"/> documentation for "M:Rhino.Geometry.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace