RhinoCommon API
DimensionStyle.ScaleLengthValues Method
 Scales all length values by 'scale'
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ScaleLengthValues(
	double scale
)
Public Sub ScaleLengthValues (
	scale As Double
)
Parameters
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.DocObjects.DimensionStyle.ScaleLengthValues(System.Double)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace