RhinoCommon API
ArchivableDictionary.TryGetBool Method
 Get value as bool, will only succeed if value was created using Set(string key, bool value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetBool(
	string key,
	out bool value
)
Public Function TryGetBool (
	key As String,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetBool(System.String,System.Boolean@)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetBool(System.String,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.TryGetBool(System.String,System.Boolean@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace