RhinoCommon SDK
Mesh.NonConstOperation Method
 Clear local cache on non const calls
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
See Also
Reference
Mesh Class
Rhino.Geometry Namespace