RhinoCommon SDK
BitmapEntry Constructor
 serialization constructor
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected BitmapEntry(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
[Missing <param name="info"/> documentation for "M:Rhino.DocObjects.BitmapEntry.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
context
Type: System.Runtime.Serialization.StreamingContext
[Missing <param name="context"/> documentation for "M:Rhino.DocObjects.BitmapEntry.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace