RhinoCommon SDK
RhinoObject.ShortDescription Method
 Gets a localized short descriptive name of the object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual string ShortDescription(
	bool plural
)
Public Overridable Function ShortDescription (
	plural As Boolean
) As String
Parameters
plural
Type: System.Boolean
true if the descriptive name should in plural.
Return Value
Type: String
A string with the short localized descriptive name.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace