RhinoCommon API
Circle.IsInPlane Method
 Evaluates whether or not this circle is co-planar with a given plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsInPlane(
	Plane plane,
	double tolerance
)
Public Function IsInPlane (
	plane As Plane,
	tolerance As Double
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Plane.
tolerance
Type: System.Double
Tolerance to use.
Return Value
Type: Boolean
true if the circle plane is co-planar with the given plane within tolerance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Circle Structure
Rhino.Geometry Namespace