RhinoCommon API
File3dmObjectTable.GetBoundingBox Method
Gets the bounding box containing every object in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox GetBoundingBox()
Public Function GetBoundingBox As BoundingBox
Return Value
Type: BoundingBox
The computed bounding box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace