RhinoCommon SDK
Mesh.Flip Method
Reverses the direction of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Flip(
	bool vertexNormals,
	bool faceNormals,
	bool faceOrientation
)
Public Sub Flip (
	vertexNormals As Boolean,
	faceNormals As Boolean,
	faceOrientation As Boolean
)
Parameters
vertexNormals
Type: System.Boolean
If true, vertex normals will be reversed.
faceNormals
Type: System.Boolean
If true, face normals will be reversed.
faceOrientation
Type: System.Boolean
If true, face orientations will be reversed.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace