RhinoCommon SDK
MeshTextureCoordinateList.TransposeTextureCoordinates Method
 Transposes texture coordinates.
The region of the bitmap the texture uses does not change. All texture coordinates rows (Us) become columns (Vs), and vice versa.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TransposeTextureCoordinates()
Public Function TransposeTextureCoordinates As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace