RhinoCommon API
ViewCaptureSettings.SetModelScaleToValue Method
 Sets the model scale to a value.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetModelScaleToValue(
	double scale
)
Public Sub SetModelScaleToValue (
	scale As Double
)
Parameters
scale
Type: System.Double
The scale value.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace