RhinoCommon API
MeshTopologyVertexList.MeshVertexIndices Method
 Gets all indices of the mesh vertices that a given topology vertex represents.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] MeshVertexIndices(
	int topologyVertexIndex
)
Public Function MeshVertexIndices (
	topologyVertexIndex As Integer
) As Integer()
Parameters
topologyVertexIndex
Type: System.Int32
Index of a topology vertex in Mesh.TopologyVertices to query.
Return Value
Type: Int32[]
 Indices of all vertices that in Mesh.Vertices that a topology vertex represents.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace