RhinoCommon API
RenderContent.FromXml Method (String, RhinoDoc)
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String,Rhino.RhinoDoc)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderContent FromXml(
	string xml,
	RhinoDoc doc
)
Public Shared Function FromXml (
	xml As String,
	doc As RhinoDoc
) As RenderContent
Parameters
xml
Type: System.String
[Missing <param name="xml"/> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String,Rhino.RhinoDoc)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String,Rhino.RhinoDoc)"]
See Also
Reference
RenderContent Class
FromXml Overload
Rhino.Render Namespace