RhinoCommon API
ObjectPropertiesPage.ShouldDisplay Method (RhinoObject)
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ShouldDisplay(
	RhinoObject rhObj
)
Public Overridable Function ShouldDisplay (
	rhObj As RhinoObject
) As Boolean
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.26
See Also
Reference
ObjectPropertiesPage Class
ShouldDisplay Overload
Rhino.UI Namespace