RhinoCommon API
GetPoint.Constrain Method (Sphere)
Constrains the picked point to lie on a sphere.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Constrain(
	Sphere sphere
)
Public Function Constrain (
	sphere As Sphere
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere to use as constraint.
Return Value
Type: Boolean
true if constraint could be applied.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace