RhinoCommon SDK
Material.GetUserStrings Method
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NameValueCollection GetUserStrings()
Public Function GetUserStrings As NameValueCollection
Return Value
Type: NameValueCollection
A collection of key strings and values strings. This
See Also
Reference
Material Class
Rhino.DocObjects Namespace