RhinoCommon API
CurveList.Add Method (Line)
 Adds a line to this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Line line
)
Public Sub Add (
	line As Line
)
Parameters
line
Type: Rhino.Geometry.Line
A line value that will be the model of the new internal curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace