RhinoCommon SDK
CustomObjectGrips.AddGrip Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.AddGrip(Rhino.DocObjects.Custom.CustomGripObject)"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected void AddGrip(
	CustomGripObject grip
)
Protected Sub AddGrip (
	grip As CustomGripObject
)
Parameters
grip
Type: Rhino.DocObjects.Custom.CustomGripObject
[Missing <param name="grip"/> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.AddGrip(Rhino.DocObjects.Custom.CustomGripObject)"]
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace