RhinoCommon API
PythonScript Constructor
 Initializes a new instance of the PythonScript class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PythonScript()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace