RhinoCommon API
RenderMaterial.GetTextureFromUsage Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.GetTextureFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderTexture GetTextureFromUsage(
	RenderMaterial.StandardChildSlots which
)
Public Function GetTextureFromUsage (
	which As RenderMaterial.StandardChildSlots
) As RenderTexture
Parameters
which
Type: Rhino.Render.RenderMaterial.StandardChildSlots
[Missing <param name="which"/> documentation for "M:Rhino.Render.RenderMaterial.GetTextureFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Return Value
Type: RenderTexture
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.GetTextureFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace