RhinoCommon API
PolylineCurve Constructor (PolylineCurve)
 Initializes a new polyline curve by copying its content from another polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PolylineCurve(
	PolylineCurve other
)
Public Sub New (
	other As PolylineCurve
)
Parameters
other
Type: Rhino.Geometry.PolylineCurve
Another polyline curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace