RhinoCommon API
NurbsCurvePointList.EnsurePrivateCopy Method
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnsurePrivateCopy()
Public Sub EnsurePrivateCopy
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace