RhinoCommon API
NamedViewTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<ViewInfo> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ViewInfo)
Return Value
Type: IEnumerator<ViewInfo>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace