RhinoCommon SDK
RhinoApp.ParseTextField Method
[Missing <summary> documentation for "M:Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static string ParseTextField(
	string formula,
	RhinoObject obj,
	RhinoObject topParentObject
)
Public Shared Function ParseTextField (
	formula As String,
	obj As RhinoObject,
	topParentObject As RhinoObject
) As String
Parameters
formula
Type: System.String
[Missing <param name="formula"/> documentation for "M:Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject)"]
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject)"]
topParentObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="topParentObject"/> documentation for "M:Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject)"]
See Also
Reference
RhinoApp Class
Rhino Namespace