RhinoCommon API
File3dmObjectTable.AddPoints Method (IEnumerable<Point3f>)
 Adds multiple points to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] AddPoints(
	IEnumerable<Point3f> points
)
Public Function AddPoints (
	points As IEnumerable(Of Point3f)
) As Guid()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3f>
Points to add.
Return Value
Type: Guid[]
An array of object unique identifiers.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmObjectTable Class
AddPoints Overload
Rhino.FileIO Namespace