RhinoCommon API
LayerTable.FindByFullPath Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FindByFullPath(
	string layerPath,
	bool ignoreDeletedLayers
)
Public Function FindByFullPath (
	layerPath As String,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
layerPath
Type: System.String
[Missing <param name="layerPath"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
ignoreDeletedLayers
Type: System.Boolean
[Missing <param name="ignoreDeletedLayers"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
LayerTable Class
FindByFullPath Overload
Rhino.DocObjects.Tables Namespace