RhinoCommon API
PersistentSettings.RegisterSettingsValidator Method (String, EventHandler<PersistentSettingsEventArgs>)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.RegisterSettingsValidator(System.String,System.EventHandler{Rhino.PersistentSettingsEventArgs})"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RegisterSettingsValidator(
	string key,
	EventHandler<PersistentSettingsEventArgs> validator
)
Public Sub RegisterSettingsValidator (
	key As String,
	validator As EventHandler(Of PersistentSettingsEventArgs)
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.RegisterSettingsValidator(System.String,System.EventHandler{Rhino.PersistentSettingsEventArgs})"]
validator
Type: System.EventHandler<PersistentSettingsEventArgs>
[Missing <param name="validator"/> documentation for "M:Rhino.PersistentSettings.RegisterSettingsValidator(System.String,System.EventHandler{Rhino.PersistentSettingsEventArgs})"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
PersistentSettings Class
RegisterSettingsValidator Overload
Rhino Namespace