RhinoCommon SDK
RenderPipeline.GetRenderWindow Method
 Get the RenderWindow associated with this RenderPipeline instance.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow GetRenderWindow()
Public Function GetRenderWindow As RenderWindow
Return Value
Type: RenderWindow
RenderWindow if one exists, null otherwise (i.e. rendering has already completed).
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPipeline Class
GetRenderWindow Overload
Rhino.Render Namespace