RhinoCommon SDK
SubDVertexPtr.FromSubDAndId Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.FromSubDAndId(Rhino.Geometry.SubD,System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static SubDVertexPtr FromSubDAndId(
	SubD subD,
	int id
)
Public Shared Function FromSubDAndId (
	subD As SubD,
	id As Integer
) As SubDVertexPtr
Parameters
subD
Type: Rhino.Geometry.SubD
[Missing <param name="subD"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.FromSubDAndId(Rhino.Geometry.SubD,System.Int32)"]
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.FromSubDAndId(Rhino.Geometry.SubD,System.Int32)"]
Return Value
Type: SubDVertexPtr
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.FromSubDAndId(Rhino.Geometry.SubD,System.Int32)"]
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace