RhinoCommon API
DisplayPipeline.EnableColorWriting Method
 Enable or disable the ColorWriting behaviour of the engine.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableColorWriting(
	bool enable
)
Public Sub EnableColorWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable ColorWriting, false to disable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace