RhinoCommon SDK
BezierCurve.MakeNonRational Method
Make bezier non-rational
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
treu if successful
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace