RhinoCommon API
UserDataListEnumerator.MoveNext Method
 Advance enumerator to next UserData item.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
True if there is a next item.
Implements
IEnumerator.MoveNext()
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace