RhinoCommon API
NurbsCurve Constructor (Int32, Int32)
 Constructs a new NURBS curve with a specific degree and control point count.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve(
	int degree,
	int pointCount
)
Public Sub New (
	degree As Integer,
	pointCount As Integer
)
Parameters
degree
Type: System.Int32
Degree of curve. Must be equal to or larger than 1 and smaller than or equal to 11.
pointCount
Type: System.Int32
Number of control-points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
NurbsCurve Class
NurbsCurve Overload
Rhino.Geometry Namespace