RhinoCommon API
Vector3d.VectorAngle Method (Vector3d, Vector3d)
 Compute the angle between two vectors.
This operation is commutative.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double VectorAngle(
	Vector3d a,
	Vector3d b
)
Public Shared Function VectorAngle (
	a As Vector3d,
	b As Vector3d
) As Double
Parameters
a
Type: Rhino.Geometry.Vector3d
First vector for angle.
b
Type: Rhino.Geometry.Vector3d
Second vector for angle.
Return Value
Type: Double
If the input is valid, the angle (in radians) between a and b; RhinoMath.UnsetValue otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Vector3d Structure
VectorAngle Overload
Rhino.Geometry Namespace