RhinoCommon API
RhinoView.CaptureToBitmap Method (DisplayPipelineAttributes)
 Captures view contents to a bitmap using display attributes to define how drawing is performed.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap CaptureToBitmap(
	DisplayPipelineAttributes attributes
)
Public Function CaptureToBitmap (
	attributes As DisplayPipelineAttributes
) As Bitmap
Parameters
attributes
Type: Rhino.Display.DisplayPipelineAttributes
The specific display mode attributes.
Return Value
Type: Bitmap
A new bitmap.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace