RhinoCommon API
LinetypeTable.FindIndex Method
 Retrieves a Linetype object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Linetype
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Linetype
A Linetype object, or null if none was found.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace