RhinoCommon API
BinaryArchiveWriter.WriteByte Method
 Writes a Byte value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteByte(
	byte value
)
Public Sub WriteByte (
	value As Byte
)
Parameters
value
Type: System.Byte
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace