RhinoCommon API
ZBufferCapture.GrayscaleDib Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.GrayscaleDib"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap GrayscaleDib()
Public Function GrayscaleDib As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.GrayscaleDib"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace