RhinoCommon SDK
RhinoApp.MainWindow Method
Note: This API is now obsolete.
 Main Rhino Window
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use MainWindowHandle or RhinoEtoApp.MainWindow in Rhino.UI")]
public static IWin32Window MainWindow()
<ObsoleteAttribute("Use MainWindowHandle or RhinoEtoApp.MainWindow in Rhino.UI")>
Public Shared Function MainWindow As IWin32Window
Return Value
Type: IWin32Window
[Missing <returns> documentation for "M:Rhino.RhinoApp.MainWindow"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
RhinoApp Class
Rhino Namespace