RhinoCommon API
HistoryRecord.SetDouble Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDouble(System.Int32,System.Double)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetDouble(
	int id,
	double value
)
Public Function SetDouble (
	id As Integer,
	value As Double
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDouble(System.Int32,System.Double)"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDouble(System.Int32,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetDouble(System.Int32,System.Double)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace