RhinoCommon API
RhinoApp.GetDataDirectory Method (Boolean, Boolean)
 Gets the data directory.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string GetDataDirectory(
	bool localUser,
	bool forceDirectoryCreation
)
Public Shared Function GetDataDirectory (
	localUser As Boolean,
	forceDirectoryCreation As Boolean
) As String
Parameters
localUser
Type: System.Boolean
If set to true local user.
forceDirectoryCreation
Type: System.Boolean
If set to true force directory creation.
Return Value
Type: String
The data directory.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoApp Class
GetDataDirectory Overload
Rhino Namespace