RhinoCommon API
RhinoSettings.GetCustomRenderSizes Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetCustomRenderSizes"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<Size> GetCustomRenderSizes()
Public Function GetCustomRenderSizes As List(Of Size)
Return Value
Type: List<Size>
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetCustomRenderSizes"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace