RhinoCommon API
UserDictionary.Read Method
 Is called to read this entity.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override bool Read(
	BinaryArchiveReader archive
)
Protected Overrides Function Read (
	archive As BinaryArchiveReader
) As Boolean
Parameters
archive
Type: Rhino.FileIO.BinaryArchiveReader
An archive.
Return Value
Type: Boolean
Always returns true.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace