RhinoCommon SDK
IStackedDialogPageService.SetPageTitle Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SetPageTitle(Rhino.UI.StackedDialogPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetPageTitle(
	StackedDialogPage page
)
Sub SetPageTitle (
	page As StackedDialogPage
)
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetPageTitle(Rhino.UI.StackedDialogPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace