RhinoCommon API
BinaryArchiveReader.ReadUtf8String Method
 Reads a String from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ReadUtf8String()
Public Function ReadUtf8String As String
Return Value
Type: String
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace