RhinoCommon API
Material.Default Method
 Set material to default settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Default()
Public Sub Default
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Material Class
Rhino.DocObjects Namespace