RhinoCommon API
CursorTooltipSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CursorTooltipSettingsState GetCurrentState()
Public Shared Function GetCurrentState As CursorTooltipSettingsState
Return Value
Type: CursorTooltipSettingsState
A new cursor tooltip state with current settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace