RhinoCommon SDK
RhinoPageView.GetDetailViews Method
 Gets a list of the detail view objects associated with this layout.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DetailViewObject[] GetDetailViews()
Public Function GetDetailViews As DetailViewObject()
Return Value
Type: DetailViewObject[]
A detail view object array. This can be null, but not empty.
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace