RhinoCommon API
OptionsDialogPage Constructor
Initializes a new instance of the OptionsDialogPage class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected OptionsDialogPage(
	string englishPageTitle
)
Protected Sub New (
	englishPageTitle As String
)
Parameters
englishPageTitle
Type: System.String
[Missing <param name="englishPageTitle"/> documentation for "M:Rhino.UI.OptionsDialogPage.#ctor(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
OptionsDialogPage Class
Rhino.UI Namespace