RhinoCommon SDK
GetBaseClass.AcceptString Method
 If you want to allow the user to be able to type in a string during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptString(true) before calling GetPoint()/GetObject(). If the user chooses to type in a string, then the result code GetResult.String is returned and you can use RhinoGet.String() to get the value of the string.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AcceptString(
	bool enable
)
Public Sub AcceptString (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true if user is able to type a string.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace