RhinoCommon SDK
RhinoViewport.GetConstructionPlane Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetConstructionPlane"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ConstructionPlane GetConstructionPlane()
Public Function GetConstructionPlane As ConstructionPlane
Return Value
Type: ConstructionPlane
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetConstructionPlane"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace