RhinoCommon API
Panels.OnClosePanel Method
 Call this method to raise the Closed event
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void OnClosePanel(
	Guid panelId,
	uint documentSerialNumber
)
Public Shared Sub OnClosePanel (
	panelId As Guid,
	documentSerialNumber As UInteger
)
Parameters
panelId
Type: System.Guid
Panel identifier.
documentSerialNumber
Type: System.UInt32
The document associated with the closed panel.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Panels Class
Rhino.UI Namespace