RhinoCommon API
DisplayPipeline.PopClipTesting Method
 Pop a ClipTesting flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PopClipTesting()
Public Sub PopClipTesting
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.23
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace