RhinoCommon API
Interop.TryCopyFromOnArc Method
 Attempts to copy the contents of a RMA.OpenNURBS.OnArc to a Rhino.Geometry.Arc.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool TryCopyFromOnArc(
	Object source,
	out Arc destination
)
Public Shared Function TryCopyFromOnArc (
	source As Object,
	<OutAttribute> ByRef destination As Arc
) As Boolean
Parameters
source
Type: System.Object
A source OnArc.
destination
Type: Rhino.Geometry.Arc
A destination arc.
Return Value
Type: Boolean
true if the operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Interop Class
Rhino.Runtime Namespace