RhinoCommon SDK
TextLog.Print Method (String, Object, Object)
 Send formatted text to the textlog
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Print(
	string format,
	Object arg0,
	Object arg1
)
Public Sub Print (
	format As String,
	arg0 As Object,
	arg1 As Object
)
Parameters
format
Type: System.String
[Missing <param name="format"/> documentation for "M:Rhino.FileIO.TextLog.Print(System.String,System.Object,System.Object)"]
arg0
Type: System.Object
[Missing <param name="arg0"/> documentation for "M:Rhino.FileIO.TextLog.Print(System.String,System.Object,System.Object)"]
arg1
Type: System.Object
[Missing <param name="arg1"/> documentation for "M:Rhino.FileIO.TextLog.Print(System.String,System.Object,System.Object)"]
See Also
Reference
TextLog Class
Print Overload
Rhino.FileIO Namespace