RhinoCommon SDK
CustomObjectGrips.OnResetMeshes Method
 Just before Rhino turns off object grips, it calls this function. If grips have modified any display meshes, they must override this function and restore the meshes to their original states.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnResetMeshes()
Protected Overridable Sub OnResetMeshes
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace