RhinoCommon API
SimpleArrayMeshPointer.Add Method
 Adds a mesh to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Mesh mesh,
	bool asConst
)
Public Sub Add (
	mesh As Mesh,
	asConst As Boolean
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to add.
asConst
Type: System.Boolean
Whether this mesh should be treated as non-modifiable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace