RhinoCommon API
ColorLCH.MakePositive Method
 Ensure the Chromaticity of this color is positive.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void MakePositive()
Public Sub MakePositive
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace