RhinoCommon SDK
AnnotationExtensions.SetDefaultContext Method
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetDefaultContext(
	this AnnotationBase annotationBase,
	RhinoDoc doc
)
<ExtensionAttribute>
Public Shared Sub SetDefaultContext (
	annotationBase As AnnotationBase,
	doc As RhinoDoc
)
Parameters
annotationBase
Type: Rhino.Geometry.AnnotationBase
[Missing <param name="annotationBase"/> documentation for "M:Rhino.Geometry.AnnotationExtensions.SetDefaultContext(Rhino.Geometry.AnnotationBase,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Geometry.AnnotationExtensions.SetDefaultContext(Rhino.Geometry.AnnotationBase,Rhino.RhinoDoc)"]
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type AnnotationBase. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
AnnotationExtensions Class
Rhino.Geometry Namespace