RhinoCommon SDK
SubD.ToLimitSurfaceMesh Method (Int32, SubD.SubDType)
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(System.Int32,Rhino.Geometry.SubD.SubDType)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh ToLimitSurfaceMesh(
	int meshDensity,
	SubD.SubDType subDType
)
Public Function ToLimitSurfaceMesh (
	meshDensity As Integer,
	subDType As SubD.SubDType
) As Mesh
Parameters
meshDensity
Type: System.Int32
[Missing <param name="meshDensity"/> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(System.Int32,Rhino.Geometry.SubD.SubDType)"]
subDType
Type: Rhino.Geometry.SubD.SubDType
[Missing <param name="subDType"/> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(System.Int32,Rhino.Geometry.SubD.SubDType)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(System.Int32,Rhino.Geometry.SubD.SubDType)"]
See Also
Reference
SubD Class
ToLimitSurfaceMesh Overload
Rhino.Geometry Namespace