RhinoCommon SDK
SweepTwoRail.PerformSweep Method (Curve, Curve, Curve, Double, Double)
[Missing <summary> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweep(
	Curve rail1,
	Curve rail2,
	Curve crossSection,
	double crossSectionParameterRail1,
	double crossSectionParameterRail2
)
Public Function PerformSweep (
	rail1 As Curve,
	rail2 As Curve,
	crossSection As Curve,
	crossSectionParameterRail1 As Double,
	crossSectionParameterRail2 As Double
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
[Missing <param name="rail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)"]
rail2
Type: Rhino.Geometry.Curve
[Missing <param name="rail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)"]
crossSection
Type: Rhino.Geometry.Curve
[Missing <param name="crossSection"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)"]
crossSectionParameterRail1
Type: System.Double
[Missing <param name="crossSectionParameterRail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)"]
crossSectionParameterRail2
Type: System.Double
[Missing <param name="crossSectionParameterRail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)"]
See Also
Reference
SweepTwoRail Class
PerformSweep Overload
Rhino.Geometry Namespace