RhinoCommon API
ViewportInfo.GetWorldToScreenScale Method
 Gets the scale factor from point in frustum to screen scale.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GetWorldToScreenScale(
	Point3d pointInFrustum
)
Public Function GetWorldToScreenScale (
	pointInFrustum As Point3d
) As Double
Parameters
pointInFrustum
Type: Rhino.Geometry.Point3d
point in viewing frustum.
Return Value
Type: Double
number of pixels per world unit at the 3d point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace