RhinoCommon SDK
BinaryArchiveWriter.WriteGeometry Method
 Writes a GeometryBase value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteGeometry(
	GeometryBase value
)
Public Sub WriteGeometry (
	value As GeometryBase
)
Parameters
value
Type: Rhino.Geometry.GeometryBase
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace