RhinoCommon API
ArchivableDictionary.Set Method (String, Transform)
 Sets a Transform.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	Transform val
)
Public Function Set (
	key As String,
	val As Transform
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Transform
A transform for that key.
Because Transform has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Transform)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace