RhinoCommon API
LicenseUtils.ReturnLicense Method (Guid)
 OBSOLETE - REMOVE WHEN POSSIBLE.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ReturnLicense(
	Guid productId
)
Public Shared Function ReturnLicense (
	productId As Guid
) As Boolean
Parameters
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ReturnLicense(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.ReturnLicense(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
LicenseUtils Class
ReturnLicense Overload
Rhino.PlugIns Namespace