RhinoCommon API
RealtimeDisplayMode.OpenGlVersion Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.OpenGlVersion"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int OpenGlVersion()
Public Function OpenGlVersion As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.OpenGlVersion"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace