RhinoCommon API
Plane.GetPlaneEquation Method
 Gets the plane equation for this plane in the format of Ax+By+Cz+D=0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double[] GetPlaneEquation()
Public Function GetPlaneEquation As Double()
Return Value
Type: Double[]
 Array of four values.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Plane Structure
Rhino.Geometry Namespace