RhinoCommon API
Centermark.Create Method
 Create a new centermark
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Centermark Create(
	DimensionStyle dimStyle,
	Plane plane,
	Point3d centerpoint,
	double radius
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	plane As Plane,
	centerpoint As Point3d,
	radius As Double
) As Centermark
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
Dimension's AnnotationStyle
plane
Type: Rhino.Geometry.Plane
Dimension's plane
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's center point
radius
Type: System.Double
Centermark;s radius
Return Value
Type: Centermark
[Missing <returns> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
Centermark Class
Rhino.Geometry Namespace