RhinoCommon SDK
Transform.Rotation Method (Double, Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Rotation(
	double sinAngle,
	double cosAngle,
	Vector3d rotationAxis,
	Point3d rotationCenter
)
Public Shared Function Rotation (
	sinAngle As Double,
	cosAngle As Double,
	rotationAxis As Vector3d,
	rotationCenter As Point3d
) As Transform
Parameters
sinAngle
Type: System.Double
Sin of the rotation angle.
cosAngle
Type: System.Double
Cos of the rotation angle.
rotationAxis
Type: Rhino.Geometry.Vector3d
Axis direction of rotation.
rotationCenter
Type: Rhino.Geometry.Point3d
Center point of rotation.
Return Value
Type: Transform
A transformation matrix which rotates geometry around an anchor point.
See Also
Reference
Transform Structure
Rotation Overload
Rhino.Geometry Namespace