RhinoCommon API
MeshTopologyEdgeList.GetConnectedFaces Method (Int32)
 Gets indices of faces connected to an edge.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] GetConnectedFaces(
	int topologyEdgeIndex
)
Public Function GetConnectedFaces (
	topologyEdgeIndex As Integer
) As Integer()
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge that is queried.
Return Value
Type: Int32[]
An array of face indices the edge borders. This might be empty on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshTopologyEdgeList Class
GetConnectedFaces Overload
Rhino.Geometry.Collections Namespace