RhinoCommon API
RenderContent.ForDisplay Method
 **** This method is for proxies and will be marked obsolete in V7 **** The only place a single proxy can be displayed is in the New Content Control main thumbnail. All other attempts to use a single proxy in a UI require it to be replaced with the corresponding multi proxy. Single proxies override this to find the corresponding multi proxy.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent ForDisplay()
Public Function ForDisplay As RenderContent
Return Value
Type: RenderContent
The cotnent.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderContent Class
Rhino.Render Namespace