RhinoCommon SDK
IRhRdkThumbnailList.Get Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Get(System.Guid@)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IRhRdkThumbnail Get(
	ref Guid u
)
Function Get (
	ByRef u As Guid
) As IRhRdkThumbnail
Parameters
u
Type: System.Guid
[Missing <param name="u"/> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Get(System.Guid@)"]
Return Value
Type: IRhRdkThumbnail
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Get(System.Guid@)"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace