RhinoCommon SDK
RenderWindow.SetAdjust Method
 Set new ImageAdjust to use. An ImageAdjust instance can be obtained by first querying for one using GetAdjust()
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetAdjust(
	RenderWindow.ImageAdjust imageAdjust
)
Public Sub SetAdjust (
	imageAdjust As RenderWindow.ImageAdjust
)
Parameters
imageAdjust
Type: Rhino.Render.RenderWindow.ImageAdjust
ImageAdjust
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderWindow Class
Rhino.Render Namespace