RhinoCommon API
Curve.GetLength Method (Double)
Get the length of the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GetLength(
	double fractionalTolerance
)
Public Function GetLength (
	fractionalTolerance As Double
) As Double
Parameters
fractionalTolerance
Type: System.Double
 Desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Return Value
Type: Double
The length of the curve on success, or zero on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Curve Class
GetLength Overload
Rhino.Geometry Namespace