RhinoCommon API
BlockEditCommand.InBlockEditMode Method
 Call this method to determine if a document is being blocked edited.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool InBlockEditMode(
	RhinoDoc doc
)
Public Shared Function InBlockEditMode (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Commands.BlockEditCommand.InBlockEditMode(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
 Returns true if the specified document is editing a block.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace