RhinoCommon API
MeshTopologyEdgeList.IsSwappableEdge Method
 Determines if a mesh edge index is valid input for SwapEdge(Int32).
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSwappableEdge(
	int topologyEdgeIndex
)
Public Function IsSwappableEdge (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if edge can be swapped.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace