RhinoCommon API
AnnotationBase.IsAllUnderlined Method
 Returns true if all of the text in the annotation is Underlined, otherwise returns false
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsAllUnderlined()
Public Function IsAllUnderlined As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.IsAllUnderlined"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace