RhinoCommon API
FilePdf.Write Method (Stream)
 Write pdf to a stream
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void Write(
	Stream stream
)
Public MustOverride Sub Write (
	stream As Stream
)
Parameters
stream
Type: System.IO.Stream
[Missing <param name="stream"/> documentation for "M:Rhino.FileIO.FilePdf.Write(System.IO.Stream)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FilePdf Class
Write Overload
Rhino.FileIO Namespace