RhinoCommon SDK
DisplayPipeline.DrawPolyline Method (IEnumerable<Point3d>, Color, Int32)
 Draws a single Polyline object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawPolyline(
	IEnumerable<Point3d> polyline,
	Color color,
	int thickness
)
Public Sub DrawPolyline (
	polyline As IEnumerable(Of Point3d),
	color As Color,
	thickness As Integer
)
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
Polyline to draw.
color
Type: System.Drawing.Color
Color to draw in.
thickness
Type: System.Int32
Thickness (in pixels) of the Polyline.
See Also
Reference
DisplayPipeline Class
DrawPolyline Overload
Rhino.Display Namespace