RhinoCommon SDK
IStackedDialogPageService.Viewport Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.Viewport(Rhino.UI.ObjectPropertiesPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RhinoViewport Viewport(
	ObjectPropertiesPage page
)
Function Viewport (
	page As ObjectPropertiesPage
) As RhinoViewport
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.Viewport(Rhino.UI.ObjectPropertiesPage)"]
Return Value
Type: RhinoViewport
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.Viewport(Rhino.UI.ObjectPropertiesPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace