RhinoCommon SDK
IPanelsService.GetOpenPanelIds Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.GetOpenPanelIds"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
Guid[] GetOpenPanelIds()
Function GetOpenPanelIds As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.GetOpenPanelIds"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace