RhinoCommon SDK
SweepOneRail.PerformSweepRefit Method (Curve, Curve, Double)
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweepRefit(
	Curve rail,
	Curve crossSection,
	double refitTolerance
)
Public Function PerformSweepRefit (
	rail As Curve,
	crossSection As Curve,
	refitTolerance As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
[Missing <param name="rail"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
crossSection
Type: Rhino.Geometry.Curve
[Missing <param name="crossSection"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
refitTolerance
Type: System.Double
[Missing <param name="refitTolerance"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
See Also
Reference
SweepOneRail Class
PerformSweepRefit Overload
Rhino.Geometry Namespace