RhinoCommon SDK
IStackedDialogPageService.SelectedObjectCount Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectCount(Rhino.UI.ObjectPropertiesPage,System.Object@)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
int SelectedObjectCount(
	ObjectPropertiesPage page,
	out Object data
)
Function SelectedObjectCount (
	page As ObjectPropertiesPage,
	<OutAttribute> ByRef data As Object
) As Integer
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectCount(Rhino.UI.ObjectPropertiesPage,System.Object@)"]
data
Type: System.Object
[Missing <param name="data"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectCount(Rhino.UI.ObjectPropertiesPage,System.Object@)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectCount(Rhino.UI.ObjectPropertiesPage,System.Object@)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace