RhinoCommon SDK
HistoryRecord.SetStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetStrings(System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetStrings(
	int id,
	IEnumerable<string> values
)
Public Function SetStrings (
	id As Integer,
	values As IEnumerable(Of String)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetStrings(System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
values
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetStrings(System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetStrings(System.Int32,System.Collections.Generic.IEnumerable{System.String})"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace