RhinoCommon API
MeshVertexStatusList.Add Method
 Adds a new flag at the end of the list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	bool hidden
)
Public Sub Add (
	hidden As Boolean
)
Parameters
hidden
Type: System.Boolean
True if vertex is hidden.
Return Value
Type:
The index of the newly added hidden vertex.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace