RhinoCommon API
SimpleArrayExtrusionPointer.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
SimpleArrayExtrusionPointer Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace