RhinoCommon API
SimpleArrayCurvePointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] ToNonConstArray()
Public Function ToNonConstArray As Curve()
Return Value
Type: Curve[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
SimpleArrayCurvePointer Class
Rhino.Runtime.InteropWrappers Namespace