RhinoCommon API
File3dmObjectTable.AddPoints Method (IEnumerable<Point3d>, ObjectAttributes)
 Adds multiple points to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] AddPoints(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes
)
Public Function AddPoints (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes
) As Guid()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point objects.
Return Value
Type: Guid[]
An array of object unique identifiers.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmObjectTable Class
AddPoints Overload
Rhino.FileIO Namespace