RhinoCommon API
RenderTexture.GetLocalMappingType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetLocalMappingType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderTexture.eLocalMappingType GetLocalMappingType()
Public Function GetLocalMappingType As RenderTexture.eLocalMappingType
Return Value
Type: RenderTexture.eLocalMappingType
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetLocalMappingType"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderTexture Class
Rhino.Render Namespace