RhinoCommon SDK
IRhRdkThumbnail.GetDisplayRect Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void GetDisplayRect(
	ref RectangleF rectOut
)
Sub GetDisplayRect (
	ByRef rectOut As RectangleF
)
Parameters
rectOut
Type: System.Drawing.RectangleF
[Missing <param name="rectOut"/> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls Namespace