RhinoCommon SDK
InstanceDefinitionTable.UndoModify Method
 Restores the instance definition to its previous state, if the instance definition has been modified and the modification can be undone.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UndoModify(
	int idefIndex
)
Public Function UndoModify (
	idefIndex As Integer
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be restored.
Return Value
Type: Boolean
true if operation succeeded.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace