RhinoCommon API
BrepLoopList.GetEnumerator Method
 Gets an enumerator that visits all edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<BrepLoop> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepLoop)
Return Value
Type: IEnumerator<BrepLoop>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace