RhinoCommon API
GetCone.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetCone Class
Dispose Overload
Rhino.Input.Custom Namespace