RhinoCommon API
BlockEditCommand.IsBlockEditing Method
 Called to determine if the specified document was not block edit mode.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool IsBlockEditing(
	RhinoDoc doc
)
Public MustOverride Function IsBlockEditing (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Commands.BlockEditCommand.IsBlockEditing(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Commands.BlockEditCommand.IsBlockEditing(Rhino.RhinoDoc)"]
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace