RhinoCommon API
GetPoint.InterruptMouseMove Method
 If you have lengthy computations in OnMouseMove() and/or DymanicDraw() overrides, then periodically call InterruptMouseMove() to see if you should interrupt your work because the mouse has moved again.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InterruptMouseMove()
Public Function InterruptMouseMove As Boolean
Return Value
Type: Boolean
true if you should interrupt your work; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace