RhinoCommon SDK
SubD Constructor
Initializes a new empty SubD surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubD()
Public Sub New
See Also
Reference
SubD Class
Rhino.Geometry Namespace