RhinoCommon SDK
ILocalizationService.LocalizeDialogItem Method
[Missing <summary> documentation for "M:Rhino.UI.ILocalizationService.LocalizeDialogItem(System.Reflection.Assembly,System.Int32,System.String,System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
string LocalizeDialogItem(
	Assembly assembly,
	int languageId,
	string key,
	string english
)
Function LocalizeDialogItem (
	assembly As Assembly,
	languageId As Integer,
	key As String,
	english As String
) As String
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeDialogItem(System.Reflection.Assembly,System.Int32,System.String,System.String)"]
languageId
Type: System.Int32
[Missing <param name="languageId"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeDialogItem(System.Reflection.Assembly,System.Int32,System.String,System.String)"]
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeDialogItem(System.Reflection.Assembly,System.Int32,System.String,System.String)"]
english
Type: System.String
[Missing <param name="english"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeDialogItem(System.Reflection.Assembly,System.Int32,System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.ILocalizationService.LocalizeDialogItem(System.Reflection.Assembly,System.Int32,System.String,System.String)"]
See Also
Reference
ILocalizationService Interface
Rhino.UI Namespace