RhinoCommon API
StringParserSettings.Dispose Method
Releases all resources used by the StringParserSettings
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
StringParserSettings Class
Dispose Overload
Rhino.Input Namespace