RhinoCommon API
Curve.IsArc Method
 Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsArc()
Public Function IsArc As Boolean
Return Value
Type: Boolean
 true if the curve can be represented by an arc or a circle within tolerance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Curve Class
IsArc Overload
Rhino.Geometry Namespace