RhinoCommon API
RenderPrimitiveList.Dispose Method
Releases all resources used by the RenderPrimitiveList
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace