RhinoCommon API
MetaData.Geometry Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.MetaData.Geometry"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Geometry()
Public Function Geometry As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.DataSources.MetaData.Geometry"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace