RhinoCommon API
Curve.TryGetArc Method (Arc)
 Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetArc(
	out Arc arc
)
Public Function TryGetArc (
	<OutAttribute> ByRef arc As Arc
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
On success, the Arc will be filled in.
Return Value
Type: Boolean
true if the curve could be converted into an arc.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Curve Class
TryGetArc Overload
Rhino.Geometry Namespace