RhinoCommon API
SupportOptions.SupportSharedUIsNoCache Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIsNoCache"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SupportSharedUIsNoCache()
Public Shared Function SupportSharedUIsNoCache As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIsNoCache"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SupportOptions Class
Rhino.Render Namespace