RhinoCommon API
ViewSettings.RestoreDefaults Method
 Updates from the default setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace