RhinoCommon API
DisplayMaterial.Finalize Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.Finalize"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace