RhinoCommon API
RenderContentKindList.Dispose Method
Releases all resources used by the RenderContentKindList
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace