RhinoCommon API
CustomMeshObject.Dispose Method
Releases all resources used by the CustomMeshObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CustomMeshObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace