RhinoCommon SDK
Plane.Rotate Method (Double, Vector3d, Point3d)
 Rotate the plane about a custom anchor point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Rotate(
	double angle,
	Vector3d axis,
	Point3d centerOfRotation
)
Public Function Rotate (
	angle As Double,
	axis As Vector3d,
	centerOfRotation As Point3d
) As Boolean
Parameters
angle
Type: System.Double
Angle in radians.
axis
Type: Rhino.Geometry.Vector3d
Axis of rotation.
centerOfRotation
Type: Rhino.Geometry.Point3d
Center of rotation.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
Rotate Overload
Rhino.Geometry Namespace