RhinoCommon API
OpenGLSettings.UpdateFromState Method
 Updates from a particular setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void UpdateFromState(
	OpenGLSettingsState state
)
Public Shared Sub UpdateFromState (
	state As OpenGLSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.OpenGLSettingsState
The new state that will be set.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace