RhinoCommon API
LayerTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Layer> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Layer)
Return Value
Type: IEnumerator<Layer>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace