RhinoCommon SDK
CalculateBoundingBoxEventArgs.IncludeBoundingBox Method
 Unites a bounding box with the current display bounding box in order to ensure dynamic objects in "box" are drawn.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void IncludeBoundingBox(
	BoundingBox box
)
Public Sub IncludeBoundingBox (
	box As BoundingBox
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
The box to unite.
See Also
Reference
CalculateBoundingBoxEventArgs Class
Rhino.Display Namespace