RhinoCommon SDK
SubDFacePtr.SetSavedSubdivisionPoint Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.SetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SetSavedSubdivisionPoint(
	SubD.SubDType type,
	Point3d pt
)
Public Function SetSavedSubdivisionPoint (
	type As SubD.SubDType,
	pt As Point3d
) As Boolean
Parameters
type
Type: Rhino.Geometry.SubD.SubDType
[Missing <param name="type"/> documentation for "M:Rhino.Geometry.SubDFacePtr.SetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d)"]
pt
Type: Rhino.Geometry.Point3d
[Missing <param name="pt"/> documentation for "M:Rhino.Geometry.SubDFacePtr.SetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.SetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d)"]
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace