RhinoCommon API
File3dmObjectTable.AddLine Method (Line, ObjectAttributes)
Adds a line object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLine(
	Line line,
	ObjectAttributes attributes
)
Public Function AddLine (
	line As Line,
	attributes As ObjectAttributes
) As Guid
Parameters
line
Type: Rhino.Geometry.Line
A line.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to line.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmObjectTable Class
AddLine Overload
Rhino.FileIO Namespace