RhinoCommon SDK
AnnotationBase.SetContext Method
 This function would not be called outside of Rhino but it is written this way not to couple this class with RhinoDoc. If you're thinking of calling this method from the Rhino context you should call the SetDefaultContext() extension method (AnnotationExtensions.cs)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetContext(
	Func<Guid, uint, DimensionStyle> getDimStyleFunc,
	Func<uint, UnitSystem> getModelUnits,
	uint docSerialNumber
)
Public Sub SetContext (
	getDimStyleFunc As Func(Of Guid, UInteger, DimensionStyle),
	getModelUnits As Func(Of UInteger, UnitSystem),
	docSerialNumber As UInteger
)
Parameters
getDimStyleFunc
Type: System.Func<Guid, UInt32, DimensionStyle>
[Missing <param name="getDimStyleFunc"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetContext(System.Func{System.Guid,System.UInt32,Rhino.DocObjects.DimensionStyle},System.Func{System.UInt32,Rhino.UnitSystem},System.UInt32)"]
getModelUnits
Type: System.Func<UInt32, UnitSystem>
[Missing <param name="getModelUnits"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetContext(System.Func{System.Guid,System.UInt32,Rhino.DocObjects.DimensionStyle},System.Func{System.UInt32,Rhino.UnitSystem},System.UInt32)"]
docSerialNumber
Type: System.UInt32
[Missing <param name="docSerialNumber"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetContext(System.Func{System.Guid,System.UInt32,Rhino.DocObjects.DimensionStyle},System.Func{System.UInt32,Rhino.UnitSystem},System.UInt32)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace