RhinoCommon API
BrepEdge.SetEdgeCurve Method (Int32)
 Set 3d curve geometry used by a b-rep edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetEdgeCurve(
	int curve3dIndex
)
Public Function SetEdgeCurve (
	curve3dIndex As Integer
) As Boolean
Parameters
curve3dIndex
Type: System.Int32
index of 3d curve in m_C3[] array
Return Value
Type: Boolean
true if successful
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BrepEdge Class
SetEdgeCurve Overload
Rhino.Geometry Namespace