RhinoCommon API
RenderContentKindList Constructor (RenderContentKindList)
Initializes a new instance of the RenderContentKindList class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentKindList(
	RenderContentKindList kind_list
)
Public Sub New (
	kind_list As RenderContentKindList
)
Parameters
kind_list
Type: Rhino.Render.RenderContentKindList
[Missing <param name="kind_list"/> documentation for "M:Rhino.Render.RenderContentKindList.#ctor(Rhino.Render.RenderContentKindList)"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContentKindList Class
RenderContentKindList Overload
Rhino.Render Namespace