RhinoCommon SDK
SubDVertexAccess.RemoveVertexAndConnections Method (Int32)
 Removes a vertex from the subD. All connected parts are removed, too.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool RemoveVertexAndConnections(
	int vertexIndex
)
Public Function RemoveVertexAndConnections (
	vertexIndex As Integer
) As Boolean
Parameters
vertexIndex
Type: System.Int32
A vertex. If null, no vertices are removed and the method succeeds.
Return Value
Type: Boolean
True if the method succeeds; false otherwise.
See Also
Reference
SubDVertexAccess Class
RemoveVertexAndConnections Overload
Rhino.Geometry.Collections Namespace