RhinoCommon API
ModelAidSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ModelAidSettingsState GetCurrentState()
Public Shared Function GetCurrentState As ModelAidSettingsState
Return Value
Type: ModelAidSettingsState
A new model aid state with current settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace