RhinoCommon API
RhinoGet.GetGrip Method
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result GetGrip(
	out GripObject grip,
	string prompt
)
Public Shared Function GetGrip (
	<OutAttribute> ByRef grip As GripObject,
	prompt As String
) As Result
Parameters
grip
Type: Rhino.DocObjects.GripObject
[Missing <param name="grip"/> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoGet Class
Rhino.Input Namespace