RhinoCommon API
MeshVertexList.Add Method (Point3f)
 Adds a new vertex to the end of the Vertex list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	Point3f vertex
)
Public Function Add (
	vertex As Point3f
) As Integer
Parameters
vertex
Type: Rhino.Geometry.Point3f
Location of new vertex.
Return Value
Type: Int32
The index of the newly added vertex.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshVertexList Class
Add Overload
Rhino.Geometry.Collections Namespace