RhinoCommon API
CustomRenderMeshProvider2 Constructor
Initializes a new instance of the CustomRenderMeshProvider2 class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomRenderMeshProvider2()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
CustomRenderMeshProvider2 Class
Rhino.Render Namespace