RhinoCommon API
DisplayPipeline.DrawConstructionPlane Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawConstructionPlane(Rhino.DocObjects.ConstructionPlane)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawConstructionPlane(
	ConstructionPlane constructionPlane
)
Public Sub DrawConstructionPlane (
	constructionPlane As ConstructionPlane
)
Parameters
constructionPlane
Type: Rhino.DocObjects.ConstructionPlane
[Missing <param name="constructionPlane"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawConstructionPlane(Rhino.DocObjects.ConstructionPlane)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace