RhinoCommon API
ContentHash.Clone Method
 Creates a copy of this content hash. Because content hash is immutable, this can be used as a deep copy.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ContentHash Clone()
Public Function Clone As ContentHash
Return Value
Type: ContentHash
A different instance of the same content hash.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace