RhinoCommon SDK
File3dmObjectTable.Dump Method
Prepares a text dump of object table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
A string containing the dump.
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace