RhinoCommon API
AngularDimension.AdjustFromPoints Method (Plane, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d centerpoint,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	centerpoint As Point3d,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane
centerpoint
Type: Rhino.Geometry.Point3d
Dimension's centerpoint
defpoint1
Type: Rhino.Geometry.Point3d
First definition point
defpoint2
Type: Rhino.Geometry.Point3d
Second definition point
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
AngularDimension Class
AdjustFromPoints Overload
Rhino.Geometry Namespace