RhinoCommon SDK
SubDVertexSectorIterator.Finalize Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Finalize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace