RhinoCommon API
ClassArrayString.ToArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] ToArray()
Public Function ToArray As String()
Return Value
Type: String[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace