RhinoCommon API
RhinoViewport.ScreenToClient Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.ScreenToClient(System.Drawing.Point)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point ScreenToClient(
	Point screenPoint
)
Public Function ScreenToClient (
	screenPoint As Point
) As Point
Parameters
screenPoint
Type: System.Drawing.Point
[Missing <param name="screenPoint"/> documentation for "M:Rhino.Display.RhinoViewport.ScreenToClient(System.Drawing.Point)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.ScreenToClient(System.Drawing.Point)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace