RhinoCommon SDK
BinaryArchiveWriter.WriteSize Method
 Writes a Size value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteSize(
	Size value
)
Public Sub WriteSize (
	value As Size
)
Parameters
value
Type: System.Drawing.Size
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace