RhinoCommon API
Torus.ToNurbsSurface Method
 Converts this torus to its nurbs surface representation. This is synonymous with calling NurbsSurface.CreateFromTorus().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A nurbs surface representation of this torus, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Torus Structure
Rhino.Geometry Namespace