RhinoCommon API
Line.Flip Method
 Flip the endpoints of the line segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Flip()
Public Sub Flip
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Line Structure
Rhino.Geometry Namespace