RhinoCommon SDK
SubDVertexAccess.Add Method (SubD.SubDVertexTag, Point3d)
 Adds a new vertex to the end of the Vertex list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr Add(
	SubD.SubDVertexTag tag,
	Point3d vertex
)
Public Function Add (
	tag As SubD.SubDVertexTag,
	vertex As Point3d
) As SubDVertexPtr
Parameters
tag
Type: Rhino.Geometry.SubD.SubDVertexTag
The type of vertex tag, such as smooth or corner.
vertex
Type: Rhino.Geometry.Point3d
Location of new vertex.
Return Value
Type: SubDVertexPtr
The index of the newly added vertex.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If tag is unset or non-defined.
See Also
Reference
SubDVertexAccess Class
Add Overload
Rhino.Geometry.Collections Namespace