RhinoCommon API
FreeFloatingBase.Finalize Method
 Handle destruction of the un-managed CPP object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
FreeFloatingBase Class
Rhino.Render Namespace