RhinoCommon API
Arc Constructor (Circle, Double)
 Initializes a new instance of an arc from a base circle and an angle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Arc(
	Circle circle,
	double angleRadians
)
Public Sub New (
	circle As Circle,
	angleRadians As Double
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to base arc upon.
angleRadians
Type: System.Double
Sweep angle of arc (in radians)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace