RhinoCommon API
DisplayModeDescription.AddDisplayMode Method (String)
 Adds a new display mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid AddDisplayMode(
	string name
)
Public Shared Function AddDisplayMode (
	name As String
) As Guid
Parameters
name
Type: System.String
The name of the new display mode.
Return Value
Type: Guid
The id of the new display mode if successful. Guid.Empty on error.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayModeDescription Class
AddDisplayMode Overload
Rhino.Display Namespace