RhinoCommon API
GripObject.Move Method (Vector3d)
 Moves the grip to a new location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Move(
	Vector3d delta
)
Public Sub Move (
	delta As Vector3d
)
Parameters
delta
Type: Rhino.Geometry.Vector3d
 Translation applied to the OriginalLocation point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace