RhinoCommon API
OptionDouble Constructor (Double)
Initializes a new instance of the OptionDouble class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OptionDouble(
	double initialValue
)
Public Sub New (
	initialValue As Double
)
Parameters
initialValue
Type: System.Double
[Missing <param name="initialValue"/> documentation for "M:Rhino.Input.Custom.OptionDouble.#ctor(System.Double)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
OptionDouble Class
OptionDouble Overload
Rhino.Input.Custom Namespace