RhinoCommon API
LightArray.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.LightArray.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LightArray Class
Rhino.Render Namespace