RhinoCommon SDK
Mesh.CollapseFacesByArea Method
 Collapses multiple mesh faces, with areas less than LessThanArea and greater than GreaterThanArea, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CollapseFacesByArea(
	double lessThanArea,
	double greaterThanArea
)
Public Function CollapseFacesByArea (
	lessThanArea As Double,
	greaterThanArea As Double
) As Integer
Parameters
lessThanArea
Type: System.Double
Area in which faces are selected if their area is less than or equal to.
greaterThanArea
Type: System.Double
Area in which faces are selected if their area is greater than or equal to.
Return Value
Type: Int32
Number of faces that were collapsed in the process.
Remarks
 This number may differ from the initial number of faces that meet the input criteria because the areas of some initial faces may be altered as other faces are collapsed. The face area must be both less than LessThanArea AND greater than GreaterThanArea in order to be considered. Use large numbers for lessThanArea or zero for greaterThanArea to simulate an OR.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace