RhinoCommon SDK
OptionDouble Constructor (Double, Boolean, Double)
 Initializes a new instance of the double option class.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public OptionDouble(
	double initialValue,
	bool setLowerLimit,
	double limit
)
Public Sub New (
	initialValue As Double,
	setLowerLimit As Boolean,
	limit As Double
)
Parameters
initialValue
Type: System.Double
The initial number .
setLowerLimit
Type: System.Boolean
 If true, limit sets the lower limit and upper limit is undefined. If false, limit sets the upper limit and lower limit is undefined.
limit
Type: System.Double
The lower limit if setLowerLimit is true; otherwise, the upper limit.
See Also
Reference
OptionDouble Class
OptionDouble Overload
Rhino.Input.Custom Namespace