RhinoCommon API
LayerTable.FindIndex Method
 Retrieves a Layer object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Layer
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Layer
A Layer object, or null if none was found.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace