RhinoCommon API
HostUtils.InitializeRhinoCommon Method
 Makes sure all static RhinoCommon components is set up correctly. This happens automatically when a plug-in is loaded, so you probably won't have to call this method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void InitializeRhinoCommon()
Public Shared Sub InitializeRhinoCommon
Remarks
Subsequent calls to this method will be ignored.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace