RhinoCommon SDK
Curve.LengthParameter Method (Double, Double, Interval)
 Gets the parameter along the curve which coincides with a given length along the curve. A fractional tolerance of 1e-8 is used in this version of the function.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool LengthParameter(
	double segmentLength,
	out double t,
	Interval subdomain
)
Public Function LengthParameter (
	segmentLength As Double,
	<OutAttribute> ByRef t As Double,
	subdomain As Interval
) As Boolean
Parameters
segmentLength
Type: System.Double
 Length of segment to measure. Must be less than or equal to the length of the subdomain.
t
Type: System.Double
 Parameter such that the length of the curve from the start of the subdomain to t is s.
subdomain
Type: Rhino.Geometry.Interval
 The calculation is performed on the specified sub-domain of the curve rather than the whole curve.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
LengthParameter Overload
Rhino.Geometry Namespace