RhinoCommon API
StatusBar.ClearMessagePane Method
 Removes the message from the message pane.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ClearMessagePane()
Public Shared Sub ClearMessagePane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
StatusBar Class
Rhino.UI Namespace