RhinoCommon API
RenderContentCollection.GetFilterContentByUsage Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.GetFilterContentByUsage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FilterContentByUsage GetFilterContentByUsage()
Public Function GetFilterContentByUsage As FilterContentByUsage
Return Value
Type: FilterContentByUsage
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.GetFilterContentByUsage"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace