RhinoCommon SDK
SubDVertexAccess.GetUnboundSectorIterator Method
 This iterator needs to be reset before any use is sensible.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexSectorIterator GetUnboundSectorIterator()
Public Function GetUnboundSectorIterator As SubDVertexSectorIterator
Return Value
Type: SubDVertexSectorIterator
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.GetUnboundSectorIterator"]
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace