RhinoCommon API
File3dmNamedConstructionPlanes.Clear Method
 Removes all named construction planes from the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace