RhinoCommon API
Surface.TryGetPlane Method (Plane)
Tests a surface for planarity and return the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetPlane(
	out Plane plane
)
Public Function TryGetPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
On success, the plane parameters are filled in.
Return Value
Type: Boolean
 true if there is a plane such that the maximum distance from the surface to the plane is <= RhinoMath.ZeroTolerance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Surface Class
TryGetPlane Overload
Rhino.Geometry Namespace