RhinoCommon API
ReplayHistoryResult.UpdateToExtrusion Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UpdateToExtrusion(
	Extrusion extrusion,
	ObjectAttributes attributes
)
Public Function UpdateToExtrusion (
	extrusion As Extrusion,
	attributes As ObjectAttributes
) As Boolean
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
[Missing <param name="extrusion"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace