RhinoCommon API
Skin.OnBuiltInCommandsRegistered Method
Is called when built-in commands are registered.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnBuiltInCommandsRegistered()
Protected Overridable Sub OnBuiltInCommandsRegistered
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Skin Class
Rhino.Runtime Namespace