RhinoCommon API
BezierCurve.CreateLoftedBezier Method (IEnumerable<Point3d>)
 Loft a bezier through a list of points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static BezierCurve CreateLoftedBezier(
	IEnumerable<Point3d> points
)
Public Shared Function CreateLoftedBezier (
	points As IEnumerable(Of Point3d)
) As BezierCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
2 or more points to interpolate
Return Value
Type: BezierCurve
new bezier curve if successful
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
BezierCurve Class
CreateLoftedBezier Overload
Rhino.Geometry Namespace