RhinoCommon API
Brep.CreatePlanarBreps Method (Curve)
 Constructs a set of planar breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreatePlanarBreps(
	Curve inputLoop
)
Public Shared Function CreatePlanarBreps (
	inputLoop As Curve
) As Brep()
Parameters
inputLoop
Type: Rhino.Geometry.Curve
A curve that should form the boundaries of the surfaces or polysurfaces.
Return Value
Type: Brep[]
An array of Planar Breps.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace