RhinoCommon API
ColorLAB.CreateFromCMYK Method
 Create the nearest LAB equivalent of a CMYK color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorLAB CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorLAB
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorLAB
The LAB equivalent of the CMYK color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace