RhinoCommon API
File3dmObjectTable.AddPoint Method (Point3f)
Adds a point object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPoint(
	Point3f point
)
Public Function AddPoint (
	point As Point3f
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3f
location of point.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace