RhinoCommon API
ComponentFunctionInfo.EvaluateTreeWithWarningsAsErrors Method
 Infrastructure method that simplifies output and performs warning checks.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Object EvaluateTreeWithWarningsAsErrors(
	IEnumerable args
)
Protected Function EvaluateTreeWithWarningsAsErrors (
	args As IEnumerable
) As Object
Parameters
args
Type: System.Collections.IEnumerable
Arguments.
Return Value
Type: Object
Items.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace