RhinoCommon API
LayerTable.ForceLayerVisible Method (Guid)
 Makes a layer and all of its parent layers visible.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ForceLayerVisible(
	Guid layerId
)
Public Function ForceLayerVisible (
	layerId As Guid
) As Boolean
Parameters
layerId
Type: System.Guid
The layer ID to be made visible.
Return Value
Type: Boolean
true if the operation succeeded.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
LayerTable Class
ForceLayerVisible Overload
Rhino.DocObjects.Tables Namespace