RhinoCommon API
Panels.ChangePanelIcon Method
 Update the icon used for a panel tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ChangePanelIcon(
	Type panelType,
	Icon icon
)
Public Shared Sub ChangePanelIcon (
	panelType As Type,
	icon As Icon
)
Parameters
panelType
Type: System.Type
[Missing <param name="panelType"/> documentation for "M:Rhino.UI.Panels.ChangePanelIcon(System.Type,System.Drawing.Icon)"]
icon
Type: System.Drawing.Icon
New icon to use
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Panels Class
Rhino.UI Namespace