RhinoCommon API
DisplayMaterial.SetTransparencyTexture Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.SetTransparencyTexture(System.String,System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTransparencyTexture(
	string filename,
	bool front
)
Public Function SetTransparencyTexture (
	filename As String,
	front As Boolean
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.Display.DisplayMaterial.SetTransparencyTexture(System.String,System.Boolean)"]
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.SetTransparencyTexture(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayMaterial.SetTransparencyTexture(System.String,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayMaterial Class
SetTransparencyTexture Overload
Rhino.Display Namespace