RhinoCommon SDK
BrepTrimList.Add Method (BrepEdge, Boolean, BrepLoop, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrim Add(
	BrepEdge edge,
	bool rev3d,
	BrepLoop loop,
	int curve2dIndex
)
Public Function Add (
	edge As BrepEdge,
	rev3d As Boolean,
	loop As BrepLoop,
	curve2dIndex As Integer
) As BrepTrim
Parameters
edge
Type: Rhino.Geometry.BrepEdge
3d edge associated with this trim
rev3d
Type: System.Boolean
 true if the edge and trim have opposite directions
loop
Type: Rhino.Geometry.BrepLoop
trim is appended to this loop
curve2dIndex
Type: System.Int32
index of 2d trimming curve
Return Value
Type: BrepTrim
new trim
See Also
Reference
BrepTrimList Class
Add Overload
Rhino.Geometry.Collections Namespace