RhinoCommon API
BezierCurve.GetControlVertex4d Method
Get location of a control vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point4d GetControlVertex4d(
	int index
)
Public Function GetControlVertex4d (
	index As Integer
) As Point4d
Parameters
index
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount)
Return Value
Type: Point4d
 Homogenous value of control vertex. If the bezier is not rational, the weight is 1.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | when index is out of range
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace