RhinoCommon SDK
RenderContent.BeginChange Method
 Begins a change or batch of changes. This returns a reference to the content which you should use to make your changes. It may also make a copy of the content state allowing EndChange() to send an event with the old and new contents. Calls to this method are counted; you must call EndChange() once for every call to BeginChange(). Note: If Changed() was called between the calls to BeginChange() and EndChange(), the last call to EndChange() may cause the ContentChanged event to be sent.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void BeginChange(
	RenderContent.ChangeContexts changeContext
)
Public Sub BeginChange (
	changeContext As RenderContent.ChangeContexts
)
Parameters
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
 the change context. If this is kUI, kProgram, kDrop or kTree, the content will be copied. EndChange() will then send the copy as 'old' in the OnContentChanged event. Note: If you override this method, please be sure to call the base class. EndChange()ContentChanged
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace