RhinoCommon SDK
SubDEdgePtr.Equals Method (Object)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDEdgePtr.Equals(System.Object)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgePtr.Equals(System.Object)"]
See Also
Reference
SubDEdgePtr Structure
Equals Overload
Rhino.Geometry Namespace