RhinoCommon SDK
InstanceDefinitionTable.GetUnusedInstanceDefinitionName Method (String)
 Gets unsed instance definition name used as default when creating new instance definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetUnusedInstanceDefinitionName(
	string root
)
Public Function GetUnusedInstanceDefinitionName (
	root As String
) As String
Parameters
root
Type: System.String
 The returned name is 'root nn' If root is empty, then 'Block' (localized) is used.
Return Value
Type: String
An unused instance definition name string.
See Also
Reference
InstanceDefinitionTable Class
GetUnusedInstanceDefinitionName Overload
Rhino.DocObjects.Tables Namespace