RhinoCommon API
TransformCommand.DuplicateObjects Method
[Missing <summary> documentation for "M:Rhino.Commands.TransformCommand.DuplicateObjects(Rhino.Collections.TransformObjectList)"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void DuplicateObjects(
	TransformObjectList list
)
Protected Sub DuplicateObjects (
	list As TransformObjectList
)
Parameters
list
Type: Rhino.Collections.TransformObjectList
[Missing <param name="list"/> documentation for "M:Rhino.Commands.TransformCommand.DuplicateObjects(Rhino.Collections.TransformObjectList)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace