RhinoCommon API
Text3d Constructor (String)
 Constructs a new instance of Text3d.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Text3d(
	string text
)
Public Sub New (
	text As String
)
Parameters
text
Type: System.String
Text string.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Text3d Class
Text3d Overload
Rhino.Display Namespace