RhinoCommon API
SupportOptions.SetCombineEditors Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetCombineEditors(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetCombineEditors(
	bool b
)
Public Shared Sub SetCombineEditors (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetCombineEditors(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
SupportOptions Class
Rhino.Render Namespace