RhinoCommon SDK
BrepFaceList.AddRuledFace Method
 Add a new face to the brep whose surface geometry is a ruled surface between two edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepFace AddRuledFace(
	BrepEdge edgeA,
	bool revEdgeA,
	BrepEdge edgeB,
	bool revEdgeB
)
Public Function AddRuledFace (
	edgeA As BrepEdge,
	revEdgeA As Boolean,
	edgeB As BrepEdge,
	revEdgeB As Boolean
) As BrepFace
Parameters
edgeA
Type: Rhino.Geometry.BrepEdge
 The south side of the face's surface will run along edgeA.
revEdgeA
Type: System.Boolean
 true if the new face's outer boundary orientation along edgeA is opposite the orientation of edgeA.
edgeB
Type: Rhino.Geometry.BrepEdge
 The north side of the face's surface will run along edgeA
revEdgeB
Type: System.Boolean
 true if the new face's outer boundary orientation along edgeB is opposite the orientation of edgeB
Return Value
Type: BrepFace
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepFaceList.AddRuledFace(Rhino.Geometry.BrepEdge,System.Boolean,Rhino.Geometry.BrepEdge,System.Boolean)"]
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace