RhinoCommon API
BrepFaceList.GetEnumerator Method
 Gets an enumerators that yields BrepFace objects.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<BrepFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepFace)
Return Value
Type: IEnumerator<BrepFace>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace