RhinoCommon API
ObjectTable.Replace Method (Guid, Arc)
Replaces one object with new curve object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	Guid objectId,
	Arc arc
)
Public Function Replace (
	objectId As Guid,
	arc As Arc
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
arc
Type: Rhino.Geometry.Arc
new arc to be added. The arc is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace