RhinoCommon API
HatchPattern Constructor
Initializes a new instance of the HatchPattern class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HatchPattern()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
HatchPattern Class
HatchPattern Overload
Rhino.DocObjects Namespace