RhinoCommon API
RhinoView.ClientToScreen Method (Point)
[Missing <summary> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(System.Drawing.Point)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point ClientToScreen(
	Point clientPoint
)
Public Function ClientToScreen (
	clientPoint As Point
) As Point
Parameters
clientPoint
Type: System.Drawing.Point
[Missing <param name="clientPoint"/> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(System.Drawing.Point)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(System.Drawing.Point)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoView Class
ClientToScreen Overload
Rhino.Display Namespace