RhinoCommon SDK
ColorXYZ.CreateFromCMYK Method
 Create the nearest XYZ equivalent of a CMYK color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorXYZ CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorXYZ
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the CMYK color.
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace