RhinoCommon SDK
AnnotationObjectBase.GetTextXform Method
[Missing <summary> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.GetTextXform(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,System.Double,Rhino.Geometry.Transform@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetTextXform(
	ViewportInfo viewport,
	Transform modelTransform,
	double detailScale,
	out Transform gdiToWorld
)
Public Function GetTextXform (
	viewport As ViewportInfo,
	modelTransform As Transform,
	detailScale As Double,
	<OutAttribute> ByRef gdiToWorld As Transform
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
can be null
modelTransform
Type: Rhino.Geometry.Transform
[Missing <param name="modelTransform"/> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.GetTextXform(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,System.Double,Rhino.Geometry.Transform@)"]
detailScale
Type: System.Double
[Missing <param name="detailScale"/> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.GetTextXform(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,System.Double,Rhino.Geometry.Transform@)"]
gdiToWorld
Type: Rhino.Geometry.Transform
[Missing <param name="gdiToWorld"/> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.GetTextXform(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,System.Double,Rhino.Geometry.Transform@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.GetTextXform(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,System.Double,Rhino.Geometry.Transform@)"]
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace