RhinoCommon SDK
Surface.Trim Method
 Constructs a sub-surface that covers the specified UV trimming domain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface Trim(
	Interval u,
	Interval v
)
Public Function Trim (
	u As Interval,
	v As Interval
) As Surface
Parameters
u
Type: Rhino.Geometry.Interval
Domain of surface along U direction to include in the subsurface.
v
Type: Rhino.Geometry.Interval
Domain of surface along V direction to include in the subsurface.
Return Value
Type: Surface
SubSurface on success, null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace