RhinoCommon SDK
IStackedDialogPageService.SetGetTreeItemColor Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemColor(Rhino.UI.StackedDialogPage,System.Drawing.Color@,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetGetTreeItemColor(
	StackedDialogPage page,
	ref Color value,
	bool set
)
Sub SetGetTreeItemColor (
	page As StackedDialogPage,
	ByRef value As Color,
	set As Boolean
)
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemColor(Rhino.UI.StackedDialogPage,System.Drawing.Color@,System.Boolean)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemColor(Rhino.UI.StackedDialogPage,System.Drawing.Color@,System.Boolean)"]
set
Type: System.Boolean
[Missing <param name="set"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SetGetTreeItemColor(Rhino.UI.StackedDialogPage,System.Drawing.Color@,System.Boolean)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace