RhinoCommon API
CustomDisplay.AddPoints Method (IEnumerable<Point3d>)
 Adds a collection of black points to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddPoints(
	IEnumerable<Point3d> points
)
Public Sub AddPoints (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CustomDisplay Class
AddPoints Overload
Rhino.Display Namespace