RhinoCommon API
ContentUndoBlocker.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.ContentUndoBlocker.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ContentUndoBlocker Class
Rhino.Render Namespace