RhinoCommon API
PlugIn.GetPlugInObject Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.GetPlugInObject"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Object GetPlugInObject()
Public Overridable Function GetPlugInObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetPlugInObject"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace