RhinoCommon SDK
ChangeQueue.NotifyEndUpdates Method
 Override this when you want to be notified when change notifications have ended.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void NotifyEndUpdates()
Protected Overridable Sub NotifyEndUpdates
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace