RhinoCommon API
PointCloud.PointAt Method
 Returns the location of the point at a specific index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	int index
)
Public Function PointAt (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
The index.
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Geometry.PointCloud.PointAt(System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace