RhinoCommon API
Line.Equality Operator
 Determines whether two lines have the same value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Line a,
	Line b
)
Public Shared Operator = (
	a As Line,
	b As Line
) As Boolean
Parameters
a
Type: Rhino.Geometry.Line
A line.
b
Type: Rhino.Geometry.Line
Another line.
Return Value
Type: Boolean
true if a has the same coordinates as b; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Line Structure
Rhino.Geometry Namespace