RhinoCommon API
RenderWindow.AddWireframeChannel Method
 A wireframe channel will not be added if none of the document properties settings indicate that one is needed. In other words, Rhino will not generate an empty wireframe channel just for the fun of it.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AddWireframeChannel(
	RhinoDoc doc,
	ViewportInfo viewport,
	Size size,
	Rectangle region
)
Public Function AddWireframeChannel (
	doc As RhinoDoc,
	viewport As ViewportInfo,
	size As Size,
	region As Rectangle
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
The document to display
viewport
Type: Rhino.DocObjects.ViewportInfo
The view to display
size
Type: System.Drawing.Size
The size of the image without clipping (ie - if you have a region, it was the size of the image before you cut the region out.
region
Type: System.Drawing.Rectangle
The area of the rendering you want to display. This should match the size of the render window itself (ie - the one set using SetSize)
Return Value
Type: Boolean
Returns true if the wireframe channel was successfully added.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderWindow Class
Rhino.Render Namespace