RhinoCommon API
BinaryArchiveReader.ReadColor Method
 Reads a Color from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ReadColor()
Public Function ReadColor As Color
Return Value
Type: Color
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace