RhinoCommon API
RevSurface.CreateFromCone Method
 Constructs a new surface of revolution from the values of a cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RevSurface CreateFromCone(
	Cone cone
)
Public Shared Function CreateFromCone (
	cone As Cone
) As RevSurface
Parameters
cone
Type: Rhino.Geometry.Cone
A cone.
Return Value
Type: RevSurface
A new surface of revolution, or null if any of the inputs is invalid or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace