RhinoCommon API
ObjectTable.Replace Method (ObjRef, Circle)
Replaces one object with new curve object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	ObjRef objref,
	Circle circle
)
Public Function Replace (
	objref As ObjRef,
	circle As Circle
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
circle
Type: Rhino.Geometry.Circle
new circle to be added. The circle is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace