RhinoCommon SDK
SubDVertexSectorIterator.ResetToFirstFace Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.ResetToFirstFace"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ResetToFirstFace()
Public Function ResetToFirstFace As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.ResetToFirstFace"]
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace