RhinoCommon SDK
Dialogs.ShowMessage Method (String, String)
 Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ShowMessageResult ShowMessage(
	string message,
	string title
)
Public Shared Function ShowMessage (
	message As String,
	title As String
) As ShowMessageResult
Parameters
message
Type: System.String
Message box text content.
title
Type: System.String
Message box title text.
Return Value
Type: ShowMessageResult
One of the ShowMessageBoxResult values.
See Also
Reference
Dialogs Class
ShowMessage Overload
Rhino.UI Namespace