RhinoCommon API
Brep.DuplicateBrep Method
 Same as Duplicate(), but already performs a cast to a brep.
This cast always succeeds.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep DuplicateBrep()
Public Function DuplicateBrep As Brep
Return Value
Type: Brep
A brep.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Brep Class
Rhino.Geometry Namespace