RhinoCommon API
Font Constructor (String)
Initializes a new instance of the Font class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Font(
	string familyName
)
Public Sub New (
	familyName As String
)
Parameters
familyName
Type: System.String
[Missing <param name="familyName"/> documentation for "M:Rhino.DocObjects.Font.#ctor(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Font Class
Font Overload
Rhino.DocObjects Namespace