RhinoCommon API
SimpleArrayDouble Constructor
 Initializes a new SimpleArrayDouble instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayDouble()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
SimpleArrayDouble Class
SimpleArrayDouble Overload
Rhino.Runtime.InteropWrappers Namespace