RhinoCommon SDK
Plane.PointAt Method (Double, Double)
 Evaluate a point on the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double u,
	double v
)
Public Function PointAt (
	u As Double,
	v As Double
) As Point3d
Parameters
u
Type: System.Double
evaulation parameter.
v
Type: System.Double
evaulation parameter.
Return Value
Type: Point3d
plane.origin + u*plane.xaxis + v*plane.yaxis.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
PointAt Overload
Rhino.Geometry Namespace