RhinoCommon API
Decals.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Render.Decals.GetEnumerator"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Decal> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Decal)
Return Value
Type: IEnumerator<Decal>
[Missing <returns> documentation for "M:Rhino.Render.Decals.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Decals Class
Rhino.Render Namespace