RhinoCommon API
PersistentSettings.SetDefault Method (String, Color)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Color)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	Color value
)
Public Sub SetDefault (
	key As String,
	value As Color
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Color)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Color)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace