RhinoCommon API
RhinoViewport.GetFrustumNearPlane Method
Get near clipping plane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetFrustumNearPlane(
	out Plane plane
)
Public Function GetFrustumNearPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
 near clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the near clipping plane.
Return Value
Type: Boolean
 true if camera and frustum are valid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace