RhinoCommon API
Box.Contains Method (BoundingBox)
 Test a boundingbox for Box inclusion. This is the same as calling Contains(box,false)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	BoundingBox box
)
Public Function Contains (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to test.
Return Value
Type: Boolean
true if the box is on the inside of or coincident with this Box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace