RhinoCommon API
ArchivableDictionary.GetPlane Method (String)
 Get value as Plane, will return defaultValue unless value was created using Set(string key, Plane value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane GetPlane(
	string key
)
Public Function GetPlane (
	key As String
) As Plane
Parameters
key
Type: System.String
The key.
Return Value
Type: Plane
The value as Plane.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ArchivableDictionary Class
GetPlane Overload
Rhino.Collections Namespace