RhinoCommon API
Point2d.Addition Operator (Vector2d, Point2d)
 Adds a vector with a point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d operator +(
	Vector2d vector,
	Point2d point
)
Public Shared Operator + (
	vector As Vector2d,
	point As Point2d
) As Point2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector.
point
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
A new point that is coordinatewise summed with the vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Point2d Structure
Addition Overload
Rhino.Geometry Namespace