RhinoCommon API
BinaryArchiveWriter.WriteRenderSettings Method
 Writes a RenderSettings value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteRenderSettings(
	RenderSettings value
)
Public Sub WriteRenderSettings (
	value As RenderSettings
)
Parameters
value
Type: Rhino.Render.RenderSettings
A value to write.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace