RhinoCommon API
SimpleArrayPlane Constructor
 Initializes a new SimpleArrayLine instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayPlane()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimpleArrayPlane Class
Rhino.Runtime.InteropWrappers Namespace