RhinoCommon SDK
RenderTexture Constructor
Initializes a new instance of the RenderTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderTexture()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderTexture Class
Rhino.Render Namespace