RhinoCommon SDK
AnnotationBase.Explode Method
 Explodes this text entity into an array of curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve[] Explode()
Public Function Explode As Curve()
Return Value
Type: Curve[]
An array of curves that forms the outline or content of this text entity.
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace