RhinoCommon API
RhinoDoc.GetRenderPrimitiveList Method
 Build custom render mesh(es) for this document (ie - GH meshes).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderPrimitiveList GetRenderPrimitiveList(
	ViewportInfo viewport,
	DisplayPipelineAttributes attrs
)
Public Function GetRenderPrimitiveList (
	viewport As ViewportInfo,
	attrs As DisplayPipelineAttributes
) As RenderPrimitiveList
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
 Attributes for the view mode you are supplying meshes for. Will be null if this is a modal rendering.
Return Value
Type: RenderPrimitiveList
 Returns a RenderPrimitiveList if successful otherwise returns null.
See Also
Reference
RhinoDoc Class
Rhino Namespace