RhinoCommon API
GetCone Constructor
Initializes a new instance of the GetCone class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetCone()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace