RhinoCommon API
ObjectTable.GetSelectedObjectTypes Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectTypes"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectType GetSelectedObjectTypes()
Public Function GetSelectedObjectTypes As ObjectType
Return Value
Type: ObjectType
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectTypes"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace