RhinoCommon API
PersistentSettings.SetDefault Method (String, Char)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Char)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	char value
)
Public Sub SetDefault (
	key As String,
	value As Char
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Char)"]
value
Type: System.Char
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Char)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace