RhinoCommon SDK
Point3d.Add Method (Vector3d, Point3d)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d Add(
	Vector3d vector,
	Point3d point
)
Public Shared Function Add (
	vector As Vector3d,
	point As Point3d
) As Point3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A new point that results from the addition of point and vector.
See Also
Reference
Point3d Structure
Add Overload
Rhino.Geometry Namespace