RhinoCommon API
RenderContent.SetChildSlotParameter Method
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. Implement this function to support values being set from automatic UI sections or the texture summary. See IAutoUIExtraRequirements.h in the C++ RDK for string definitions for the parameter names.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool SetChildSlotParameter(
	string parameterName,
	string childSlotName,
	Object value,
	RenderContent.ExtraRequirementsSetContexts sc
)
Public Overridable Function SetChildSlotParameter (
	parameterName As String,
	childSlotName As String,
	value As Object,
	sc As RenderContent.ExtraRequirementsSetContexts
) As Boolean
Parameters
parameterName
Type: System.String
The parameter or field internal name to which this query applies
childSlotName
Type: System.String
The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK
value
Type: System.Object
The value to set this extra requirement parameter. You will typically use System.Convert to convert the value to the type you need
sc
Type: Rhino.Render.RenderContent.ExtraRequirementsSetContexts
The context of this operation.
Return Value
Type: Boolean
Null variant if not supported. Call the base class if you do not support the extra requirement paramter.
See Also
Reference
RenderContent Class
Rhino.Render Namespace