RhinoCommon API
ScaleValue.Dispose Method
actively reclaim native allocated ON_SacleValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ScaleValue Class
Rhino Namespace