RhinoCommon SDK
GroupTable.Add Method (String, IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	string groupName,
	IEnumerable<Guid> objectIds
)
Public Function Add (
	groupName As String,
	objectIds As IEnumerable(Of Guid)
) As Integer
Parameters
groupName
Type: System.String
Name of new group.
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
An array, a list or any enumerable set of object IDs.
Return Value
Type: Int32
 >=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks
 In some cases, calling Add() can cause the group indices to become invalid.
See Also
Reference
GroupTable Class
Add Overload
Rhino.DocObjects.Tables Namespace