RhinoCommon API
GetPoint.Constrain Method (Arc)
Constrains the picked point to lie on an arc.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Constrain(
	Arc arc
)
Public Function Constrain (
	arc As Arc
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
An arc to use as constraint.
Return Value
Type: Boolean
true if constraint could be applied.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace