RhinoCommon SDK
DisplayPipeline.DrawCurvatureGraph Method (Curve, Color, Int32, Int32, Int32)
 Draw a typical Rhino Curvature Graph.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCurvatureGraph(
	Curve curve,
	Color color,
	int hairScale,
	int hairDensity,
	int sampleDensity
)
Public Sub DrawCurvatureGraph (
	curve As Curve,
	color As Color,
	hairScale As Integer,
	hairDensity As Integer,
	sampleDensity As Integer
)
Parameters
curve
Type: Rhino.Geometry.Curve
Base curve for curvature graph.
color
Type: System.Drawing.Color
Color of curvature graph.
hairScale
Type: System.Int32
100 = true length, > 100 magnified, < 100 shortened.
hairDensity
Type: System.Int32
>= 0 larger numbers = more hairs (good default is 1).
sampleDensity
Type: System.Int32
Between 1 and 10. Higher numbers draw smoother outer curves. (good default is 2).
See Also
Reference
DisplayPipeline Class
DrawCurvatureGraph Overload
Rhino.Display Namespace