RhinoCommon API
File3dmNamedConstructionPlanes.Add Method (ConstructionPlane)
 Adds a named construction plane to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	ConstructionPlane cplane
)
Public Sub Add (
	cplane As ConstructionPlane
)
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The construction plane to add.
Implements
ICollection<T>.Add(T)
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmNamedConstructionPlanes Class
Add Overload
Rhino.FileIO Namespace