RhinoCommon API
Mesh.FileHole Method
 Given a starting "naked" edge index, this function attempts to determine a "hole" by chaining additional naked edges together until if returns to the start index. Then it triangulates the closed polygon and either adds the faces to the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FileHole(
	int topologyEdgeIndex
)
Public Function FileHole (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
Starting naked edge index.
Return Value
Type: Boolean
true if successful, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Mesh Class
Rhino.Geometry Namespace