RhinoCommon API
Vector2d Constructor
 Initializes a new instance of the vector based on two, X and Y, components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2d(
	double x,
	double y
)
Public Sub New (
	x As Double,
	y As Double
)
Parameters
x
Type: System.Double
The X (first) component.
y
Type: System.Double
The Y (second) component.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace