RhinoCommon API
Cone.ToNurbsSurface Method
 Constructs a Nurbs surface representation of this Cone. This is synonymous with calling NurbsSurface.CreateFromCone().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A Nurbs surface representation of the cone or null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Cone Structure
Rhino.Geometry Namespace