RhinoCommon SDK
UiWriteBracket.Dispose Method
Releases all resources used by the UiWriteBracket
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
UiWriteBracket Class
Rhino.UI.Controls Namespace