RhinoCommon API
ZBufferCapture.ShowAnnotations Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowAnnotations(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ShowAnnotations(
	bool on
)
Public Sub ShowAnnotations (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowAnnotations(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace