RhinoCommon API
Surface.CreateExtrusionToPoint Method
 Constructs a surface by extruding a curve to a point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Surface CreateExtrusionToPoint(
	Curve profile,
	Point3d apexPoint
)
Public Shared Function CreateExtrusionToPoint (
	profile As Curve,
	apexPoint As Point3d
) As Surface
Parameters
profile
Type: Rhino.Geometry.Curve
Profile curve to extrude.
apexPoint
Type: Rhino.Geometry.Point3d
Apex point of extrusion.
Return Value
Type: Surface
A Surface on success or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Surface Class
Rhino.Geometry Namespace