RhinoCommon SDK
Surface.IsCylinder Method (Double)
Determines if the surface is a portion of a cylinder within a given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCylinder(
	double tolerance
)
Public Function IsCylinder (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
See Also
Reference
Surface Class
IsCylinder Overload
Rhino.Geometry Namespace