RhinoCommon API
Mesh.ReleaseUnsafeLock Method
 Updates the Mesh data with the information that was stored via the MeshUnsafeLock.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ReleaseUnsafeLock(
	MeshUnsafeLock meshData
)
Public Sub ReleaseUnsafeLock (
	meshData As MeshUnsafeLock
)
Parameters
meshData
Type: Rhino.Geometry.MeshUnsafeLock
The data that will be unlocked.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Mesh Class
Rhino.Geometry Namespace