RhinoCommon SDK
Transform.CompareTo Method
 Compares this transform with another transform.
M33 has highest value, then M32, etc..
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CompareTo(
	Transform other
)
Public Function CompareTo (
	other As Transform
) As Integer
Parameters
other
Type: Rhino.Geometry.Transform
Another transform.
Return Value
Type: Int32
-1 if this < other; 0 if both are equal; 1 otherwise.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
Transform Structure
Rhino.Geometry Namespace