RhinoCommon SDK
Fonts Constructor
Initializes a new instance of the Fonts class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Fonts()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Fonts Class
Rhino.UI Namespace