RhinoCommon API
RenderContentKindList.Add Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentKindList.Add(Rhino.Render.RenderContentKind)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	RenderContentKind kind
)
Public Sub Add (
	kind As RenderContentKind
)
Parameters
kind
Type: Rhino.Render.RenderContentKind
[Missing <param name="kind"/> documentation for "M:Rhino.Render.RenderContentKindList.Add(Rhino.Render.RenderContentKind)"]
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace