RhinoCommon API
RenderTexture.GetProjectionMode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetProjectionMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual TextureProjectionMode GetProjectionMode()
Public Overridable Function GetProjectionMode As TextureProjectionMode
Return Value
Type: TextureProjectionMode
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetProjectionMode"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderTexture Class
Rhino.Render Namespace