RhinoCommon SDK
RTree.Remove Method (BoundingBox, Int32)
Removes an element from the tree.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	BoundingBox box,
	int elementId
)
Public Function Remove (
	box As BoundingBox,
	elementId As Integer
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
A bounding box.
elementId
Type: System.Int32
A number.
Return Value
Type: Boolean
true if element was successfully removed.
See Also
Reference
RTree Class
Remove Overload
Rhino.Geometry Namespace