RhinoCommon API
BinaryArchiveReader.ReadInt Method
 Reads a Int32 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ReadInt()
Public Function ReadInt As Integer
Return Value
Type: Int32
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace