RhinoCommon API
PreviewLighting Constructor
 Constructor for PreivewLighting
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewLighting(
	IntPtr pPreviewLighting
)
Public Sub New (
	pPreviewLighting As IntPtr
)
Parameters
pPreviewLighting
Type: System.IntPtr
[Missing <param name="pPreviewLighting"/> documentation for "M:Rhino.Render.PreviewLighting.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace