RhinoCommon SDK
ObjectTable.AddPointCloud Method (PointCloud, ObjectAttributes, HistoryRecord, Boolean)
Adds a point cloud object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPointCloud(
	PointCloud cloud,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddPointCloud (
	cloud As PointCloud,
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
cloud
Type: Rhino.Geometry.PointCloud
PointCloud to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point cloud. null is acceptable
history
Type: Rhino.DocObjects.HistoryRecord
history associated with this pointcloud. null is acceptable
reference
Type: System.Boolean
 true if the object is from a reference file. Reference objects do not persist in archives
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddPointCloud Overload
Rhino.DocObjects.Tables Namespace