RhinoCommon API
Sphere.NormalAt Method
 Computes the normal at a specific angular location on the sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d NormalAt(
	double longitudeRadians,
	double latitudeRadians
)
Public Function NormalAt (
	longitudeRadians As Double,
	latitudeRadians As Double
) As Vector3d
Parameters
longitudeRadians
Type: System.Double
A number within the interval [0, 2pi].
latitudeRadians
Type: System.Double
A number within the interval [-pi/2, pi/2].
Return Value
Type: Vector3d
A vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace