RhinoCommon SDK
VisualAnalysisMode.DrawMeshObject Method
 Draws one mesh. Override this method to add your custom behavior.
The default implementation does nothing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void DrawMeshObject(
	MeshObject mesh,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawMeshObject (
	mesh As MeshObject,
	pipeline As DisplayPipeline
)
Parameters
mesh
Type: Rhino.DocObjects.MeshObject
A mesh object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace