RhinoCommon API
Material.CommitChanges Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.CommitChanges"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CommitChanges()
Public Function CommitChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.CommitChanges"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Material Class
Rhino.DocObjects Namespace