RhinoCommon API
BinaryArchiveWriter.WriteByteArray Method
 Writes a list, an array, or any enumerable of Byte to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteByteArray(
	IEnumerable<byte> value
)
Public Sub WriteByteArray (
	value As IEnumerable(Of Byte)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Byte>
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace