RhinoCommon API
Dialogs.ShowSemiModal Method
Note: This API is now obsolete.
 Show a windows form that is modal in the sense that this function does not return until the form is closed, but also allows for interaction with other elements of the Rhino user interface.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public static DialogResult ShowSemiModal(
	Form form
)
<ObsoleteAttribute>
Public Shared Function ShowSemiModal (
	form As Form
) As DialogResult
Parameters
form
Type: System.Windows.Forms.Form
 The form must have buttons that are assigned to the "AcceptButton" and "CancelButton".
Return Value
Type: DialogResult
One of the System.Windows.Forms.DialogResult values.
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.4
See Also
Reference
Dialogs Class
Rhino.UI Namespace