RhinoCommon SDK
Surface.IsSphere Method
 Determines if the surface is a portion of a sphere within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSphere()
Public Function IsSphere As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a sphere.
See Also
Reference
Surface Class
IsSphere Overload
Rhino.Geometry Namespace