RhinoCommon SDK
Layer.GetDefaultLayerProperties Method
 Constructs a layer with the current default properties. The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
iges level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Layer GetDefaultLayerProperties()
Public Shared Function GetDefaultLayerProperties As Layer
Return Value
Type: Layer
A new layer instance.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace