RhinoCommon API
ArchivableDictionary.AddContentsFrom Method
 Add the contents from the source dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AddContentsFrom(
	ArchivableDictionary source
)
Public Function AddContentsFrom (
	source As ArchivableDictionary
) As Boolean
Parameters
source
Type: Rhino.Collections.ArchivableDictionary
[Missing <param name="source"/> documentation for "M:Rhino.Collections.ArchivableDictionary.AddContentsFrom(Rhino.Collections.ArchivableDictionary)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.AddContentsFrom(Rhino.Collections.ArchivableDictionary)"]
Exceptions
Exception | Condition
ArgumentException
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace