RhinoCommon API
Material.OnSwitchToNonConst Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.OnSwitchToNonConst"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
Material Class
Rhino.DocObjects Namespace