RhinoCommon API
Mesh.SplitDisjointPieces Method
 Splits up the mesh into its unconnected pieces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh[] SplitDisjointPieces()
Public Function SplitDisjointPieces As Mesh()
Return Value
Type: Mesh[]
An array containing all the disjoint pieces that make up this Mesh.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Mesh Class
Rhino.Geometry Namespace