RhinoCommon SDK
SubDVertexSectorIterator.IncrementFaceToCrease Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFaceToCrease(System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IncrementFaceToCrease(
	bool ccwForward
)
Public Function IncrementFaceToCrease (
	ccwForward As Boolean
) As Boolean
Parameters
ccwForward
Type: System.Boolean
[Missing <param name="ccwForward"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFaceToCrease(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFaceToCrease(System.Boolean)"]
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace