RhinoCommon SDK
UserDataListEnumerator Constructor
 Create new UserDataListEnumerator
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserDataListEnumerator(
	UserDataList udl
)
Public Sub New (
	udl As UserDataList
)
Parameters
udl
Type: Rhino.DocObjects.Custom.UserDataList
UserDataList to enumerate
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace