RhinoCommon API
BrepFaceList.RemoveAt Method
 Deletes a face at a specified index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveAt(
	int faceIndex
)
Public Sub RemoveAt (
	faceIndex As Integer
)
Parameters
faceIndex
Type: System.Int32
The index of the mesh face.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace