RhinoCommon API
Plane.Equals Method (Plane)
 Determines if another plane has the same components as this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Plane plane
)
Public Function Equals (
	plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
A plane.
Return Value
Type: Boolean
true if plane has the same components as this plane; false otherwise.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Plane Structure
Equals Overload
Rhino.Geometry Namespace