RhinoCommon API
BrepEdgeList.GetEnumerator Method
 Gets an enumerator that visits all edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<BrepEdge> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepEdge)
Return Value
Type: IEnumerator<BrepEdge>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace