RhinoCommon SDK
ViewportInfo Constructor
 Initializes a new instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ViewportInfo()
Public Sub New
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace