RhinoCommon API
Vector3d.Reverse Method
 Reverses this vector in place (reverses the direction).
If this vector is Invalid, no changes will occur and false will be returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Reverse()
Public Function Reverse As Boolean
Return Value
Type: Boolean
true on success or false if the vector is invalid.
Remarks
Similar to Negate, that is only provided for CLR language compliance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace