RhinoCommon SDK
RhinoGet.GetBox Method (Box, GetBoxMode, Point3d, String, String, String)
 Asks the user to select a Box in the viewport.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetBox(
	out Box box,
	GetBoxMode mode,
	Point3d basePoint,
	string prompt1,
	string prompt2,
	string prompt3
)
Public Shared Function GetBox (
	<OutAttribute> ByRef box As Box,
	mode As GetBoxMode,
	basePoint As Point3d,
	prompt1 As String,
	prompt2 As String,
	prompt3 As String
) As Result
Parameters
box
Type: Rhino.Geometry.Box
If the result is Success, this parameter will be filled out.
mode
Type: Rhino.Input.GetBoxMode
A particular "get box" mode, or All.
basePoint
Type: Rhino.Geometry.Point3d
Optional base point. Supply Point3d.Unset if you don't want to use this.
prompt1
Type: System.String
Optional first prompt. Supply null to use the default prompt.
prompt2
Type: System.String
Optional second prompt. Supply null to use the default prompt.
prompt3
Type: System.String
Optional third prompt. Supply null to use the default prompt.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
GetBox Overload
Rhino.Input Namespace