RhinoCommon SDK
ToolbarFile.Save Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.Save"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Save()
Public Function Save As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.Save"]
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace