RhinoCommon API
DisplayPipeline.PopCullFaceMode Method
 Pop a FaceCull flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PopCullFaceMode()
Public Sub PopCullFaceMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace