RhinoCommon API
DisplayBitmap.Finalize Method
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace