RhinoCommon SDK
ControlPoint.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EpsilonEquals(
	ControlPoint other,
	double epsilon
)
Public Function EpsilonEquals (
	other As ControlPoint,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.ControlPoint
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.ControlPoint.EpsilonEquals(Rhino.Geometry.ControlPoint,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.ControlPoint.EpsilonEquals(Rhino.Geometry.ControlPoint,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.ControlPoint.EpsilonEquals(Rhino.Geometry.ControlPoint,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace