RhinoCommon SDK
ZBufferCapture Constructor
Initializes a new instance of the ZBufferCapture class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ZBufferCapture(
	RhinoViewport viewport
)
Public Sub New (
	viewport As RhinoViewport
)
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Display.ZBufferCapture.#ctor(Rhino.Display.RhinoViewport)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace