RhinoCommon API
GetBaseClass Constructor
Initializes a new instance of the GetBaseClass class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected GetBaseClass()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace