RhinoCommon API
RenderContent.ChildSlotOn Method
 Gets the on-ness property for the texture in the specified child slot.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ChildSlotOn(
	string childSlotName
)
Public Function ChildSlotOn (
	childSlotName As String
) As Boolean
Parameters
childSlotName
Type: System.String
Child slot name for the child
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.ChildSlotOn(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContent Class
Rhino.Render Namespace