RhinoCommon API
RenderPipeline.Dispose Method
Releases all resources used by the RenderPipeline
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderPipeline Class
Dispose Overload
Rhino.Render Namespace