RhinoCommon SDK
CachedTextureCoordinates.Add Method
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Point3d item
)
Public Sub Add (
	item As Point3d
)
Parameters
item
Type: Rhino.Geometry.Point3d
[Missing <param name="item"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.Add(Rhino.Geometry.Point3d)"]
Implements
ICollection<T>.Add(T)
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace