RhinoCommon SDK
ViewportInfo.GetCameraFrame Method
 Gets location and vectors of this camera.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetCameraFrame(
	out Point3d location,
	out Vector3d cameraX,
	out Vector3d cameraY,
	out Vector3d cameraZ
)
Public Function GetCameraFrame (
	<OutAttribute> ByRef location As Point3d,
	<OutAttribute> ByRef cameraX As Vector3d,
	<OutAttribute> ByRef cameraY As Vector3d,
	<OutAttribute> ByRef cameraZ As Vector3d
) As Boolean
Parameters
location
Type: Rhino.Geometry.Point3d
An out parameter that will be filled with a point during the call.
cameraX
Type: Rhino.Geometry.Vector3d
An out parameter that will be filled with the X vector during the call.
cameraY
Type: Rhino.Geometry.Vector3d
An out parameter that will be filled with the Y vector during the call.
cameraZ
Type: Rhino.Geometry.Vector3d
An out parameter that will be filled with the Z vector during the call.
Return Value
Type: Boolean
true if current camera orientation is valid; otherwise false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace