RhinoCommon API
Brep.DuplicateSubBrep Method
 Copy a subset of this Brep into another Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep DuplicateSubBrep(
	IEnumerable<int> faceIndices
)
Public Function DuplicateSubBrep (
	faceIndices As IEnumerable(Of Integer)
) As Brep
Parameters
faceIndices
Type: System.Collections.Generic.IEnumerable<Int32>
 array of face indices in this brep to copy. (If any values in faceIndices are out of range or if faceIndices contains duplicates, this function will return null.)
Return Value
Type: Brep
A brep, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Brep Class
Rhino.Geometry Namespace