RhinoCommon API
Circle.Reverse Method
 Reverse the orientation of the circle. Changes the domain from [a,b] to [-b,-a].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Reverse()
Public Sub Reverse
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Circle Structure
Rhino.Geometry Namespace