RhinoCommon API
BinaryArchiveReader.ReadVector3f Method
 Reads a Vector3f from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3f ReadVector3f()
Public Function ReadVector3f As Vector3f
Return Value
Type: Vector3f
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace