RhinoCommon API
RenderContent.GetChildSlotParameter Method
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. Implement this function to specify additional functionality for automatic UI sections or the texture summary. See IAutoUIExtraRequirements.h in the C++ RDK for string definitions for the parameter names.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Object GetChildSlotParameter(
	string parameterName,
	string childSlotName
)
Public Overridable Function GetChildSlotParameter (
	parameterName As String,
	childSlotName As String
) As Object
Parameters
parameterName
Type: System.String
The parameter or field internal name to which this query applies
childSlotName
Type: System.String
The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK
Return Value
Type: Object
 Call the base class if you do not support the extra requirement parameter. Current supported return values are (int, bool, float, double, string, Guid, Color, Vector3d, Point3d, DateTime)
See Also
Reference
RenderContent Class
Rhino.Render Namespace