RhinoCommon API
CustomDisplay.AddVector Method (Point3d, Vector3d)
 Adds a new, black vector to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddVector(
	Point3d anchor,
	Vector3d span
)
Public Sub AddVector (
	anchor As Point3d,
	span As Vector3d
)
Parameters
anchor
Type: Rhino.Geometry.Point3d
Anchor point of vector.
span
Type: Rhino.Geometry.Vector3d
Direction and magnitude of vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
CustomDisplay Class
AddVector Overload
Rhino.Display Namespace