RhinoCommon API
MeshTextureCoordinateList.Add Method (Point3d)
 Adds a new texture coordinate to the end of the Texture list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	Point3d tc
)
Public Function Add (
	tc As Point3d
) As Integer
Parameters
tc
Type: Rhino.Geometry.Point3d
Texture coordinate to add.
Return Value
Type: Int32
The index of the newly added texture coordinate.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshTextureCoordinateList Class
Add Overload
Rhino.Geometry.Collections Namespace