RhinoCommon API
HistoryRecord.SetInts Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetInts(
	int id,
	IEnumerable<int> values
)
Public Function SetInts (
	id As Integer,
	values As IEnumerable(Of Integer)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
values
Type: System.Collections.Generic.IEnumerable<Int32>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace