RhinoCommon API
TransformObjectList.GripArray Method
 Gets access to the GripObject array of the TransformObjectList object.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GripObject[] GripArray()
Public Function GripArray As GripObject()
Return Value
Type: GripObject[]
An array of GripObjects, empty if there were no GripObjects
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace