RhinoCommon API
MeshFaceList.DeleteFaces Method (IEnumerable<Int32>, Boolean)
 Removes a collection of faces from the mesh without affecting the remaining geometry.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DeleteFaces(
	IEnumerable<int> faceIndexes,
	bool compact
)
Public Function DeleteFaces (
	faceIndexes As IEnumerable(Of Integer),
	compact As Boolean
) As Integer
Parameters
faceIndexes
Type: System.Collections.Generic.IEnumerable<Int32>
An array containing all the face indices to be removed.
compact
Type: System.Boolean
No longer used.
Return Value
Type: Int32
The number of faces deleted on success.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshFaceList Class
DeleteFaces Overload
Rhino.Geometry.Collections Namespace