RhinoCommon API
BrepFace.DuplicateSurface Method
 Gets a copy to the untrimmed surface that this face is based on.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface DuplicateSurface()
Public Function DuplicateSurface As Surface
Return Value
Type: Surface
A copy of this face's underlying surface.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace