RhinoCommon SDK
Point2d.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EpsilonEquals(
	Point2d other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Point2d,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Point2d
epsilon
Type: System.Double
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Point2d.EpsilonEquals(Rhino.Geometry.Point2d,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace