RhinoCommon SDK
SubDVertexSectorIterator.Dispose Method
Releases all resources used by the SubDVertexSectorIterator
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace