RhinoCommon SDK
SubDFacePtr.AddEdgeFaceConnection Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.AddEdgeFaceConnection(Rhino.Geometry.SubDEdgePtr,System.Boolean,System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AddEdgeFaceConnection(
	SubDEdgePtr edge,
	bool flipped,
	int index
)
Public Function AddEdgeFaceConnection (
	edge As SubDEdgePtr,
	flipped As Boolean,
	index As Integer
) As Boolean
Parameters
edge
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="edge"/> documentation for "M:Rhino.Geometry.SubDFacePtr.AddEdgeFaceConnection(Rhino.Geometry.SubDEdgePtr,System.Boolean,System.Int32)"]
flipped
Type: System.Boolean
[Missing <param name="flipped"/> documentation for "M:Rhino.Geometry.SubDFacePtr.AddEdgeFaceConnection(Rhino.Geometry.SubDEdgePtr,System.Boolean,System.Int32)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDFacePtr.AddEdgeFaceConnection(Rhino.Geometry.SubDEdgePtr,System.Boolean,System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.AddEdgeFaceConnection(Rhino.Geometry.SubDEdgePtr,System.Boolean,System.Int32)"]
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace