RhinoCommon SDK
IRhRdkThumbnail.IsHot Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.IsHot"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool IsHot()
Function IsHot As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.IsHot"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls Namespace