RhinoCommon API
StringHolder.Dispose Method (Boolean)
 Called by Dispose and finalizer
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
StringHolder Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace