RhinoCommon API
Curve.CreateBooleanIntersection Method (Curve, Curve)
 Calculates the boolean intersection of two closed, planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve[] CreateBooleanIntersection(
	Curve curveA,
	Curve curveB
)
Public Shared Function CreateBooleanIntersection (
	curveA As Curve,
	curveB As Curve
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
curveB
Type: Rhino.Geometry.Curve
The second closed, planar curve.
Return Value
Type: Curve[]
Result curves on success, empty array if no intersection could be calculated.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.3
See Also
Reference
Curve Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace