RhinoCommon API
ViewCaptureWriter.DrawCircle Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawCircle(
	PointF center,
	float diameter,
	Color fillColor,
	float strokeWidth,
	Color strokeColor
)
Protected MustOverride Sub DrawCircle (
	center As PointF,
	diameter As Single,
	fillColor As Color,
	strokeWidth As Single,
	strokeColor As Color
)
Parameters
center
Type: System.Drawing.PointF
[Missing <param name="center"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
diameter
Type: System.Single
[Missing <param name="diameter"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
strokeWidth
Type: System.Single
[Missing <param name="strokeWidth"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawCircle(System.Drawing.PointF,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace