RhinoCommon API
Point3f.Transform Method
 Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Transform(
	Transform xform
)
Public Sub Transform (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace