RhinoCommon API
Sphere.FitSphereToPoints Method
 Attempts to fit a sphere to a collection of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Sphere FitSphereToPoints(
	IEnumerable<Point3d> points
)
Public Shared Function FitSphereToPoints (
	points As IEnumerable(Of Point3d)
) As Sphere
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to fit. The collection must contain at least two points.
Return Value
Type: Sphere
The Sphere that best approximates the points or Sphere.Unset on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace