RhinoCommon SDK
ClassArrayObjRef Constructor (IEnumerable<ObjRef>)
 Initializes a new instances from a set of ObjRefs
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ClassArrayObjRef(
	IEnumerable<ObjRef> objrefs
)
Public Sub New (
	objrefs As IEnumerable(Of ObjRef)
)
Parameters
objrefs
Type: System.Collections.Generic.IEnumerable<ObjRef>
An array, a list or any enumerable set of Rhino object references.
See Also
Reference
ClassArrayObjRef Class
ClassArrayObjRef Overload
Rhino.Runtime.InteropWrappers Namespace