RhinoCommon SDK
BinaryArchiveReader.ReadMeshingParameters Method
 Reads a MeshingParameters from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshingParameters ReadMeshingParameters()
Public Function ReadMeshingParameters As MeshingParameters
Return Value
Type: MeshingParameters
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace