RhinoCommon API
Point3dList Constructor (IEnumerable<Point3d>)
 Initializes a new point list by copying the values from another set.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList(
	IEnumerable<Point3d> collection
)
Public Sub New (
	collection As IEnumerable(Of Point3d)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Point3d>
The collection to copy from.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Point3dList Class
Point3dList Overload
Rhino.Collections Namespace