RhinoCommon API
Vector3d.ToString Method
 Returns the string representation of the current vector, in the form X,Y,Z.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string with the current location of the point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace