RhinoCommon API
Point2d.Multiply Method (Point2d, Double)
 Multiplies a Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d Multiply(
	Point2d point,
	double t
)
Public Shared Function Multiply (
	point As Point2d,
	t As Double
) As Point2d
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point2d
A new point that is coordinatewise multiplied by t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Point2d Structure
Multiply Overload
Rhino.Geometry Namespace