RhinoCommon API
RenderMaterial.GetTextureOnFromUsage Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.GetTextureOnFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetTextureOnFromUsage(
	RenderMaterial.StandardChildSlots which
)
Public Function GetTextureOnFromUsage (
	which As RenderMaterial.StandardChildSlots
) As Boolean
Parameters
which
Type: Rhino.Render.RenderMaterial.StandardChildSlots
[Missing <param name="which"/> documentation for "M:Rhino.Render.RenderMaterial.GetTextureOnFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.GetTextureOnFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace