RhinoCommon SDK
Mesh.PullPointsToMesh Method
 Pulls a collection of points to a mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] PullPointsToMesh(
	IEnumerable<Point3d> points
)
Public Function PullPointsToMesh (
	points As IEnumerable(Of Point3d)
) As Point3d()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
An array, a list or any enumerable set of points.
Return Value
Type: Point3d[]
An array of points. This can be empty.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace