RhinoCommon API
ColorHSL.CreateFromCMYK Method
 Create the nearest HSL equivalent of a CMYK color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorHSL CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorHSL
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorHSL
The HSL equivalent of the CMYK color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace