RhinoCommon SDK
SubDVertexPtr.EdgesTaggedCount Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgesTaggedCount(Rhino.Geometry.SubD.SubDEdgeTag)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int EdgesTaggedCount(
	SubD.SubDEdgeTag edgeTag
)
Public Function EdgesTaggedCount (
	edgeTag As SubD.SubDEdgeTag
) As Integer
Parameters
edgeTag
Type: Rhino.Geometry.SubD.SubDEdgeTag
[Missing <param name="edgeTag"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgesTaggedCount(Rhino.Geometry.SubD.SubDEdgeTag)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgesTaggedCount(Rhino.Geometry.SubD.SubDEdgeTag)"]
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace