RhinoCommon API
PolyCurve.SegmentDomain Method
 Returns the polycurve subdomain assigned to a segment curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval SegmentDomain(
	int segmentIndex
)
Public Function SegmentDomain (
	segmentIndex As Integer
) As Interval
Parameters
segmentIndex
Type: System.Int32
Index of segment.
Return Value
Type: Interval
 The polycurve subdomain assigned to a segment curve. Returns Interval.Unset if segment_index < 0 or segment_index >= Count().
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace