RhinoCommon API
Mesh.ExtractNonManifoldEdges Method
 Extracts, or removes, non-manifold mesh edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh ExtractNonManifoldEdges(
	bool selective
)
Public Function ExtractNonManifoldEdges (
	selective As Boolean
) As Mesh
Parameters
selective
Type: System.Boolean
If true, then extract hanging faces only.
Return Value
Type: Mesh
A mesh containing the extracted non-manifold parts if successful, null otherwise.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Mesh Class
Rhino.Geometry Namespace