RhinoCommon API
Mesh.CreateRefinedCatmullClarkMesh Method
 Instantiates a new mesh that represents a Catmull-Clark subdivision of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateRefinedCatmullClarkMesh(
	Mesh mesh,
	RefinementSettings settings = null
)
Public Shared Function CreateRefinedCatmullClarkMesh (
	mesh As Mesh,
	Optional settings As RefinementSettings = Nothing
) As Mesh
Parameters
mesh
Type: Rhino.Geometry.Mesh
The mesh to subdivide.
settings (Optional)
Type: Rhino.Geometry.MeshRefinements.RefinementSettings
An instance of the settings class, or null for defaults.
Return Value
Type: Mesh
A new mesh. null is never returned.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Mesh Class
Rhino.Geometry Namespace