RhinoCommon API
TextLog.PrintWrappedText Method
 Send text wrapped at a set line length
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PrintWrappedText(
	string text,
	int lineLength
)
Public Sub PrintWrappedText (
	text As String,
	lineLength As Integer
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.FileIO.TextLog.PrintWrappedText(System.String,System.Int32)"]
lineLength
Type: System.Int32
[Missing <param name="lineLength"/> documentation for "M:Rhino.FileIO.TextLog.PrintWrappedText(System.String,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
TextLog Class
Rhino.FileIO Namespace