RhinoCommon API
BrepFace.DuplicateFace Method
 Duplicate a face from the brep to create new single face brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep DuplicateFace(
	bool duplicateMeshes
)
Public Function DuplicateFace (
	duplicateMeshes As Boolean
) As Brep
Parameters
duplicateMeshes
Type: System.Boolean
If true, shading meshes will be copied as well.
Return Value
Type: Brep
A new single-face brep synonymous with the current Face.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace