RhinoCommon API
PersistentSettings.SetSize Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetSize(System.String,System.Drawing.Size)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetSize(
	string key,
	Size value
)
Public Sub SetSize (
	key As String,
	value As Size
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetSize(System.String,System.Drawing.Size)"]
value
Type: System.Drawing.Size
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetSize(System.String,System.Drawing.Size)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PersistentSettings Class
Rhino Namespace