RhinoCommon API
SimpleArrayGuid.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
SimpleArrayGuid Class
Rhino.Runtime.InteropWrappers Namespace