RhinoCommon API
NurbsCurvePointList.Contains Method
 Determines if this list contains an item.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	ControlPoint item
)
Public Function Contains (
	item As ControlPoint
) As Boolean
Parameters
item
Type: Rhino.Geometry.ControlPoint
The exact item to search for.
Return Value
Type: Boolean
A boolean value.
Implements
ICollection<T>.Contains(T)
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace