RhinoCommon SDK
BinaryArchiveReader.ReadSByte Method
 Reads a SByte from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sbyte ReadSByte()
Public Function ReadSByte As SByte
Return Value
Type: SByte
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace