RhinoCommon API
RenderEnvironment.NewBasicEnvironment Method
 Constructs a new RenderEnvironment from a SimulatedEnvironment.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderEnvironment NewBasicEnvironment(
	SimulatedEnvironment environment
)
Public Shared Function NewBasicEnvironment (
	environment As SimulatedEnvironment
) As RenderEnvironment
Parameters
environment
Type: Rhino.Render.SimulatedEnvironment
The environment to create the basic environment from.
Return Value
Type: RenderEnvironment
A new basic environment.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace