RhinoCommon API
GetCylinder.Get Method
 Perform the 'get' operation.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result Get(
	out Cylinder cylinder
)
Public Function Get (
	<OutAttribute> ByRef cylinder As Cylinder
) As Result
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
[Missing <param name="cylinder"/> documentation for "M:Rhino.Input.Custom.GetCylinder.Get(Rhino.Geometry.Cylinder@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetCylinder.Get(Rhino.Geometry.Cylinder@)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace