RhinoCommon API
ArchivableDictionary.Set Method (String, Double)
 Sets a Double.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	double val
)
Public Function Set (
	key As String,
	val As Double
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.Double
A Double.
Because Double has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace