RhinoCommon SDK
Curve.SetEndPoint Method
Forces the curve to end at a specified point. Not all curve types support this operation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetEndPoint(
	Point3d point
)
Public Function SetEndPoint (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
New end point of curve.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
Some end points cannot be moved. Be sure to check return code
See Also
Reference
Curve Class
Rhino.Geometry Namespace