RhinoCommon SDK
ObjectTable.UnselectAll Method (Boolean)
Unselect objects.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int UnselectAll(
	bool ignorePersistentSelections
)
Public Function UnselectAll (
	ignorePersistentSelections As Boolean
) As Integer
Parameters
ignorePersistentSelections
Type: System.Boolean
 if true, then objects that are persistently selected will not be unselected.
Return Value
Type: Int32
Number of object that were unselected.
See Also
Reference
ObjectTable Class
UnselectAll Overload
Rhino.DocObjects.Tables Namespace