RhinoCommon API
RdkUndoRecord Constructor
 Constructor for RdkUndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RdkUndoRecord(
	IntPtr pUndoRecord
)
Public Sub New (
	pUndoRecord As IntPtr
)
Parameters
pUndoRecord
Type: System.IntPtr
[Missing <param name="pUndoRecord"/> documentation for "M:Rhino.Render.RdkUndoRecord.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RdkUndoRecord Class
Rhino.Render Namespace