RhinoCommon API
BoundingBox.ClosestPoint Method (Point3d)
 Finds the closest point on or in the boundingbox.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClosestPoint(
	Point3d point
)
Public Function ClosestPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Sample point.
Return Value
Type: Point3d
The point on or in the box that is closest to the sample point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
BoundingBox Structure
ClosestPoint Overload
Rhino.Geometry Namespace