RhinoCommon API
Mesh.CopyFrom Method
 Copies mesh values into this mesh from another mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void CopyFrom(
	Mesh other
)
Public Sub CopyFrom (
	other As Mesh
)
Parameters
other
Type: Rhino.Geometry.Mesh
The other mesh to copy from.
Exceptions
Exception | Condition
ArgumentNullException | If other is null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Mesh Class
Rhino.Geometry Namespace