RhinoCommon SDK
BinaryArchiveReader.ReadSingleArray Method
 Reads an array of Single from the archive.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float[] ReadSingleArray()
Public Function ReadSingleArray As Single()
Return Value
Type: Single[]
The array that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace