RhinoCommon SDK
ReplayHistoryResult.UpdateToPolyline Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToPolyline(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes
)
Public Function UpdateToPolyline (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="points"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace