RhinoCommon API
BrepFaceList.SplitKinkyFaces Method
 Splits any faces with creases into G1 pieces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SplitKinkyFaces()
Public Function SplitKinkyFaces As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Remarks
If you need to detect whether splitting occured, compare the before and after values of Faces.Count
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BrepFaceList Class
SplitKinkyFaces Overload
Rhino.Geometry.Collections Namespace