RhinoCommon API
RhinoObject.GetActiveVisualAnalysisModes Method
 Gets a list of currently enabled analysis modes for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public VisualAnalysisMode[] GetActiveVisualAnalysisModes()
Public Function GetActiveVisualAnalysisModes As VisualAnalysisMode()
Return Value
Type: VisualAnalysisMode[]
An array of visual analysis modes. The array can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace