RhinoCommon API
Curve.IsLinear Method (Double)
 Test a curve to see if it is linear to within the custom tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsLinear(
	double tolerance
)
Public Function IsLinear (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use when checking linearity.
Return Value
Type: Boolean
 true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve ends is <= tolerance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Curve Class
IsLinear Overload
Rhino.Geometry Namespace