RhinoCommon API
LinetypeTable.FindName Method
Finds the linetype with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype FindName(
	string name
)
Public Function FindName (
	name As String
) As Linetype
Parameters
name
Type: System.String
The name.
Return Value
Type: Linetype
 A linetype, or null if the name does not exist.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace