RhinoCommon API
SnapShotsClient.SupportsObjects Method
 Returns true if the client saves/restores object user data.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool SupportsObjects()
Public MustOverride Function SupportsObjects As Boolean
Return Value
Type: Boolean
true if the client saves/restores object user data.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace