RhinoCommon API
SupportOptions.CombineEditors Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.CombineEditors"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool CombineEditors()
Public Shared Function CombineEditors As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.CombineEditors"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SupportOptions Class
Rhino.Render Namespace