RhinoCommon API
RenderContent.RenderHashExclude Method (TextureRenderHashFlags, String)
 As RenderHash, but ignore parameter names given.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RenderHashExclude(
	TextureRenderHashFlags flags,
	string excludeParameterNames
)
Public Function RenderHashExclude (
	flags As TextureRenderHashFlags,
	excludeParameterNames As String
) As UInteger
Parameters
flags
Type: Rhino.Render.TextureRenderHashFlags
Flags to ignore
excludeParameterNames
Type: System.String
semicolon-delimited string
Return Value
Type: UInt32
Render hash
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderContent Class
RenderHashExclude Overload
Rhino.Render Namespace