RhinoCommon SDK
ObjectTable.Select Method (Guid, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Select(
	Guid objectId,
	bool select,
	bool syncHighlight,
	bool persistentSelect,
	bool ignoreGripsState,
	bool ignoreLayerLocking,
	bool ignoreLayerVisibility
)
Public Function Select (
	objectId As Guid,
	select As Boolean,
	syncHighlight As Boolean,
	persistentSelect As Boolean,
	ignoreGripsState As Boolean,
	ignoreLayerLocking As Boolean,
	ignoreLayerVisibility As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to select.
select
Type: System.Boolean
If true, the object will be selected, if false, it will be deselected.
syncHighlight
Type: System.Boolean
 If true, then the object is highlighted if it is selected and unhighlighted if is is not selected.
persistentSelect
Type: System.Boolean
 Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState
Type: System.Boolean
 If true, then objects with grips on can be selected. If false, then the value returned by the object's IsSelectableWithGripsOn() function decides if the object can be selected when it has grips turned on.
ignoreLayerLocking
Type: System.Boolean
 If true, then objects on locked layers can be selected.
ignoreLayerVisibility
Type: System.Boolean
 If true, then objects on hidden layers can be selectable.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace