RhinoCommon SDK
BrepFaceList.SplitKinkyFaces Method (Double)
 Splits any faces with creases into G1 pieces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SplitKinkyFaces(
	double kinkTolerance
)
Public Function SplitKinkyFaces (
	kinkTolerance As Double
) As Boolean
Parameters
kinkTolerance
Type: System.Double
Tolerance (in radians) to use for crease detection.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
If you need to detect whether splitting occured, compare the before and after values of Faces.Count
See Also
Reference
BrepFaceList Class
SplitKinkyFaces Overload
Rhino.Geometry.Collections Namespace