RhinoCommon API
PointCloud Constructor (IEnumerable<Point3d>)
 Initializes a new instance of the PointCloud class, copying the content from a set of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloud(
	IEnumerable<Point3d> points
)
Public Sub New (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list or an array of Point3d, or any object that implements IEnumerable<T>.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace