RhinoCommon SDK
SubDVertexPtr.EdgeAt Method (Int32)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeAt(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr EdgeAt(
	int index
)
Public Function EdgeAt (
	index As Integer
) As SubDEdgePtr
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeAt(System.Int32)"]
Return Value
Type: SubDEdgePtr
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeAt(System.Int32)"]
See Also
Reference
SubDVertexPtr Structure
EdgeAt Overload
Rhino.Geometry Namespace