RhinoCommon SDK
File3dmStringTable.SetString Method (String, String)
 Adds or sets a a document string in the 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SetString(
	string key,
	string value
)
Public Function SetString (
	key As String,
	value As String
) As String
Parameters
key
Type: System.String
The key.
value
Type: System.String
The entry value.
Return Value
Type: String
 The previous value if successful.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmStringTable Class
SetString Overload
Rhino.FileIO Namespace