RhinoCommon API
BinaryArchiveWriter.WritePoint3f Method
 Writes a Point3f value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WritePoint3f(
	Point3f value
)
Public Sub WritePoint3f (
	value As Point3f
)
Parameters
value
Type: Rhino.Geometry.Point3f
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace