RhinoCommon API
MostRecentCommandDescription Constructor
Initializes a new instance of the MostRecentCommandDescription class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MostRecentCommandDescription()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace