RhinoCommon API
Line.Equals Method (Line)
 Determines whether a line has the same value as this line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Line other
)
Public Function Equals (
	other As Line
) As Boolean
Parameters
other
Type: Rhino.Geometry.Line
A line.
Return Value
Type: Boolean
true if other has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Line Structure
Equals Overload
Rhino.Geometry Namespace