RhinoCommon API
Linetype Constructor
Initializes a new instance of the Linetype class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Linetype Class
Linetype Overload
Rhino.DocObjects Namespace