RhinoCommon API
SupportOptions.SetAutoSaveRenderings Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetAutoSaveRenderings(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetAutoSaveRenderings(
	bool b
)
Public Shared Sub SetAutoSaveRenderings (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetAutoSaveRenderings(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SupportOptions Class
Rhino.Render Namespace