RhinoCommon SDK
IPanelsService.OpenPanelAsSibling Method (Guid, Guid, Boolean)
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool OpenPanelAsSibling(
	Guid panelId,
	Guid siblingPanelId,
	bool makeSelectedTab
)
Function OpenPanelAsSibling (
	panelId As Guid,
	siblingPanelId As Guid,
	makeSelectedTab As Boolean
) As Boolean
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid,System.Boolean)"]
siblingPanelId
Type: System.Guid
[Missing <param name="siblingPanelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid,System.Boolean)"]
makeSelectedTab
Type: System.Boolean
[Missing <param name="makeSelectedTab"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.OpenPanelAsSibling(System.Guid,System.Guid,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IPanelsService Interface
OpenPanelAsSibling Overload
Rhino.UI Namespace