RhinoCommon API
WorldMapDayNight.Map Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.Map"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Image Map()
Public Function Map As Image
Return Value
Type: Image
[Missing <returns> documentation for "M:Rhino.Render.UI.WorldMapDayNight.Map"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace