RhinoCommon API
IPanel.PanelShown Method (UInt32)
[Missing <summary> documentation for "M:Rhino.UI.IPanel.PanelShown(System.UInt32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void PanelShown(
	uint documentSerialNumber
)
Sub PanelShown (
	documentSerialNumber As UInteger
)
Parameters
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanel.PanelShown(System.UInt32)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
IPanel Interface
PanelShown Overload
Rhino.UI Namespace