RhinoCommon API
BinaryArchiveReader.ReadPoint4d Method
 Reads a Point4d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point4d ReadPoint4d()
Public Function ReadPoint4d As Point4d
Return Value
Type: Point4d
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace