RhinoCommon SDK
BinaryArchiveReader.ReadShortArray Method
 Reads an array of Int16 from the archive.
An array is returned even if the input was another enumerable type.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public short[] ReadShortArray()
Public Function ReadShortArray As Short()
Return Value
Type: Int16[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace