RhinoCommon API
BinaryArchiveReader.ReadTransform Method
 Reads a Transform from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform ReadTransform()
Public Function ReadTransform As Transform
Return Value
Type: Transform
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace