RhinoCommon SDK
SubDEdgePtr.FaceAt Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDEdgePtr.FaceAt(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacePtr FaceAt(
	int index
)
Public Function FaceAt (
	index As Integer
) As SubDFacePtr
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.FaceAt(System.Int32)"]
Return Value
Type: SubDFacePtr
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgePtr.FaceAt(System.Int32)"]
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace