RhinoCommon API
PersistentSettings.GetString Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetString(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetString(
	string key
)
Public Function GetString (
	key As String
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetString(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetString(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PersistentSettings Class
GetString Overload
Rhino Namespace