RhinoCommon SDK
File3dm.IsValid Method (TextLog)
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid(
	TextLog errors
)
Public Function IsValid (
	errors As TextLog
) As Boolean
Parameters
errors
Type: Rhino.FileIO.TextLog
 No errors are found.
Return Value
Type: Boolean
>true in any case.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
File3dm Class
IsValid Overload
Rhino.FileIO Namespace