RhinoCommon API
CustomGripObject.NewLocation Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomGripObject.NewLocation"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void NewLocation()
Public Overridable Sub NewLocation
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace