RhinoCommon API
SupportOptions.SetCustomLibraryPath Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetCustomLibraryPath(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetCustomLibraryPath(
	string path
)
Public Shared Sub SetCustomLibraryPath (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetCustomLibraryPath(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SupportOptions Class
Rhino.Render Namespace