RhinoCommon API
SimpleArrayExtrusionPointer.ConstPointer Method
 Gets the const (immutable) pointer of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The const pointer.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace