RhinoCommon SDK
Vector2d.Equals Method (Object)
 Determines whether the specified System.Object is a Vector2d and has the same value as the present vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The specified object.
Return Value
Type: Boolean
true if obj is Vector2d and has the same components as this; otherwise false.
See Also
Reference
Vector2d Structure
Equals Overload
Rhino.Geometry Namespace