RhinoCommon SDK
RhinoView.SpeedTest Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoView.SpeedTest(System.Int32,System.Boolean,System.Int32,System.Double)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SpeedTest(
	int frameCount,
	bool freezeDrawList,
	int direction,
	double angleDeltaRadians
)
Public Function SpeedTest (
	frameCount As Integer,
	freezeDrawList As Boolean,
	direction As Integer,
	angleDeltaRadians As Double
) As Double
Parameters
frameCount
Type: System.Int32
[Missing <param name="frameCount"/> documentation for "M:Rhino.Display.RhinoView.SpeedTest(System.Int32,System.Boolean,System.Int32,System.Double)"]
freezeDrawList
Type: System.Boolean
[Missing <param name="freezeDrawList"/> documentation for "M:Rhino.Display.RhinoView.SpeedTest(System.Int32,System.Boolean,System.Int32,System.Double)"]
direction
Type: System.Int32
[Missing <param name="direction"/> documentation for "M:Rhino.Display.RhinoView.SpeedTest(System.Int32,System.Boolean,System.Int32,System.Double)"]
angleDeltaRadians
Type: System.Double
[Missing <param name="angleDeltaRadians"/> documentation for "M:Rhino.Display.RhinoView.SpeedTest(System.Int32,System.Boolean,System.Int32,System.Double)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Display.RhinoView.SpeedTest(System.Int32,System.Boolean,System.Int32,System.Double)"]
See Also
Reference
RhinoView Class
Rhino.Display Namespace