RhinoCommon SDK
IRhRdkThumbnailList.Add Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Add(Rhino.UI.Controls.Thumbnail)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void Add(
	Thumbnail t
)
Sub Add (
	t As Thumbnail
)
Parameters
t
Type: Rhino.UI.Controls.Thumbnail
[Missing <param name="t"/> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Add(Rhino.UI.Controls.Thumbnail)"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace