RhinoCommon API
Thumbnail.IsHot Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.IsHot"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsHot()
Public Function IsHot As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.IsHot"]
Implements
IRhRdkThumbnail.IsHot()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace