RhinoCommon API
DisplayPipeline.DrawCurvatureGraph Method (Curve, Color)
 Draw a typical Rhino Curvature Graph.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawCurvatureGraph(
	Curve curve,
	Color color
)
Public Sub DrawCurvatureGraph (
	curve As Curve,
	color As Color
)
Parameters
curve
Type: Rhino.Geometry.Curve
Base curve for curvature graph.
color
Type: System.Drawing.Color
Color of curvature graph.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipeline Class
DrawCurvatureGraph Overload
Rhino.Display Namespace