RhinoCommon SDK
ObjectAttributes Constructor
Initializes a new instance of the ObjectAttributes class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectAttributes()
Public Sub New
See Also
Reference
ObjectAttributes Class
ObjectAttributes Overload
Rhino.DocObjects Namespace