RhinoCommon API
GetBaseClass.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace