RhinoCommon API
BitmapEntry.Save Method
[Missing <summary> documentation for "M:Rhino.DocObjects.BitmapEntry.Save(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Save(
	string fileName
)
Public Function Save (
	fileName As String
) As Boolean
Parameters
fileName
Type: System.String
[Missing <param name="fileName"/> documentation for "M:Rhino.DocObjects.BitmapEntry.Save(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.BitmapEntry.Save(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace