RhinoCommon API
RhinoApp.SetFocusToMainWindow Method (RhinoDoc)
 Sets the focus to the main windows for a given document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetFocusToMainWindow(
	RhinoDoc doc
)
Public Shared Sub SetFocusToMainWindow (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
 the document to use for determing a "main window"
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoApp Class
SetFocusToMainWindow Overload
Rhino Namespace