RhinoCommon API
Vector3f.UnaryNegation Operator
 Computes the opposite vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f operator -(
	Vector3f vector
)
Public Shared Operator - (
	vector As Vector3f
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3f
A vector to negate.
Return Value
Type: Vector3f
A new vector where all components were multiplied by -1.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace