RhinoCommon API
Curve.JoinCurves Method (IEnumerable<Curve>)
 Joins a collection of curve segments together.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve[] JoinCurves(
	IEnumerable<Curve> inputCurves
)
Public Shared Function JoinCurves (
	inputCurves As IEnumerable(Of Curve)
) As Curve()
Parameters
inputCurves
Type: System.Collections.Generic.IEnumerable<Curve>
Curve segments to join.
Return Value
Type: Curve[]
An array of curves which contains.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Curve Class
JoinCurves Overload
Rhino.Geometry Namespace