RhinoCommon API
SimpleArrayPoint3d Constructor
 Initializes a new empty SimpleArrayPoint3d instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayPoint3d()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
SimpleArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace