RhinoCommon SDK
BoundingBox.Contains Method (Point3d, Boolean)
 Tests a point for BoundingBox inclusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	Point3d point,
	bool strict
)
Public Function Contains (
	point As Point3d,
	strict As Boolean
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
strict
Type: System.Boolean
If true, the point needs to be fully on the inside of the BoundingBox. I.e. coincident points will be considered 'outside'.
Return Value
Type: Boolean
If 'strict' is affirmative, true if the point is inside this boundingbox; false if it is on the surface or outside.
If 'strict' is negative, true if the point is on the surface or on the inside of the boundingbox; otherwise false.
See Also
Reference
BoundingBox Structure
Contains Overload
Rhino.Geometry Namespace