RhinoCommon API
RenderContentCollection.GetForcedVaries Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.GetForcedVaries"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetForcedVaries()
Public Function GetForcedVaries As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.GetForcedVaries"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace