RhinoCommon SDK
MeshObject.DuplicateMeshGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.MeshObject.DuplicateMeshGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh DuplicateMeshGeometry()
Public Function DuplicateMeshGeometry As Mesh
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.DocObjects.MeshObject.DuplicateMeshGeometry"]
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace