RhinoCommon API
RenderPrimitiveList.ConvertMeshesToTriangles Method
 Convert mesh quad faces to triangle faces.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ConvertMeshesToTriangles()
Public Sub ConvertMeshesToTriangles
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace