RhinoCommon API
BinaryArchiveReader.ReadBoolArray Method
 Reads an array of Boolean from the archive.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool[] ReadBoolArray()
Public Function ReadBoolArray As Boolean()
Return Value
Type: Boolean[]
The array that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace