RhinoCommon API
LicenseUtils.GetLicenseType Method
 Returns the contentType of a specified product license
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int GetLicenseType(
	Guid productId
)
Public Shared Function GetLicenseType (
	productId As Guid
) As Integer
Parameters
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicenseType(System.Guid)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicenseType(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace