RhinoCommon API
Surface.IsCone Method (Double)
Determines if the surface is a portion of a cone within a given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCone(
	double tolerance
)
Public Function IsCone (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a cone.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Surface Class
IsCone Overload
Rhino.Geometry Namespace