RhinoCommon API
LightObject.DuplicateLightGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.LightObject.DuplicateLightGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light DuplicateLightGeometry()
Public Function DuplicateLightGeometry As Light
Return Value
Type: Light
[Missing <returns> documentation for "M:Rhino.DocObjects.LightObject.DuplicateLightGeometry"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace