RhinoCommon API
RenderTabs.RegisterTab Method
 Register custom render user interface with Rhino. This should only be done in RegisterRenderTabs(RenderTabs). Panels registered after RegisterRenderTabs(RenderTabs) is called will be ignored. If the class includes a public method "void DoHelp()" the method will get called when F1 is pressed and the custom tab is active.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RegisterTab(
	PlugIn plugin,
	Type tabType,
	string caption,
	Icon icon
)
Public Sub RegisterTab (
	plugin As PlugIn,
	tabType As Type,
	caption As String,
	icon As Icon
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
 The plug-in providing the custom user interface
tabType
Type: System.Type
 The type of object to be created and added to the render container.
caption
Type: System.String
 The caption for the custom user interface.
icon
Type: System.Drawing.Icon
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderTabs Class
Rhino.Render Namespace