RhinoCommon API
MeshNgonList.GetNgonOuterEdgeCount Method
 Gets the outer edge count of an ngon.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GetNgonOuterEdgeCount(
	int index
)
Public Function GetNgonOuterEdgeCount (
	index As Integer
) As Integer
Parameters
index
Type: System.Int32
Ngon index.
Return Value
Type: Int32
Outer edge count or zero on error.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace