RhinoCommon API
Mesh.GetCachedTextureCoordinates Method
 Call this method to get cached texture coordinates for a texture mapping with the specified Id.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CachedTextureCoordinates GetCachedTextureCoordinates(
	Guid textureMappingId
)
Public Function GetCachedTextureCoordinates (
	textureMappingId As Guid
) As CachedTextureCoordinates
Parameters
textureMappingId
Type: System.Guid
 Texture mapping Id
Return Value
Type: CachedTextureCoordinates
 Object which allows access to coordinates and other props.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Mesh Class
Rhino.Geometry Namespace