RhinoCommon SDK
Dimension.SetFacename Method
[Missing <summary> documentation for "M:Rhino.Geometry.Dimension.SetFacename(System.Boolean,System.String)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool SetFacename(
	bool setOn,
	string facename
)
Public Overrides Function SetFacename (
	setOn As Boolean,
	facename As String
) As Boolean
Parameters
setOn
Type: System.Boolean
[Missing <param name="setOn"/> documentation for "M:Rhino.Geometry.Dimension.SetFacename(System.Boolean,System.String)"]
facename
Type: System.String
[Missing <param name="facename"/> documentation for "M:Rhino.Geometry.Dimension.SetFacename(System.Boolean,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Dimension.SetFacename(System.Boolean,System.String)"]
See Also
Reference
Dimension Class
Rhino.Geometry Namespace