RhinoCommon API
ObjectAttributes.Duplicate Method
 Constructs a copy of this ObjectAttributes instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes Duplicate()
Public Function Duplicate As ObjectAttributes
Return Value
Type: ObjectAttributes
A new instance on success, or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace