RhinoCommon API
PointCloud Constructor (PointCloud)
 Initializes a new instance of the PointCloud class, copying (Merge) the content of another pointcloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloud(
	PointCloud other
)
Public Sub New (
	other As PointCloud
)
Parameters
other
Type: Rhino.Geometry.PointCloud
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.PointCloud.#ctor(Rhino.Geometry.PointCloud)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace