RhinoCommon API
File3dmObjectTable.AddLeader Method (IEnumerable<Point3d>)
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLeader(
	IEnumerable<Point3d> points
)
Public Function AddLeader (
	points As IEnumerable(Of Point3d)
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of 2d points.
Return Value
Type: Guid
A unique identifier for the object; or Empty on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmObjectTable Class
AddLeader Overload
Rhino.FileIO Namespace