RhinoCommon API
Brep.GetVolume Method
 Compute the Volume of the Brep. If you want proper Volume data with moments and error information, use the VolumeMassProperties class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GetVolume()
Public Function GetVolume As Double
Return Value
Type: Double
The volume of the Brep.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Brep Class
GetVolume Overload
Rhino.Geometry Namespace