RhinoCommon API
Material.GetBitmapTexture Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetBitmapTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetBitmapTexture()
Public Function GetBitmapTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetBitmapTexture"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Material Class
Rhino.DocObjects Namespace