RhinoCommon API
GumballDisplayConduit.UpdateGumball Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UpdateGumball(
	Point3d point,
	Line worldLine
)
Public Function UpdateGumball (
	point As Point3d,
	worldLine As Line
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
worldLine
Type: Rhino.Geometry.Line
[Missing <param name="worldLine"/> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace