RhinoCommon API
RhinoDoc.GetMeshingParameters Method
 Get MeshingParameters currently used by the document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters GetMeshingParameters(
	MeshingParameterStyle style
)
Public Function GetMeshingParameters (
	style As MeshingParameterStyle
) As MeshingParameters
Parameters
style
Type: Rhino.Geometry.MeshingParameterStyle
[Missing <param name="style"/> documentation for "M:Rhino.RhinoDoc.GetMeshingParameters(Rhino.Geometry.MeshingParameterStyle)"]
Return Value
Type: MeshingParameters
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetMeshingParameters(Rhino.Geometry.MeshingParameterStyle)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoDoc Class
Rhino Namespace