RhinoCommon API
Interval.NormalizedIntervalAt Method
Converts interval value, or pair of values, to normalized parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval NormalizedIntervalAt(
	Interval intervalParameter
)
Public Function NormalizedIntervalAt (
	intervalParameter As Interval
) As Interval
Parameters
intervalParameter
Type: Rhino.Geometry.Interval
[Missing <param name="intervalParameter"/> documentation for "M:Rhino.Geometry.Interval.NormalizedIntervalAt(Rhino.Geometry.Interval)"]
Return Value
Type: Interval
Normalized parameter x so that min*(1.0-x) + max*x = intervalParameter.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Interval Structure
Rhino.Geometry Namespace
ParameterAt