RhinoCommon SDK
Linetype.AppendSegment Method
Adds a segment to the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AppendSegment(
	double length,
	bool isSolid
)
Public Function AppendSegment (
	length As Double,
	isSolid As Boolean
) As Integer
Parameters
length
Type: System.Double
The length of the segment to be added.
isSolid
Type: System.Boolean
 If true, the length is interpreted as a line. If false, then the length is interpreted as a space.
Return Value
Type: Int32
Index of the added segment.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace