RhinoCommon API
HostUtils.DisplayOleAlerts Method
 Defines if Ole alerts ("Server busy") alerts should be visualized.
This function makes no sense on Mono.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void DisplayOleAlerts(
	bool display
)
Public Shared Sub DisplayOleAlerts (
	display As Boolean
)
Parameters
display
Type: System.Boolean
Whether alerts should be visible.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace