RhinoCommon API
Command.OnHelp Method
 Is called when the user needs assistance with this command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnHelp()
Protected Overridable Sub OnHelp
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Command Class
Rhino.Commands Namespace