RhinoCommon API
Color4f.BlendTo Method
[Missing <summary> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color4f BlendTo(
	float t,
	Color4f col
)
Public Function BlendTo (
	t As Single,
	col As Color4f
) As Color4f
Parameters
t
Type: System.Single
[Missing <param name="t"/> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
col
Type: Rhino.Display.Color4f
[Missing <param name="col"/> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
Return Value
Type: Color4f
[Missing <returns> documentation for "M:Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Color4f Structure
Rhino.Display Namespace