RhinoCommon API
Interpolator Constructor
 Constructs a new, empty Interpolator.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interpolator()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace