RhinoCommon API
CommandStyleAttribute Constructor
 Initializes a new command style attribute class.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CommandStyleAttribute(
	Style styles
)
Public Sub New (
	styles As Style
)
Parameters
styles
Type: Rhino.Commands.Style
 Set of values combined using a bitwise OR operation to get the desired combination of command styles.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace