RhinoCommon API
DisplayModeDescription.DeleteDiplayMode Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool DeleteDiplayMode(
	Guid id
)
Public Shared Function DeleteDiplayMode (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace