RhinoCommon API
StretchSpaceMorph Constructor (Point3d, Point3d, Double)
 Constructs a stretch space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StretchSpaceMorph(
	Point3d start,
	Point3d end,
	double length
)
Public Sub New (
	start As Point3d,
	end As Point3d,
	length As Double
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start of stretch axis.
end
Type: Rhino.Geometry.Point3d
End of stretch axis.>
length
Type: System.Double
Length of new stretch axis.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
StretchSpaceMorph Class
StretchSpaceMorph Overload
Rhino.Geometry.Morphs Namespace