RhinoCommon API
ObjRef.SetSelectionComponent Method
 When an object is selected by picking a sub-object, SetSelectionComponent may be used to identify the sub-object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetSelectionComponent(
	ComponentIndex componentIndex
)
Public Sub SetSelectionComponent (
	componentIndex As ComponentIndex
)
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
[Missing <param name="componentIndex"/> documentation for "M:Rhino.DocObjects.ObjRef.SetSelectionComponent(Rhino.Geometry.ComponentIndex)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace