RhinoCommon API
SimpleArrayPoint3d.ToArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] ToArray()
Public Function ToArray As Point3d()
Return Value
Type: Point3d[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
SimpleArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace