RhinoCommon SDK
FieldDictionary.Set Method (String, Color4f)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Set(
	string key,
	Color4f value
)
Public Sub Set (
	key As String,
	value As Color4f
)
Parameters
key
Type: System.String
Key name for the field value to change.
value
Type: Rhino.Display.Color4f
New value for this field.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FieldDictionary Class
Set Overload
Rhino.Render.Fields Namespace