RhinoCommon SDK
SubDFacePtr.RemoveEdge Method (Int32)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.RemoveEdge(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void RemoveEdge(
	int edgeInFaceIndex
)
Public Sub RemoveEdge (
	edgeInFaceIndex As Integer
)
Parameters
edgeInFaceIndex
Type: System.Int32
[Missing <param name="edgeInFaceIndex"/> documentation for "M:Rhino.Geometry.SubDFacePtr.RemoveEdge(System.Int32)"]
See Also
Reference
SubDFacePtr Structure
RemoveEdge Overload
Rhino.Geometry Namespace