RhinoCommon API
File3dm.IsValid Method (String)
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid(
	out string errors
)
Public Function IsValid (
	<OutAttribute> ByRef errors As String
) As Boolean
Parameters
errors
Type: System.String
 No errors are found.
Return Value
Type: Boolean
true in any case.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.23
See Also
Reference
File3dm Class
IsValid Overload
Rhino.FileIO Namespace