RhinoCommon API
ReplayHistoryData.TryGetBool Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetBool(
	int id,
	out bool value
)
Public Function TryGetBool (
	id As Integer,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace