RhinoCommon SDK
Line.MinimumDistanceTo Method (Line)
 Finds the shortest distance between this line as a finite segment and another finite segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MinimumDistanceTo(
	Line testLine
)
Public Function MinimumDistanceTo (
	testLine As Line
) As Double
Parameters
testLine
Type: Rhino.Geometry.Line
A line to test.
Return Value
Type: Double
The minimum distance.
See Also
Reference
Line Structure
MinimumDistanceTo Overload
Rhino.Geometry Namespace