RhinoCommon SDK
Surface.IsAtSeam Method
 Tests if a surface parameter value is at a seam.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int IsAtSeam(
	double u,
	double v
)
Public Function IsAtSeam (
	u As Double,
	v As Double
) As Integer
Parameters
u
Type: System.Double
Surface u parameter to test.
v
Type: System.Double
Surface v parameter to test.
Return Value
Type: Int32
 0 if not a seam, 1 if u == Domain(0)[i] and srf(u, v) == srf(Domain(0)[1-i], v) 2 if v == Domain(1)[i] and srf(u, v) == srf(u, Domain(1)[1-i]) 3 if 1 and 2 are true.
See Also
Reference
Surface Class
Rhino.Geometry Namespace