RhinoCommon API
FloatField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.FloatField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.FloatField.ValueAsObject"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
FloatField Class
Rhino.Render.Fields Namespace