RhinoCommon SDK
SubDVertexAccess.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.GetEnumerator"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<SubDVertexPtr> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SubDVertexPtr)
Return Value
Type: IEnumerator<SubDVertexPtr>
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace