RhinoCommon API
GetObject.Get Method
 Call to select a single object.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
 Success - objects selected. Cancel - user pressed ESCAPE to cancel the get. See GetResults for other possible values that may be returned when options, numbers, etc., are acceptable responses.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace