RhinoCommon SDK
SubDFacePtr.IndexOf Method (SubDEdgePtr)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.IndexOf(Rhino.Geometry.SubDEdgePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int IndexOf(
	SubDEdgePtr edge
)
Public Function IndexOf (
	edge As SubDEdgePtr
) As Integer
Parameters
edge
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="edge"/> documentation for "M:Rhino.Geometry.SubDFacePtr.IndexOf(Rhino.Geometry.SubDEdgePtr)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.IndexOf(Rhino.Geometry.SubDEdgePtr)"]
See Also
Reference
SubDFacePtr Structure
IndexOf Overload
Rhino.Geometry Namespace