RhinoCommon API
Point3d.UnaryNegation Operator
 Computes the additive inverse of all coordinates in the point, and returns the new point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d operator -(
	Point3d point
)
Public Shared Operator - (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A point value that, when summed with the point input, yields the Origin.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace