RhinoCommon SDK
ViewportInfo.GetDollyCameraVector Method (Point, Point, Double)
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d GetDollyCameraVector(
	Point screen0,
	Point screen1,
	double projectionPlaneDistance
)
Public Function GetDollyCameraVector (
	screen0 As Point,
	screen1 As Point,
	projectionPlaneDistance As Double
) As Vector3d
Parameters
screen0
Type: System.Drawing.Point
Start point.
screen1
Type: System.Drawing.Point
End point.
projectionPlaneDistance
Type: System.Double
Distance of projection plane from camera. When in doubt, use 0.5*(frus_near+frus_far).
Return Value
Type: Vector3d
The world coordinate dolly vector.
See Also
Reference
ViewportInfo Class
GetDollyCameraVector Overload
Rhino.DocObjects Namespace