RhinoCommon API
PreviewAppearance.RotationX Method
 RotationX
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double RotationX()
Public Function RotationX As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.RotationX"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace