RhinoCommon API
ViewportInfo.SetFrustumNearFar Method (Point3d, Double)
 Sets the frustum near and far using a center point and radius.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetFrustumNearFar(
	Point3d center,
	double radius
)
Public Function SetFrustumNearFar (
	center As Point3d,
	radius As Double
) As Boolean
Parameters
center
Type: Rhino.Geometry.Point3d
A center point.
radius
Type: System.Double
A radius value.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
SetFrustumNearFar Overload
Rhino.DocObjects Namespace