RhinoCommon API
DisplayMaterial.GetBumpTexture Method
 Gets the bump texture for this display material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetBumpTexture(
	bool front
)
Public Function GetBumpTexture (
	front As Boolean
) As Texture
Parameters
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.GetBumpTexture(System.Boolean)"]
Return Value
Type: Texture
The texture, or null if no bump texture has been added to this material.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace