RhinoCommon API
GetCancel.Wait<TResult> Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetCancel.Wait``1(System.Threading.Tasks.Task{``0},Rhino.RhinoDoc)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result Wait<TResult>(
	Task<TResult> task,
	RhinoDoc doc
)
Public Function Wait(Of TResult) (
	task As Task(Of TResult),
	doc As RhinoDoc
) As Result
Parameters
task
Type: System.Threading.Tasks.Task<TResult>
[Missing <param name="task"/> documentation for "M:Rhino.Input.Custom.GetCancel.Wait``1(System.Threading.Tasks.Task{``0},Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.Custom.GetCancel.Wait``1(System.Threading.Tasks.Task{``0},Rhino.RhinoDoc)"]
Type Parameters
TResult
[Missing <typeparam name="TResult"/> documentation for "M:Rhino.Input.Custom.GetCancel.Wait``1(System.Threading.Tasks.Task{``0},Rhino.RhinoDoc)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetCancel.Wait``1(System.Threading.Tasks.Task{``0},Rhino.RhinoDoc)"]
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace