RhinoCommon API
CommonObject Constructor
 Allows construction from inheriting classes.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CommonObject()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CommonObject Class
CommonObject Overload
Rhino.Runtime Namespace