RhinoCommon SDK
DisplayPipeline.DrawBox Method (Box, Color, Int32)
 Draws the edges of a Box object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBox(
	Box box,
	Color color,
	int thickness
)
Public Sub DrawBox (
	box As Box,
	color As Color,
	thickness As Integer
)
Parameters
box
Type: Rhino.Geometry.Box
Box to draw.
color
Type: System.Drawing.Color
Color to draw in.
thickness
Type: System.Int32
Thickness (in pixels) of box edges.
See Also
Reference
DisplayPipeline Class
DrawBox Overload
Rhino.Display Namespace