RhinoCommon API
PreviewLighting.ElementKind Method
 ElementKind
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ElementKind()
Public Function ElementKind As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.PreviewLighting.ElementKind"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace