RhinoCommon API
PersistentSettings.DeleteItem Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.DeleteItem(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DeleteItem(
	string key
)
Public Sub DeleteItem (
	key As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.DeleteItem(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PersistentSettings Class
Rhino Namespace