RhinoCommon API
FieldDictionary.AddTextured Method (String, Color4f, String)
 Add a new Color4fField to the dictionary. This overload will cause the field to be tagged as "textured" so that the texturing UI will appear in automatic UIs.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color4fField AddTextured(
	string key,
	Color4f value,
	string prompt
)
Public Function AddTextured (
	key As String,
	value As Color4f,
	prompt As String
) As Color4fField
Parameters
key
Type: System.String
Key name for the field value to change.
value
Type: Rhino.Display.Color4f
Initial value for this field.
prompt
Type: System.String
 Prompt to display in the user interface (Content Browsers) if this is null or an empty string the this field is a data only field and will not appear in the user interface.
Return Value
Type: Color4fField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Display.Color4f,System.String)"]
Exceptions
Exception | Condition
ArgumentException |  An element with the same key already exists in the dictionary
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace