RhinoCommon API
EdgeAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static EdgeAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As EdgeAnalysisSettingsState
Return Value
Type: EdgeAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.EdgeAnalysisSettings.GetCurrentState"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace