RhinoCommon API
Brep.AddSurface Method
 Adds a 3D surface used by BrepFace.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddSurface(
	Surface surface
)
Public Function AddSurface (
	surface As Surface
) As Integer
Parameters
surface
Type: Rhino.Geometry.Surface
A copy of the surface is added to this brep.
Return Value
Type: Int32
 Index that should be used to reference the geometry.
-1 is returned if the input is not acceptable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Brep Class
Rhino.Geometry Namespace