RhinoCommon API
ViewportInfo Constructor (ViewportInfo)
 Initializes a new instance by copying values from another instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportInfo(
	ViewportInfo other
)
Public Sub New (
	other As ViewportInfo
)
Parameters
other
Type: Rhino.DocObjects.ViewportInfo
The other viewport info.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace