RhinoCommon API
PolylineCurve.Point Method
 Gets a point at a specified index in the polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Point(
	int index
)
Public Function Point (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
An index.
Return Value
Type: Point3d
A point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace