RhinoCommon API
CustomObjectGrips.Grip Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.Grip(System.Int32)"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CustomGripObject Grip(
	int index
)
Public Function Grip (
	index As Integer
) As CustomGripObject
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.Grip(System.Int32)"]
Return Value
Type: CustomGripObject
[Missing <returns> documentation for "M:Rhino.DocObjects.Custom.CustomObjectGrips.Grip(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace