RhinoCommon SDK
SubD.UpdateAllTagsAndSectorCoefficients Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.UpdateAllTagsAndSectorCoefficients"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int UpdateAllTagsAndSectorCoefficients()
Public Function UpdateAllTagsAndSectorCoefficients As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.UpdateAllTagsAndSectorCoefficients"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace