RhinoCommon SDK
Interval.LessThan Operator
 Determines whether the first specified Interval comes before (has inferior sorting value than) the second Interval.
The lower bound has first evaluation priority.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator <(
	Interval a,
	Interval b
)
Public Shared Operator < (
	a As Interval,
	b As Interval
) As Boolean
Parameters
a
Type: Rhino.Geometry.Interval
First interval.
b
Type: Rhino.Geometry.Interval
Second interval.
Return Value
Type: Boolean
true if a[0] is smaller than b[0], or a[0] == b[0] and a[1] is smaller than b[1]; otherwise, false.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace