RhinoCommon API
SnapShotsClient Constructor
 SnapShotsClient constructor
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SnapShotsClient()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace