RhinoCommon SDK
RhinoViewport.GetFrustumFarPlane Method
Get far clipping plane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFrustumFarPlane(
	out Plane plane
)
Public Function GetFrustumFarPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
 far clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the far clipping plane.
Return Value
Type: Boolean
 true if camera and frustum are valid.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace