RhinoCommon API
BrepFaceList.SplitFacesAtTangents Method
 Splits all of the faces of a Brep at tangent locations.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SplitFacesAtTangents()
Public Function SplitFacesAtTangents As Boolean
Return Value
Type: Boolean
True if successful, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace