RhinoCommon SDK
SubDEdgePtr.ClearFaces Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDEdgePtr.ClearFaces"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearFaces()
Public Sub ClearFaces
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace