RhinoCommon API
Color4f Constructor (Color4f)
Initializes a new instance of the Color4f class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color4f(
	Color4f color
)
Public Sub New (
	color As Color4f
)
Parameters
color
Type: Rhino.Display.Color4f
[Missing <param name="color"/> documentation for "M:Rhino.Display.Color4f.#ctor(Rhino.Display.Color4f)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Color4f Structure
Color4f Overload
Rhino.Display Namespace