RhinoCommon API
Brep.CullUnused3dCurves Method
Culls 2d curves not referenced by a trim.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullUnused3dCurves()
Public Function CullUnused3dCurves As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Brep Class
Rhino.Geometry Namespace