RhinoCommon API
RenderWindow.Invalidate Method
 Invalidate the entire view window so that the pixels get painted.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Invalidate()
Public Sub Invalidate
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderWindow Class
Rhino.Render Namespace