RhinoCommon SDK
IPanelsService.GetPanel Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
Object GetPanel(
	Guid panelId
)
Function GetPanel (
	panelId As Guid
) As Object
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace