RhinoCommon API
PersistentSettingsEventArgs Constructor
Initializes a new instance of the PersistentSettingsEventArgs class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PersistentSettingsEventArgs()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PersistentSettingsEventArgs Class
Rhino Namespace