RhinoCommon SDK
Interval.Subtraction Operator (Double, Interval)
 Shifts an interval by a specific amount (subtraction).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Interval operator -(
	double number,
	Interval interval
)
Public Shared Operator - (
	number As Double,
	interval As Interval
) As Interval
Parameters
number
Type: System.Double
The shifting value to subtract from (minuend).
interval
Type: Rhino.Geometry.Interval
The interval to be subtracted from (subtrahend).
Return Value
Type: Interval
A new interval with [number-T0, number-T1].
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interval Structure
Subtraction Overload
Rhino.Geometry Namespace