RhinoCommon API
LightManagerSupportClient.UnGroup Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.UnGroup(Rhino.Render.LightArray)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UnGroup(
	LightArray lights
)
Public Sub UnGroup (
	lights As LightArray
)
Parameters
lights
Type: Rhino.Render.LightArray
[Missing <param name="lights"/> documentation for "M:Rhino.Render.LightManagerSupportClient.UnGroup(Rhino.Render.LightArray)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace