RhinoCommon API
Line.Equals Method (Object)
 Determines whether an object is a line that has the same value as this line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
An object.
Return Value
Type: Boolean
true if obj is a Line and has the same coordinates as this; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Line Structure
Equals Overload
Rhino.Geometry Namespace