RhinoCommon SDK
GumballObject.Dispose Method
Releases all resources used by the GumballObject
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GumballObject Class
Dispose Overload
Rhino.UI.Gumball Namespace