RhinoCommon SDK
GripObject.GetSurfaceParameters Method
 Retrieves the 2d parameter space values of this GripObject from the surface it's associated with.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetSurfaceParameters(
	out double u,
	out double v
)
Public Function GetSurfaceParameters (
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double
) As Boolean
Parameters
u
Type: System.Double
[Missing <param name="u"/> documentation for "M:Rhino.DocObjects.GripObject.GetSurfaceParameters(System.Double@,System.Double@)"]
v
Type: System.Double
[Missing <param name="v"/> documentation for "M:Rhino.DocObjects.GripObject.GetSurfaceParameters(System.Double@,System.Double@)"]
Return Value
Type: Boolean
True on success. Output is unreliable if return is false.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace