RhinoCommon API
ObjectTable.GetObjectsByType<T> Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<T> GetObjectsByType<T>()
where T : RhinoObject
Public Function GetObjectsByType(Of T As RhinoObject) As IEnumerable(Of T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1"]
Return Value
Type: IEnumerable<T>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ObjectTable Class
GetObjectsByType Overload
Rhino.DocObjects.Tables Namespace