RhinoCommon SDK
IPanelsService.OpenPanel Method (Guid, Guid, Boolean)
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid OpenPanel(
	Guid dockBarId,
	Guid panelId,
	bool makeSelectedTab
)
Function OpenPanel (
	dockBarId As Guid,
	panelId As Guid,
	makeSelectedTab As Boolean
) As Guid
Parameters
dockBarId
Type: System.Guid
[Missing <param name="dockBarId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid,System.Boolean)"]
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid,System.Boolean)"]
makeSelectedTab
Type: System.Boolean
[Missing <param name="makeSelectedTab"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid,System.Boolean)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid,System.Guid,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IPanelsService Interface
OpenPanel Overload
Rhino.UI Namespace