RhinoCommon API
LicenseUtils.IsCheckOutEnabled Method
 Returns whether or not license checkout is enabled.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsCheckOutEnabled()
Public Shared Function IsCheckOutEnabled As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.IsCheckOutEnabled"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace