RhinoCommon SDK
MeshTopologyEdgeList.SwapEdge Method
 If the edge is shared by two triangular face, then the edge is swapped.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SwapEdge(
	int topologyEdgeIndex
)
Public Function SwapEdge (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if successful.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace