RhinoCommon API
PlugIn.GetInstalledPlugIns Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.GetInstalledPlugIns"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Dictionary<Guid, string> GetInstalledPlugIns()
Public Shared Function GetInstalledPlugIns As Dictionary(Of Guid, String)
Return Value
Type: Dictionary<Guid, String>
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetInstalledPlugIns"]
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace