RhinoCommon SDK
Vector3f.Equals Method (Object)
 Determines whether the specified System.Object is a Vector3f and has the same values as the present vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The specified object.
Return Value
Type: Boolean
true if obj is Vector3f and has the same components as this; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3f Structure
Equals Overload
Rhino.Geometry Namespace