RhinoCommon API
Curve.ExtendOnSurface Method (CurveEnd, BrepFace)
 Extends a curve on a surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve ExtendOnSurface(
	CurveEnd side,
	BrepFace face
)
Public Function ExtendOnSurface (
	side As CurveEnd,
	face As BrepFace
) As Curve
Parameters
side
Type: Rhino.Geometry.CurveEnd
The end of the curve to extend.
face
Type: Rhino.Geometry.BrepFace
BrepFace that contains the curve.
Return Value
Type: Curve
New extended curve result on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Curve Class
ExtendOnSurface Overload
Rhino.Geometry Namespace