RhinoCommon API
Decal.CustomData Method
 Gets custom data associated with this decal - see Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<NamedValue> CustomData()
Public Function CustomData As List(Of NamedValue)
Return Value
Type: List<NamedValue>
The return value can be null if there is no data associated with this decal.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Decal Class
Rhino.Render Namespace