RhinoCommon API
PhysicallyBasedMaterial.ParametersNames Constructor
Initializes a new instance of the PhysicallyBasedMaterial.ParametersNames class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ParametersNames()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace