RhinoCommon API
HistoryRecord.SetSurface Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetSurface(
	int id,
	Surface value
)
Public Function SetSurface (
	id As Integer,
	value As Surface
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
value
Type: Rhino.Geometry.Surface
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace