RhinoCommon API
File3dmObjectTable.AddPointCloud Method (PointCloud, ObjectAttributes)
Adds a point cloud object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPointCloud(
	PointCloud cloud,
	ObjectAttributes attributes
)
Public Function AddPointCloud (
	cloud As PointCloud,
	attributes As ObjectAttributes
) As Guid
Parameters
cloud
Type: Rhino.Geometry.PointCloud
PointCloud to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point cloud.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmObjectTable Class
AddPointCloud Overload
Rhino.FileIO Namespace