RhinoCommon SDK
LineCurve Constructor (Line, Double, Double)
 Initializes a new instance of the LineCurve class, by retrieving its value from a line and setting the domain.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LineCurve(
	Line line,
	double t0,
	double t1
)
Public Sub New (
	line As Line,
	t0 As Double,
	t1 As Double
)
Parameters
line
Type: Rhino.Geometry.Line
A line to use as model.
t0
Type: System.Double
The new domain start.
t1
Type: System.Double
The new domain end.
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace