RhinoCommon API
GetBaseClass.PostCustomMessage Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.PostCustomMessage(System.Object)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void PostCustomMessage(
	Object messageData
)
Public Shared Sub PostCustomMessage (
	messageData As Object
)
Parameters
messageData
Type: System.Object
[Missing <param name="messageData"/> documentation for "M:Rhino.Input.Custom.GetBaseClass.PostCustomMessage(System.Object)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace