RhinoCommon API
BrepVertex.EdgeIndices Method
 Gets the indices of all edges associated with this vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] EdgeIndices()
Public Function EdgeIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace