RhinoCommon API
CommonObject.ConstructConstObject Method
 Assigns a parent object and a subobject index to this.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void ConstructConstObject(
	Object parentObject,
	int subobject_index
)
Protected Sub ConstructConstObject (
	parentObject As Object,
	subobject_index As Integer
)
Parameters
parentObject
Type: System.Object
The parent object.
subobject_index
Type: System.Int32
[Missing <param name="subobject_index"/> documentation for "M:Rhino.Runtime.CommonObject.ConstructConstObject(System.Object,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace