RhinoCommon SDK
LayerTable.UndoModify Method (Int32, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UndoModify(
	int layerIndex,
	uint undoRecordSerialNumber
)
Public Function UndoModify (
	layerIndex As Integer,
	undoRecordSerialNumber As UInteger
) As Boolean
Parameters
layerIndex
Type: System.Int32
The layer index to be used.
undoRecordSerialNumber
Type: System.UInt32
The undo record serial number. Pass 0 not to specify one.
Return Value
Type: Boolean
true if this layer had been modified and the modifications were undone.
See Also
Reference
LayerTable Class
UndoModify Overload
Rhino.DocObjects.Tables Namespace