RhinoCommon API
SnapShotsClient.SupportsDocument Method
 Defines if the client supports document user data or not
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool SupportsDocument()
Public MustOverride Function SupportsDocument As Boolean
Return Value
Type: Boolean
 true if the client saves/restores document user data.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace