RhinoCommon SDK
DimStyleTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<DimensionStyle> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of DimensionStyle)
Return Value
Type: IEnumerator<DimensionStyle>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace