RhinoCommon API
BinaryArchiveReader.AtEnd Method
 true if at end of a file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AtEnd()
Public Function AtEnd As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.AtEnd"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace