RhinoCommon API
PersistentSettings.GetEnumValue<T> Method
 Get a stored enum value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T GetEnumValue<T>()
where T : struct, new(), IConvertible
Public Function GetEnumValue(Of T As {Structure, New, IConvertible}) As T
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetEnumValue``1"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
PersistentSettings Class
GetEnumValue Overload
Rhino Namespace