RhinoCommon API
ObjRef.TextEntity Method
 Gets the text entity if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextEntity TextEntity()
Public Function TextEntity As TextEntity
Return Value
Type: TextEntity
A text entity; or null if the referenced object is not a text entity, or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace