RhinoCommon API
InstanceDefinitionTable.GetList Method
 Gets an array of instance definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinition[] GetList(
	bool ignoreDeleted
)
Public Function GetList (
	ignoreDeleted As Boolean
) As InstanceDefinition()
Parameters
ignoreDeleted
Type: System.Boolean
If true then deleted idefs are filtered out.
Return Value
Type: InstanceDefinition[]
An array of instance definitions. This can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace