RhinoCommon API
RevSurface.CreateFromTorus Method
 Constructs a new surface of revolution from the values of a torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RevSurface CreateFromTorus(
	Torus torus
)
Public Shared Function CreateFromTorus (
	torus As Torus
) As RevSurface
Parameters
torus
Type: Rhino.Geometry.Torus
A torus.
Return Value
Type: RevSurface
A new surface of revolution, or null if any of the inputs is invalid or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace