RhinoCommon API
ObjRef Constructor (RhinoObject)
 Initializes a new object reference from a Rhino object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef(
	RhinoObject rhinoObject
)
Public Sub New (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
The Rhino object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace