RhinoCommon API
ViewTable.AddPageView Method (String)
 Constructs a new page view with a given title and, at the same time, adds it to the list.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoPageView AddPageView(
	string title
)
Public Function AddPageView (
	title As String
) As RhinoPageView
Parameters
title
Type: System.String
 If null or empty, a name will be generated as "Page #" where # is the largest page number.
Return Value
Type: RhinoPageView
The newly created page view on success; or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewTable Class
AddPageView Overload
Rhino.DocObjects.Tables Namespace