RhinoCommon API
Skin.ShowSplash Method
Is called when the splash screen should be shown.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ShowSplash()
Protected Overridable Sub ShowSplash
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Skin Class
Rhino.Runtime Namespace