RhinoCommon API
ObjRef Constructor (RhinoObject, PickContext)
 Initialized a new object reference from a Rhino object and pick context
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef(
	RhinoObject rhinoObject,
	PickContext pickContext
)
Public Sub New (
	rhinoObject As RhinoObject,
	pickContext As PickContext
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhinoObject"/> documentation for "M:Rhino.DocObjects.ObjRef.#ctor(Rhino.DocObjects.RhinoObject,Rhino.Input.Custom.PickContext)"]
pickContext
Type: Rhino.Input.Custom.PickContext
[Missing <param name="pickContext"/> documentation for "M:Rhino.DocObjects.ObjRef.#ctor(Rhino.DocObjects.RhinoObject,Rhino.Input.Custom.PickContext)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace