RhinoCommon SDK
Brep.CreateFromBox Method (IEnumerable<Point3d>)
 Constructs new brep from 8 corner points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromBox(
	IEnumerable<Point3d> corners
)
Public Shared Function CreateFromBox (
	corners As IEnumerable(Of Point3d)
) As Brep
Parameters
corners
Type: System.Collections.Generic.IEnumerable<Point3d>
 8 points defining the box corners arranged as the vN labels indicate.
v7_______e6____v6
\             |\
e7           | e5
\ ______e4_____\
e11 v4         |   v5
|        e10
v3--|---e2----v2   e9
 \  e8          \
 e3 |            e1
   \|             \
    v0_____e0______v1
Return Value
Type: Brep
A new box brep, on null on error.
See Also
Reference
Brep Class
CreateFromBox Overload
Rhino.Geometry Namespace