RhinoCommon SDK
BinaryArchiveWriter.WritePoint4d Method
 Writes a Point4d value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WritePoint4d(
	Point4d value
)
Public Sub WritePoint4d (
	value As Point4d
)
Parameters
value
Type: Rhino.Geometry.Point4d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace