RhinoCommon SDK
RenderMaterial.GetTextureAmountFromUsage Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.GetTextureAmountFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GetTextureAmountFromUsage(
	RenderMaterial.StandardChildSlots which
)
Public Function GetTextureAmountFromUsage (
	which As RenderMaterial.StandardChildSlots
) As Double
Parameters
which
Type: Rhino.Render.RenderMaterial.StandardChildSlots
[Missing <param name="which"/> documentation for "M:Rhino.Render.RenderMaterial.GetTextureAmountFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.GetTextureAmountFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace