RhinoCommon API
Sun Constructor
 Create a non-document controlled Sun
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Sun()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Sun Class
Rhino.Render Namespace