RhinoCommon SDK
OrdinateDimension.GetDistanceDisplayText Method
[Missing <summary> documentation for "M:Rhino.Geometry.OrdinateDimension.GetDistanceDisplayText(Rhino.DocObjects.DimensionStyle,Rhino.UnitSystem)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string GetDistanceDisplayText(
	DimensionStyle style,
	UnitSystem units
)
Public Function GetDistanceDisplayText (
	style As DimensionStyle,
	units As UnitSystem
) As String
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.OrdinateDimension.GetDistanceDisplayText(Rhino.DocObjects.DimensionStyle,Rhino.UnitSystem)"]
units
Type: Rhino.UnitSystem
[Missing <param name="units"/> documentation for "M:Rhino.Geometry.OrdinateDimension.GetDistanceDisplayText(Rhino.DocObjects.DimensionStyle,Rhino.UnitSystem)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.OrdinateDimension.GetDistanceDisplayText(Rhino.DocObjects.DimensionStyle,Rhino.UnitSystem)"]
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace