RhinoCommon API
Interpolator Constructor (RhinoList<Double>)
 Copy all the numbers from an existing RhinoList.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interpolator(
	RhinoList<double> list
)
Public Sub New (
	list As RhinoList(Of Double)
)
Parameters
list
Type: Rhino.Collections.RhinoList<Double>
List to mimic.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace