RhinoCommon API
Box.Contains Method (Point3d, Boolean)
 Determines whether a point is included in this box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	Point3d point,
	bool strict
)
Public Function Contains (
	point As Point3d,
	strict As Boolean
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
strict
Type: System.Boolean
If true, the point needs to be fully on the inside of the Box. I.e. coincident points will be considered 'outside'.
Return Value
Type: Boolean
true if the point is (strictly) on the inside of this Box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace