RhinoCommon API
RenderContentKindList.Contains Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentKindList.Contains(Rhino.Render.RenderContentKind)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	RenderContentKind kind
)
Public Function Contains (
	kind As RenderContentKind
) As Boolean
Parameters
kind
Type: Rhino.Render.RenderContentKind
[Missing <param name="kind"/> documentation for "M:Rhino.Render.RenderContentKindList.Contains(Rhino.Render.RenderContentKind)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentKindList.Contains(Rhino.Render.RenderContentKind)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContentKindList Class
Rhino.Render Namespace