RhinoCommon API
NamedParametersEventArgs.SetInt Method
 Set an int value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetInt(
	string name,
	int value
)
Public Sub SetInt (
	name As String,
	value As Integer
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetInt(System.String,System.Int32)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetInt(System.String,System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace