RhinoCommon API
Unroller.AddFollowingGeometry Method (TextDot)
 Adds a text dot that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddFollowingGeometry(
	TextDot dot
)
Public Sub AddFollowingGeometry (
	dot As TextDot
)
Parameters
dot
Type: Rhino.Geometry.TextDot
A text dot.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace