RhinoCommon API
Unroller Constructor (Brep)
 Initializes a new instance of the Unroller class with a brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Unroller(
	Brep brep
)
Public Sub New (
	brep As Brep
)
Parameters
brep
Type: Rhino.Geometry.Brep
A brep to be unrolled.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Unroller Class
Unroller Overload
Rhino.Geometry Namespace