RhinoCommon SDK
IStackedDialogPageService.GetSetModified Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.GetSetModified(Rhino.UI.StackedDialogPage,System.Boolean,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool GetSetModified(
	StackedDialogPage page,
	bool set,
	bool value
)
Function GetSetModified (
	page As StackedDialogPage,
	set As Boolean,
	value As Boolean
) As Boolean
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetSetModified(Rhino.UI.StackedDialogPage,System.Boolean,System.Boolean)"]
set
Type: System.Boolean
[Missing <param name="set"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetSetModified(Rhino.UI.StackedDialogPage,System.Boolean,System.Boolean)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetSetModified(Rhino.UI.StackedDialogPage,System.Boolean,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.GetSetModified(Rhino.UI.StackedDialogPage,System.Boolean,System.Boolean)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace