RhinoCommon SDK
BrepFaceList.SplitClosedFaces Method
 Splits closed surfaces so they are not closed.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SplitClosedFaces(
	int minimumDegree
)
Public Function SplitClosedFaces (
	minimumDegree As Integer
) As Boolean
Parameters
minimumDegree
Type: System.Int32
 If the degree of the surface < min_degree, the surface is not split. In some cases, minimumDegree = 2 is useful to preserve piecewise linear surfaces.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace