RhinoCommon API
Panels.OpenPanel Method (Guid)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void OpenPanel(
	Guid panelId
)
Public Shared Sub OpenPanel (
	panelId As Guid
)
Parameters
panelId
Type: System.Guid
 Class type Id for the panel to open.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace