RhinoCommon SDK
WorldMapDayNight.HasMapForCurrentSettings Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.HasMapForCurrentSettings"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasMapForCurrentSettings()
Public Function HasMapForCurrentSettings As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.UI.WorldMapDayNight.HasMapForCurrentSettings"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace