RhinoCommon API
Extrusion.PathLineCurve Method
 Gets the line-like curve that is the conceptual axis of the extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LineCurve PathLineCurve()
Public Function PathLineCurve As LineCurve
Return Value
Type: LineCurve
The path as a line curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace