RhinoCommon API
Point2d.GreaterThan Operator
 Determines whether the first specified Point2d comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator >(
	Point2d a,
	Point2d b
)
Public Shared Operator > (
	a As Point2d,
	b As Point2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point2d
First point.
b
Type: Rhino.Geometry.Point2d
Second point.
Return Value
Type: Boolean
true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace