RhinoCommon API
ObjectTable.AddText Method (TextEntity)
 Adds a v6_TextObject to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddText(
	TextEntity text
)
Public Function AddText (
	text As TextEntity
) As Guid
Parameters
text
Type: Rhino.Geometry.TextEntity
 Text object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectTable Class
AddText Overload
Rhino.DocObjects.Tables Namespace