RhinoCommon API
BinaryArchiveWriter.WriteIntArray Method
 Writes a list, an array, or any enumerable of Int32 to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteIntArray(
	IEnumerable<int> value
)
Public Sub WriteIntArray (
	value As IEnumerable(Of Integer)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Int32>
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace