RhinoCommon API
Interop.NativeRhinoDocPointer Method
 Gets the C++ CRhinoDoc* for a given RhinoCommon RhinoDoc class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static IntPtr NativeRhinoDocPointer(
	RhinoDoc doc
)
Public Shared Function NativeRhinoDocPointer (
	doc As RhinoDoc
) As IntPtr
Parameters
doc
Type: Rhino.RhinoDoc
A document.
Return Value
Type: IntPtr
A pointer value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Interop Class
Rhino.Runtime Namespace