RhinoCommon API
ReplayHistoryData.TryGetPoint3d Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetPoint3d(
	int id,
	out Point3d value
)
Public Function TryGetPoint3d (
	id As Integer,
	<OutAttribute> ByRef value As Point3d
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace