RhinoCommon API
Curve.Extend Method (Interval)
 Where possible, analytically extends curve to include the given domain. This will not work on closed curves. The original curve will be identical to the restriction of the resulting curve to the original curve domain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Extend(
	Interval domain
)
Public Function Extend (
	domain As Interval
) As Curve
Parameters
domain
Type: Rhino.Geometry.Interval
Extension domain.
Return Value
Type: Curve
Extended curve on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Curve Class
Extend Overload
Rhino.Geometry Namespace