RhinoCommon SDK
Arc Constructor (Point3d, Vector3d, Point3d)
 Initializes a new arc from end points and a tangent vector. If the tangent is parallel with the endpoints this will result in an Invalid arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc(
	Point3d pointA,
	Vector3d tangentA,
	Point3d pointB
)
Public Sub New (
	pointA As Point3d,
	tangentA As Vector3d,
	pointB As Point3d
)
Parameters
pointA
Type: Rhino.Geometry.Point3d
Start point of arc.
tangentA
Type: Rhino.Geometry.Vector3d
Tangent at start of arc.
pointB
Type: Rhino.Geometry.Point3d
End point of arc.
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace