RhinoCommon API
Plane.Clone Method
 Returns a deep of this instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane Clone()
Public Function Clone As Plane
Return Value
Type: Plane
A plane with the same values as this item.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Plane Structure
Rhino.Geometry Namespace