RhinoCommon API
ToolbarFileCollection.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFileCollection.GetEnumerator"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<ToolbarFile> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ToolbarFile)
Return Value
Type: IEnumerator<ToolbarFile>
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace