RhinoCommon SDK
Layer.GetUserStrings Method
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NameValueCollection GetUserStrings()
Public Function GetUserStrings As NameValueCollection
Return Value
Type: NameValueCollection
A new collection.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Layer Class
Rhino.DocObjects Namespace