RhinoCommon API
AppearanceSettings.SetPaintColor Method (PaintColor, Color)
 Sets the logical paint color association to a spacific .Net library color, without forced UI update.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetPaintColor(
	PaintColor whichColor,
	Color c
)
Public Shared Sub SetPaintColor (
	whichColor As PaintColor,
	c As Color
)
Parameters
whichColor
Type: Rhino.ApplicationSettings.PaintColor
A logical color association.
c
Type: System.Drawing.Color
A .Net library color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettings Class
SetPaintColor Overload
Rhino.ApplicationSettings Namespace