RhinoCommon API
ZBufferCapture.ShowMeshWires Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowMeshWires(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ShowMeshWires(
	bool on
)
Public Sub ShowMeshWires (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowMeshWires(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace