RhinoCommon API
LicenseUtils.GetLicense Method (Int32, ValidateProductKeyDelegate)
 This version of Rhino.PlugIns.LicenseUtils.GetLicense is used by Rhino C++ plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool GetLicense(
	int productType,
	ValidateProductKeyDelegate validateDelegate
)
Public Shared Function GetLicense (
	productType As Integer,
	validateDelegate As ValidateProductKeyDelegate
) As Boolean
Parameters
productType
Type: System.Int32
[Missing <param name="productType"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(System.Int32,Rhino.PlugIns.ValidateProductKeyDelegate)"]
validateDelegate
Type: Rhino.PlugIns.ValidateProductKeyDelegate
[Missing <param name="validateDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(System.Int32,Rhino.PlugIns.ValidateProductKeyDelegate)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(System.Int32,Rhino.PlugIns.ValidateProductKeyDelegate)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LicenseUtils Class
GetLicense Overload
Rhino.PlugIns Namespace