RhinoCommon API
RhinoDoc.FromFilePath Method
 Search the open document list for a document with a Path equal to the specified file path.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RhinoDoc FromFilePath(
	string filePath
)
Public Shared Function FromFilePath (
	filePath As String
) As RhinoDoc
Parameters
filePath
Type: System.String
The full path to the file to search for.
Return Value
Type: RhinoDoc
The file name to search for
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoDoc Class
Rhino Namespace