RhinoCommon API
CurveIntersections.Finalize Method
 Destructor.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace