RhinoCommon SDK
ArchivableDictionary.Set Method (String, Interval)
 Sets an Interval.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	Interval val
)
Public Function Set (
	key As String,
	val As Interval
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Interval
A value for that key.
Because Interval has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Interval)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace