RhinoCommon API
TextureEvaluator.Finalize Method
 For Dispose pattern
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace