RhinoCommon SDK
ViewportInfo.DollyFrustum Method
 Moves the frustum clipping planes.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DollyFrustum(
	double dollyDistance
)
Public Function DollyFrustum (
	dollyDistance As Double
) As Boolean
Parameters
dollyDistance
Type: System.Double
Distance to move in camera direction.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace