RhinoCommon API
SimpleArrayBrepPointer.Add Method
 Adds a brep to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Brep brep,
	bool asConst
)
Public Sub Add (
	brep As Brep,
	asConst As Boolean
)
Parameters
brep
Type: Rhino.Geometry.Brep
A brep to add.
asConst
Type: System.Boolean
Whether this brep should be treated as non-modifiable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayBrepPointer Class
Rhino.Runtime.InteropWrappers Namespace