RhinoCommon API
ScaleValue.IsUnset Method
 Test IsUnset
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsUnset()
Public Function IsUnset As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.ScaleValue.IsUnset"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ScaleValue Class
Rhino Namespace