RhinoCommon API
Point2f.Inequality Operator
 Determines whether two Point2f have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Point2f a,
	Point2f b
)
Public Shared Operator <> (
	a As Point2f,
	b As Point2f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point2f
The first point.
b
Type: Rhino.Geometry.Point2f
The second point.
Return Value
Type: Boolean
true if the two points differ in any coordinate; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace