RhinoCommon API
Interval.Equality Operator
 Determines whether the two Intervals have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Interval a,
	Interval b
)
Public Shared Operator = (
	a As Interval,
	b As Interval
) As Boolean
Parameters
a
Type: Rhino.Geometry.Interval
The first interval.
b
Type: Rhino.Geometry.Interval
The second interval.
Return Value
Type: Boolean
true if the components of the two intervals are exactly equal; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Interval Structure
Rhino.Geometry Namespace