RhinoCommon API
ComponentFunctionInfo.EvaluateTreeSilenceWarnings Method
 Infrastructure method that simplifies output and performs warning checks.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Object[] EvaluateTreeSilenceWarnings(
	IEnumerable args
)
Protected Function EvaluateTreeSilenceWarnings (
	args As IEnumerable
) As Object()
Parameters
args
Type: System.Collections.IEnumerable
Arguments.
Return Value
Type: Object[]
Items.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace