RhinoCommon API
FileWriteOptions.Dispose Method
Releases all resources used by the FileWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
FileWriteOptions Class
Dispose Overload
Rhino.FileIO Namespace