RhinoCommon SDK
PreviewBackground.EnvironmentInstanceId Method
 EnvironmentInstanceId
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid EnvironmentInstanceId()
Public Function EnvironmentInstanceId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.PreviewBackground.EnvironmentInstanceId"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace