RhinoCommon API
File3dmObjectTable.AddLine Method (Line)
Adds a line object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLine(
	Line line
)
Public Function AddLine (
	line As Line
) As Guid
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Line)"]
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmObjectTable Class
AddLine Overload
Rhino.FileIO Namespace