RhinoCommon SDK
DimStyleTable.Find Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DimensionStyle Find(
	string name,
	bool ignoreDeletedDimensionStyles
)
Public Function Find (
	name As String,
	ignoreDeletedDimensionStyles As Boolean
) As DimensionStyle
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
ignoreDeletedDimensionStyles
Type: System.Boolean
[Missing <param name="ignoreDeletedDimensionStyles"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace