RhinoCommon SDK
DimStyleTable.Add Method (String, Boolean)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	string name,
	bool reference
)
Public Function Add (
	name As String,
	reference As Boolean
) As Integer
Parameters
name
Type: System.String
 Name of the new AnnotationStyle. If null or empty, Rhino automatically generates the name.
reference
Type: System.Boolean
if true the dimstyle will not be saved in files.
Return Value
Type: Int32
index of new AnnotationStyle.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimStyleTable Class
Add Overload
Rhino.DocObjects.Tables Namespace