RhinoCommon API
AngularDimension.Create Method (Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AngularDimension Create(
	Guid styleId,
	Plane plane,
	Point3d extpoint1,
	Point3d extpoint2,
	Point3d dirpoint1,
	Point3d dirpoint2,
	Point3d dimlinepoint
)
Public Shared Function Create (
	styleId As Guid,
	plane As Plane,
	extpoint1 As Point3d,
	extpoint2 As Point3d,
	dirpoint1 As Point3d,
	dirpoint2 As Point3d,
	dimlinepoint As Point3d
) As AngularDimension
Parameters
styleId
Type: System.Guid
Dimension's AnnotationStyle
plane
Type: Rhino.Geometry.Plane
Dimension's plane
extpoint1
Type: Rhino.Geometry.Point3d
First dimension point
extpoint2
Type: Rhino.Geometry.Point3d
Second definition point
dirpoint1
Type: Rhino.Geometry.Point3d
First direction point
dirpoint2
Type: Rhino.Geometry.Point3d
Second direction point
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
Return Value
Type: AngularDimension
[Missing <returns> documentation for "M:Rhino.Geometry.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AngularDimension Class
Create Overload
Rhino.Geometry Namespace