RhinoCommon SDK
RenderContentCollection.GetSearchPattern Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.GetSearchPattern"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string GetSearchPattern()
Public Function GetSearchPattern As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.GetSearchPattern"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace