RhinoCommon SDK
BinaryArchiveWriter.WriteBoundingBox Method
 Writes a BoundingBox value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteBoundingBox(
	BoundingBox value
)
Public Sub WriteBoundingBox (
	value As BoundingBox
)
Parameters
value
Type: Rhino.Geometry.BoundingBox
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace