RhinoCommon SDK
ObjectTable.Delete Method (RhinoObject, Boolean, Boolean)
 Deletes object from document. The deletion can be undone by calling UndeleteObject().
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	RhinoObject obj,
	bool quiet,
	bool ignoreModes
)
Public Function Delete (
	obj As RhinoObject,
	quiet As Boolean,
	ignoreModes As Boolean
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
The object to delete.
quiet
Type: System.Boolean
If false, a message box will appear when an object cannot be deleted.
ignoreModes
Type: System.Boolean
 If true, locked and hidden objects are deleted. If false objects that are locked, hidden, or on locked or hidden layers are not deleted.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace