RhinoCommon API
ZBufferCapture.ShowLights Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowLights(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ShowLights(
	bool on
)
Public Sub ShowLights (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowLights(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace