RhinoCommon API
RhinoObject.OnAddToDocument Method
 This call informs an object it is about to be added to the list of active objects in the document.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnAddToDocument(
	RhinoDoc doc
)
Protected Overridable Sub OnAddToDocument (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnAddToDocument(Rhino.RhinoDoc)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace