RhinoCommon API
TextureMapping.CreateCustomMeshMapping Method
 Create custom mesh mapping
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static TextureMapping CreateCustomMeshMapping(
	Mesh mesh
)
Public Shared Function CreateCustomMeshMapping (
	mesh As Mesh
) As TextureMapping
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh with texture coordinates
Return Value
Type: TextureMapping
TextureMapping instance
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
TextureMapping Class
Rhino.Render Namespace