RhinoCommon API
GumballObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.Finalize"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace