RhinoCommon SDK
NurbsCurvePointList.SetPoint Method (Int32, Point4d)
 Sets a specific weighted control-point.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetPoint(
	int index,
	Point4d point
)
Public Function SetPoint (
	index As Integer,
	point As Point4d
) As Boolean
Parameters
index
Type: System.Int32
Index of control-point to set.
point
Type: Rhino.Geometry.Point4d
Coordinate and weight of control-point.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point4d)"]
See Also
Reference
NurbsCurvePointList Class
SetPoint Overload
Rhino.Geometry.Collections Namespace