RhinoCommon SDK
IPanelsService.ChangePanelIcon Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.ChangePanelIcon(System.Guid,System.Drawing.Icon)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void ChangePanelIcon(
	Guid panelId,
	Icon icon
)
Sub ChangePanelIcon (
	panelId As Guid,
	icon As Icon
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.ChangePanelIcon(System.Guid,System.Drawing.Icon)"]
icon
Type: System.Drawing.Icon
[Missing <param name="icon"/> documentation for "M:Rhino.UI.IPanelsService.ChangePanelIcon(System.Guid,System.Drawing.Icon)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace