RhinoCommon SDK
InstanceObject.UsesDefinition Method
Determine if this reference uses an instance definition
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UsesDefinition(
	int definitionIndex,
	out int nestingLevel
)
Public Function UsesDefinition (
	definitionIndex As Integer,
	<OutAttribute> ByRef nestingLevel As Integer
) As Boolean
Parameters
definitionIndex
Type: System.Int32
[Missing <param name="definitionIndex"/> documentation for "M:Rhino.DocObjects.InstanceObject.UsesDefinition(System.Int32,System.Int32@)"]
nestingLevel
Type: System.Int32
 If the instance definition is used, this is the definition's nesting depth
Return Value
Type: Boolean
true or false depending on if the deifinition is used
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace