RhinoCommon SDK
BrepObject.DuplicateBrepGeometry Method
 Constructs a new deep copy of the brep geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep DuplicateBrepGeometry()
Public Function DuplicateBrepGeometry As Brep
Return Value
Type: Brep
The copy of the geometry.
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace