RhinoCommon SDK
BinaryArchiveWriter.WriteEmptyCheckSum Method
Note: This API is now obsolete.
 Reads a legacy ON_CheckSum, only provided to read data chunks from old V5 files, the CheckSum read is discarded
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("This is only present to allow writing of old, empty ON_CheckSum data")]
public void WriteEmptyCheckSum()
<ObsoleteAttribute("This is only present to allow writing of old, empty ON_CheckSum data")>
Public Sub WriteEmptyCheckSum
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace