RhinoCommon API
BinaryArchiveReader.ReadObjRefArray Method
 Reads an array of Double from the archive.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef[] ReadObjRefArray()
Public Function ReadObjRefArray As ObjRef()
Return Value
Type: ObjRef[]
The array that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace