RhinoCommon API
UndoRecord.Dispose Method
 UndoRecord Dispose
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
UndoRecord Class
Dispose Overload
Rhino.UI.Controls Namespace