RhinoCommon API
CommandAliasList.Delete Method
Deletes an existing command alias from Rhino.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool Delete(
	string alias
)
Public Shared Function Delete (
	alias As String
) As Boolean
Parameters
alias
Type: System.String
[in] The name of the command alias.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace