RhinoCommon API
CollapsibleSectionImpl.Factory Constructor
Initializes a new instance of the CollapsibleSectionImpl.Factory class
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Factory()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CollapsibleSectionImpl.Factory Class
Rhino.UI.Controls Namespace