RhinoCommon API
CurvatureAnalysisSettings.RestoreDefaults Method
 Commits the default settings as the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace