RhinoCommon SDK
IRhRdkThumbnail.GetDib Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.GetDib"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Bitmap GetDib()
Function GetDib As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.GetDib"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace