RhinoCommon API
AsyncRenderContext.DeleteThis Method
[Missing <summary> documentation for "M:Rhino.Render.AsyncRenderContext.DeleteThis"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void DeleteThis()
Protected Overridable Sub DeleteThis
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace