RhinoCommon SDK
Command.LookupCommandName Method
 Returns the command name given a command ID.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string LookupCommandName(
	Guid commandId,
	bool englishName
)
Public Shared Function LookupCommandName (
	commandId As Guid,
	englishName As Boolean
) As String
Parameters
commandId
Type: System.Guid
A command ID.
englishName
Type: System.Boolean
true if the requested command is in English.
Return Value
Type: String
The command name, or null on error.
See Also
Reference
Command Class
Rhino.Commands Namespace