RhinoCommon API
SimulatedTexture.Texture Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedTexture.Texture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture Texture()
Public Function Texture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.Render.SimulatedTexture.Texture"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace