RhinoCommon SDK
SubDVertexPtr.Equals Method (SubDVertexPtr)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.Equals(Rhino.Geometry.SubDVertexPtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Equals(
	SubDVertexPtr other
)
Public Function Equals (
	other As SubDVertexPtr
) As Boolean
Parameters
other
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.Equals(Rhino.Geometry.SubDVertexPtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.Equals(Rhino.Geometry.SubDVertexPtr)"]
Implements
IEquatable<T>.Equals(T)
See Also
Reference
SubDVertexPtr Structure
Equals Overload
Rhino.Geometry Namespace