RhinoCommon API
Font.AvailableFontFaceNames Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Font.AvailableFontFaceNames"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] AvailableFontFaceNames()
Public Shared Function AvailableFontFaceNames As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Font.AvailableFontFaceNames"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Font Class
Rhino.DocObjects Namespace