RhinoCommon SDK
SubDEdgePtr.OtherEnd Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDEdgePtr.OtherEnd(Rhino.Geometry.SubDVertexPtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr OtherEnd(
	SubDVertexPtr fromOrTo
)
Public Function OtherEnd (
	fromOrTo As SubDVertexPtr
) As SubDVertexPtr
Parameters
fromOrTo
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="fromOrTo"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.OtherEnd(Rhino.Geometry.SubDVertexPtr)"]
Return Value
Type: SubDVertexPtr
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgePtr.OtherEnd(Rhino.Geometry.SubDVertexPtr)"]
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace