RhinoCommon SDK
BinaryArchiveWriter.BeginWrite3dmChunk Method (UInt32, Int32, Int32)
 Begins writing a chunk
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool BeginWrite3dmChunk(
	uint typecode,
	int majorVersion,
	int minorVersion
)
Public Function BeginWrite3dmChunk (
	typecode As UInteger,
	majorVersion As Integer,
	minorVersion As Integer
) As Boolean
Parameters
typecode
Type: System.UInt32
chunk's typecode
majorVersion
Type: System.Int32
[Missing <param name="majorVersion"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int32,System.Int32)"]
minorVersion
Type: System.Int32
[Missing <param name="minorVersion"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int32,System.Int32)"]
Return Value
Type: Boolean
 True if input was valid and chunk was started. In this case you must call EndWrite3dmChunk(), even if something goes wrong while you attempt to write the contents of the chunk. False if input was not valid or the write failed.
See Also
Reference
BinaryArchiveWriter Class
BeginWrite3dmChunk Overload
Rhino.FileIO Namespace