RhinoCommon API
CachedTextureCoordinates.Remove Method
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Remove(
	Point3d item
)
Public Function Remove (
	item As Point3d
) As Boolean
Parameters
item
Type: Rhino.Geometry.Point3d
[Missing <param name="item"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.Remove(Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.CachedTextureCoordinates.Remove(Rhino.Geometry.Point3d)"]
Implements
ICollection<T>.Remove(T)
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace