RhinoCommon API
RenderMaterial.CreateBasicMaterial Method (Material)
 Constructs a new basic material from a Material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderMaterial CreateBasicMaterial(
	Material material
)
Public Shared Function CreateBasicMaterial (
	material As Material
) As RenderMaterial
Parameters
material
Type: Rhino.DocObjects.Material
(optional)The material to create the basic material from.
Return Value
Type: RenderMaterial
A new basic material.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderMaterial Class
CreateBasicMaterial Overload
Rhino.Render Namespace