RhinoCommon API
DisplayPipeline.DrawDot Method (Point3d, String)
 Draws a text dot in world coordinates.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawDot(
	Point3d worldPosition,
	string text
)
Public Sub DrawDot (
	worldPosition As Point3d,
	text As String
)
Parameters
worldPosition
Type: Rhino.Geometry.Point3d
Location of dot in world coordinates.
text
Type: System.String
Text content of dot.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipeline Class
DrawDot Overload
Rhino.Display Namespace