RhinoCommon SDK
ViewportInfo.UnlockFrustumSymmetry Method
 Unlocks frustum horizontal and vertical symmetries.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UnlockFrustumSymmetry()
Public Sub UnlockFrustumSymmetry
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace