RhinoCommon SDK
RenderPipeline.CommandResult Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.CommandResult"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result CommandResult()
Public Function CommandResult As Result
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.CommandResult"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace