RhinoCommon API
Mesh.OnSwitchToNonConst Method
 Performs some memory cleanup if necessary
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Mesh Class
Rhino.Geometry Namespace