RhinoCommon SDK
Interop.FileWriteOptionsConstPointer Method
 Returns the underlying const CRhinoFileWriteOptions* for a Rhino.FileIO.FileWriteOptions object. You should only be interested in using this function if you are writing C++ code.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static IntPtr FileWriteOptionsConstPointer(
	FileWriteOptions options
)
Public Shared Function FileWriteOptionsConstPointer (
	options As FileWriteOptions
) As IntPtr
Parameters
options
Type: Rhino.FileIO.FileWriteOptions
A FileWriteOptions object.
Return Value
Type: IntPtr
A pointer to the Rhino const object.
See Also
Reference
Interop Class
Rhino.Runtime Namespace