RhinoCommon SDK
File3dmLinetypeTable.FindNameHash Method
 Finds a Linetype given its name hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As Linetype
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the Linetype to be searched.
Return Value
Type: Linetype
An Linetype, or null on error.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace