RhinoCommon API
UserDictionary.OnDuplicate Method
 Clones the user data.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void OnDuplicate(
	UserData source
)
Protected Overrides Sub OnDuplicate (
	source As UserData
)
Parameters
source
Type: Rhino.DocObjects.Custom.UserData
The source data.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace