RhinoCommon API
RhinoObject.GetMeshes Method
 Get existing meshes used to render and analyze surface and polysrf objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Mesh[] GetMeshes(
	MeshType meshType
)
Public Overridable Function GetMeshes (
	meshType As MeshType
) As Mesh()
Parameters
meshType
Type: Rhino.Geometry.MeshType
[Missing <param name="meshType"/> documentation for "M:Rhino.DocObjects.RhinoObject.GetMeshes(Rhino.Geometry.MeshType)"]
Return Value
Type: Mesh[]
An array of meshes.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace