RhinoCommon API
ColorXYZ Constructor (Double, Double, Double)
 Constructs a new instance of ColorXYZ with custom channel values.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorXYZ(
	double x,
	double y,
	double z
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double
)
Parameters
x
Type: System.Double
X channel value, channel will be limited to 0~1.
y
Type: System.Double
Y channel value, channel will be limited to 0~1.
z
Type: System.Double
Z channel value, channel will be limited to 0~1.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ColorXYZ Structure
ColorXYZ Overload
Rhino.Display Namespace