RhinoCommon API
PlugIn.SaveSettings Method
 Write settings to disk which will raise a SettingsSaved event.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SaveSettings()
Public Sub SaveSettings
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace