RhinoCommon SDK
NurbsSurfaceKnotList.SuperfluousKnot Method
 Computes the knots that are superfluous because they are not used in NURBs evaluation. These make it appear so that the first and last surface spans are different from interior spans.
http://wiki.mcneel.com/developer/onsuperfluousknot
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SuperfluousKnot(
	bool start
)
Public Function SuperfluousKnot (
	start As Boolean
) As Double
Parameters
start
Type: System.Boolean
true if the query targets the first knot. Otherwise, the last knot.
Return Value
Type: Double
A component.
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace