RhinoCommon API
MetaData.ContentInstanceId Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.MetaData.ContentInstanceId"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ContentInstanceId()
Public Function ContentInstanceId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.DataSources.MetaData.ContentInstanceId"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace