RhinoCommon API
DocumentOrFreeFloatingBase.EndChange Method
 See BeginChange
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EndChange()
Public Function EndChange As Boolean
Return Value
Type: Boolean
true if the object has returned to no-changes mode.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DocumentOrFreeFloatingBase Class
Rhino.Render Namespace