RhinoCommon SDK
NurbsSurface.CreateFromSphere Method
 Constructs a new NURBS surfaces from sphere data.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateFromSphere(
	Sphere sphere
)
Public Shared Function CreateFromSphere (
	sphere As Sphere
) As NurbsSurface
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace