RhinoCommon API
Plane.FitPlaneToPoints Method (IEnumerable<Point3d>, Plane)
Fit a plane through a collection of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static PlaneFitResult FitPlaneToPoints(
	IEnumerable<Point3d> points,
	out Plane plane
)
Public Shared Function FitPlaneToPoints (
	points As IEnumerable(Of Point3d),
	<OutAttribute> ByRef plane As Plane
) As PlaneFitResult
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to fit to.
plane
Type: Rhino.Geometry.Plane
Resulting plane.
Return Value
Type: PlaneFitResult
A value indicating the result of the operation.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Plane Structure
FitPlaneToPoints Overload
Rhino.Geometry Namespace