RhinoCommon API
LinetypeTable.Find Method (String)
Finds the linetype with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	string name
)
Public Function Find (
	name As String
) As Integer
Parameters
name
Type: System.String
search ignores case.
Return Value
Type: Int32
 >=0 index of the linetype with the given name -1 no linetype has the given name.
Remarks
Suggested new method in place of this: FindName().
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
LinetypeTable Class
Find Overload
Rhino.DocObjects.Tables Namespace