RhinoCommon API
MouseCallback.OnMouseDoubleClick Method
[Missing <summary> documentation for "M:Rhino.UI.MouseCallback.OnMouseDoubleClick(Rhino.UI.MouseCallbackEventArgs)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseDoubleClick(
	MouseCallbackEventArgs e
)
Protected Overridable Sub OnMouseDoubleClick (
	e As MouseCallbackEventArgs
)
Parameters
e
Type: Rhino.UI.MouseCallbackEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.MouseCallback.OnMouseDoubleClick(Rhino.UI.MouseCallbackEventArgs)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MouseCallback Class
Rhino.UI Namespace