RhinoCommon API
GetBaseClass.Option Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.Option"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CommandLineOption Option()
Public Function Option As CommandLineOption
Return Value
Type: CommandLineOption
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.Option"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace