RhinoCommon SDK
Intersection.LineBox Method (Line, Box, Double, Interval)
 Intersects an infinite line with a box volume.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool LineBox(
	Line line,
	Box box,
	double tolerance,
	out Interval lineParameters
)
Public Shared Function LineBox (
	line As Line,
	box As Box,
	tolerance As Double,
	<OutAttribute> ByRef lineParameters As Interval
) As Boolean
Parameters
line
Type: Rhino.Geometry.Line
Line for intersection.
box
Type: Rhino.Geometry.Box
Box to intersect.
tolerance
Type: System.Double
 If tolerance > 0.0, then the intersection is performed against a box that has each side moved out by tolerance.
lineParameters
Type: Rhino.Geometry.Interval
 The chord from line.PointAt(lineParameters.T0) to line.PointAt(lineParameters.T1) is the intersection.
Return Value
Type: Boolean
true if the line intersects the box, false if no intersection occurs.
See Also
Reference
Intersection Class
LineBox Overload
Rhino.Geometry.Intersect Namespace