RhinoCommon API
PointCloud.GetPoints Method
 Copy all the point coordinates in this point cloud to an array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] GetPoints()
Public Function GetPoints As Point3d()
Return Value
Type: Point3d[]
An array containing all the points in this point cloud.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace