RhinoCommon API
File3dmStringTable.GetValue Method (Int32)
 Returns a string value at a given index.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetValue(
	int i
)
Public Function GetValue (
	i As Integer
) As String
Parameters
i
Type: System.Int32
The index at which to get the value.
Return Value
Type: String
The string value if successful.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmStringTable Class
GetValue Overload
Rhino.FileIO Namespace