RhinoCommon SDK
FactoryBase.Finalize Method
 Finalizer
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FactoryBase Class
Rhino.UI.Controls Namespace