RhinoCommon SDK
Curve.CreateBlendCurve Method (Curve, Curve, BlendContinuity)
 Create a Blend curve between two existing curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateBlendCurve(
	Curve curveA,
	Curve curveB,
	BlendContinuity continuity
)
Public Shared Function CreateBlendCurve (
	curveA As Curve,
	curveB As Curve,
	continuity As BlendContinuity
) As Curve
Parameters
curveA
Type: Rhino.Geometry.Curve
Curve to blend from (blending will occur at curve end point).
curveB
Type: Rhino.Geometry.Curve
Curve to blend to (blending will occur at curve start point).
continuity
Type: Rhino.Geometry.BlendContinuity
Continuity of blend.
Return Value
Type: Curve
A curve representing the blend between A and B or null on failure.
See Also
Reference
Curve Class
CreateBlendCurve Overload
Rhino.Geometry Namespace