RhinoCommon SDK
SubDVertexSectorIterator.AdvanceToNextFace Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.AdvanceToNextFace(System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AdvanceToNextFace(
	bool stopAtCrease
)
Public Function AdvanceToNextFace (
	stopAtCrease As Boolean
) As Boolean
Parameters
stopAtCrease
Type: System.Boolean
[Missing <param name="stopAtCrease"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.AdvanceToNextFace(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.AdvanceToNextFace(System.Boolean)"]
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace