RhinoCommon API
SimpleArrayLinetypePointer.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimpleArrayLinetypePointer Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace