RhinoCommon API
ArchivableDictionary.Set Method (String, Single)
 Sets a Single.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	float val
)
Public Function Set (
	key As String,
	val As Single
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.Single
A Single.
Because Single has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace