RhinoCommon API
BinaryArchiveWriter.WriteSizeF Method
 Writes a SizeF value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteSizeF(
	SizeF value
)
Public Sub WriteSizeF (
	value As SizeF
)
Parameters
value
Type: System.Drawing.SizeF
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace