RhinoCommon API
RhinoDoc.GetAnalysisMeshingParameters Method
 Get analysis meshing parameters currently used by the document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters GetAnalysisMeshingParameters()
Public Function GetAnalysisMeshingParameters As MeshingParameters
Return Value
Type: MeshingParameters
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetAnalysisMeshingParameters"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace