RhinoCommon SDK
Box.MakeValid Method
 Attempts to make the Box valid. This is not always possible.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeValid()
Public Function MakeValid As Boolean
Return Value
Type: Boolean
true if the box was made valid, or if it was valid to begin with. false if the box remains in a differently abled state.
See Also
Reference
Box Structure
Rhino.Geometry Namespace