RhinoCommon API
MeshTopologyEdgeList.GetTopologyVertices Method
Gets the two topology vertices for a given topology edge.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IndexPair GetTopologyVertices(
	int topologyEdgeIndex
)
Public Function GetTopologyVertices (
	topologyEdgeIndex As Integer
) As IndexPair
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge.
Return Value
Type: IndexPair
The pair of vertex indices the edge connects.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace