RhinoCommon API
BinaryArchiveReader.ReadRenderSettings Method
 Reads a RenderSettings-derived object from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderSettings ReadRenderSettings()
Public Function ReadRenderSettings As RenderSettings
Return Value
Type: RenderSettings
The element that was read.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace