RhinoCommon API
ISettingsService.WriteSettings Method
 Writes the settings to OS specific location.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool WriteSettings(
	bool isShuttingDown,
	Stream stream,
	string fileName,
	Action<bool, bool> writing
)
Function WriteSettings (
	isShuttingDown As Boolean,
	stream As Stream,
	fileName As String,
	writing As Action(Of Boolean, Boolean)
) As Boolean
Parameters
isShuttingDown
Type: System.Boolean
 Will be true if Rhino is in the process of shutting down when writing the file
stream
Type: System.IO.Stream
 Stream containing the XML document
fileName
Type: System.String
 Requested file name and location.
writing
Type: System.Action<Boolean, Boolean>
 Called twice, first time with a false argument meaning about to write the final file, second time with a true meaning it is done writing.
Return Value
Type: Boolean
 Return true, if settings was written, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace