RhinoCommon SDK
SubDFaceAccess.Add Method
 Adds a new edge to the end of the SubDEdgePtr list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacePtr Add(
	SubDEdgePtr[] edges,
	bool[] directions
)
Public Function Add (
	edges As SubDEdgePtr(),
	directions As Boolean()
) As SubDFacePtr
Parameters
edges
Type: Rhino.Geometry.SubDEdgePtr[]
An array of edges
directions
Type: System.Boolean[]
The direction each of these edges has, ralated to the face. True means that the edge is reversed compared to the counter-clockwise order of the face.
This argument can be null. In this case, no edge is considered reversed.
Return Value
Type: SubDFacePtr
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDFaceAccess.Add(Rhino.Geometry.SubDEdgePtr[],System.Boolean[])"]
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If tag is unset or non-defined.
See Also
Reference
SubDFaceAccess Class
Rhino.Geometry.Collections Namespace