RhinoCommon API
Layer.GetUserString Method
 Gets user string from this geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetUserString(
	string key
)
Public Function GetUserString (
	key As String
) As String
Parameters
key
Type: System.String
id used to retrieve the string.
Return Value
Type: String
string associated with the key if successful. null if no key was found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Layer Class
Rhino.DocObjects Namespace