RhinoCommon API
PreviewAppearance Constructor
 Constructor for previewappearance
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewAppearance(
	IntPtr pRenderContent
)
Public Sub New (
	pRenderContent As IntPtr
)
Parameters
pRenderContent
Type: System.IntPtr
[Missing <param name="pRenderContent"/> documentation for "M:Rhino.Render.PreviewAppearance.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace