RhinoCommon API
Font.InstalledFontsAsQuartets Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Font.InstalledFontsAsQuartets"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static FontQuartet[] InstalledFontsAsQuartets()
Public Shared Function InstalledFontsAsQuartets As FontQuartet()
Return Value
Type: FontQuartet[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Font.InstalledFontsAsQuartets"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Font Class
Rhino.DocObjects Namespace