RhinoCommon SDK
DisplayPipeline.EnableClippingPlanes Method
 Enable or disable the Clipping Plane logic of the engine.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableClippingPlanes(
	bool enable
)
Public Sub EnableClippingPlanes (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable Clipping Planes, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace