RhinoCommon API
SupportOptions.SetCustomPaths Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetCustomPaths(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetCustomPaths(
	string path
)
Public Shared Sub SetCustomPaths (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetCustomPaths(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SupportOptions Class
Rhino.Render Namespace