RhinoCommon API
ViewCaptureSettings Constructor (RhinoPageView, Double)
Initializes a new instance of the ViewCaptureSettings class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewCaptureSettings(
	RhinoPageView sourcePageView,
	double dpi
)
Public Sub New (
	sourcePageView As RhinoPageView,
	dpi As Double
)
Parameters
sourcePageView
Type: Rhino.Display.RhinoPageView
[Missing <param name="sourcePageView"/> documentation for "M:Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.RhinoPageView,System.Double)"]
dpi
Type: System.Double
[Missing <param name="dpi"/> documentation for "M:Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.RhinoPageView,System.Double)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ViewCaptureSettings Class
ViewCaptureSettings Overload
Rhino.Display Namespace