RhinoCommon API
SupportOptions.SupportSharedUIs Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIs"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SupportSharedUIs()
Public Shared Function SupportSharedUIs As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.SupportSharedUIs"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SupportOptions Class
Rhino.Render Namespace