RhinoCommon API
MeshVertexStatusList.Destroy Method
 Releases all memory allocated to store hidden vertices. The list capacity will be 0 after this call.
Vertices will be immediately considered visible.
Subsequent calls can add new items.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Destroy()
Public Sub Destroy
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace