RhinoCommon API
Field.CreateCppPointer Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.Field.CreateCppPointer(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void CreateCppPointer(
	RenderContent content,
	string key,
	string prompt,
	Object initialValue,
	bool isTextured
)
Protected Sub CreateCppPointer (
	content As RenderContent,
	key As String,
	prompt As String,
	initialValue As Object,
	isTextured As Boolean
)
Parameters
content
Type: Rhino.Render.RenderContent
[Missing <param name="content"/> documentation for "M:Rhino.Render.Fields.Field.CreateCppPointer(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Render.Fields.Field.CreateCppPointer(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Render.Fields.Field.CreateCppPointer(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
initialValue
Type: System.Object
[Missing <param name="initialValue"/> documentation for "M:Rhino.Render.Fields.Field.CreateCppPointer(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
isTextured
Type: System.Boolean
[Missing <param name="isTextured"/> documentation for "M:Rhino.Render.Fields.Field.CreateCppPointer(Rhino.Render.RenderContent,System.String,System.String,System.Object,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Field Class
Rhino.Render.Fields Namespace