RhinoCommon API
CurveList Constructor (IEnumerable<Curve>)
 Initializes a new list that is filled with all items of the input enumerable.
Input items are not explicitly duplicated (this is a shallow copy).
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CurveList(
	IEnumerable<Curve> collection
)
Public Sub New (
	collection As IEnumerable(Of Curve)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Curve>
A list, an array or any enumerable set of Curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CurveList Class
CurveList Overload
Rhino.Collections Namespace