RhinoCommon API
Point2d Constructor (Point2d)
 Initializes a new instance of Point2d by copying another Point2d.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d(
	Point2d point
)
Public Sub New (
	point As Point2d
)
Parameters
point
Type: Rhino.Geometry.Point2d
The point that will be copied.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace