RhinoCommon API
SupportOptions.SetPreferNativeRenderer Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetPreferNativeRenderer(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetPreferNativeRenderer(
	bool b
)
Public Shared Sub SetPreferNativeRenderer (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetPreferNativeRenderer(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
SupportOptions Class
Rhino.Render Namespace