RhinoCommon SDK
Thumbnail.IsSelected Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.Thumbnail.IsSelected"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsSelected()
Public Function IsSelected As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.Thumbnail.IsSelected"]
Implements
IRhRdkThumbnail.IsSelected()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace