RhinoCommon SDK
SubDEdgeAccess.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Geometry.Collections.SubDEdgeAccess.GetEnumerator"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<SubDEdgePtr> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SubDEdgePtr)
Return Value
Type: IEnumerator<SubDEdgePtr>
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDEdgeAccess.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
SubDEdgeAccess Class
Rhino.Geometry.Collections Namespace