RhinoCommon API
RdkEdit.Dispose Method
Releases all resources used by the RdkEdit
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RdkEdit Class
Rhino.Render.DataSources Namespace