RhinoCommon SDK
MeshFaceNormalList.AddFaceNormal Method (Single, Single, Single)
 Appends a face normal to the list of mesh face normals.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddFaceNormal(
	float x,
	float y,
	float z
)
Public Function AddFaceNormal (
	x As Single,
	y As Single,
	z As Single
) As Integer
Parameters
x
Type: System.Single
X component of face normal.
y
Type: System.Single
Y component of face normal.
z
Type: System.Single
Z component of face normal.
Return Value
Type: Int32
The index of the newly added face normal.
See Also
Reference
MeshFaceNormalList Class
AddFaceNormal Overload
Rhino.Geometry.Collections Namespace