RhinoCommon API
ViewportInfo.GetScreenPort Method
 Gets the location of viewport in pixels. See documentation for SetScreenPort.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle GetScreenPort()
Public Function GetScreenPort As Rectangle
Return Value
Type: Rectangle
The rectangle, or Empty rectangle on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewportInfo Class
GetScreenPort Overload
Rhino.DocObjects Namespace