RhinoCommon API
AnnotationBase.GetBoundingBox Method (Transform)
 Aligned Boundingbox solver. Gets the world axis aligned boundingbox for the transformed geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override BoundingBox GetBoundingBox(
	Transform xform
)
Public Overrides Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply to bbox after calculation. The geometry is not modified.
Return Value
Type: BoundingBox
The boundingbox of the transformed geometry in world coordinates or BoundingBox.Empty if not bounding box could be found.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
AnnotationBase Class
GetBoundingBox Overload
Rhino.Geometry Namespace