RhinoCommon API
GumballDisplayConduit.SetBaseGumball Method (GumballObject)
 Contents of the gumball are copied to the base gumball of this class.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetBaseGumball(
	GumballObject gumball
)
Public Sub SetBaseGumball (
	gumball As GumballObject
)
Parameters
gumball
Type: Rhino.UI.Gumball.GumballObject
The gumball source.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GumballDisplayConduit Class
SetBaseGumball Overload
Rhino.UI.Gumball Namespace