RhinoCommon SDK
InstanceDefinitionTable.ModifySourceArchive Method
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModifySourceArchive(
	int idefIndex,
	string sourceArchive,
	InstanceDefinitionUpdateType updateType,
	bool quiet
)
Public Function ModifySourceArchive (
	idefIndex As Integer,
	sourceArchive As String,
	updateType As InstanceDefinitionUpdateType,
	quiet As Boolean
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be modified.
sourceArchive
Type: System.String
The new source archive file name.
updateType
Type: Rhino.DocObjects.InstanceDefinitionUpdateType
[Missing <param name="updateType"/> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifySourceArchive(System.Int32,System.String,Rhino.DocObjects.InstanceDefinitionUpdateType,System.Boolean)"]
quiet
Type: System.Boolean
If true, then message boxes about erroneous parameters will not be shown.
Return Value
Type: Boolean
 Returns true if the definition was successfully modified otherwise returns false.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace