RhinoCommon SDK
Curve.ProjectToBrep Method (IEnumerable<Curve>, IEnumerable<Brep>, Vector3d, Double, Int32[], Int32[])
 Projects a collection of Curves onto a collection of Breps along a given direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] ProjectToBrep(
	IEnumerable<Curve> curves,
	IEnumerable<Brep> breps,
	Vector3d direction,
	double tolerance,
	out int[] curveIndices,
	out int[] brepIndices
)
Public Shared Function ProjectToBrep (
	curves As IEnumerable(Of Curve),
	breps As IEnumerable(Of Brep),
	direction As Vector3d,
	tolerance As Double,
	<OutAttribute> ByRef curveIndices As Integer(),
	<OutAttribute> ByRef brepIndices As Integer()
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
Curves to project.
breps
Type: System.Collections.Generic.IEnumerable<Brep>
Breps to project onto.
direction
Type: Rhino.Geometry.Vector3d
Direction of projection.
tolerance
Type: System.Double
Tolerance to use for projection.
curveIndices
Type: System.Int32[]
Index of which curve in the input list was the source for a curve in the return array.
brepIndices
Type: System.Int32[]
Index of which brep was used to generate a curve in the return array.
Return Value
Type: Curve[]
An array of projected curves. Array is empty if the projection set is empty.
See Also
Reference
Curve Class
ProjectToBrep Overload
Rhino.Geometry Namespace