RhinoCommon API
RhinoViewport.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.DeleteAllUserStrings"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace