RhinoCommon API
SimulatedTexture.ConstPointer Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedTexture.ConstPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.SimulatedTexture.ConstPointer"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace