RhinoCommon API
ISettingsService.DeleteSettingsFile Method
 Deletes the settings file.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void DeleteSettingsFile(
	string fileName
)
Sub DeleteSettingsFile (
	fileName As String
)
Parameters
fileName
Type: System.String
 Full path to settings to delete.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace