RhinoCommon API
RenderContentCollection.Clear Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.Clear"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace