RhinoCommon SDK
VisualAnalysisMode.DrawPointObject Method
 Draws one point. Override this method to add your custom behavior.
The default implementation does nothing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawPointObject(
	PointObject point,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawPointObject (
	point As PointObject,
	pipeline As DisplayPipeline
)
Parameters
point
Type: Rhino.DocObjects.PointObject
A point object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace