RhinoCommon API
BinaryArchiveReader.ReadDouble Method
 Reads a Double from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ReadDouble()
Public Function ReadDouble As Double
Return Value
Type: Double
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace