RhinoCommon API
PolyCurve.SegmentIndex Method
 Finds the segment used for evaluation at polycurve_parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SegmentIndex(
	double polycurveParameter
)
Public Function SegmentIndex (
	polycurveParameter As Double
) As Integer
Parameters
polycurveParameter
Type: System.Double
Parameter on polycurve for segment lookup.
Return Value
Type: Int32
 Index of the segment used for evaluation at polycurve_parameter. If polycurve_parameter < Domain.Min(), then 0 is returned. If polycurve_parameter > Domain.Max(), then Count()-1 is returned.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace