RhinoCommon SDK
Brep.DuplicateEdgeCurves Method
 Duplicate all the edges of this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] DuplicateEdgeCurves()
Public Function DuplicateEdgeCurves As Curve()
Return Value
Type: Curve[]
An array of edge curves.
See Also
Reference
Brep Class
DuplicateEdgeCurves Overload
Rhino.Geometry Namespace