RhinoCommon API
LightManagerSupportClient.DeleteLight Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.DeleteLight(Rhino.Geometry.Light)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DeleteLight(
	Light light
)
Public Sub DeleteLight (
	light As Light
)
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupportClient.DeleteLight(Rhino.Geometry.Light)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace