RhinoCommon API
Layer.IsChildOf Method (Layer)
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(Rhino.DocObjects.Layer)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsChildOf(
	Layer otherLayer
)
Public Function IsChildOf (
	otherLayer As Layer
) As Boolean
Parameters
otherLayer
Type: Rhino.DocObjects.Layer
[Missing <param name="otherLayer"/> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(Rhino.DocObjects.Layer)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(Rhino.DocObjects.Layer)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Layer Class
IsChildOf Overload
Rhino.DocObjects Namespace