RhinoCommon SDK
PlugIn.WriteDocument Method
 Called when Rhino is saving a .3dm file to allow the plug-in to save document user data.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void WriteDocument(
	RhinoDoc doc,
	BinaryArchiveWriter archive,
	FileWriteOptions options
)
Protected Overridable Sub WriteDocument (
	doc As RhinoDoc,
	archive As BinaryArchiveWriter,
	options As FileWriteOptions
)
Parameters
doc
Type: Rhino.RhinoDoc
The Rhino document instance that is being saved.
archive
Type: Rhino.FileIO.BinaryArchiveWriter
 OpenNURBS file archive object Rhino is using to write the file. Use BinaryArchiveWriter.Write*() functions to write plug-in data. OR use the ArchivableDictionary If any BinaryArchiveWriter.Write*() functions throw an exception, then archive.WriteErrorOccured will be true and you should immediately return. Setting archive.WriteErrorOccured to true will cause Rhino to stop saving the file.
options
Type: Rhino.FileIO.FileWriteOptions
The file write options, such as "include preview image" and "include render meshes".
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace