RhinoCommon API
ArcCurve Constructor (ArcCurve)
 Initializes a new ArcCurve instance, copying values from another ArcCurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArcCurve(
	ArcCurve other
)
Public Sub New (
	other As ArcCurve
)
Parameters
other
Type: Rhino.Geometry.ArcCurve
Another ArcCurve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace