RhinoCommon API
GetPolyline Constructor
Initializes a new instance of the GetPolyline class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetPolyline()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace