RhinoCommon SDK
ObjectTable.FindByObjectType Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.FindByObjectType(Rhino.DocObjects.ObjectType)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByObjectType(
	ObjectType typeFilter
)
Public Function FindByObjectType (
	typeFilter As ObjectType
) As RhinoObject()
Parameters
typeFilter
Type: Rhino.DocObjects.ObjectType
[Missing <param name="typeFilter"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.FindByObjectType(Rhino.DocObjects.ObjectType)"]
Return Value
Type: RhinoObject[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.FindByObjectType(Rhino.DocObjects.ObjectType)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace