RhinoCommon API
GumballObject Constructor
Initializes a new instance of the GumballObject class
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballObject()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace