RhinoCommon API
DisplayPipeline.DrawDot Method (Point3d, String, Color, Color)
 Draw a text dot in world coordinates.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawDot(
	Point3d worldPosition,
	string text,
	Color dotColor,
	Color textColor
)
Public Sub DrawDot (
	worldPosition As Point3d,
	text As String,
	dotColor As Color,
	textColor As Color
)
Parameters
worldPosition
Type: Rhino.Geometry.Point3d
Location of dot in world coordinates.
text
Type: System.String
Text content of dot.
dotColor
Type: System.Drawing.Color
Dot background color.
textColor
Type: System.Drawing.Color
Dot foreground color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
DisplayPipeline Class
DrawDot Overload
Rhino.Display Namespace