RhinoCommon SDK
Sphere.LongitudeDegrees Method
 Computes the meridian at a specific longitude angle.
The angle is specified in degrees.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle LongitudeDegrees(
	double degrees
)
Public Function LongitudeDegrees (
	degrees As Double
) As Circle
Parameters
degrees
Type: System.Double
An angle in degrees.
Return Value
Type: Circle
A circle.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace