RhinoCommon API
MeshFace.IsValid Method (Int32)
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes upper bound indices into account.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid(
	int vertexCount
)
Public Function IsValid (
	vertexCount As Integer
) As Boolean
Parameters
vertexCount
Type: System.Int32
Number of vertices in the mesh that this face is a part of.
Return Value
Type: Boolean
true if the face is considered valid, false if not.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshFace Structure
IsValid Overload
Rhino.Geometry Namespace