RhinoCommon SDK
DisplayPipeline.DrawSphere Method (Sphere, Color)
 Draw a wireframe sphere.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawSphere(
	Sphere sphere,
	Color color
)
Public Sub DrawSphere (
	sphere As Sphere,
	color As Color
)
Parameters
sphere
Type: Rhino.Geometry.Sphere
Sphere to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawSphere Overload
Rhino.Display Namespace