RhinoCommon API
CommandAliasList.GetMacro Method
Returns the macro of a command alias.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string GetMacro(
	string alias
)
Public Shared Function GetMacro (
	alias As String
) As String
Parameters
alias
Type: System.String
[in] The name of the command alias.
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CommandAliasList.GetMacro(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace