RhinoCommon API
IPanelsService.PanelDockBar Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.PanelDockBar(System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid PanelDockBar(
	Guid panelId
)
Function PanelDockBar (
	panelId As Guid
) As Guid
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.PanelDockBar(System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.PanelDockBar(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace