RhinoCommon API
SupportOptions.SetLibrariesInitialLocationCustomFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocationCustomFolder(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetLibrariesInitialLocationCustomFolder(
	string path
)
Public Shared Sub SetLibrariesInitialLocationCustomFolder (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocationCustomFolder(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SupportOptions Class
Rhino.Render Namespace