RhinoCommon API
TrulyObservableOrderedSet<T> Constructor (IEnumerable<T>)
 Creates an instance with the given items.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TrulyObservableOrderedSet(
	IEnumerable<T> items
)
Public Sub New (
	items As IEnumerable(Of T)
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<T>
Items that the instance will contain. If there are duplicate items, they will be removed.
See Also
Reference
TrulyObservableOrderedSet<T> Class
TrulyObservableOrderedSet<T> Overload
Rhino.Runtime.Notifications Namespace