RhinoCommon API
GumballDisplayConduit.Finalize Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballDisplayConduit.Finalize"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace