RhinoCommon SDK
SubDVertexAccess.Find Method
[Missing <summary> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.Find(System.Int32)"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr Find(
	int vertexIndex
)
Public Function Find (
	vertexIndex As Integer
) As SubDVertexPtr
Parameters
vertexIndex
Type: System.Int32
[Missing <param name="vertexIndex"/> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.Find(System.Int32)"]
Return Value
Type: SubDVertexPtr
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.Find(System.Int32)"]
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace