RhinoCommon API
PolyCurve.Append Method (Arc)
 Appends and matches the start of the arc to the end of polycurve. This function will fail if the polycurve is closed or if SegmentCount > 0 and the arc is closed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Append(
	Arc arc
)
Public Function Append (
	arc As Arc
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
Arc segment to append.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PolyCurve Class
Append Overload
Rhino.Geometry Namespace