RhinoCommon API
GetBaseClass.SetWaitDuration Method
 Sets the wait duration (in milliseconds) of the getter. If the duration passes without the user making a decision, the GetResult.Timeout code is returned.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetWaitDuration(
	int milliseconds
)
Public Sub SetWaitDuration (
	milliseconds As Integer
)
Parameters
milliseconds
Type: System.Int32
Number of milliseconds to wait.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace