RhinoCommon API
Sphere.ClosestPoint Method
 Returns point on sphere that is closest to given point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to project onto Sphere.
Return Value
Type: Point3d
Point on sphere surface closest to testPoint.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace