RhinoCommon API
RenderWindow.Size Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.Size"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Size Size()
Public Function Size As Size
Return Value
Type: Size
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.Size"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderWindow Class
Rhino.Render Namespace