RhinoCommon API
SupportOptions.SetHarvestContentParameters Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetHarvestContentParameters(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetHarvestContentParameters(
	bool b
)
Public Shared Sub SetHarvestContentParameters (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetHarvestContentParameters(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SupportOptions Class
Rhino.Render Namespace