RhinoCommon API
RhinoViewport.ClientToScreen Method (Point2d)
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.ClientToScreen(Rhino.Geometry.Point2d)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point ClientToScreen(
	Point2d clientPoint
)
Public Function ClientToScreen (
	clientPoint As Point2d
) As Point
Parameters
clientPoint
Type: Rhino.Geometry.Point2d
[Missing <param name="clientPoint"/> documentation for "M:Rhino.Display.RhinoViewport.ClientToScreen(Rhino.Geometry.Point2d)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.ClientToScreen(Rhino.Geometry.Point2d)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoViewport Class
ClientToScreen Overload
Rhino.Display Namespace