RhinoCommon API
LightManagerSupportClient.Dispose Method
Releases all resources used by the LightManagerSupportClient
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace