RhinoCommon API
CursorTooltipSettingsState Constructor
Initializes a new instance of the CursorTooltipSettingsState class
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CursorTooltipSettingsState()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace