RhinoCommon API
LicenseUtils.LogoutOfCloudZoo Method
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseUtils.LogoutOfCloudZoo"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool LogoutOfCloudZoo()
Public Shared Function LogoutOfCloudZoo As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.LogoutOfCloudZoo"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace