RhinoCommon API
BinaryArchiveReader.ReadString Method
 Reads a String from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ReadString()
Public Function ReadString As String
Return Value
Type: String
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace