RhinoCommon SDK
OptionToggle.Dispose Method
Releases all resources used by the OptionToggle
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
OptionToggle Class
Dispose Overload
Rhino.Input.Custom Namespace