RhinoCommon SDK
IStackedDialogPageService.SelectedView Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedView(Rhino.UI.ObjectPropertiesPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RhinoView SelectedView(
	ObjectPropertiesPage page
)
Function SelectedView (
	page As ObjectPropertiesPage
) As RhinoView
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedView(Rhino.UI.ObjectPropertiesPage)"]
Return Value
Type: RhinoView
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedView(Rhino.UI.ObjectPropertiesPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace