RhinoCommon API
RhinoViewport.GetFarRect Method
Get corners of far clipping plane rectangle.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] GetFarRect()
Public Function GetFarRect As Point3d()
Return Value
Type: Point3d[]
 [left_bottom, right_bottom, left_top, right_top] points on success null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace