RhinoCommon API
GroundPlane Constructor (GroundPlane)
 Create an utility object not associated with any document from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GroundPlane(
	GroundPlane g
)
Public Sub New (
	g As GroundPlane
)
Parameters
g
Type: Rhino.Render.GroundPlane
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GroundPlane Class
GroundPlane Overload
Rhino.Render Namespace