RhinoCommon SDK
TextureMapping.CreateCylinderMapping Method
Create a cylindrical projection texture mapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static TextureMapping CreateCylinderMapping(
	Cylinder cylinder,
	bool capped
)
Public Shared Function CreateCylinderMapping (
	cylinder As Cylinder,
	capped As Boolean
) As TextureMapping
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
 cylinder in world space used to define a cylindrical coordinate system. The angular parameter maps (0,2pi) to texture "u" (0,1), The height parameter maps (height[0],height[1]) to texture "v" (0,1), and the radial parameter maps (0,r) to texture "w" (0,1).
capped
Type: System.Boolean
 If true, the cylinder is treated as a finite capped cylinder
Return Value
Type: TextureMapping
TextureMapping instance if input is valid
Remarks
 When the cylinder is capped and m_texture_space = divided, the cylinder is mapped to texture space as follows: The side is mapped to 0 <= "u" <= 2/3. The bottom is mapped to 2/3 <= "u" <= 5/6. The top is mapped to 5/6 <= "u" <= 5/6. This is the same convention box mapping uses.
See Also
Reference
TextureMapping Class
Rhino.Render Namespace