RhinoCommon API
RTree.CreateMeshFaceTree Method
 Constructs a new tree with an element for each face in the mesh. The element id is set to the index of the face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RTree CreateMeshFaceTree(
	Mesh mesh
)
Public Shared Function CreateMeshFaceTree (
	mesh As Mesh
) As RTree
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh.
Return Value
Type: RTree
A new tree, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RTree Class
Rhino.Geometry Namespace