RhinoCommon API
Surface.TryGetTorus Method (Torus, Double)
Tests a surface to see if it is a portion of a torus and returns the torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetTorus(
	out Torus torus,
	double tolerance
)
Public Function TryGetTorus (
	<OutAttribute> ByRef torus As Torus,
	tolerance As Double
) As Boolean
Parameters
torus
Type: Rhino.Geometry.Torus
On success, the torus parameters are filled in.
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a torus.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Surface Class
TryGetTorus Overload
Rhino.Geometry Namespace