RhinoCommon SDK
ObjRef Constructor (Guid)
 Initializes a new object reference from a globally unique identifier (Guid).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjRef(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
The ID.
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace