RhinoCommon API
BrepFace.SetMesh Method
 Sets a reference to a specified type of mesh for this brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetMesh(
	MeshType meshType,
	Mesh mesh
)
Public Function SetMesh (
	meshType As MeshType,
	mesh As Mesh
) As Boolean
Parameters
meshType
Type: Rhino.Geometry.MeshType
The mesh type.
mesh
Type: Rhino.Geometry.Mesh
The new mesh.
Return Value
Type: Boolean
true if the operation succeeded; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace