RhinoCommon API
RenderTexture.GetDisplayInViewport Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetDisplayInViewport"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetDisplayInViewport()
Public Function GetDisplayInViewport As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetDisplayInViewport"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderTexture Class
Rhino.Render Namespace