RhinoCommon API
SceneServerData.Dispose Method
 Dispose for SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SceneServerData Class
Rhino.Render Namespace