RhinoCommon API
ToolbarFileCollection.FindByName Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ToolbarFile FindByName(
	string name,
	bool ignoreCase
)
Public Function FindByName (
	name As String,
	ignoreCase As Boolean
) As ToolbarFile
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
ignoreCase
Type: System.Boolean
[Missing <param name="ignoreCase"/> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
Return Value
Type: ToolbarFile
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace