RhinoCommon SDK
ObjectTable.Select Method (Guid, Boolean)
 Select or deselects a single object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Select(
	Guid objectId,
	bool select
)
Public Function Select (
	objectId As Guid,
	select As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to select.
select
Type: System.Boolean
If true, the object will be selected, if false, it will be deselected.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace