RhinoCommon SDK
IPanelsService.GetPanel Method (Guid, UInt32)
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Object GetPanel(
	Guid panelId,
	uint documentSerialNumber
)
Function GetPanel (
	panelId As Guid,
	documentSerialNumber As UInteger
) As Object
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid,System.UInt32)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IPanelsService Interface
GetPanel Overload
Rhino.UI Namespace