RhinoCommon SDK
File3dm.Audit Method
 This function is only kept for forward assembly compatibility.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Audit(
	bool attemptRepair,
	out int repairCount,
	out string errors,
	out int[] warnings
)
Public Function Audit (
	attemptRepair As Boolean,
	<OutAttribute> ByRef repairCount As Integer,
	<OutAttribute> ByRef errors As String,
	<OutAttribute> ByRef warnings As Integer()
) As Integer
Parameters
attemptRepair
Type: System.Boolean
 Ignored.
repairCount
Type: System.Int32
Is set to 0.
errors
Type: System.String
 Contains no meaninful error.
warnings
Type: System.Int32[]
Is set to null.
Return Value
Type: Int32
 Returns 0.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace