RhinoCommon API
CommonComponentTable<T>.Clear Method
 Marks all items as deleted.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace