RhinoCommon API
Point3dList.Duplicate Method
 Returns a deep copy of this point list instance.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList Duplicate()
Public Function Duplicate As Point3dList
Return Value
Type: Point3dList
The duplicated list.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Point3dList Class
Rhino.Collections Namespace