RhinoCommon API
GetArc Constructor
Initializes a new instance of the GetArc class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetArc()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace