RhinoCommon API
ArchivableDictionary.Set Method (String, Point3f)
 Sets a Point3f.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	Point3f val
)
Public Function Set (
	key As String,
	val As Point3f
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Point3f
A value for that key.
Because Point3f has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point3f)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace