RhinoCommon API
RdkModalEditContentBucket.Dispose Method
Releases all resources used by the RdkModalEditContentBucket
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RdkModalEditContentBucket Class
Rhino.Render.DataSources Namespace