RhinoCommon API
DisplayModeDescription.GetDisplayMode Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.GetDisplayMode(System.Guid)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static DisplayModeDescription GetDisplayMode(
	Guid id
)
Public Shared Function GetDisplayMode (
	id As Guid
) As DisplayModeDescription
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Display.DisplayModeDescription.GetDisplayMode(System.Guid)"]
Return Value
Type: DisplayModeDescription
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.GetDisplayMode(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace