RhinoCommon SDK
Curve.Contains Method (Point3d, Plane)
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointContainment Contains(
	Point3d testPoint,
	Plane plane
)
Public Function Contains (
	testPoint As Point3d,
	plane As Plane
) As PointContainment
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to test.
plane
Type: Rhino.Geometry.Plane
Plane in in which to compare point and region.
Return Value
Type: PointContainment
Relationship between point and curve region.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
Curve Class
Contains Overload
Rhino.Geometry Namespace