RhinoCommon SDK
Box.Inflate Method (Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Inflate(
	double amount
)
Public Sub Inflate (
	amount As Double
)
Parameters
amount
Type: System.Double
Amount (in model units) to inflate this box in all directions.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Box Structure
Inflate Overload
Rhino.Geometry Namespace