RhinoCommon API
WorldMapDayNight.Dispose Method
Releases all resources used by the WorldMapDayNight
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace