RhinoCommon SDK
MeshTopologyEdgeList.IsHidden Method
 Returns true if the topological edge is hidden. The mesh topology edge is hidden only if either of its mesh topology vertices is hidden.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsHidden(
	int topologyEdgeIndex
)
Public Function IsHidden (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if mesh topology edge is hidden.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace