RhinoCommon API
RhinoDoc.EndUndoRecord Method
 Ends the undo record.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EndUndoRecord(
	uint undoRecordSerialNumber
)
Public Function EndUndoRecord (
	undoRecordSerialNumber As UInteger
) As Boolean
Parameters
undoRecordSerialNumber
Type: System.UInt32
The serial number of the undo record.
Return Value
Type: Boolean
True if successful, false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace