RhinoCommon API
IRhRdkThumbnailList.Add Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Add(Rhino.UI.Controls.ThumbnailUI.Thumbnail)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void Add(
	Thumbnail t
)
Sub Add (
	t As Thumbnail
)
Parameters
t
Type: Rhino.UI.Controls.ThumbnailUI.Thumbnail
[Missing <param name="t"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Add(Rhino.UI.Controls.ThumbnailUI.Thumbnail)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace