RhinoCommon SDK
SubD.OnSwitchToNonConst Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.OnSwitchToNonConst"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
SubD Class
Rhino.Geometry Namespace