RhinoCommon API
File3dmObjectTable.Add Method
 Duplicates the object, then adds a copy of the object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override void Add(
	File3dmObject item
)
Public Overrides Sub Add (
	item As File3dmObject
)
Parameters
item
Type: Rhino.FileIO.File3dmObject
The item to duplicate and add.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace