RhinoCommon API
ZBufferCapture.WorldPointAt Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.WorldPointAt(System.Int32,System.Int32)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d WorldPointAt(
	int x,
	int y
)
Public Function WorldPointAt (
	x As Integer,
	y As Integer
) As Point3d
Parameters
x
Type: System.Int32
[Missing <param name="x"/> documentation for "M:Rhino.Display.ZBufferCapture.WorldPointAt(System.Int32,System.Int32)"]
y
Type: System.Int32
[Missing <param name="y"/> documentation for "M:Rhino.Display.ZBufferCapture.WorldPointAt(System.Int32,System.Int32)"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.WorldPointAt(System.Int32,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace