RhinoCommon API
Quaternion.Equals Method (Object)
 Determines whether an object is a quaternion and has the same value of this quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Another object to compare.
Return Value
Type: Boolean
true if obj is a quaternion and has exactly equal coefficients; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Quaternion Structure
Equals Overload
Rhino.Geometry Namespace