RhinoCommon API
RhinoMath.ToDegrees Method
 Convert an angle from radians to degrees.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double ToDegrees(
	double radians
)
Public Shared Function ToDegrees (
	radians As Double
) As Double
Parameters
radians
Type: System.Double
Radians to convert (180 degrees equals pi radians).
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.RhinoMath.ToDegrees(System.Double)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoMath Class
Rhino Namespace