RhinoCommon SDK
ViewportInfo.GetFrustumLine Method (Point)
 Gets the world coordinate line in the view frustum that projects to a point on the screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line GetFrustumLine(
	Point screenPoint
)
Public Function GetFrustumLine (
	screenPoint As Point
) As Line
Parameters
screenPoint
Type: System.Drawing.Point
screen location
Return Value
Type: Line
3d world coordinate line segment starting on the near clipping plane and ending on the far clipping plane.
See Also
Reference
ViewportInfo Class
GetFrustumLine Overload
Rhino.DocObjects Namespace