RhinoCommon API
SimpleArrayCurvePointer Constructor
 Initializes a new SimpleArrayCurvePointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayCurvePointer()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SimpleArrayCurvePointer Class
SimpleArrayCurvePointer Overload
Rhino.Runtime.InteropWrappers Namespace