RhinoCommon API
EarthAnchorPoint.EarthLocationIsSet Method
 Checks if the earth location is set or not.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EarthLocationIsSet()
Public Function EarthLocationIsSet As Boolean
Return Value
Type: Boolean
Bool value, true if set else false
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace