RhinoCommon API
RenderWindow.GetAdjust Method
 Get an ImageAdjust instance containing current image adjusting settings for this RenderWindow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ImageAdjust GetAdjust()
Public Function GetAdjust As RenderWindow.ImageAdjust
Return Value
Type: RenderWindow.ImageAdjust
ImageAdjust
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderWindow Class
Rhino.Render Namespace