RhinoCommon API
Transform.Multiply Operator (Transform, Point3d)
 Multiplies a transformation by a point and gets a new point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d operator *(
	Transform m,
	Point3d p
)
Public Shared Operator * (
	m As Transform,
	p As Point3d
) As Point3d
Parameters
m
Type: Rhino.Geometry.Transform
A transformation.
p
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
The tranformed point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Transform Structure
Multiply Overload
Rhino.Geometry Namespace