RhinoCommon API
Ellipse.ToNurbsCurve Method
 Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A nurbs curve representation of this ellipse or null if no such representation could be made.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace