RhinoCommon SDK
SupportOptions.CheckSupportFilesBeforeRendering Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.CheckSupportFilesBeforeRendering"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool CheckSupportFilesBeforeRendering()
Public Shared Function CheckSupportFilesBeforeRendering As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.CheckSupportFilesBeforeRendering"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace