RhinoCommon SDK
RhinoViewport.GetDepth Method (Sphere, Double, Double)
 Gets near and far clipping distances of a sphere.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetDepth(
	Sphere sphere,
	out double nearDistance,
	out double farDistance
)
Public Function GetDepth (
	sphere As Sphere,
	<OutAttribute> ByRef nearDistance As Double,
	<OutAttribute> ByRef farDistance As Double
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
The sphere.
nearDistance
Type: System.Double
The near distance is assigned to this out parameter during this call.
farDistance
Type: System.Double
The far distance is assigned to this out parameter during this call.
Return Value
Type: Boolean
 true if the sphere intersects the view frustum and near_dist/far_dist were set. false if the sphere does not intesect the view frustum.
See Also
Reference
RhinoViewport Class
GetDepth Overload
Rhino.Display Namespace