RhinoCommon SDK
GetPoint.PointOnObject Method
 Call this function to see if the point was on an object. If the point was on an object an ObjRef is returned; otherwise null is returned.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjRef PointOnObject()
Public Function PointOnObject As ObjRef
Return Value
Type: ObjRef
A point object reference.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace