RhinoCommon API
ReplayHistoryResult.UpdateToMesh Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UpdateToMesh(
	Mesh mesh,
	ObjectAttributes attributes
)
Public Function UpdateToMesh (
	mesh As Mesh,
	attributes As ObjectAttributes
) As Boolean
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace