RhinoCommon API
ColorLAB.CreateFromXYZ Method
 Create the nearest LAB equivalent of an XYZ color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorLAB CreateFromXYZ(
	ColorXYZ xyz
)
Public Shared Function CreateFromXYZ (
	xyz As ColorXYZ
) As ColorLAB
Parameters
xyz
Type: Rhino.Display.ColorXYZ
Target color in XYZ space.
Return Value
Type: ColorLAB
The LAB equivalent of the XYZ color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace