RhinoCommon API
Vector2d.Multiply Operator (Double, Vector2d)
 Multiplies a vector by a number, having the effect of scaling it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2d operator *(
	double t,
	Vector2d vector
)
Public Shared Operator * (
	t As Double,
	vector As Vector2d
) As Vector2d
Parameters
t
Type: System.Double
A number.
vector
Type: Rhino.Geometry.Vector2d
A vector.
Return Value
Type: Vector2d
A new vector that is the original vector coordinatewise multiplied by t.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector2d Structure
Multiply Overload
Rhino.Geometry Namespace