RhinoCommon API
CustomBrepObject Constructor
Initializes a new instance of the CustomBrepObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomBrepObject()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
CustomBrepObject Class
CustomBrepObject Overload
Rhino.DocObjects.Custom Namespace