RhinoCommon API
TrulyObservableOrderedSet<T> Constructor
 Creates an empty instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TrulyObservableOrderedSet()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
TrulyObservableOrderedSet<T> Class
TrulyObservableOrderedSet<T> Overload
Rhino.Runtime.Notifications Namespace