RhinoCommon API
MaterialTable.Find Method (String, Boolean)
 Finds a meterial with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	string materialName,
	bool ignoreDeletedMaterials
)
Public Function Find (
	materialName As String,
	ignoreDeletedMaterials As Boolean
) As Integer
Parameters
materialName
Type: System.String
Name of the material to search for. The search ignores case.
ignoreDeletedMaterials
Type: System.Boolean
true means don't search deleted materials.
Return Value
Type: Int32
 >=0 index of the material with the given name -1 no material has the given name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MaterialTable Class
Find Overload
Rhino.DocObjects.Tables Namespace