RhinoCommon API
ClassArrayObjRef Constructor
 Initializes a new ClassArrayObjRef instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClassArrayObjRef()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ClassArrayObjRef Class
ClassArrayObjRef Overload
Rhino.Runtime.InteropWrappers Namespace