RhinoCommon SDK
RhinoViewport.PushViewInfo Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.PushViewInfo(Rhino.DocObjects.ViewInfo,System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PushViewInfo(
	ViewInfo viewinfo,
	bool includeTraceImage
)
Public Function PushViewInfo (
	viewinfo As ViewInfo,
	includeTraceImage As Boolean
) As Boolean
Parameters
viewinfo
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="viewinfo"/> documentation for "M:Rhino.Display.RhinoViewport.PushViewInfo(Rhino.DocObjects.ViewInfo,System.Boolean)"]
includeTraceImage
Type: System.Boolean
[Missing <param name="includeTraceImage"/> documentation for "M:Rhino.Display.RhinoViewport.PushViewInfo(Rhino.DocObjects.ViewInfo,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.PushViewInfo(Rhino.DocObjects.ViewInfo,System.Boolean)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace