RhinoCommon API
MaterialTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Material> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Material)
Return Value
Type: IEnumerator<Material>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace