RhinoCommon API
Circle Constructor (Plane, Point3d, Double)
 Initializes a circle parallel to a given plane with given center and radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle(
	Plane plane,
	Point3d center,
	double radius
)
Public Sub New (
	plane As Plane,
	center As Point3d,
	radius As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Plane for circle.
center
Type: Rhino.Geometry.Point3d
Center point override.
radius
Type: System.Double
Radius of circle (should be a positive value).
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace