RhinoCommon SDK
ObjectTable.FindByGroup Method
 Finds all RhinoObjects that are in a given group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByGroup(
	int groupIndex
)
Public Function FindByGroup (
	groupIndex As Integer
) As RhinoObject()
Parameters
groupIndex
Type: System.Int32
Index of group to search for.
Return Value
Type: RhinoObject[]
An array of objects that belong to the specified group or null if no objects could be found.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace