RhinoCommon API
BinaryArchiveFile.Open Method
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Open"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Open()
Public Function Open As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Open"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace