RhinoCommon API
CollapsibleSectionImpl Constructor
Initializes a new instance of the CollapsibleSectionImpl class
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CollapsibleSectionImpl(
	ICollapsibleSection section
)
Public Sub New (
	section As ICollapsibleSection
)
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.#ctor(Rhino.UI.Controls.ICollapsibleSection)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace