RhinoCommon API
BrepTrim.IsReversed Method
 Get orientation of trim with respect to it's corresponding edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsReversed()
Public Function IsReversed As Boolean
Return Value
Type: Boolean
true if the 2d trim and 3d edge have opposite orientations
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace