RhinoCommon API
BinaryArchiveReader.ReadCheckSum Method
Note: This API is now obsolete.
 Reads a legacy ON_CheckSum, only provided to read data chunks from old V5 files, the CheckSum read is discarded
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("This is only present to allow reading of old ON_CheckSum data")]
public void ReadCheckSum()
<ObsoleteAttribute("This is only present to allow reading of old ON_CheckSum data")>
Public Sub ReadCheckSum
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.4
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace