RhinoCommon SDK
PolyCurve.Explode Method
 Explodes this PolyCurve into a list of Curve segments. This will not explode nested polycurves. Call RemoveNesting() first if you need all individual segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] Explode()
Public Function Explode As Curve()
Return Value
Type: Curve[]
An array of polycurve segments.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace