RhinoCommon API
DisplayModeDescription.AddDisplayMode Method (DisplayModeDescription)
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.AddDisplayMode(Rhino.Display.DisplayModeDescription)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid AddDisplayMode(
	DisplayModeDescription displayMode
)
Public Shared Function AddDisplayMode (
	displayMode As DisplayModeDescription
) As Guid
Parameters
displayMode
Type: Rhino.Display.DisplayModeDescription
[Missing <param name="displayMode"/> documentation for "M:Rhino.Display.DisplayModeDescription.AddDisplayMode(Rhino.Display.DisplayModeDescription)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.AddDisplayMode(Rhino.Display.DisplayModeDescription)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayModeDescription Class
AddDisplayMode Overload
Rhino.Display Namespace