RhinoCommon API
SimpleArrayClippingPlaneObjectPointer Constructor
 Initializes a new SimpleArrayClippingPlaneObjectPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayClippingPlaneObjectPointer()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Rhino.Runtime.InteropWrappers Namespace