RhinoCommon API
FileSettings.GetDefaultState Method
 Returns the default state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static FileSettingsState GetDefaultState()
Public Shared Function GetDefaultState As FileSettingsState
Return Value
Type: FileSettingsState
A new instance containing the default state.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace