RhinoCommon API
Mesh.Split Method (Mesh)
 Split a mesh with another mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh[] Split(
	Mesh mesh
)
Public Function Split (
	mesh As Mesh
) As Mesh()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to split with.
Return Value
Type: Mesh[]
An array of mesh segments representing the split result.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace