RhinoCommon API
EdgeAnalysisSettings.UpdateFromState Method
 Sets all settings to a particular defined joined state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void UpdateFromState(
	EdgeAnalysisSettingsState state
)
Public Shared Sub UpdateFromState (
	state As EdgeAnalysisSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.EdgeAnalysisSettingsState
The particular state.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace