RhinoCommon API
BoundingBox.MakeValid Method
 Ensures that the box is defined in an increasing fashion along X, Y and Z axes. If the Min or Max points are unset, this function will not change the box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeValid()
Public Function MakeValid As Boolean
Return Value
Type: Boolean
true if the box was made valid, false if the box could not be made valid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace