RhinoCommon SDK
MeshTextureCoordinateList.AddRange Method
 Appends an array of texture coordinates.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AddRange(
	Point2f[] textureCoordinates
)
Public Function AddRange (
	textureCoordinates As Point2f()
) As Boolean
Parameters
textureCoordinates
Type: Rhino.Geometry.Point2f[]
Texture coordinates to append.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace