RhinoCommon SDK
Thumbnail.GetDisplayRect Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.Thumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void GetDisplayRect(
	ref RectangleF rectOut
)
Public Sub GetDisplayRect (
	ByRef rectOut As RectangleF
)
Parameters
rectOut
Type: System.Drawing.RectangleF
[Missing <param name="rectOut"/> documentation for "M:Rhino.UI.Controls.Thumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
Implements
IRhRdkThumbnail.GetDisplayRect(RectangleF)
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace