RhinoCommon SDK
Quaternion.Inequality Operator
 Determines whether two quaternions have different values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator !=(
	Quaternion a,
	Quaternion b
)
Public Shared Operator <> (
	a As Quaternion,
	b As Quaternion
) As Boolean
Parameters
a
Type: Rhino.Geometry.Quaternion
A quaternion.
b
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Boolean
true if the quaternions differ in any coefficient; otherwise false.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace