RhinoCommon SDK
SupportOptions.LibrariesInitialLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static SupportOptions.RdkInitialLocation LibrariesInitialLocation()
Public Shared Function LibrariesInitialLocation As SupportOptions.RdkInitialLocation
Return Value
Type: SupportOptions.RdkInitialLocation
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocation"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace