RhinoCommon API
DisplayPipeline.DrawBox Method (Box, Color)
 Draws the edges of a Box object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawBox(
	Box box,
	Color color
)
Public Sub DrawBox (
	box As Box,
	color As Color
)
Parameters
box
Type: Rhino.Geometry.Box
Box to draw.
color
Type: System.Drawing.Color
Color to draw in.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayPipeline Class
DrawBox Overload
Rhino.Display Namespace