RhinoCommon API
MeshVertexColorList.CreateMonotoneMesh Method
 Constructs a valid vertex color list consisting of a single color.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CreateMonotoneMesh(
	Color baseColor
)
Public Function CreateMonotoneMesh (
	baseColor As Color
) As Boolean
Parameters
baseColor
Type: System.Drawing.Color
Color to apply to every vertex.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace