RhinoCommon SDK
Vector3d.IsPerpendicularTo Method (Vector3d)
 Test to see whether this vector is perpendicular to within one degree of another one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPerpendicularTo(
	Vector3d other
)
Public Function IsPerpendicularTo (
	other As Vector3d
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector3d
Vector to compare to.
Return Value
Type: Boolean
true if both vectors are perpendicular, false if otherwise.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3d Structure
IsPerpendicularTo Overload
Rhino.Geometry Namespace