RhinoCommon API
Light.CreateSunLight Method (Sun)
 Constructs a light which simulates a Sun.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Light CreateSunLight(
	Sun sun
)
Public Shared Function CreateSunLight (
	sun As Sun
) As Light
Parameters
sun
Type: Rhino.Render.Sun
A Sun object from the Rhino.Render namespace.
Return Value
Type: Light
A light.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Light Class
CreateSunLight Overload
Rhino.Geometry Namespace