RhinoCommon SDK
Surface.IsTorus Method (Double)
Determines if the surface is a portion of a torus within a given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTorus(
	double tolerance
)
Public Function IsTorus (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a torus.
See Also
Reference
Surface Class
IsTorus Overload
Rhino.Geometry Namespace