RhinoCommon API
DisplayPipeline.DrawCone Method (Cone, Color, Int32)
 Draw a wireframe cone.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawCone(
	Cone cone,
	Color color,
	int thickness
)
Public Sub DrawCone (
	cone As Cone,
	color As Color,
	thickness As Integer
)
Parameters
cone
Type: Rhino.Geometry.Cone
Cone to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of Cone wires.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipeline Class
DrawCone Overload
Rhino.Display Namespace