RhinoCommon SDK
IStackedDialogPageService.Document Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.Document(Rhino.UI.ObjectPropertiesPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RhinoDoc Document(
	ObjectPropertiesPage page
)
Function Document (
	page As ObjectPropertiesPage
) As RhinoDoc
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.Document(Rhino.UI.ObjectPropertiesPage)"]
Return Value
Type: RhinoDoc
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.Document(Rhino.UI.ObjectPropertiesPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace