RhinoCommon API
Brep.AddTrimCurve Method
 Add a 2d curve used by the brep trims
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddTrimCurve(
	Curve curve
)
Public Function AddTrimCurve (
	curve As Curve
) As Integer
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Geometry.Brep.AddTrimCurve(Rhino.Geometry.Curve)"]
Return Value
Type: Int32
 Index used to reference this geometry in the trimming curve list
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Brep Class
Rhino.Geometry Namespace