RhinoCommon SDK
SubDFacePtr.IndexOf Method (SubDVertexPtr)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.IndexOf(Rhino.Geometry.SubDVertexPtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int IndexOf(
	SubDVertexPtr vertex
)
Public Function IndexOf (
	vertex As SubDVertexPtr
) As Integer
Parameters
vertex
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="vertex"/> documentation for "M:Rhino.Geometry.SubDFacePtr.IndexOf(Rhino.Geometry.SubDVertexPtr)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.IndexOf(Rhino.Geometry.SubDVertexPtr)"]
See Also
Reference
SubDFacePtr Structure
IndexOf Overload
Rhino.Geometry Namespace