RhinoCommon SDK
AnnotationBase.SetRichText Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.SetRichText(System.String,Rhino.DocObjects.DimensionStyle)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetRichText(
	string rtfText,
	DimensionStyle dimstyle
)
Public Sub SetRichText (
	rtfText As String,
	dimstyle As DimensionStyle
)
Parameters
rtfText
Type: System.String
[Missing <param name="rtfText"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetRichText(System.String,Rhino.DocObjects.DimensionStyle)"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetRichText(System.String,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace