RhinoCommon API
SimpleArrayInterval.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval[] ToArray()
Public Function ToArray As Interval()
Return Value
Type: Interval[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayInterval Class
Rhino.Runtime.InteropWrappers Namespace