RhinoCommon API
RadialDimension.GetDistanceDisplayText Method
[Missing <summary> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetDistanceDisplayText(
	UnitSystem unitsystem,
	DimensionStyle style
)
Public Function GetDistanceDisplayText (
	unitsystem As UnitSystem,
	style As DimensionStyle
) As String
Parameters
unitsystem
Type: Rhino.UnitSystem
[Missing <param name="unitsystem"/> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace