RhinoCommon SDK
RenderContent.AddPersistentRenderContent Method (RenderContent)
Note: This API is now obsolete.
 Add a material, environment or texture to the internal RDK document lists as top level content. The content must have been returned from RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use RhinoDoc.RenderMaterials.Attach")]
public static bool AddPersistentRenderContent(
	RenderContent renderContent
)
<ObsoleteAttribute("Use RhinoDoc.RenderMaterials.Attach")>
Public Shared Function AddPersistentRenderContent (
	renderContent As RenderContent
) As Boolean
Parameters
renderContent
Type: Rhino.Render.RenderContent
The render content.
Return Value
Type: Boolean
true on success.
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
RenderContent Class
AddPersistentRenderContent Overload
Rhino.Render Namespace