RhinoCommon API
AnnotationBase.ClearPropertyOverrides Method
 Clears all overriden properties for this annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ClearPropertyOverrides()
Public Function ClearPropertyOverrides As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.ClearPropertyOverrides"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace