RhinoCommon API
IRhRdkContentThumbnail.GroupId Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.GroupId"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid GroupId()
Function GroupId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.GroupId"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace