RhinoCommon API
MeshVertexColorList.SetColor Method (MeshFace, Color)
 Sets a color at the three or four vertex indices of a specified face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetColor(
	MeshFace face,
	Color color
)
Public Function SetColor (
	face As MeshFace,
	color As Color
) As Boolean
Parameters
face
Type: Rhino.Geometry.MeshFace
A face to use to retrieve indices.
color
Type: System.Drawing.Color
A color.
Return Value
Type: Boolean
true on success; false on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshVertexColorList Class
SetColor Overload
Rhino.Geometry.Collections Namespace