RhinoCommon API
TextEntity.CreateExtrusions Method
 Creates extrusions from the outline curves with specified height.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Extrusion[] CreateExtrusions(
	DimensionStyle dimstyle,
	double height,
	double smallCapsScale = 1,
	double spacing = 0
)
Public Function CreateExtrusions (
	dimstyle As DimensionStyle,
	height As Double,
	Optional smallCapsScale As Double = 1,
	Optional spacing As Double = 0
) As Extrusion()
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreateExtrusions(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)"]
height
Type: System.Double
 Height in direction perpedicular to plane of text.
smallCapsScale (Optional)
Type: System.Double
 Set to create small caps out of lower case letters.
spacing (Optional)
Type: System.Double
 Set to add additional spacing between glyph output.
Return Value
Type: Extrusion[]
An array of planar breps.
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace