RhinoCommon SDK
IStackedDialogPageService.NewOptionsDialogPagePointer Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.NewOptionsDialogPagePointer(Rhino.UI.StackedDialogPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IntPtr NewOptionsDialogPagePointer(
	StackedDialogPage page
)
Function NewOptionsDialogPagePointer (
	page As StackedDialogPage
) As IntPtr
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.NewOptionsDialogPagePointer(Rhino.UI.StackedDialogPage)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.NewOptionsDialogPagePointer(Rhino.UI.StackedDialogPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace