RhinoCommon SDK
Surface.IsAtSingularity Method
 Tests if a surface parameter value is at a singularity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsAtSingularity(
	double u,
	double v,
	bool exact
)
Public Function IsAtSingularity (
	u As Double,
	v As Double,
	exact As Boolean
) As Boolean
Parameters
u
Type: System.Double
Surface u parameter to test.
v
Type: System.Double
Surface v parameter to test.
exact
Type: System.Boolean
 If true, test if (u,v) is exactly at a singularity. If false, test if close enough to cause numerical problems.
Return Value
Type: Boolean
true if surface is singular at (s,t)
See Also
Reference
Surface Class
Rhino.Geometry Namespace