RhinoCommon API
DisplayConduit Constructor
Initializes a new instance of the DisplayConduit class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected DisplayConduit()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace