RhinoCommon SDK
Point3d.Subtraction Operator (Point3d, Point3d)
 Subtracts a point from another point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d operator -(
	Point3d point1,
	Point3d point2
)
Public Shared Operator - (
	point1 As Point3d,
	point2 As Point3d
) As Vector3d
Parameters
point1
Type: Rhino.Geometry.Point3d
A point.
point2
Type: Rhino.Geometry.Point3d
Another point.
Return Value
Type: Vector3d
A new vector that is the difference of point minus vector.
See Also
Reference
Point3d Structure
Subtraction Overload
Rhino.Geometry Namespace