RhinoCommon SDK
Polyline.TangentAt Method
 Gets the unit tangent vector along the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d TangentAt(
	double t
)
Public Function TangentAt (
	t As Double
) As Vector3d
Parameters
t
Type: System.Double
Polyline parameter.
Return Value
Type: Vector3d
The tangent along the polyline at t.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Polyline Class
Rhino.Geometry Namespace