RhinoCommon API
Vector3f.ToString Method
 Constructs the string representation of the current vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The vector representation in the form X,Y,Z.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace