RhinoCommon API
Plane.Flip Method
 Flip this plane by swapping out the X and Y axes and inverting the Z axis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Flip()
Public Sub Flip
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Plane Structure
Rhino.Geometry Namespace