RhinoCommon API
BinaryArchiveReader.ReadByte Method
 Reads a Byte from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public byte ReadByte()
Public Function ReadByte As Byte
Return Value
Type: Byte
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace