RhinoCommon API
NurbsSurface.CreateFromCone Method
 Constructs a new NURBS surfaces from cone data.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static NurbsSurface CreateFromCone(
	Cone cone
)
Public Shared Function CreateFromCone (
	cone As Cone
) As NurbsSurface
Parameters
cone
Type: Rhino.Geometry.Cone
A cone value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace