RhinoCommon SDK
PointCloud.RemoveAt Method
 Remove the point at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of point to remove.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace