RhinoCommon SDK
ThumbData Constructor
Initializes a new instance of the ThumbData class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ThumbData()
Public Sub New
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace