RhinoCommon SDK
SubDVertexPtr.GetSectorIterator Method (SubDFacePtr, Boolean)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.GetSectorIterator(Rhino.Geometry.SubDFacePtr,System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexSectorIterator GetSectorIterator(
	SubDFacePtr face,
	bool counterClockWise
)
Public Function GetSectorIterator (
	face As SubDFacePtr,
	counterClockWise As Boolean
) As SubDVertexSectorIterator
Parameters
face
Type: Rhino.Geometry.SubDFacePtr
[Missing <param name="face"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.GetSectorIterator(Rhino.Geometry.SubDFacePtr,System.Boolean)"]
counterClockWise
Type: System.Boolean
[Missing <param name="counterClockWise"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.GetSectorIterator(Rhino.Geometry.SubDFacePtr,System.Boolean)"]
Return Value
Type: SubDVertexSectorIterator
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.GetSectorIterator(Rhino.Geometry.SubDFacePtr,System.Boolean)"]
See Also
Reference
SubDVertexPtr Structure
GetSectorIterator Overload
Rhino.Geometry Namespace