RhinoCommon API
File3dmObjectTable.Delete Method (File3dmObject)
 Deletes object from document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	File3dmObject obj
)
Public Function Delete (
	obj As File3dmObject
) As Boolean
Parameters
obj
Type: Rhino.FileIO.File3dmObject
The object to delete.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
File3dmObjectTable Class
Delete Overload
Rhino.FileIO Namespace