RhinoCommon API
Curve.DerivativeAt Method (Double, Int32)
 Evaluate the derivatives at the specified curve parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d[] DerivativeAt(
	double t,
	int derivativeCount
)
Public Function DerivativeAt (
	t As Double,
	derivativeCount As Integer
) As Vector3d()
Parameters
t
Type: System.Double
Curve parameter to evaluate.
derivativeCount
Type: System.Int32
Number of derivatives to evaluate, must be at least 0.
Return Value
Type: Vector3d[]
An array of vectors that represents all the derivatives starting at zero.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Curve Class
DerivativeAt Overload
Rhino.Geometry Namespace