RhinoCommon API
RealtimeDisplayModeClassInfo Constructor
Initializes a new instance of the RealtimeDisplayModeClassInfo class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RealtimeDisplayModeClassInfo()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace