RhinoCommon SDK
EarthAnchorPoint.GetEarthAnchorPlane Method
 Returns the earth anchor plane
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane GetEarthAnchorPlane(
	out Vector3d anchorNorth
)
Public Function GetEarthAnchorPlane (
	<OutAttribute> ByRef anchorNorth As Vector3d
) As Plane
Parameters
anchorNorth
Type: Rhino.Geometry.Vector3d
[Missing <param name="anchorNorth"/> documentation for "M:Rhino.DocObjects.EarthAnchorPoint.GetEarthAnchorPlane(Rhino.Geometry.Vector3d@)"]
Return Value
Type: Plane
A plane value.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace