RhinoCommon SDK
SubDDisplayParameters Constructor
Initializes a new instance of the SubDDisplayParameters class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDDisplayParameters()
Public Sub New
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace