RhinoCommon API
RhinoDoc.ExtractPreviewImage Method
Extracts the bitmap preview image from the specified model (3DM).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Bitmap ExtractPreviewImage(
	string path
)
Public Shared Function ExtractPreviewImage (
	path As String
) As Bitmap
Parameters
path
Type: System.String
 The model (3DM) from which to extract the preview image. If null, the currently loaded model is used.
Return Value
Type: Bitmap
true on success.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoDoc Class
Rhino Namespace