RhinoCommon API
GroupTable.GroupName Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupName(System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GroupName(
	int groupIndex
)
Public Function GroupName (
	groupIndex As Integer
) As String
Parameters
groupIndex
Type: System.Int32
[Missing <param name="groupIndex"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupName(System.Int32)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupName(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace