RhinoCommon SDK
File3dmObjectTable.Delete Method (IEnumerable<Guid>)
 Deletes a collection of objects from the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Delete(
	IEnumerable<Guid> objectIds
)
Public Function Delete (
	objectIds As IEnumerable(Of Guid)
) As Integer
Parameters
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
Ids of all objects to delete.
Return Value
Type: Int32
The number of successfully deleted objects.
See Also
Reference
File3dmObjectTable Class
Delete Overload
Rhino.FileIO Namespace