RhinoCommon SDK
SubDEdgePtr.Inequality Operator
[Missing <summary> documentation for "M:Rhino.Geometry.SubDEdgePtr.op_Inequality(Rhino.Geometry.SubDEdgePtr,Rhino.Geometry.SubDEdgePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool operator !=(
	SubDEdgePtr a,
	SubDEdgePtr b
)
Public Shared Operator <> (
	a As SubDEdgePtr,
	b As SubDEdgePtr
) As Boolean
Parameters
a
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="a"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.op_Inequality(Rhino.Geometry.SubDEdgePtr,Rhino.Geometry.SubDEdgePtr)"]
b
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="b"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.op_Inequality(Rhino.Geometry.SubDEdgePtr,Rhino.Geometry.SubDEdgePtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgePtr.op_Inequality(Rhino.Geometry.SubDEdgePtr,Rhino.Geometry.SubDEdgePtr)"]
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace