RhinoCommon API
BinaryArchiveWriter.WriteShortArray Method
 Writes a list, an array, or any enumerable of Int16 to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteShortArray(
	IEnumerable<short> value
)
Public Sub WriteShortArray (
	value As IEnumerable(Of Short)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Int16>
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace