RhinoCommon SDK
Layer Constructor
Initializes a new instance of the Layer class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Layer()
Public Sub New
See Also
Reference
Layer Class
Layer Overload
Rhino.DocObjects Namespace