RhinoCommon API
ToolbarFileCollection.Open Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFileCollection.Open(System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ToolbarFile Open(
	string path
)
Public Function Open (
	path As String
) As ToolbarFile
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.UI.ToolbarFileCollection.Open(System.String)"]
Return Value
Type: ToolbarFile
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.Open(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace