RhinoCommon API
Mesh.SetTextureCoordinates Method
 Set texture coordinates using given mapping and applying given transform. Set lazy to false to generate texture coordinates right away.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetTextureCoordinates(
	TextureMapping tm,
	Transform xf,
	bool lazy
)
Public Sub SetTextureCoordinates (
	tm As TextureMapping,
	xf As Transform,
	lazy As Boolean
)
Parameters
tm
Type: Rhino.Render.TextureMapping
Texture mapping
xf
Type: Rhino.Geometry.Transform
Transform to apply to the texture mapping
lazy
Type: System.Boolean
Whether to generate lazily (true) or right away (false)
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Mesh Class
Rhino.Geometry Namespace