RhinoCommon SDK
ObjRef.PointCloud Method
 Gets the point cloud if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloud PointCloud()
Public Function PointCloud As PointCloud
Return Value
Type: PointCloud
A point cloud; or null if the referenced object is not a point cloud, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace