RhinoCommon API
RdkUndoRecord.Dispose Method
 Dispose for RdkUndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RdkUndoRecord Class
Rhino.Render Namespace