RhinoCommon API
Mesh.Split Method (Plane)
 Split a mesh by an infinite plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh[] Split(
	Plane plane
)
Public Function Split (
	plane As Plane
) As Mesh()
Parameters
plane
Type: Rhino.Geometry.Plane
The splitting plane.
Return Value
Type: Mesh[]
A new mesh array with the split result. This can be null if no result was found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace