RhinoCommon API
ArchivableDictionary.Set Method (String, String)
 Sets a String.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	string val
)
Public Function Set (
	key As String,
	val As String
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.String
A String.
Because String is immutable, it is not possible to modify the object while it is in this dictionary.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace