RhinoCommon API
DisplayPipeline.DrawArc Method (Arc, Color, Int32)
 Draw a single arc object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawArc(
	Arc arc,
	Color color,
	int thickness
)
Public Sub DrawArc (
	arc As Arc,
	color As Color,
	thickness As Integer
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of arc.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipeline Class
DrawArc Overload
Rhino.Display Namespace