RhinoCommon API
ReplayHistoryResult.UpdateToCurve Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UpdateToCurve(
	Curve curve,
	ObjectAttributes attributes
)
Public Function UpdateToCurve (
	curve As Curve,
	attributes As ObjectAttributes
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace