RhinoCommon API
Sphere.LongitudeRadians Method
 Computes the meridian at a specific longitude angle.
The angle is specified in radians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle LongitudeRadians(
	double radians
)
Public Function LongitudeRadians (
	radians As Double
) As Circle
Parameters
radians
Type: System.Double
An angle in radians.
Return Value
Type: Circle
A circle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace