RhinoCommon API
HostUtils.ClearFpuExceptionStatus Method
 Clear FPU exception and busy flags (Intel assembly fnclex)
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ClearFpuExceptionStatus()
Public Shared Sub ClearFpuExceptionStatus
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace