RhinoCommon API
RenderTexture.GetRotation Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetRotation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Vector3d GetRotation()
Public Overridable Function GetRotation As Vector3d
Return Value
Type: Vector3d
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetRotation"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderTexture Class
Rhino.Render Namespace