RhinoCommon SDK
SubDVertexPtr.AddFace Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.AddFace(Rhino.Geometry.SubDFacePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void AddFace(
	SubDFacePtr face
)
Public Sub AddFace (
	face As SubDFacePtr
)
Parameters
face
Type: Rhino.Geometry.SubDFacePtr
[Missing <param name="face"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.AddFace(Rhino.Geometry.SubDFacePtr)"]
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace