RhinoCommon API
ScaleValue.LeftLengthValue Method
 Get the Left LengthValue from Scale
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LengthValue LeftLengthValue()
Public Function LeftLengthValue As LengthValue
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.ScaleValue.LeftLengthValue"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ScaleValue Class
Rhino Namespace