RhinoCommon SDK
IStackedDialogPageService.MakeActive Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.MakeActive(Rhino.UI.StackedDialogPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void MakeActive(
	StackedDialogPage page
)
Sub MakeActive (
	page As StackedDialogPage
)
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.MakeActive(Rhino.UI.StackedDialogPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace