RhinoCommon API
Interval Constructor (Interval)
 Initializes a new instance copying the other instance values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval(
	Interval other
)
Public Sub New (
	other As Interval
)
Parameters
other
Type: Rhino.Geometry.Interval
The Rhino.Geometry.Interval to use as a base.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Interval Structure
Interval Overload
Rhino.Geometry Namespace