RhinoCommon SDK
IPanelsService.IsPanelVisible Method (Guid, Boolean)
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.IsPanelVisible(System.Guid,System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool IsPanelVisible(
	Guid panelId,
	bool isSelectedTab
)
Function IsPanelVisible (
	panelId As Guid,
	isSelectedTab As Boolean
) As Boolean
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.IsPanelVisible(System.Guid,System.Boolean)"]
isSelectedTab
Type: System.Boolean
[Missing <param name="isSelectedTab"/> documentation for "M:Rhino.UI.IPanelsService.IsPanelVisible(System.Guid,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.IsPanelVisible(System.Guid,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IPanelsService Interface
IsPanelVisible Overload
Rhino.UI Namespace