RhinoCommon API
Transform.IsZeroTransformaton Method
 True if all values are 0 and M33 is 1 within tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsZeroTransformaton(
	double zeroTolerance
)
Public Function IsZeroTransformaton (
	zeroTolerance As Double
) As Boolean
Parameters
zeroTolerance
Type: System.Double
The zero tolerance.
Return Value
Type: Boolean
Returns true if all values are 0 and M33 is 1 within tolerance.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace