RhinoCommon API
Quaternion.Multiply Operator (Quaternion, Quaternion)
 Multiplies a quaternion with another one.
Quaternion multiplication (Hamilton product) is not commutative.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion operator *(
	Quaternion a,
	Quaternion b
)
Public Shared Operator * (
	a As Quaternion,
	b As Quaternion
) As Quaternion
Parameters
a
Type: Rhino.Geometry.Quaternion
The first term.
b
Type: Rhino.Geometry.Quaternion
The second term.
Return Value
Type: Quaternion
A new quaternion.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Quaternion Structure
Multiply Overload
Rhino.Geometry Namespace