RhinoCommon API
GumballPickResult.SetToDefault Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballPickResult.SetToDefault"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetToDefault()
Public Sub SetToDefault
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace