RhinoCommon API
OptionColor Constructor
Initializes a new instance of the OptionColor class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OptionColor(
	Color initialValue
)
Public Sub New (
	initialValue As Color
)
Parameters
initialValue
Type: System.Drawing.Color
[Missing <param name="initialValue"/> documentation for "M:Rhino.Input.Custom.OptionColor.#ctor(System.Drawing.Color)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace