RhinoCommon API
NurbsSurface.CopyFrom Method
 Copies this NURBS surface from another NURBS surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void CopyFrom(
	NurbsSurface other
)
Public Sub CopyFrom (
	other As NurbsSurface
)
Parameters
other
Type: Rhino.Geometry.NurbsSurface
The other NURBS surface to use as source.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace