RhinoCommon SDK
ViewportInfo.GetObjectData Method
 Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
Public Sub GetObjectData (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
The System.Runtime.Serialization.SerializationInfo to populate with data.
context
Type: System.Runtime.Serialization.StreamingContext
The destination (see System.Runtime.Serialization.StreamingContext) for this serialization.
Implements
ISerializable.GetObjectData(SerializationInfo, StreamingContext)
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace