RhinoCommon SDK
IRhRdkThumbnail.Label Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.Label"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
string Label()
Function Label As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.Label"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls Namespace