RhinoCommon API
ObjectTable.Duplicate Method (RhinoObject)
 Duplicates the object that is referenced by obj.
Same as TransformObject(obj, Transform.Identityy, false)
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Duplicate(
	RhinoObject obj
)
Public Function Duplicate (
	obj As RhinoObject
) As Guid
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
A Rhino object to duplicate.
Return Value
Type: Guid
The new object ID.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace