RhinoCommon SDK
DimensionStyle Constructor
 Create a new non-document controlled annotation style
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
DimensionStyle Overload
Rhino.DocObjects Namespace