RhinoCommon API
Arc.PointAt Method
 Gets the point at the given arc parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Arc parameter to evaluate.
Return Value
Type: Point3d
The point at the given parameter.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Arc Structure
Rhino.Geometry Namespace