RhinoCommon API
DisplayPipeline.DrawArrows Method (IEnumerable<Line>, Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawArrows(
	IEnumerable<Line> lines,
	Color color
)
Public Sub DrawArrows (
	lines As IEnumerable(Of Line),
	color As Color
)
Parameters
lines
Type: System.Collections.Generic.IEnumerable<Line>
Arrow shafts.
color
Type: System.Drawing.Color
Color of arrows.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
DisplayPipeline Class
DrawArrows Overload
Rhino.Display Namespace