RhinoCommon SDK
IRhRdkThumbnail.GetDib Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.GetDib"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Bitmap GetDib()
Function GetDib As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.GetDib"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls Namespace