RhinoCommon API
TextureGraphInfo.AmountW Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.AmountW"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AmountW()
Public Function AmountW As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.TextureGraphInfo.AmountW"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace