RhinoCommon SDK
NamedConstructionPlaneTable.Delete Method (String)
 Remove named construction plane from the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	string name
)
Public Function Delete (
	name As String
) As Boolean
Parameters
name
Type: System.String
name of the construction plane.
Return Value
Type: Boolean
true if successful.
See Also
Reference
NamedConstructionPlaneTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace