RhinoCommon API
GetLine.SetFirstPoint Method
 Use SetFirstPoint to specify the line's starting point and skip the start point interactive picking
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetFirstPoint(
	Point3d point
)
Public Sub SetFirstPoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Input.Custom.GetLine.SetFirstPoint(Rhino.Geometry.Point3d)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace