RhinoCommon SDK
Dialogs.ShowContextMenu Method
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowContextMenu(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Point,System.Collections.Generic.IEnumerable{System.Int32})"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static int ShowContextMenu(
	IEnumerable<string> items,
	Point screenPoint,
	IEnumerable<int> modes
)
Public Shared Function ShowContextMenu (
	items As IEnumerable(Of String),
	screenPoint As Point,
	modes As IEnumerable(Of Integer)
) As Integer
Parameters
items
Type: System.Collections.Generic.IEnumerable<String>
[Missing <param name="items"/> documentation for "M:Rhino.UI.Dialogs.ShowContextMenu(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Point,System.Collections.Generic.IEnumerable{System.Int32})"]
screenPoint
Type: System.Drawing.Point
[Missing <param name="screenPoint"/> documentation for "M:Rhino.UI.Dialogs.ShowContextMenu(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Point,System.Collections.Generic.IEnumerable{System.Int32})"]
modes
Type: System.Collections.Generic.IEnumerable<Int32>
[Missing <param name="modes"/> documentation for "M:Rhino.UI.Dialogs.ShowContextMenu(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Point,System.Collections.Generic.IEnumerable{System.Int32})"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.UI.Dialogs.ShowContextMenu(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Point,System.Collections.Generic.IEnumerable{System.Int32})"]
See Also
Reference
Dialogs Class
Rhino.UI Namespace