RhinoCommon API
RTree.Insert Method (Point3d, IntPtr)
Inserts an element into the tree.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Insert(
	Point3d point,
	IntPtr elementId
)
Public Function Insert (
	point As Point3d,
	elementId As IntPtr
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
elementId
Type: System.IntPtr
A pointer.
Return Value
Type: Boolean
true if element was successfully inserted.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RTree Class
Insert Overload
Rhino.Geometry Namespace