RhinoCommon API
ViewCaptureSettings.Dispose Method
Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace