RhinoCommon SDK
BinaryArchiveWriter.WriteGuid Method
 Writes a Guid value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteGuid(
	Guid value
)
Public Sub WriteGuid (
	value As Guid
)
Parameters
value
Type: System.Guid
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace