RhinoCommon SDK
NurbsCurve.GrevilleParameters Method
 Gets all Greville (Edit point) parameters for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] GrevilleParameters()
Public Function GrevilleParameters As Double()
Return Value
Type: Double[]
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevilleParameters"]
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace