RhinoCommon SDK
Curve.CreateMeanCurve Method (Curve, Curve, Double)
 Constructs a mean, or average, curve from two curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateMeanCurve(
	Curve curveA,
	Curve curveB,
	double angleToleranceRadians
)
Public Shared Function CreateMeanCurve (
	curveA As Curve,
	curveB As Curve,
	angleToleranceRadians As Double
) As Curve
Parameters
curveA
Type: Rhino.Geometry.Curve
A first curve.
curveB
Type: Rhino.Geometry.Curve
A second curve.
angleToleranceRadians
Type: System.Double
 The angle tolerance, in radians, used to match kinks between curves. If you are unsure how to set this parameter, then either use the document's angle tolerance RhinoDoc.AngleToleranceRadians, or the default value (RhinoMath.UnsetValue)
Return Value
Type: Curve
The average curve, or null on error.
Exceptions
Exception | Condition
ArgumentNullException | If curveA or curveB are null.
See Also
Reference
Curve Class
CreateMeanCurve Overload
Rhino.Geometry Namespace