RhinoCommon API
Plane.Equals Method (Object)
 Determines if an object is a plane and has the same components as this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
An object.
Return Value
Type: Boolean
true if obj is a plane and has the same components as this plane; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Plane Structure
Equals Overload
Rhino.Geometry Namespace