RhinoCommon API
Layer.IsChildOf Method (Int32)
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Int32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsChildOf(
	int layerIndex
)
Public Function IsChildOf (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
[Missing <param name="layerIndex"/> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.IsChildOf(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Layer Class
IsChildOf Overload
Rhino.DocObjects Namespace