RhinoCommon API
RenderContentKindList Constructor (IntPtr)
Initializes a new instance of the RenderContentKindList class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentKindList(
	IntPtr pRdkRenderContentKindList
)
Public Sub New (
	pRdkRenderContentKindList As IntPtr
)
Parameters
pRdkRenderContentKindList
Type: System.IntPtr
[Missing <param name="pRdkRenderContentKindList"/> documentation for "M:Rhino.Render.RenderContentKindList.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderContentKindList Class
RenderContentKindList Overload
Rhino.Render Namespace