RhinoCommon API
NamedParametersEventArgs.SetBool Method
 Set a bool value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetBool(
	string name,
	bool value
)
Public Sub SetBool (
	name As String,
	value As Boolean
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetBool(System.String,System.Boolean)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetBool(System.String,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace