RhinoCommon SDK
GetNumber.SetUpperLimit Method
 Sets an upper limit on the number that can be returned. By default there is no upper limit.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetUpperLimit(
	double upperLimit,
	bool strictlyLessThan
)
Public Sub SetUpperLimit (
	upperLimit As Double,
	strictlyLessThan As Boolean
)
Parameters
upperLimit
Type: System.Double
largest acceptable number.
strictlyLessThan
Type: System.Boolean
If true, then the returned number will be < upper_limit.
See Also
Reference
GetNumber Class
Rhino.Input.Custom Namespace