RhinoCommon API
ExtrusionObject.DuplicateExtrusionGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ExtrusionObject.DuplicateExtrusionGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Extrusion DuplicateExtrusionGeometry()
Public Function DuplicateExtrusionGeometry As Extrusion
Return Value
Type: Extrusion
[Missing <returns> documentation for "M:Rhino.DocObjects.ExtrusionObject.DuplicateExtrusionGeometry"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace