RhinoCommon API
Curve.Trim Method (Interval)
 Removes portions of the curve outside the specified interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Curve
Parameters
domain
Type: Rhino.Geometry.Interval
 Trimming interval. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
Return Value
Type: Curve
Trimmed curve if successful, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Curve Class
Trim Overload
Rhino.Geometry Namespace