RhinoCommon API
Hatch.ScalePattern Method
 Scale the hatch's pattern
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ScalePattern(
	Transform xform
)
Public Sub ScalePattern (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Geometry.Hatch.ScalePattern(Rhino.Geometry.Transform)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Hatch Class
Rhino.Geometry Namespace