RhinoCommon SDK
Point3d.ArePointsCoplanar Method
 Determines whether a set of points is coplanar within a given tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool ArePointsCoplanar(
	IEnumerable<Point3d> points,
	double tolerance
)
Public Shared Function ArePointsCoplanar (
	points As IEnumerable(Of Point3d),
	tolerance As Double
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable of Point3d.
tolerance
Type: System.Double
A tolerance value. A default might be RhinoMath.ZeroTolerance.
Return Value
Type: Boolean
true if points are on the same plane; false otherwise.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace