RhinoCommon API
DisplayPipeline.Draw2dText Method (String, Color, Point3d, Boolean)
 Draws 2D text on the viewport.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Draw2dText(
	string text,
	Color color,
	Point3d worldCoordinate,
	bool middleJustified
)
Public Sub Draw2dText (
	text As String,
	color As Color,
	worldCoordinate As Point3d,
	middleJustified As Boolean
)
Parameters
text
Type: System.String
the string to draw.
color
Type: System.Drawing.Color
text color.
worldCoordinate
Type: Rhino.Geometry.Point3d
definition point in world coordinates.
middleJustified
Type: System.Boolean
if true text is centered around the definition point, otherwise it is lower-left justified.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipeline Class
Draw2dText Overload
Rhino.Display Namespace