RhinoCommon API
Mesh.Duplicate Method
 Constructs a copy of this mesh. This is the same as DuplicateMesh().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
A mesh.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Mesh Class
Rhino.Geometry Namespace