RhinoCommon SDK
CustomGripObject.Dispose Method (Boolean)
Releases the unmanaged resources used by the CustomGripObject and optionally releases the managed resources
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
CustomGripObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace