RhinoCommon API
Arc.TangentAt Method
 Gets the tangent at the given parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d TangentAt(
	double t
)
Public Function TangentAt (
	t As Double
) As Vector3d
Parameters
t
Type: System.Double
Parameter of tangent to evaluate.
Return Value
Type: Vector3d
The tangent at the arc at the given parameter.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Arc Structure
Rhino.Geometry Namespace