RhinoCommon API
Mesh.DestroyPartition Method
 Destroys mesh partition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DestroyPartition()
Public Sub DestroyPartition
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Mesh Class
Rhino.Geometry Namespace