RhinoCommon API
SpaceMorph.IsMorphable Method
 true if the geometry can be morphed by calling SpaceMorph.Morph(geometry)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsMorphable(
	GeometryBase geometry
)
Public Shared Function IsMorphable (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
[Missing <param name="geometry"/> documentation for "M:Rhino.Geometry.SpaceMorph.IsMorphable(Rhino.Geometry.GeometryBase)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SpaceMorph.IsMorphable(Rhino.Geometry.GeometryBase)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace