RhinoCommon API
HistoryRecord Constructor
Initializes a new instance of the HistoryRecord class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HistoryRecord(
	Command command,
	int version
)
Public Sub New (
	command As Command,
	version As Integer
)
Parameters
command
Type: Rhino.Commands.Command
[Missing <param name="command"/> documentation for "M:Rhino.DocObjects.HistoryRecord.#ctor(Rhino.Commands.Command,System.Int32)"]
version
Type: System.Int32
[Missing <param name="version"/> documentation for "M:Rhino.DocObjects.HistoryRecord.#ctor(Rhino.Commands.Command,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace