RhinoCommon API
PersistentSettings.TryGetEnumValue<T> Method (T)
 Attempt to get the stored value for an enum setting. Note: the enum value ALWAYS gets assigned! Be sure to check for success of this method to prevent erroneous use of the value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetEnumValue<T>(
	out T enumValue
)
where T : struct, new(), IConvertible
Public Function TryGetEnumValue(Of T As {Structure, New, IConvertible}) (
	<OutAttribute> ByRef enumValue As T
) As Boolean
Parameters
enumValue
Type: T
[Missing <param name="enumValue"/> documentation for "M:Rhino.PersistentSettings.TryGetEnumValue``1(``0@)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.TryGetEnumValue``1(``0@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetEnumValue``1(``0@)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
PersistentSettings Class
TryGetEnumValue Overload
Rhino Namespace