RhinoCommon SDK
DisplayPipeline.DrawParticles Method (ParticleSystem, DisplayBitmap)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem,Rhino.Display.DisplayBitmap)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawParticles(
	ParticleSystem particles,
	DisplayBitmap bitmap
)
Public Sub DrawParticles (
	particles As ParticleSystem,
	bitmap As DisplayBitmap
)
Parameters
particles
Type: Rhino.Geometry.ParticleSystem
[Missing <param name="particles"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem,Rhino.Display.DisplayBitmap)"]
bitmap
Type: Rhino.Display.DisplayBitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem,Rhino.Display.DisplayBitmap)"]
See Also
Reference
DisplayPipeline Class
DrawParticles Overload
Rhino.Display Namespace