RhinoCommon API
SurfaceCurvature.OsculatingCircle Method
 Computes the osculating circle along the given direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle OsculatingCircle(
	int direction
)
Public Function OsculatingCircle (
	direction As Integer
) As Circle
Parameters
direction
Type: System.Int32
Direction index, valid values are 0 and 1.
Return Value
Type: Circle
The osculating circle in the given direction or Circle.Unset on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace