RhinoCommon SDK
NameHash.Equals Method (NameHash)
 Determines if another name hash has the same value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	NameHash other
)
Public Function Equals (
	other As NameHash
) As Boolean
Parameters
other
Type: Rhino.FileIO.NameHash
The other name hash to compare.
Return Value
Type: Boolean
True if the two hashes are equal.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NameHash Class
Equals Overload
Rhino.FileIO Namespace