RhinoCommon API
NeverRepeatList.CommandNames Method
The list of commands to not repeat.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] CommandNames()
Public Shared Function CommandNames As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.NeverRepeatList.CommandNames"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
NeverRepeatList Class
Rhino.ApplicationSettings Namespace