RhinoCommon SDK
FreeFloatingBase.CopyFrom Method
 Copy from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void CopyFrom(
	FreeFloatingBase src
)
Public MustOverride Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.FreeFloatingBase.CopyFrom(Rhino.Render.FreeFloatingBase)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FreeFloatingBase Class
Rhino.Render Namespace