RhinoCommon SDK
Curve.SetStartPoint Method
Forces the curve to start at a specified point. Not all curve types support this operation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetStartPoint(
	Point3d point
)
Public Function SetStartPoint (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
New start point of curve.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
Some start points cannot be moved. Be sure to check return code.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
Rhino.Geometry Namespace