RhinoCommon SDK
OptionInteger.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.OptionInteger.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace