RhinoCommon SDK
ObjectTable.GripUpdate Method
 Altered grip positions on a RhinoObject are used to calculate an updated object that is added to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject GripUpdate(
	RhinoObject obj,
	bool deleteOriginal
)
Public Function GripUpdate (
	obj As RhinoObject,
	deleteOriginal As Boolean
) As RhinoObject
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
object with modified grips to update.
deleteOriginal
Type: System.Boolean
if true, obj is deleted from the document.
Return Value
Type: RhinoObject
new RhinoObject on success; otherwise null.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace