RhinoCommon API
GroupTable.FindName Method
 Finds a Linetype given its name. Returns the instance, rather than the index.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Group FindName(
	string name
)
Public Function FindName (
	name As String
) As Group
Parameters
name
Type: System.String
The name of the Linetype to be searched.
Return Value
Type: Group
An Linetype, or null on error.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace