RhinoCommon SDK
Interval.IncludesInterval Method (Interval, Boolean)
 Tests another interval for Interval inclusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IncludesInterval(
	Interval interval,
	bool strict
)
Public Function IncludesInterval (
	interval As Interval,
	strict As Boolean
) As Boolean
Parameters
interval
Type: Rhino.Geometry.Interval
Interval to test.
strict
Type: System.Boolean
If true, the other interval must be fully on the inside of the Interval.
Return Value
Type: Boolean
true if the other interval is contained within the limits of this Interval; otherwise false.
See Also
Reference
Interval Structure
IncludesInterval Overload
Rhino.Geometry Namespace