RhinoCommon API
MeshTextureCoordinateList.ReverseTextureCoordinates Method
 Reverses one coordinate direction of the texture coordinates.
The region of the bitmap the texture uses does not change. Either Us or Vs direction is flipped.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReverseTextureCoordinates(
	int direction
)
Public Function ReverseTextureCoordinates (
	direction As Integer
) As Boolean
Parameters
direction
Type: System.Int32
0 = first texture coordinate is reversed.
1 = second texture coordinate is reversed.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace