RhinoCommon API
Curve.IsCircle Method
 Test a curve to see if it can be represented by a circle within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCircle()
Public Function IsCircle As Boolean
Return Value
Type: Boolean
 true if the Curve can be represented by a circle within tolerance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Curve Class
IsCircle Overload
Rhino.Geometry Namespace