RhinoCommon API
Material.SetEnvironmentTexture Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetEnvironmentTexture(
	string filename
)
Public Function SetEnvironmentTexture (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Material Class
SetEnvironmentTexture Overload
Rhino.DocObjects Namespace