RhinoCommon SDK
PickContext.PickMeshTopologyVertices Method
 Utility for picking mesh vertices
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] PickMeshTopologyVertices(
	Mesh mesh
)
Public Function PickMeshTopologyVertices (
	mesh As Mesh
) As Integer()
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Input.Custom.PickContext.PickMeshTopologyVertices(Rhino.Geometry.Mesh)"]
Return Value
Type: Int32[]
indices of mesh topology vertices that were picked
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace