RhinoCommon API
ObjectTable.Purge Method (RhinoObject)
 Removes object from document and deletes the pointer. Typically you will want to call Delete instead in order to keep the object on the undo list.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Purge(
	RhinoObject rhinoObject
)
Public Function Purge (
	rhinoObject As RhinoObject
) As Boolean
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
A Rhino object that will be deleted.
Return Value
Type: Boolean
true if the object was purged; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ObjectTable Class
Purge Overload
Rhino.DocObjects.Tables Namespace