RhinoCommon SDK
RenderContentCollection.Iterator_Sel Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.Iterator_Sel"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentCollectionIterator Iterator_Sel()
Public Function Iterator_Sel As ContentCollectionIterator
Return Value
Type: ContentCollectionIterator
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.Iterator_Sel"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace