RhinoCommon SDK
ObjectTable.Hide Method (RhinoObject, Boolean)
 If obj.IsNormal() is true, then the object will be hidden.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Hide(
	RhinoObject obj,
	bool ignoreLayerMode
)
Public Function Hide (
	obj As RhinoObject,
	ignoreLayerMode As Boolean
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
object to hide.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be hidden even if it is on a layer that is locked or off.
Return Value
Type: Boolean
true if the object was successfully hidden.
See Also
Reference
ObjectTable Class
Hide Overload
Rhino.DocObjects.Tables Namespace