RhinoCommon API
VisualAnalysisMode.EnableUserInterface Method
 Turns the analysis mode's user interface on and off. For Rhino's built in modes this opens or closes the modeless dialog that controls the analysis mode's display settings.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void EnableUserInterface(
	bool on
)
Public Overridable Sub EnableUserInterface (
	on As Boolean
)
Parameters
on
Type: System.Boolean
true if the inferface should be shown; false if it should be concealed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace