RhinoCommon API
SupportOptions.MultithreadedTextureEvaluation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.MultithreadedTextureEvaluation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool MultithreadedTextureEvaluation()
Public Shared Function MultithreadedTextureEvaluation As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.MultithreadedTextureEvaluation"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SupportOptions Class
Rhino.Render Namespace