RhinoCommon API
Arc Constructor (Point3d, Double, Double)
 Initializes a new horizontal arc at the given center point, with a custom radius and angle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Arc(
	Point3d center,
	double radius,
	double angleRadians
)
Public Sub New (
	center As Point3d,
	radius As Double,
	angleRadians As Double
)
Parameters
center
Type: Rhino.Geometry.Point3d
Center point of arc.
radius
Type: System.Double
Radius of arc.
angleRadians
Type: System.Double
Sweep angle of arc (in radians)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace