RhinoCommon API
InitFrameBufferEventArgs.SetFill Method (Color)
[Missing <summary> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetFill(
	Color color
)
Public Sub SetFill (
	color As Color
)
Parameters
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
InitFrameBufferEventArgs Class
SetFill Overload
Rhino.Display Namespace