RhinoCommon API
HostUtils.DebugString Method (String)
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void DebugString(
	string msg
)
Public Shared Sub DebugString (
	msg As String
)
Parameters
msg
Type: System.String
Message to print.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
HostUtils Class
DebugString Overload
Rhino.Runtime Namespace