RhinoCommon SDK
RhinoViewport.ClientToWorld Method (Point2d)
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(Rhino.Geometry.Point2d)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line ClientToWorld(
	Point2d clientPoint
)
Public Function ClientToWorld (
	clientPoint As Point2d
) As Line
Parameters
clientPoint
Type: Rhino.Geometry.Point2d
[Missing <param name="clientPoint"/> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(Rhino.Geometry.Point2d)"]
Return Value
Type: Line
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(Rhino.Geometry.Point2d)"]
See Also
Reference
RhinoViewport Class
ClientToWorld Overload
Rhino.Display Namespace