RhinoCommon API
ZBufferCapture.MinZ Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.MinZ"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float MinZ()
Public Function MinZ As Single
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.MinZ"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace