RhinoCommon SDK
CustomGripObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomGripObject.Finalize"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace