RhinoCommon API
File3dmNamedConstructionPlanes.Delete Method (Int32)
 Remove a named construction plane from the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	int index
)
Public Function Delete (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero based array index.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmNamedConstructionPlanes Class
Delete Overload
Rhino.FileIO Namespace