RhinoCommon API
RenderContentCollection.Set Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.Set(Rhino.Render.RenderContentCollection)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Set(
	RenderContentCollection collection
)
Public Sub Set (
	collection As RenderContentCollection
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
[Missing <param name="collection"/> documentation for "M:Rhino.Render.RenderContentCollection.Set(Rhino.Render.RenderContentCollection)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace