RhinoCommon API
GetOption Constructor
Initializes a new instance of the GetOption class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetOption()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetOption Class
Rhino.Input.Custom Namespace