RhinoCommon API
SimpleArrayGuid Constructor
 Initializes a new SimpleArrayGuid class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayGuid()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimpleArrayGuid Class
Rhino.Runtime.InteropWrappers Namespace