RhinoCommon API
SnapShotsClient.LayersCategory Method
 Predefined layers category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string LayersCategory()
Public Shared Function LayersCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.LayersCategory"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace