RhinoCommon API
NurbsCurve Constructor (NurbsCurve)
 Initializes a NURBS curve by copying its values from another NURBS curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve(
	NurbsCurve other
)
Public Sub New (
	other As NurbsCurve
)
Parameters
other
Type: Rhino.Geometry.NurbsCurve
The other curve. This value can be null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
NurbsCurve Class
NurbsCurve Overload
Rhino.Geometry Namespace