RhinoCommon API
BinaryArchiveWriter.WriteObjRef Method
 Writes a ObjRef to the archive
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteObjRef(
	ObjRef objref
)
Public Sub WriteObjRef (
	objref As ObjRef
)
Parameters
objref
Type: Rhino.DocObjects.ObjRef
[Missing <param name="objref"/> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.WriteObjRef(Rhino.DocObjects.ObjRef)"]
Return Value
Type:
the element that was read
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace