RhinoCommon API
SmartTrackSettings.UpdateFromState Method
 Updates from a particular setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void UpdateFromState(
	SmartTrackSettingsState state
)
Public Shared Sub UpdateFromState (
	state As SmartTrackSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.SmartTrackSettingsState
The new state that will be set.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace