RhinoCommon SDK
BrepTrimList.AddSingularTrim Method
 Add a new singular trim to the brep.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrim AddSingularTrim(
	BrepVertex vertex,
	BrepLoop loop,
	IsoStatus iso,
	int curve2dIndex
)
Public Function AddSingularTrim (
	vertex As BrepVertex,
	loop As BrepLoop,
	iso As IsoStatus,
	curve2dIndex As Integer
) As BrepTrim
Parameters
vertex
Type: Rhino.Geometry.BrepVertex
vertex along collapsed surface edge
loop
Type: Rhino.Geometry.BrepLoop
trim is appended to this loop
iso
Type: Rhino.Geometry.IsoStatus
[Missing <param name="iso"/> documentation for "M:Rhino.Geometry.Collections.BrepTrimList.AddSingularTrim(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepLoop,Rhino.Geometry.IsoStatus,System.Int32)"]
curve2dIndex
Type: System.Int32
index of 2d trimming curve
Return Value
Type: BrepTrim
new trim
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace