RhinoCommon API
Matrix.Invert Method
 Modifies this matrix to become its own inverse.
Matrix might be non-invertible (singular) and the return value will be false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Invert(
	double zeroTolerance
)
Public Function Invert (
	zeroTolerance As Double
) As Boolean
Parameters
zeroTolerance
Type: System.Double
The admitted tolerance for 0.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Matrix Class
Rhino.Geometry Namespace