RhinoCommon API
Point3dGrid Constructor
 Initializes a rectangular grid of points, with no points in it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dGrid()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Point3dGrid Class
Point3dGrid Overload
Rhino.Geometry Namespace