RhinoCommon SDK
PersistentSettings.TryGetPoint3d Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@)"]
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetPoint3d(
	string key,
	out Point3d value
)
Public Function TryGetPoint3d (
	key As String,
	<OutAttribute> ByRef value As Point3d
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@)"]
See Also
Reference
PersistentSettings Class
Rhino Namespace