RhinoCommon API
GumballObject.SetFromBoundingBox Method (BoundingBox)
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.BoundingBox)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetFromBoundingBox(
	BoundingBox boundingBox
)
Public Function SetFromBoundingBox (
	boundingBox As BoundingBox
) As Boolean
Parameters
boundingBox
Type: Rhino.Geometry.BoundingBox
[Missing <param name="boundingBox"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.BoundingBox)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.BoundingBox)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GumballObject Class
SetFromBoundingBox Overload
Rhino.UI.Gumball Namespace