RhinoCommon API
BrepFaceList.SplitFaceAtTangents Method
 Splits the face of a Brep at tangent locations.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SplitFaceAtTangents(
	int faceIndex
)
Public Function SplitFaceAtTangents (
	faceIndex As Integer
) As Boolean
Parameters
faceIndex
Type: System.Int32
The index of the face to split.
Return Value
Type: Boolean
True if successful, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace