RhinoCommon API
Curve.LcoalClosestPoint Method
 Find parameter of the point on a curve that is locally closest to the testPoint. The search for a local close point starts at a seed parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool LcoalClosestPoint(
	Point3d testPoint,
	double seed,
	out double t
)
Public Function LcoalClosestPoint (
	testPoint As Point3d,
	seed As Double,
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
A point to test against.
seed
Type: System.Double
The seed parameter.
t
Type: System.Double
>Parameter of the curve that is closest to testPoint.
Return Value
Type: Boolean
true if the search is successful, false if the search fails.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Curve Class
Rhino.Geometry Namespace