RhinoCommon API
Curve.ToNurbsCurve Method
 Constructs a NURBS curve representation of this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
NURBS representation of the curve on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Curve Class
ToNurbsCurve Overload
Rhino.Geometry Namespace