RhinoCommon API
MetaDataProxy.Dispose Method
 Dispose for MetaDataProxy
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace