RhinoCommon SDK
ViewportInfo.SetScreenPort Method (Rectangle, Int32, Int32)
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetScreenPort(
	Rectangle windowRectangle,
	int near,
	int far
)
Public Function SetScreenPort (
	windowRectangle As Rectangle,
	near As Integer,
	far As Integer
) As Boolean
Parameters
windowRectangle
Type: System.Drawing.Rectangle
A new rectangle.
near
Type: System.Int32
The near value.
far
Type: System.Int32
The far value.
Return Value
Type: Boolean
true if input is valid.
See Also
Reference
ViewportInfo Class
SetScreenPort Overload
Rhino.DocObjects Namespace