RhinoCommon API
File3dmObjectTable.AddSurface Method (Surface)
Adds a surface object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddSurface(
	Surface surface
)
Public Function AddSurface (
	surface As Surface
) As Guid
Parameters
surface
Type: Rhino.Geometry.Surface
A duplicate of this surface is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmObjectTable Class
AddSurface Overload
Rhino.FileIO Namespace