RhinoCommon API
Transform.Inequality Operator
 Determines if two transformations are different in value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Transform a,
	Transform b
)
Public Shared Operator <> (
	a As Transform,
	b As Transform
) As Boolean
Parameters
a
Type: Rhino.Geometry.Transform
A tranform.
b
Type: Rhino.Geometry.Transform
Another tranform.
Return Value
Type: Boolean
true if transforms are different; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Transform Structure
Rhino.Geometry Namespace