RhinoCommon SDK
Point4d Constructor (Point4d)
 Initializes a new point by copying coordinates from another point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point4d(
	Point4d point
)
Public Sub New (
	point As Point4d
)
Parameters
point
Type: Rhino.Geometry.Point4d
A point.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point4d Structure
Point4d Overload
Rhino.Geometry Namespace