RhinoCommon API
Skin.OnLicenseCheckCompleted Method
Is called when the license check is completed.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnLicenseCheckCompleted()
Protected Overridable Sub OnLicenseCheckCompleted
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Skin Class
Rhino.Runtime Namespace