RhinoCommon SDK
DisplayPipeline.IsActive Method
 Determines if an object can be visible in this viewport based on it's object type and display attributes. This test does not check for visibility based on location of the object. NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on location (is some part of the object in the view frustum). Use CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on object type.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsActive(
	RhinoObject rhinoObject
)
Public Function IsActive (
	rhinoObject As RhinoObject
) As Boolean
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
Object to test.
Return Value
Type: Boolean
 true if this object can be drawn in the pipeline's viewport based on it's object type and display attributes.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace