RhinoCommon API
PlugIn.AskUserForLicense Method (LicenseBuildType, Boolean, String, Object, ValidateProductKeyDelegate, OnLeaseChangedDelegate)
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected bool AskUserForLicense(
	LicenseBuildType productBuildType,
	bool standAlone,
	string textMask,
	Object parentWindow,
	ValidateProductKeyDelegate validateProductKeyDelegate,
	OnLeaseChangedDelegate onLeaseChangedDelegate
)
Protected Function AskUserForLicense (
	productBuildType As LicenseBuildType,
	standAlone As Boolean,
	textMask As String,
	parentWindow As Object,
	validateProductKeyDelegate As ValidateProductKeyDelegate,
	onLeaseChangedDelegate As OnLeaseChangedDelegate
) As Boolean
Parameters
productBuildType
Type: Rhino.PlugIns.LicenseBuildType
[Missing <param name="productBuildType"/> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
standAlone
Type: System.Boolean
[Missing <param name="standAlone"/> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
textMask
Type: System.String
[Missing <param name="textMask"/> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
parentWindow
Type: System.Object
[Missing <param name="parentWindow"/> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
validateProductKeyDelegate
Type: Rhino.PlugIns.ValidateProductKeyDelegate
[Missing <param name="validateProductKeyDelegate"/> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
onLeaseChangedDelegate
Type: Rhino.PlugIns.OnLeaseChangedDelegate
[Missing <param name="onLeaseChangedDelegate"/> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.AskUserForLicense(Rhino.PlugIns.LicenseBuildType,System.Boolean,System.String,System.Object,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
PlugIn Class
AskUserForLicense Overload
Rhino.PlugIns Namespace