RhinoCommon API
ViewCaptureWriter.DrawPath Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Drawing.Color)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void DrawPath(
	ViewCaptureWriter.PathPoint[] points,
	ViewCaptureWriter.Pen pen,
	Color brushColor
)
Protected MustOverride Sub DrawPath (
	points As ViewCaptureWriter.PathPoint(),
	pen As ViewCaptureWriter.Pen,
	brushColor As Color
)
Parameters
points
Type: Rhino.Runtime.ViewCaptureWriter.PathPoint[]
[Missing <param name="points"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Drawing.Color)"]
pen
Type: Rhino.Runtime.ViewCaptureWriter.Pen
[Missing <param name="pen"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Drawing.Color)"]
brushColor
Type: System.Drawing.Color
[Missing <param name="brushColor"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.DrawPath(Rhino.Runtime.ViewCaptureWriter.PathPoint[],Rhino.Runtime.ViewCaptureWriter.Pen,System.Drawing.Color)"]
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace