RhinoCommon API
ComponentFunctionInfo.SimplifyTreeOutput Method
 Performs list logical reduction when trees are not used.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Object SimplifyTreeOutput(
	Object[] input,
	string[] warnings,
	bool treatWarningsAsErrors
)
Public Shared Function SimplifyTreeOutput (
	input As Object(),
	warnings As String(),
	treatWarningsAsErrors As Boolean
) As Object
Parameters
input
Type: System.Object[]
The computed data.
warnings
Type: System.String[]
A series of warnings.
treatWarningsAsErrors
Type: System.Boolean
If warnings should be considered, then this is set to true.
Return Value
Type: Object
The simplified object.
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace