RhinoCommon API
DocumentOrFreeFloatingBase.BeginChange Method
 Call this function before making any change to this object (calling a setter) otherwise undo will not work correctly. Calls to BeginChange must be paired with a call to EndChange.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void BeginChange(
	RenderContent.ChangeContexts cc
)
Public Sub BeginChange (
	cc As RenderContent.ChangeContexts
)
Parameters
cc
Type: Rhino.Render.RenderContent.ChangeContexts
Change context
See Also
Reference
DocumentOrFreeFloatingBase Class
Rhino.Render Namespace