RhinoCommon API
BinaryArchiveFile.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace