RhinoCommon API
BrepLoop.To3dCurve Method
 Create a 3D curve that approximates the loop geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve To3dCurve()
Public Function To3dCurve As Curve
Return Value
Type: Curve
A 3D curve that approximates the loop or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace