RhinoCommon API
RhinoApp.RunningInRdp Method
 Find out if Rhino is running in a remote session
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RunningInRdp()
Public Shared Function RunningInRdp As Boolean
Return Value
Type: Boolean
true if Rhino is running in a RDP session, false otherwise
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoApp Class
Rhino Namespace