RhinoCommon SDK
CurveList.Add Method (Circle)
 Adds a circle to this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Circle circle
)
Public Sub Add (
	circle As Circle
)
Parameters
circle
Type: Rhino.Geometry.Circle
A circle value that will be the model of the new internal curve.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace