RhinoCommon API
SupportOptions.UseRenderedPreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UseRenderedPreview"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UseRenderedPreview()
Public Shared Function UseRenderedPreview As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UseRenderedPreview"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SupportOptions Class
Rhino.Render Namespace