RhinoCommon API
OpenGLSettings.GetDefaultState Method
 Gets the OpenGL factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static OpenGLSettingsState GetDefaultState()
Public Shared Function GetDefaultState As OpenGLSettingsState
Return Value
Type: OpenGLSettingsState
A new OpenGL state with factory settings.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace