RhinoCommon API
Command.InScriptRunnerCommand Method
 This is a low level tool to determine if Rhino is currently running a script running command like "ReadCommandFile" or the RhinoScript plug-in's "RunScript".
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool InScriptRunnerCommand()
Public Shared Function InScriptRunnerCommand As Boolean
Return Value
Type: Boolean
true if a script running command is active.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Command Class
Rhino.Commands Namespace