RhinoCommon API
RhinoMath.UnitScale Method
Computes the scale factor for changing the measurements unit systems.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double UnitScale(
	UnitSystem from,
	UnitSystem to
)
Public Shared Function UnitScale (
	from As UnitSystem,
	to As UnitSystem
) As Double
Parameters
from
Type: Rhino.UnitSystem
The system to convert from.
to
Type: Rhino.UnitSystem
The system to convert measurements into.
Return Value
Type: Double
A scale multiplier.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoMath Class
Rhino Namespace