RhinoCommon SDK
RhinoViewport.Dispose Method (Boolean)
Releases the unmanaged resources used by the RhinoViewport and optionally releases the managed resources
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
RhinoViewport Class
Dispose Overload
Rhino.Display Namespace