RhinoCommon SDK
LinearDimension.FromPoints Method
 Initializes a new instance of the LinearDimension class, based on three points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static LinearDimension FromPoints(
	Point3d extensionLine1End,
	Point3d extensionLine2End,
	Point3d pointOnDimensionLine
)
Public Shared Function FromPoints (
	extensionLine1End As Point3d,
	extensionLine2End As Point3d,
	pointOnDimensionLine As Point3d
) As LinearDimension
Parameters
extensionLine1End
Type: Rhino.Geometry.Point3d
[Missing <param name="extensionLine1End"/> documentation for "M:Rhino.Geometry.LinearDimension.FromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
extensionLine2End
Type: Rhino.Geometry.Point3d
[Missing <param name="extensionLine2End"/> documentation for "M:Rhino.Geometry.LinearDimension.FromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
pointOnDimensionLine
Type: Rhino.Geometry.Point3d
[Missing <param name="pointOnDimensionLine"/> documentation for "M:Rhino.Geometry.LinearDimension.FromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Return Value
Type: LinearDimension
[Missing <returns> documentation for "M:Rhino.Geometry.LinearDimension.FromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace