RhinoCommon API
ContentFactory.Kind Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.ContentFactory.Kind"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentKind Kind()
Public Function Kind As RenderContentKind
Return Value
Type: RenderContentKind
[Missing <returns> documentation for "M:Rhino.Render.DataSources.ContentFactory.Kind"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace