RhinoCommon SDK
Rectangle3d.ToNurbsCurve Method
 Constructs a nurbs curve representation of this rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A nurbs curve with the same shape as this rectangle.
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace