RhinoCommon API
MeshTopologyEdgeList.EdgeLine Method
Gets the 3d line along an edge.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line EdgeLine(
	int topologyEdgeIndex
)
Public Function EdgeLine (
	topologyEdgeIndex As Integer
) As Line
Parameters
topologyEdgeIndex
Type: System.Int32
The topology edge index.
Return Value
Type: Line
 Line along edge. If input is not valid, an Invalid Line is returned.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace