RhinoCommon SDK
Color4fField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.Color4fField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.Color4fField.ValueAsObject"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace