RhinoCommon SDK
DisplayPipeline.DrawExtrusionWires Method (Extrusion, Color)
 Draws all the wireframe curves of an extrusion object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawExtrusionWires(
	Extrusion extrusion,
	Color color
)
Public Sub DrawExtrusionWires (
	extrusion As Extrusion,
	color As Color
)
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
Extrusion to draw.
color
Type: System.Drawing.Color
Color of Wireframe curves.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
DrawExtrusionWires Overload
Rhino.Display Namespace