RhinoCommon API
RenderContent.ChildSlotAmount Method
 Gets the amount property for the texture in the specified child slot. Values are typically from 0.0 - 100.0
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ChildSlotAmount(
	string childSlotName
)
Public Function ChildSlotAmount (
	childSlotName As String
) As Double
Parameters
childSlotName
Type: System.String
Child slot name for the child
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.ChildSlotAmount(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderContent Class
Rhino.Render Namespace