RhinoCommon SDK
File3dmObjectTable.GetEnumerator Method
 Gets the enumerator that visits any File3dmObject in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<File3dmObject> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmObject)
Return Value
Type: IEnumerator<File3dmObject>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace