RhinoCommon SDK
GetPoint.EnableObjectSnapCursors Method
 Enables or disables object snap cursors. By default, object snap cursors are enabled.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableObjectSnapCursors(
	bool enable
)
Public Sub EnableObjectSnapCursors (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
If true then object snap cursors (plus sign with "near", "end", etc.) are used when the point snaps to a object.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace