RhinoCommon API
LightManagerSupport.PluginId Method
 The Guid of the plugin
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid PluginId()
Public MustOverride Function PluginId As Guid
Return Value
Type: Guid
Returns the Guid of the plugin
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace