RhinoCommon API
SpaceMorph Constructor
Initializes a new instance of the SpaceMorph class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SpaceMorph()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace