RhinoCommon SDK
Point3f.GetHashCode Method
 Computes a hash code for the present point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this point.
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace