RhinoCommon API
DisplayPipeline.DrawDottedLine Method (Line, Color)
 Draws a single dotted line.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawDottedLine(
	Line line,
	Color color
)
Public Sub DrawDottedLine (
	line As Line,
	color As Color
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color of line.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipeline Class
DrawDottedLine Overload
Rhino.Display Namespace