RhinoCommon API
RealtimeDisplayMode.HudRendererPaused Method
 Implement to support pausing and resuming in the viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool HudRendererPaused()
Public Overridable Function HudRendererPaused As Boolean
Return Value
Type: Boolean
Return true if the render engine is paused.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace