RhinoCommon SDK
Layer Constructor (SerializationInfo, StreamingContext)
Initializes a new instance of the Layer class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected Layer(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
[Missing <param name="info"/> documentation for "M:Rhino.DocObjects.Layer.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
context
Type: System.Runtime.Serialization.StreamingContext
[Missing <param name="context"/> documentation for "M:Rhino.DocObjects.Layer.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
See Also
Reference
Layer Class
Layer Overload
Rhino.DocObjects Namespace