RhinoCommon SDK
SubD.Dispose Method (Boolean)
Releases the unmanaged resources used by the SubD and optionally releases the managed resources
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Dispose(
	bool disposing
)
Protected Overrides Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
SubD Class
Dispose Overload
Rhino.Geometry Namespace