RhinoCommon API
RenderTabs.SessionIdFromTab Method
 Get the session Id that created the specified tab object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid SessionIdFromTab(
	Object tab
)
Public Shared Function SessionIdFromTab (
	tab As Object
) As Guid
Parameters
tab
Type: System.Object
[Missing <param name="tab"/> documentation for "M:Rhino.Render.RenderTabs.SessionIdFromTab(System.Object)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.RenderTabs.SessionIdFromTab(System.Object)"]
See Also
Reference
RenderTabs Class
Rhino.Render Namespace