RhinoCommon API
DisplayPipeline.DrawCurve Method (Curve, Color, Int32)
 Draw a single Curve object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawCurve(
	Curve curve,
	Color color,
	int thickness
)
Public Sub DrawCurve (
	curve As Curve,
	color As Color,
	thickness As Integer
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
DisplayPipeline Class
DrawCurve Overload
Rhino.Display Namespace