RhinoCommon API
DisplayPipeline.DrawLine Method (Line, Color, Int32)
 Draws a single line object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawLine(
	Line line,
	Color color,
	int thickness
)
Public Sub DrawLine (
	line As Line,
	color As Color,
	thickness As Integer
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color to draw line in.
thickness
Type: System.Int32
Thickness (in pixels) of line.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipeline Class
DrawLine Overload
Rhino.Display Namespace