RhinoCommon API
ColorHSL Implicit Conversion (ColorHSL to Color)
 Implicitly converts a ColorHSL in a .Net library color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator Color (
	ColorHSL hsl
)
Public Shared Widening Operator CType (
	hsl As ColorHSL
) As Color
Parameters
hsl
Type: Rhino.Display.ColorHSL
A HSL color.
Return Value
Type: Color
A ARGB .Net library color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace