RhinoCommon SDK
RenderContentCollection.SetIterationStrategy Method
 Used to set the iteration strategy on the render content collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetIterationStrategy(
	it_strategy strategy,
	uint flag = 0,
	string kind = ""
)
Public Sub SetIterationStrategy (
	strategy As it_strategy,
	Optional flag As UInteger = 0,
	Optional kind As String = ""
)
Parameters
strategy
Type: Rhino.Render.it_strategy
The type of iterator that is wanted. ContentDatabase or ContentSelection
flag (Optional)
Type: System.UInt32
Used to specify what contents are in the iteration
kind (Optional)
Type: System.String
The content kind of the collection. E.g material, texture or environment. Can contain many kinds in a comma delimited string
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace