RhinoCommon SDK
SweepOneRail.SetRoadlikeUpDirection Method
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetRoadlikeUpDirection(Rhino.Geometry.Vector3d)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetRoadlikeUpDirection(
	Vector3d up
)
Public Sub SetRoadlikeUpDirection (
	up As Vector3d
)
Parameters
up
Type: Rhino.Geometry.Vector3d
[Missing <param name="up"/> documentation for "M:Rhino.Geometry.SweepOneRail.SetRoadlikeUpDirection(Rhino.Geometry.Vector3d)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace