RhinoCommon API
Point3dList.ClosestIndex Method
 Finds the index of the point that is closest to a test point in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ClosestIndex(
	Point3d testPoint
)
Public Function ClosestIndex (
	testPoint As Point3d
) As Integer
Parameters
testPoint
Type: Rhino.Geometry.Point3d
point to compare against.
Return Value
Type: Int32
index of closest point in the list on success. -1 on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Point3dList Class
Rhino.Collections Namespace