RhinoCommon SDK
Vector3f.Multiply Operator (Vector3f, Vector3f)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double operator *(
	Vector3f vector1,
	Vector3f vector2
)
Public Shared Operator * (
	vector1 As Vector3f,
	vector2 As Vector3f
) As Double
Parameters
vector1
Type: Rhino.Geometry.Vector3f
A vector.
vector2
Type: Rhino.Geometry.Vector3f
A second vector.
Return Value
Type: Double
 A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y + v1.Z*v2.Z.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.
See Also
Reference
Vector3f Structure
Multiply Overload
Rhino.Geometry Namespace