RhinoCommon API
Material.SetBitmapTexture Method (Texture)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(Rhino.DocObjects.Texture)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetBitmapTexture(
	Texture texture
)
Public Function SetBitmapTexture (
	texture As Texture
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(Rhino.DocObjects.Texture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(Rhino.DocObjects.Texture)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Material Class
SetBitmapTexture Overload
Rhino.DocObjects Namespace