RhinoCommon API
SupportOptions.SetLabelFormatLoc Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLabelFormatLoc(System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetLabelFormatLoc(
	int value
)
Public Shared Sub SetLabelFormatLoc (
	value As Integer
)
Parameters
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.Render.SupportOptions.SetLabelFormatLoc(System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SupportOptions Class
Rhino.Render Namespace