RhinoCommon API
RhinoApp.Wait Method
 Pauses to keep Windows message pump alive so views will update and windows will repaint.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void Wait()
Public Shared Sub Wait
See Also
Reference
RhinoApp Class
Rhino Namespace