RhinoCommon API
Point2d Constructor (Vector2d)
 Initializes a new instance of Point2d by converting a vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d(
	Vector2d vector
)
Public Sub New (
	vector As Vector2d
)
Parameters
vector
Type: Rhino.Geometry.Vector2d
The vector that will be copied.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace