RhinoCommon API
Brep.Append Method
 Appends a copy of another brep to this and updates indices of appended brep parts. Duplicates are not removed
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Append(
	Brep other
)
Public Sub Append (
	other As Brep
)
Parameters
other
Type: Rhino.Geometry.Brep
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Brep.Append(Rhino.Geometry.Brep)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Brep Class
Rhino.Geometry Namespace