RhinoCommon API
Brep.GetArea Method
 Compute the Area of the Brep. If you want proper Area data with moments and error information, use the AreaMassProperties class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GetArea()
Public Function GetArea As Double
Return Value
Type: Double
The area of the Brep.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Brep Class
GetArea Overload
Rhino.Geometry Namespace