RhinoCommon API
BinaryArchiveWriter.WriteInterval Method
 Writes a Interval value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteInterval(
	Interval value
)
Public Sub WriteInterval (
	value As Interval
)
Parameters
value
Type: Rhino.Geometry.Interval
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace