RhinoCommon API
ViewTable.ThreeViewLayout Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewTable.ThreeViewLayout(System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ThreeViewLayout(
	bool useMatchingViews
)
Public Sub ThreeViewLayout (
	useMatchingViews As Boolean
)
Parameters
useMatchingViews
Type: System.Boolean
[Missing <param name="useMatchingViews"/> documentation for "M:Rhino.DocObjects.Tables.ViewTable.ThreeViewLayout(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace