RhinoCommon API
GetPoint.ConstrainToTargetPlane Method
 Constrains point to lie on a plane that is parallel to the viewing plane and passes through the view's target point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ConstrainToTargetPlane()
Public Sub ConstrainToTargetPlane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace