RhinoCommon API
LineCurve Constructor (Point2d, Point2d)
 Initializes a new instance of the LineCurve class, by setting start and end point from two 2D points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LineCurve(
	Point2d from,
	Point2d to
)
Public Sub New (
	from As Point2d,
	to As Point2d
)
Parameters
from
Type: Rhino.Geometry.Point2d
A start point.
to
Type: Rhino.Geometry.Point2d
An end point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace