RhinoCommon API
BrepFace.IsPointOnFace Method
 Tests if a parameter space point is on the interior of a trimmed face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointFaceRelation IsPointOnFace(
	double u,
	double v
)
Public Function IsPointOnFace (
	u As Double,
	v As Double
) As PointFaceRelation
Parameters
u
Type: System.Double
Parameter space point u value.
v
Type: System.Double
Parameter space point v value.
Return Value
Type: PointFaceRelation
A value describing the spatial relationship between the point and the face.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace