RhinoCommon API
LicenseUtils.GetOneLicenseStatus Method
 Returns the current status of a license for ui purposes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static LicenseStatus GetOneLicenseStatus(
	Guid productid
)
Public Shared Function GetOneLicenseStatus (
	productid As Guid
) As LicenseStatus
Parameters
productid
Type: System.Guid
[Missing <param name="productid"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetOneLicenseStatus(System.Guid)"]
Return Value
Type: LicenseStatus
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetOneLicenseStatus(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace