RhinoCommon API
PointCloud.Add Method (Point3d)
 Append a new point to the end of the list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Point3d point
)
Public Sub Add (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to append.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
PointCloud Class
Add Overload
Rhino.Geometry Namespace