RhinoCommon API
Point3d.Multiply Operator (Double, Point3d)
 Multiplies a Point3d by a number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d operator *(
	double t,
	Point3d point
)
Public Shared Operator * (
	t As Double,
	point As Point3d
) As Point3d
Parameters
t
Type: System.Double
A number.
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A new point that is coordinatewise multiplied by t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Point3d Structure
Multiply Overload
Rhino.Geometry Namespace