RhinoCommon API
ColorLCH Constructor (Color)
 Constructs a new instance of ColorLCH that is equivalent to an RGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorLCH(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
RGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ColorLCH Structure
ColorLCH Overload
Rhino.Display Namespace