RhinoCommon SDK
BrepFace.TrimAwareIsoCurve Method
 Similar to IsoCurve function, except this function pays attention to trims on faces and may return multiple curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] TrimAwareIsoCurve(
	int direction,
	double constantParameter
)
Public Function TrimAwareIsoCurve (
	direction As Integer,
	constantParameter As Double
) As Curve()
Parameters
direction
Type: System.Int32
Direction of isocurve.
0 = Isocurve connects all points with a constant U value.
1 = Isocurve connects all points with a constant V value.
constantParameter
Type: System.Double
Surface parameter that remains identical along the isocurves.
Return Value
Type: Curve[]
Isoparametric curves connecting all points with the constantParameter value.
Remarks
 In this function "direction" indicates which direction the resulting curve runs. 0: horizontal, 1: vertical In the other Surface functions that take a "direction" argument, "direction" indicates if "constantParameter" is a "u" or "v" parameter.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace