RhinoCommon API
SimpleArrayBinaryArchiveReader.Add Method
 Adds a new Interval at the end of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	BinaryArchiveReader reader
)
Public Sub Add (
	reader As BinaryArchiveReader
)
Parameters
reader
Type: Rhino.FileIO.BinaryArchiveReader
[Missing <param name="reader"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Add(Rhino.FileIO.BinaryArchiveReader)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace