RhinoCommon API
LicenseChangedEventArgs Constructor
Initializes a new instance of the LicenseChangedEventArgs class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseChangedEventArgs()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LicenseChangedEventArgs Class
Rhino.PlugIns Namespace