RhinoCommon API
FactoryBase.Register Method
 Call this function during startup of current assembly to load classes with factory creation support are registed
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Type[] Register()
Public Shared Function Register As Type()
Return Value
Type: Type[]
[Missing <returns> documentation for "M:Rhino.UI.Controls.FactoryBase.Register"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
FactoryBase Class
Register Overload
Rhino.UI.Controls Namespace