RhinoCommon API
RhinoApp.SetCommandPrompt Method (String)
Set Rhino command prompt.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetCommandPrompt(
	string prompt
)
Public Shared Sub SetCommandPrompt (
	prompt As String
)
Parameters
prompt
Type: System.String
The new prompt text.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoApp Class
SetCommandPrompt Overload
Rhino Namespace