RhinoCommon API
TaperSpaceMorph.MorphPoint Method
Morphs an Euclidean point.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Point3d MorphPoint(
	Point3d point
)
Public Overrides Function MorphPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point that will be morphed by this object.
Return Value
Type: Point3d
Resulting morphed point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
TaperSpaceMorph Class
Rhino.Geometry.Morphs Namespace