RhinoCommon SDK
ReplayHistoryData.TryGetGuid Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuid(System.Int32,System.Guid@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetGuid(
	int id,
	out Guid value
)
Public Function TryGetGuid (
	id As Integer,
	<OutAttribute> ByRef value As Guid
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuid(System.Int32,System.Guid@)"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuid(System.Int32,System.Guid@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetGuid(System.Int32,System.Guid@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace