RhinoCommon SDK
MeshTextureCoordinateList.NormalizeTextureCoordinates Method
 Scales the texture coordinates so the texture domains are [0,1] and eliminate any texture rotations.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool NormalizeTextureCoordinates()
Public Function NormalizeTextureCoordinates As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace