RhinoCommon API
RhinoViewport.PopConstructionPlane Method
 Sets the construction plane to the plane that was active before the last call to PushConstructionPlane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PopConstructionPlane()
Public Function PopConstructionPlane As Boolean
Return Value
Type: Boolean
true if a construction plane was popped.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace