RhinoCommon SDK
SubD.ChamferVertex Method
 Removes a vertex and inserts a face using some parameters.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ChamferVertex(
	int vertexIndex,
	DistancingMode mode,
	double distance
)
Public Sub ChamferVertex (
	vertexIndex As Integer,
	mode As DistancingMode,
	distance As Double
)
Parameters
vertexIndex
Type: System.Int32
The index of the vertex where insertion should happen.
mode
Type: Rhino.Geometry.DistancingMode
The distance mode.
distance
Type: System.Double
The distance, in terms defined with mode: units or unary values, where 0 is start and 1 is end.
See Also
Reference
SubD Class
Rhino.Geometry Namespace