RhinoCommon API
IStackedDialogPageService.SelectedObjects Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjects(Rhino.UI.ObjectPropertiesPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RhinoObject[] SelectedObjects(
	ObjectPropertiesPage page
)
Function SelectedObjects (
	page As ObjectPropertiesPage
) As RhinoObject()
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjects(Rhino.UI.ObjectPropertiesPage)"]
Return Value
Type: RhinoObject[]
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjects(Rhino.UI.ObjectPropertiesPage)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace