RhinoCommon API
GetPoint.EnableDrawLineFromPoint Method
 Controls drawing of dynamic a line from the start point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableDrawLineFromPoint(
	bool enable
)
Public Sub EnableDrawLineFromPoint (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
 if true, a dynamic line is drawn from the DrawLineFromPoint startPoint to the point being picked.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace