RhinoCommon API
GetTransform.AddTransformObjects Method
 Adds any objects you want transformed and grips you want transformed. Make sure no duplicates are in the list and that no grip ownwers are passed in as objects.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddTransformObjects(
	TransformObjectList list
)
Public Sub AddTransformObjects (
	list As TransformObjectList
)
Parameters
list
Type: Rhino.Collections.TransformObjectList
A custom transform object list.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace