RhinoCommon API
SimpleArrayDouble Constructor (IEnumerable<Double>)
 Initializes a new SimpleArrayDouble instance, with items.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayDouble(
	IEnumerable<double> items
)
Public Sub New (
	items As IEnumerable(Of Double)
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="items"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayDouble.#ctor(System.Collections.Generic.IEnumerable{System.Double})"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
SimpleArrayDouble Class
SimpleArrayDouble Overload
Rhino.Runtime.InteropWrappers Namespace