RhinoCommon API
Unroller.AddFollowingGeometry Method (Point3d, String)
 Adds a text dot that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddFollowingGeometry(
	Point3d dotLocation,
	string dotText
)
Public Sub AddFollowingGeometry (
	dotLocation As Point3d,
	dotText As String
)
Parameters
dotLocation
Type: Rhino.Geometry.Point3d
A dot point.
dotText
Type: System.String
A dot text.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace