RhinoCommon API
ISettingsWriteErrorService.LogFailure Method
 If there is a entry for this settings file increment the failure counter otherwise create a new entry and set the failure count to one.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void LogFailure(
	string fileName,
	Exception exception
)
Sub LogFailure (
	fileName As String,
	exception As Exception
)
Parameters
fileName
Type: System.String
 Used to generate registry key unique to this file name
exception
Type: System.Exception
 The exception causing this event
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ISettingsWriteErrorService Interface
Rhino.Runtime Namespace