RhinoCommon API
Brep.UnjoinEdges Method
 Unjoins, or separates, edges within the Brep. Note, seams in closed surfaces will not separate.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep[] UnjoinEdges(
	IEnumerable<int> edgesToUnjoin
)
Public Function UnjoinEdges (
	edgesToUnjoin As IEnumerable(Of Integer)
) As Brep()
Parameters
edgesToUnjoin
Type: System.Collections.Generic.IEnumerable<Int32>
The indices of the Brep edges to unjoin.
Return Value
Type: Brep[]
This Brep is not modified, the trim results are returned in an array.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Brep Class
Rhino.Geometry Namespace