RhinoCommon API
Brep.CullUnusedLoops Method
Culls loops with m_loop_index == -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullUnusedLoops()
Public Function CullUnusedLoops As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Brep Class
Rhino.Geometry Namespace