RhinoCommon API
MeshFace.GetHashCode Method
 Returns a runtime-stable hashcode for the current mesh face. You are not allowed to rely on persistance of this hashcode in serialization, but for each version of RhinoCommon, this hashcode will be the same for each mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this mesh face.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshFace Structure
GetHashCode Overload
Rhino.Geometry Namespace