RhinoCommon API
Material.SetBumpTexture Method (Texture)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(Rhino.DocObjects.Texture)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetBumpTexture(
	Texture texture
)
Public Function SetBumpTexture (
	texture As Texture
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(Rhino.DocObjects.Texture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(Rhino.DocObjects.Texture)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Material Class
SetBumpTexture Overload
Rhino.DocObjects Namespace