RhinoCommon API
ColorXYZ Implicit Conversion (ColorXYZ to Color)
 Implicitly converts a XYZ color into a .Net library color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator Color (
	ColorXYZ xyz
)
Public Shared Widening Operator CType (
	xyz As ColorXYZ
) As Color
Parameters
xyz
Type: Rhino.Display.ColorXYZ
A XYZ color.
Return Value
Type: Color
A ARGB .Net library color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace