RhinoCommon API
BrepFace.CreateExtrusion Method
 Extrude a face in a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep CreateExtrusion(
	Curve pathCurve,
	bool cap
)
Public Function CreateExtrusion (
	pathCurve As Curve,
	cap As Boolean
) As Brep
Parameters
pathCurve
Type: Rhino.Geometry.Curve
The path to extrude along.
cap
Type: System.Boolean
If true, the extrusion is capped with a translation of the face being extruded
Return Value
Type: Brep
A Brep on success or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace