RhinoCommon API
PlugIn.Find Method (Guid)
 Finds the plug-in instance that was loaded from a given plug-in Id.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static PlugIn Find(
	Guid plugInId
)
Public Shared Function Find (
	plugInId As Guid
) As PlugIn
Parameters
plugInId
Type: System.Guid
The plug-in Id.
Return Value
Type: PlugIn
The plug-in instance if successful. Otherwise, null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PlugIn Class
Find Overload
Rhino.PlugIns Namespace