RhinoCommon API
LightTable.Find Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	Guid id,
	bool ignoreDeleted
)
Public Function Find (
	id As Guid,
	ignoreDeleted As Boolean
) As Integer
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
ignoreDeleted
Type: System.Boolean
[Missing <param name="ignoreDeleted"/> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace