RhinoCommon SDK
SubDFacePtr.CompareTo Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.CompareTo(Rhino.Geometry.SubDFacePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int CompareTo(
	SubDFacePtr obj
)
Public Function CompareTo (
	obj As SubDFacePtr
) As Integer
Parameters
obj
Type: Rhino.Geometry.SubDFacePtr
[Missing <param name="obj"/> documentation for "M:Rhino.Geometry.SubDFacePtr.CompareTo(Rhino.Geometry.SubDFacePtr)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.CompareTo(Rhino.Geometry.SubDFacePtr)"]
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace