RhinoCommon API
UserDataList.Purge Method
 Removes all user data from this geometry.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Purge()
Public Sub Purge
Remarks
User Remove(UserData) to delete a single, known, item.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace