RhinoCommon API
RhinoWindow.Invoke Method
[Missing <summary> documentation for "M:Rhino.RhinoWindow.Invoke(System.Delegate)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Invoke(
	Delegate method
)
Public Sub Invoke (
	method As Delegate
)
Parameters
method
Type: System.Delegate
[Missing <param name="method"/> documentation for "M:Rhino.RhinoWindow.Invoke(System.Delegate)"]
Return Value
Type:
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoWindow Class
Rhino Namespace