RhinoCommon SDK
Ray3d.PointAt Method
 Evaluates a point along the ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
The t parameter.
Return Value
Type: Point3d
A point at (Direction*t + Position).
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace