RhinoCommon SDK
SupportOptions.ShowCustom Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.ShowCustom"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowCustom()
Public Shared Function ShowCustom As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.ShowCustom"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace