RhinoCommon API
ObjectPropertiesPage Constructor
Initializes a new instance of the ObjectPropertiesPage class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected ObjectPropertiesPage()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace