RhinoCommon API
CustomRenderMeshProvider.AllObjectsChanged Method
Note: This API is now obsolete.
 Call this method if your render meshes change.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use version that requires a document")]
public static void AllObjectsChanged()
<ObsoleteAttribute("Use version that requires a document")>
Public Shared Sub AllObjectsChanged
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.25
See Also
Reference
CustomRenderMeshProvider Class
AllObjectsChanged Overload
Rhino.Render Namespace