RhinoCommon API
UserData.MoveUserDataTo Method
 Moves the user data.
See MoveUserDataFrom(CommonObject) for more information.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void MoveUserDataTo(
	CommonObject objectToGetUserData,
	Guid id,
	bool append
)
Public Shared Sub MoveUserDataTo (
	objectToGetUserData As CommonObject,
	id As Guid,
	append As Boolean
)
Parameters
objectToGetUserData
Type: Rhino.Runtime.CommonObject
Object data source.
id
Type: System.Guid
Target.
append
Type: System.Boolean
If the data should be appended or replaced.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace