RhinoCommon API
PersistentSettings.TryGetEnumValue<T> Method (String, T)
 Attempt to get the stored value for an enum setting using a custom key. Note: the enum value ALWAYS gets assigned! Be sure to check for success of this method to prevent erroneous use of the value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetEnumValue<T>(
	string key,
	out T enumValue
)
where T : struct, new(), IConvertible
Public Function TryGetEnumValue(Of T As {Structure, New, IConvertible}) (
	key As String,
	<OutAttribute> ByRef enumValue As T
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetEnumValue``1(System.String,``0@)"]
enumValue
Type: T
[Missing <param name="enumValue"/> documentation for "M:Rhino.PersistentSettings.TryGetEnumValue``1(System.String,``0@)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.TryGetEnumValue``1(System.String,``0@)"]
Return Value
Type: Boolean
true if successful
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
PersistentSettings Class
TryGetEnumValue Overload
Rhino Namespace