RhinoCommon API
Surface.IsTorus Method
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsTorus()
Public Function IsTorus As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a torus.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Surface Class
IsTorus Overload
Rhino.Geometry Namespace