RhinoCommon SDK
Curve.ChangeDimension Method
 Changes the dimension of a curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeDimension(
	int desiredDimension
)
Public Function ChangeDimension (
	desiredDimension As Integer
) As Boolean
Parameters
desiredDimension
Type: System.Int32
The desired dimension.
Return Value
Type: Boolean
 true if the curve's dimension was already desiredDimension or if the curve's dimension was successfully changed to desiredDimension; otherwise false.
See Also
Reference
Curve Class
Rhino.Geometry Namespace