RhinoCommon API
ViewportInfo.SetCameraUp Method
 Sets the camera up vector.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetCameraUp(
	Vector3d up
)
Public Function SetCameraUp (
	up As Vector3d
) As Boolean
Parameters
up
Type: Rhino.Geometry.Vector3d
A new direction.
Return Value
Type: Boolean
true if the direction was set; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace