RhinoCommon API
RhinoDoc.Redo Method
 Redo the last action that was "undone"
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Redo()
Public Function Redo As Boolean
Return Value
Type: Boolean
 true on success
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoDoc Class
Rhino Namespace