RhinoCommon API
SimpleArrayLine Constructor
 Initializes a new SimpleArrayLine instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayLine()
Public Sub New
See Also
Reference
SimpleArrayLine Class
Rhino.Runtime.InteropWrappers Namespace