RhinoCommon SDK
File3dm.ReadNotes Method
Reads only the notes from an existing 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ReadNotes(
	string path
)
Public Shared Function ReadNotes (
	path As String
) As String
Parameters
path
Type: System.String
The file from which to read the notes.
Return Value
Type: String
The 3dm file notes.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist, is null or cannot be accessed because of permissions.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace