RhinoCommon API
Box.Contains Method (Point3d)
 Determines whether a point is included in this box. This is the same as calling Contains(point,false)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	Point3d point
)
Public Function Contains (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
Point to test.
Return Value
Type: Boolean
true if the point is on the inside of or coincident with this Box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Box Structure
Contains Overload
Rhino.Geometry Namespace