RhinoCommon API
Circle.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EpsilonEquals(
	Circle other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Circle,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Circle
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Circle Structure
Rhino.Geometry Namespace