RhinoCommon SDK
Color4f.AsSystemColor Method
[Missing <summary> documentation for "M:Rhino.Display.Color4f.AsSystemColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color AsSystemColor()
Public Function AsSystemColor As Color
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.Display.Color4f.AsSystemColor"]
See Also
Reference
Color4f Structure
Rhino.Display Namespace