RhinoCommon SDK
ColorCMYK.CreateFromHSL Method
 Constructs the nearest CMYK equivalent of an HSL color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorCMYK CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorCMYK
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the HSL color.
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace