RhinoCommon SDK
SubDEdgeAccess.Add Method
 Adds a new edge to the end of the SubDEdgePtr list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr Add(
	SubD.SubDEdgeTag tag,
	SubDVertexPtr v0,
	SubDVertexPtr v1
)
Public Function Add (
	tag As SubD.SubDEdgeTag,
	v0 As SubDVertexPtr,
	v1 As SubDVertexPtr
) As SubDEdgePtr
Parameters
tag
Type: Rhino.Geometry.SubD.SubDEdgeTag
The type of edge tag, such as smooth or corner.
v0
Type: Rhino.Geometry.SubDVertexPtr
First vertex.
v1
Type: Rhino.Geometry.SubDVertexPtr
Second vertex.
Return Value
Type: SubDEdgePtr
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDEdgeAccess.Add(Rhino.Geometry.SubD.SubDEdgeTag,Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDVertexPtr)"]
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If tag is unset or non-defined.
See Also
Reference
SubDEdgeAccess Class
Rhino.Geometry.Collections Namespace