RhinoCommon API
RhinoApp.GetExecutableDirectory Method
 directory
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static DirectoryInfo GetExecutableDirectory()
Public Shared Function GetExecutableDirectory As DirectoryInfo
Return Value
Type: DirectoryInfo
[Missing <returns> documentation for "M:Rhino.RhinoApp.GetExecutableDirectory"]
See Also
Reference
RhinoApp Class
Rhino Namespace