RhinoCommon API
CommandLineOption.IsValidOptionName Method
 Test a string to see if it can be used as an option name in any of the RhinoGet::AddCommandOption...() functions.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsValidOptionName(
	string optionName
)
Public Shared Function IsValidOptionName (
	optionName As String
) As Boolean
Parameters
optionName
Type: System.String
The string to be tested.
Return Value
Type: Boolean
true if string can be used as an option name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace