RhinoCommon API
BrepFaceList.SplitBipolarFaces Method
 Splits surfaces with two singularities, like spheres, so the results have at most one singularity.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SplitBipolarFaces()
Public Function SplitBipolarFaces As Boolean
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace