RhinoCommon API
AsyncRenderContext.Dispose Method
Releases all resources used by the AsyncRenderContext
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
AsyncRenderContext Class
Dispose Overload
Rhino.Render Namespace