RhinoCommon SDK
CurveList.Insert Method (Int32, Arc)
 Inserts an arc at a given index of this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	Arc arc
)
Public Sub Insert (
	index As Integer,
	arc As Arc
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
arc
Type: Rhino.Geometry.Arc
The arc value from which to construct the new curve.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace