RhinoCommon API
UserDataList.Remove Method
 Remove the userdata from this list
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Remove(
	UserData userdata
)
Public Function Remove (
	userdata As UserData
) As Boolean
Parameters
userdata
Type: Rhino.DocObjects.Custom.UserData
[Missing <param name="userdata"/> documentation for "M:Rhino.DocObjects.Custom.UserDataList.Remove(Rhino.DocObjects.Custom.UserData)"]
Return Value
Type: Boolean
true if the user data was successfully removed
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace