RhinoCommon SDK
Sun.ColorFromAltitude Method
Get sun color based on altitude.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color ColorFromAltitude(
	double altitudeDegrees
)
Public Shared Function ColorFromAltitude (
	altitudeDegrees As Double
) As Color
Parameters
altitudeDegrees
Type: System.Double
The altitude sun angle in degrees.
Return Value
Type: Color
 Returns color for altitude.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Sun Class
Rhino.Render Namespace