RhinoCommon SDK
RenderTexture.NewBitmapTexture Method
 Constructs a new basic texture from a SimulatedTexture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderTexture NewBitmapTexture(
	SimulatedTexture texture
)
Public Shared Function NewBitmapTexture (
	texture As SimulatedTexture
) As RenderTexture
Parameters
texture
Type: Rhino.Render.SimulatedTexture
The texture to create the basic texture from.
Return Value
Type: RenderTexture
A new render texture.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderTexture Class
Rhino.Render Namespace