RhinoCommon API
RhinoObject.MemoryEstimate Method
 Computes an estimate of the number of bytes that this object is using in memory. Note that this is a runtime memory estimate and does not directly compare to the amount of space take up by the object when saved to a file.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint MemoryEstimate()
Public Function MemoryEstimate As UInteger
Return Value
Type: UInt32
The estimated number of bytes this object occupies in memory.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace