RhinoCommon SDK
SubDDisplayParameters.CreateFromDisplayDensity Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDDisplayParameters.CreateFromDisplayDensity(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static SubDDisplayParameters CreateFromDisplayDensity(
	int nurbsDisplayDensity
)
Public Shared Function CreateFromDisplayDensity (
	nurbsDisplayDensity As Integer
) As SubDDisplayParameters
Parameters
nurbsDisplayDensity
Type: System.Int32
[Missing <param name="nurbsDisplayDensity"/> documentation for "M:Rhino.Geometry.SubDDisplayParameters.CreateFromDisplayDensity(System.Int32)"]
Return Value
Type: SubDDisplayParameters
[Missing <returns> documentation for "M:Rhino.Geometry.SubDDisplayParameters.CreateFromDisplayDensity(System.Int32)"]
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace