RhinoCommon SDK
ToolbarFile.GetGroup Method (String)
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.GetGroup(System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ToolbarGroup GetGroup(
	string name
)
Public Function GetGroup (
	name As String
) As ToolbarGroup
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.UI.ToolbarFile.GetGroup(System.String)"]
Return Value
Type: ToolbarGroup
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.GetGroup(System.String)"]
See Also
Reference
ToolbarFile Class
GetGroup Overload
Rhino.UI Namespace