RhinoCommon API
AnimationProperties.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
AnimationProperties Class
Dispose Overload
Rhino.DocObjects Namespace