RhinoCommon API
ObjectTable.ObjectCount Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ObjectCount(Rhino.DocObjects.ObjectEnumeratorSettings)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ObjectCount(
	ObjectEnumeratorSettings filter
)
Public Function ObjectCount (
	filter As ObjectEnumeratorSettings
) As Integer
Parameters
filter
Type: Rhino.DocObjects.ObjectEnumeratorSettings
[Missing <param name="filter"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ObjectCount(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ObjectCount(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace