RhinoCommon API
ColorLCH.CreateFromXYZ Method
 Create the nearest LCH equivalent of an XYZ color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorLCH CreateFromXYZ(
	ColorXYZ xyz
)
Public Shared Function CreateFromXYZ (
	xyz As ColorXYZ
) As ColorLCH
Parameters
xyz
Type: Rhino.Display.ColorXYZ
Target color in XYZ space.
Return Value
Type: ColorLCH
The LCH equivalent of the XYZ color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace