RhinoCommon SDK
Brep.DuplicateVertices Method
 Duplicate all the corner vertices of this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d[] DuplicateVertices()
Public Function DuplicateVertices As Point3d()
Return Value
Type: Point3d[]
An array or corner vertices.
See Also
Reference
Brep Class
Rhino.Geometry Namespace