RhinoCommon API
CollapsibleSectionHolderImpl.Dispose Method
Releases all resources used by the CollapsibleSectionHolderImpl
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CollapsibleSectionHolderImpl Class
Rhino.UI.Controls Namespace