RhinoCommon API
SupportOptions.SetCheckSupportFilesBeforeRendering Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetCheckSupportFilesBeforeRendering(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetCheckSupportFilesBeforeRendering(
	bool b
)
Public Shared Sub SetCheckSupportFilesBeforeRendering (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetCheckSupportFilesBeforeRendering(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
SupportOptions Class
Rhino.Render Namespace