RhinoCommon API
StatusBar.HideProgressMeter Method
 Ends, or hides, Rhino's status bar progress meter.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void HideProgressMeter()
Public Shared Sub HideProgressMeter
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
StatusBar Class
Rhino.UI Namespace