RhinoCommon SDK
IRhRdkThumbnailList.ShowLabels Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.ShowLabels"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool ShowLabels()
Function ShowLabels As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.ShowLabels"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace