RhinoCommon API
PersistentSettings.SetDefault Method (String, String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	string value
)
Public Sub SetDefault (
	key As String,
	value As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace