RhinoCommon SDK
StackedDialogPage.OnCancel Method
Called when stacked dialog Cancel button is pressed.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void OnCancel()
Public Overridable Sub OnCancel
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace