RhinoCommon SDK
IRhRdkThumbnailList.Shape Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Shape"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IRhRdkThumbnailList_Shapes Shape()
Function Shape As IRhRdkThumbnailList_Shapes
Return Value
Type: IRhRdkThumbnailList_Shapes
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Shape"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace