RhinoCommon API
RenderMaterial.SimulateMaterial Method (Material, Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void SimulateMaterial(
	ref Material simulation,
	bool isForDataOnly
)
Public Overridable Sub SimulateMaterial (
	ByRef simulation As Material,
	isForDataOnly As Boolean
)
Parameters
simulation
Type: Rhino.DocObjects.Material
Set the properties of the input basic material to provide the simulation for this material.
isForDataOnly
Type: System.Boolean
Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.
See Also
Reference
RenderMaterial Class
SimulateMaterial Overload
Rhino.Render Namespace