RhinoCommon API
RiskyAction.Dispose Method
 IDisposable implementation
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RiskyAction Class
Rhino.Runtime Namespace