RhinoCommon API
RhinoSettings.GetRenderSettings Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetRenderSettings"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderSettings GetRenderSettings()
Public Function GetRenderSettings As RenderSettings
Return Value
Type: RenderSettings
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.GetRenderSettings"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace