RhinoCommon API
RhinoApp.SetFocusToMainWindow Method
 Sets the focus to the main window. This function attempts to use the ActiveDoc on Mac to figure out which window to set focus to.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetFocusToMainWindow()
Public Shared Sub SetFocusToMainWindow
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoApp Class
SetFocusToMainWindow Overload
Rhino Namespace