RhinoCommon API
StringParser Constructor
Initializes a new instance of the StringParser class
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StringParser()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
StringParser Class
Rhino.Input Namespace