RhinoCommon API
Decal.TryGetColor Method
 Blend color with the decal color at a given point.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetColor(
	Point3d point,
	Vector3d normal,
	ref Color4f colInOut,
	ref Point2d uvOut
)
Public Function TryGetColor (
	point As Point3d,
	normal As Vector3d,
	ByRef colInOut As Color4f,
	ByRef uvOut As Point2d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
The point in space or, if the decal is uv-mapped, the uv-coordinate of that point.
normal
Type: Rhino.Geometry.Vector3d
The face normal of the given point.
colInOut
Type: Rhino.Display.Color4f
The color to blend the decal color to.
uvOut
Type: Rhino.Geometry.Point2d
the UV on the texture that the color point was read from.
Return Value
Type: Boolean
true if the given point hits the decal, else false.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Decal Class
Rhino.Render Namespace