RhinoCommon SDK
ObjectTable.Replace Method (Guid, Point3d)
Replaces one object with new point object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	Point3d point
)
Public Function Replace (
	objectId As Guid,
	point As Point3d
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
point
Type: Rhino.Geometry.Point3d
new point to be added. The point is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace