RhinoCommon SDK
AnnotationBase.WrapText Method
 Wrap text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WrapText()
Public Sub WrapText
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace