RhinoCommon API
GetCone.Get Method
 Perform the 'get' operation.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result Get(
	out Cone cone
)
Public Function Get (
	<OutAttribute> ByRef cone As Cone
) As Result
Parameters
cone
Type: Rhino.Geometry.Cone
[Missing <param name="cone"/> documentation for "M:Rhino.Input.Custom.GetCone.Get(Rhino.Geometry.Cone@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetCone.Get(Rhino.Geometry.Cone@)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace