RhinoCommon SDK
DimensionStyle.CreatePreviewBitmap Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap CreatePreviewBitmap(
	int width,
	int height
)
Public Function CreatePreviewBitmap (
	width As Integer,
	height As Integer
) As Bitmap
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace