RhinoCommon SDK
LineCurve Constructor (Line)
 Initializes a new instance of the LineCurve class, by retrieving its value from a line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LineCurve(
	Line line
)
Public Sub New (
	line As Line
)
Parameters
line
Type: Rhino.Geometry.Line
A line to use as model.
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace