RhinoCommon SDK
RhinoViewport.ClearTraceImage Method
 Remove trace image (background bitmap) for this viewport if one exists.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ClearTraceImage()
Public Sub ClearTraceImage
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace