RhinoCommon SDK
ObjectTable.Replace Method (Guid, Curve)
Replaces one object with new curve object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	Curve curve
)
Public Function Replace (
	objectId As Guid,
	curve As Curve
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
curve
Type: Rhino.Geometry.Curve
 New curve to be added. A duplicate of the curve is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace