RhinoCommon API
Dialogs.KillSplash Method
 Destroy the splash screen if it is being displayed.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void KillSplash()
Public Shared Sub KillSplash
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Dialogs Class
Rhino.UI Namespace