RhinoCommon API
ContentCollectionIterator.Dispose Method
Releases all resources used by the ContentCollectionIterator
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace