RhinoCommon API
MeshVertexNormalList.Flip Method
 Reverses direction of all vertex normals
This is the same as Mesh.Flip(true, false, false)
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Flip()
Public Sub Flip
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace