RhinoCommon SDK
BrepTrimList.Add Method (Boolean, BrepEdge, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrim Add(
	bool rev3d,
	BrepEdge edge,
	int curve2dIndex
)
Public Function Add (
	rev3d As Boolean,
	edge As BrepEdge,
	curve2dIndex As Integer
) As BrepTrim
Parameters
rev3d
Type: System.Boolean
 true if the edge and trim have opposite directions
edge
Type: Rhino.Geometry.BrepEdge
3d edge associated with this trim
curve2dIndex
Type: System.Int32
index of 2d trimming curve
Return Value
Type: BrepTrim
new trim
See Also
Reference
BrepTrimList Class
Add Overload
Rhino.Geometry.Collections Namespace