RhinoCommon API
RhinoObject.GetRenderPrimitiveList Method (ViewportInfo, Boolean)
Note: This API is now obsolete.
 Build custom render mesh(es) for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public RenderPrimitiveList GetRenderPrimitiveList(
	ViewportInfo viewport,
	bool preview
)
<ObsoleteAttribute>
Public Function GetRenderPrimitiveList (
	viewport As ViewportInfo,
	preview As Boolean
) As RenderPrimitiveList
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
preview
Type: System.Boolean
 Type of mesh to build, if preview is true then a smaller mesh may be generated in less time, false is meant when actually rendering.
Return Value
Type: RenderPrimitiveList
 Returns a RenderPrimitiveList if successful otherwise returns null.
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.26
See Also
Reference
RhinoObject Class
GetRenderPrimitiveList Overload
Rhino.DocObjects Namespace