RhinoCommon API
SupportOptions.SetUsePreviewCache Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetUsePreviewCache(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetUsePreviewCache(
	bool b
)
Public Shared Sub SetUsePreviewCache (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetUsePreviewCache(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
SupportOptions Class
Rhino.Render Namespace