RhinoCommon SDK
PolylineCurve.ToPolyline Method
 Returns the underlying Polyline, or points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline ToPolyline()
Public Function ToPolyline As Polyline
Return Value
Type: Polyline
The Polyline if successful, null of the curve has no points.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PolylineCurve Class
ToPolyline Overload
Rhino.Geometry Namespace