RhinoCommon API
FilePdf.Create Method
 Create a new instance of a FilePdf class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static FilePdf Create()
Public Shared Function Create As FilePdf
Return Value
Type: FilePdf
[Missing <returns> documentation for "M:Rhino.FileIO.FilePdf.Create"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace