RhinoCommon SDK
BinaryArchiveReader.ReadDoubleArray Method
 Reads an array of Double from the archive.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] ReadDoubleArray()
Public Function ReadDoubleArray As Double()
Return Value
Type: Double[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace