RhinoCommon API
Point3d.Equals Method (Point3d)
 Determines whether the specified Point3d has the same values as the present point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Point3d point
)
Public Function Equals (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
The specified point.
Return Value
Type: Boolean
true if point has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Point3d Structure
Equals Overload
Rhino.Geometry Namespace