RhinoCommon API
Rectangle3d.RecenterPlane Method (Point3d)
 Recenters the base plane on a new origin.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RecenterPlane(
	Point3d origin
)
Public Sub RecenterPlane (
	origin As Point3d
)
Parameters
origin
Type: Rhino.Geometry.Point3d
New origin for plane.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rectangle3d Structure
RecenterPlane Overload
Rhino.Geometry Namespace