RhinoCommon SDK
SupportOptions.PreviewCustomRenderMeshes Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.PreviewCustomRenderMeshes"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool PreviewCustomRenderMeshes()
Public Shared Function PreviewCustomRenderMeshes As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.PreviewCustomRenderMeshes"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace