RhinoCommon API
DisplayBitmap Constructor
 Constructs a DisplayBitmap from an existing bitmap.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayBitmap(
	Bitmap bitmap
)
Public Sub New (
	bitmap As Bitmap
)
Parameters
bitmap
Type: System.Drawing.Bitmap
The original bitmap.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace