RhinoCommon API
AnnotationBase.IsAllItalic Method
 Returns true if all of the text in the annotation is Italic, otherwise returns false
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsAllItalic()
Public Function IsAllItalic As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.IsAllItalic"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace