RhinoCommon SDK
DimStyleTable.FindName Method
 Finds the DimensionStyle with a given name and retuns it. None is returned if no DimensionStyle is found.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle FindName(
	string name
)
Public Function FindName (
	name As String
) As DimensionStyle
Parameters
name
Type: System.String
The string to search. Deleted styles are ignored.
Return Value
Type: DimensionStyle
The instance, or null.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace