RhinoCommon API
RhinoDoc.FromRuntimeSerialNumber Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.FromRuntimeSerialNumber(System.UInt32)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RhinoDoc FromRuntimeSerialNumber(
	uint serialNumber
)
Public Shared Function FromRuntimeSerialNumber (
	serialNumber As UInteger
) As RhinoDoc
Parameters
serialNumber
Type: System.UInt32
[Missing <param name="serialNumber"/> documentation for "M:Rhino.RhinoDoc.FromRuntimeSerialNumber(System.UInt32)"]
Return Value
Type: RhinoDoc
[Missing <returns> documentation for "M:Rhino.RhinoDoc.FromRuntimeSerialNumber(System.UInt32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc Class
Rhino Namespace