RhinoCommon SDK
SubD.ToLimitSurfaceMesh Method (Int32)
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh ToLimitSurfaceMesh(
	int meshDensity
)
Public Function ToLimitSurfaceMesh (
	meshDensity As Integer
) As Mesh
Parameters
meshDensity
Type: System.Int32
[Missing <param name="meshDensity"/> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(System.Int32)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(System.Int32)"]
See Also
Reference
SubD Class
ToLimitSurfaceMesh Overload
Rhino.Geometry Namespace