RhinoCommon API
RenderContent.UseCount Method
 UseCount returns how many times the content is used
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UseCount()
Public Function UseCount As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.UseCount"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderContent Class
Rhino.Render Namespace