RhinoCommon API
GetPoint.PermitTabMode Method
 Permits the use of the tab key to define a line constraint.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PermitTabMode(
	bool permit
)
Public Sub PermitTabMode (
	permit As Boolean
)
Parameters
permit
Type: System.Boolean
If true, then the built-in tab key mode is available.
Remarks
By default, use of the tab key is supported.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace