RhinoCommon API
ObjectTable.Find Method (Guid)
 Please use FindId().
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject Find(
	Guid objectId
)
Public Function Find (
	objectId As Guid
) As RhinoObject
Parameters
objectId
Type: System.Guid
Do not use this method.
Return Value
Type: RhinoObject
Do not use this method.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectTable Class
Find Overload
Rhino.DocObjects.Tables Namespace