RhinoCommon API
BrepTrimList.MatchEnds Method
 Matches the endpoints of all trims in the Brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MatchEnds()
Public Function MatchEnds As Boolean
Return Value
Type: Boolean
true if any trim's 2d curve is changed, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
BrepTrimList Class
MatchEnds Overload
Rhino.Geometry.Collections Namespace