RhinoCommon API
CustomDisplay.AddText Method (String, Plane, Double)
 Adds a new, black 3D text object to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddText(
	string text,
	Plane plane,
	double size
)
Public Sub AddText (
	text As String,
	plane As Plane,
	size As Double
)
Parameters
text
Type: System.String
Text to add.
plane
Type: Rhino.Geometry.Plane
Plane for text orientation.
size
Type: System.Double
Height (in units) of font.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CustomDisplay Class
AddText Overload
Rhino.Display Namespace