RhinoCommon SDK
GeometryBase.Translate Method (Double, Double, Double)
Translates the object along the specified vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Translate(
	double x,
	double y,
	double z
)
Public Function Translate (
	x As Double,
	y As Double,
	z As Double
) As Boolean
Parameters
x
Type: System.Double
The X component.
y
Type: System.Double
The Y component.
z
Type: System.Double
The Z component.
Return Value
Type: Boolean
true if geometry successfully translated.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GeometryBase Class
Translate Overload
Rhino.Geometry Namespace