RhinoCommon SDK
CustomPointObject Constructor (Point)
Initializes a new instance of the CustomPointObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomPointObject(
	Point point
)
Protected Sub New (
	point As Point
)
Parameters
point
Type: Rhino.Geometry.Point
[Missing <param name="point"/> documentation for "M:Rhino.DocObjects.Custom.CustomPointObject.#ctor(Rhino.Geometry.Point)"]
See Also
Reference
CustomPointObject Class
CustomPointObject Overload
Rhino.DocObjects.Custom Namespace