RhinoCommon API
ObjectAttributes.DrawColor Method (RhinoDoc, Guid)
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color DrawColor(
	RhinoDoc document,
	Guid viewportId
)
Public Function DrawColor (
	document As RhinoDoc,
	viewportId As Guid
) As Color
Parameters
document
Type: Rhino.RhinoDoc
[Missing <param name="document"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
viewportId
Type: System.Guid
[Missing <param name="viewportId"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ObjectAttributes Class
DrawColor Overload
Rhino.DocObjects Namespace