RhinoCommon API
RenderPrimitive.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitive.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace