RhinoCommon API
ViewCaptureSettings Constructor
Initializes a new instance of the ViewCaptureSettings class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewCaptureSettings()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewCaptureSettings Class
ViewCaptureSettings Overload
Rhino.Display Namespace