RhinoCommon SDK
GumballObject.SetFromExtrusion Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromExtrusion(Rhino.Geometry.Extrusion)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromExtrusion(
	Extrusion extrusion
)
Public Function SetFromExtrusion (
	extrusion As Extrusion
) As Boolean
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
[Missing <param name="extrusion"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromExtrusion(Rhino.Geometry.Extrusion)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromExtrusion(Rhino.Geometry.Extrusion)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace