RhinoCommon SDK
ObjRef.SurfaceParameter Method
 If the reference geometry is a surface, brep with one face, or surface edge with a selection point, then this gets the surface paramters of the selection point.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface SurfaceParameter(
	out double u,
	out double v
)
Public Function SurfaceParameter (
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double
) As Surface
Parameters
u
Type: System.Double
The U value is assigned to this out parameter during the call.
v
Type: System.Double
The V value is assigned to this out parameter during the call.
Return Value
Type: Surface
 If the selection point was on a surface, then the surface is returned.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace