RhinoCommon API
PreviewAppearance.Background Method
 Background
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewBackground Background()
Public Function Background As PreviewBackground
Return Value
Type: PreviewBackground
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Background"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace