RhinoCommon SDK
IRhRdkThumbnailList.Mode Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Mode"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IRhRdkThumbnailList_Modes Mode()
Function Mode As IRhRdkThumbnailList_Modes
Return Value
Type: IRhRdkThumbnailList_Modes
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Mode"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace