RhinoCommon API
LayerTable.Find Method (Guid, String, Boolean)
Note: This API is now obsolete.
Finds a layer with a given name and matching parent ID.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("ignoreDeletedLayers is no longer supported for research by name. Use the overload with notFoundReturnValue (-1 was the previous default).")]
public int Find(
	Guid parentId,
	string layerName,
	bool ignoreDeletedLayers
)
<ObsoleteAttribute("ignoreDeletedLayers is no longer supported for research by name. Use the overload with notFoundReturnValue (-1 was the previous default).")>
Public Function Find (
	parentId As Guid,
	layerName As String,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
parentId
Type: System.Guid
A valid layer ID.
layerName
Type: System.String
name of layer to search for. The search ignores case.
ignoreDeletedLayers
Type: System.Boolean
If true, deleted layers are not checked. NOT SUPPORTED FOR NAME SEARCH, only for Guids.
Return Value
Type: Int32
 >=0 index of the layer with the given name -1 no layer has the given name.
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.4
See Also
Reference
LayerTable Class
Find Overload
Rhino.DocObjects.Tables Namespace