RhinoCommon API
RhinoViewport.KeyboardRotate Method
 Emulates the keyboard arrow key in terms of interaction.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool KeyboardRotate(
	bool leftRight,
	double angleRadians
)
Public Function KeyboardRotate (
	leftRight As Boolean,
	angleRadians As Double
) As Boolean
Parameters
leftRight
Type: System.Boolean
left/right rotate if true, up/down rotate if false.
angleRadians
Type: System.Double
 If less than 0, rotation is to left or down. If greater than 0, rotation is to right or up.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace