RhinoCommon API
WorldMapDayNight Constructor
Initializes a new instance of the WorldMapDayNight class
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public WorldMapDayNight()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace