RhinoCommon SDK
SubDVertexAccess.Add Method (SubD.SubDVertexTag, Double, Double, Double)
 Adds a new vertex to the end of the Vertex list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr Add(
	SubD.SubDVertexTag tag,
	double x,
	double y,
	double z
)
Public Function Add (
	tag As SubD.SubDVertexTag,
	x As Double,
	y As Double,
	z As Double
) As SubDVertexPtr
Parameters
tag
Type: Rhino.Geometry.SubD.SubDVertexTag
The type of vertex tag, such as smooth or corner.
x
Type: System.Double
X component of new vertex coordinate.
y
Type: System.Double
Y component of new vertex coordinate.
z
Type: System.Double
Z component of new vertex coordinate.
Return Value
Type: SubDVertexPtr
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDVertexAccess.Add(Rhino.Geometry.SubD.SubDVertexTag,System.Double,System.Double,System.Double)"]
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If tag is unset or non-defined.
See Also
Reference
SubDVertexAccess Class
Add Overload
Rhino.Geometry.Collections Namespace