RhinoCommon API
ObjectTable.AddRhinoObject Method (PointObject, Point)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.PointObject,Rhino.Geometry.Point)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddRhinoObject(
	PointObject pointObject,
	Point point
)
Public Sub AddRhinoObject (
	pointObject As PointObject,
	point As Point
)
Parameters
pointObject
Type: Rhino.DocObjects.PointObject
[Missing <param name="pointObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.PointObject,Rhino.Geometry.Point)"]
point
Type: Rhino.Geometry.Point
[Missing <param name="point"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.PointObject,Rhino.Geometry.Point)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace