RhinoCommon SDK
GetBaseClass.SetDefaultPoint Method
 Sets a point as default value that will be returned if the user presses the ENTER key during the get.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetDefaultPoint(
	Point3d point
)
Public Sub SetDefaultPoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
value for default point.
Remarks
 Calling SetDefaultPoint will automatically handle setting the command prompt default and reacting to the user pressing ENTER. If the user presses enter to accept the default point, GetResult.Point is returned and RhinoGet.GotDefault() will return true. Calling SetDefaultPoint will clear any previous calls to SetDefaultString or SetDefaultNumber.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace