RhinoCommon API
ContentUndoHelper Constructor
 Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ContentUndoHelper(
	RhinoDoc doc,
	string description
)
Public Sub New (
	doc As RhinoDoc,
	description As String
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.ContentUndoHelper.#ctor(Rhino.RhinoDoc,System.String)"]
description
Type: System.String
Undo description (which appears in the UI when undo is run)
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentUndoHelper Class
Rhino.Render Namespace