RhinoCommon API
RenderContent.Create Method (Guid, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Constructs a new content of the specified type and add it to the persistent content list. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RenderContentType.NewContentFromType().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderContent Create(
	Guid type,
	RenderContent.ShowContentChooserFlags flags,
	RhinoDoc doc
)
Public Shared Function Create (
	type As Guid,
	flags As RenderContent.ShowContentChooserFlags,
	doc As RhinoDoc
) As RenderContent
Parameters
type
Type: System.Guid
Is the type of the content to add.
flags
Type: Rhino.Render.RenderContent.ShowContentChooserFlags
Options for the tab.
doc
Type: Rhino.RhinoDoc
The current Rhino document.
Return Value
Type: RenderContent
A new persistent render content.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderContent Class
Create Overload
Rhino.Render Namespace