RhinoCommon API
Mesh.CreateFromSurface Method (Surface)
 Constructs a mesh from a surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateFromSurface(
	Surface surface
)
Public Shared Function CreateFromSurface (
	surface As Surface
) As Mesh
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to approximate
Return Value
Type: Mesh
New mesh representing the surface
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Mesh Class
CreateFromSurface Overload
Rhino.Geometry Namespace