RhinoCommon API
PointCloud.AppendNew Method
 Appends a new PointCloudItem to the end of this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloudItem AppendNew()
Public Function AppendNew As PointCloudItem
Return Value
Type: PointCloudItem
The newly appended item.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace