RhinoCommon SDK
MeshFaceList.AddFaces Method
 Appends a list of faces to the end of the mesh face list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] AddFaces(
	IEnumerable<MeshFace> faces
)
Public Function AddFaces (
	faces As IEnumerable(Of MeshFace)
) As Integer()
Parameters
faces
Type: System.Collections.Generic.IEnumerable<MeshFace>
Faces to add.
Return Value
Type: Int32[]
Indices of the newly created faces
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace