RhinoCommon API
Surface.IsPeriodic Method
 Gets a value indicating if thr surface is periodic in a direction (default is false).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPeriodic(
	int direction
)
Public Function IsPeriodic (
	direction As Integer
) As Boolean
Parameters
direction
Type: System.Int32
0 = U, 1 = V.
Return Value
Type: Boolean
The indicating boolean value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Surface Class
Rhino.Geometry Namespace