RhinoCommon SDK
DisplayPipeline.DrawLeader Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawLeader(Rhino.Geometry.Leader,System.Drawing.Color)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DrawLeader(
	Leader leader,
	Color color
)
Public Sub DrawLeader (
	leader As Leader,
	color As Color
)
Parameters
leader
Type: Rhino.Geometry.Leader
[Missing <param name="leader"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLeader(Rhino.Geometry.Leader,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLeader(Rhino.Geometry.Leader,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace