RhinoCommon API
OptionColor.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.OptionColor.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace