RhinoCommon API
File3dmObjectTable.AddMesh Method (Mesh)
Adds a mesh object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddMesh(
	Mesh mesh
)
Public Function AddMesh (
	mesh As Mesh
) As Guid
Parameters
mesh
Type: Rhino.Geometry.Mesh
A duplicate of this mesh is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmObjectTable Class
AddMesh Overload
Rhino.FileIO Namespace