RhinoCommon API
RenderPlugIn Constructor
Initializes a new instance of the RenderPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderPlugIn()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace