RhinoCommon API
StringParserSettings Constructor
Initializes a new instance of the StringParserSettings class
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StringParserSettings()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace