RhinoCommon SDK
File3dmObjectTable.AddPointCloud Method (IEnumerable<Point3d>, ObjectAttributes)
Adds a point cloud object to the document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPointCloud(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes
)
Public Function AddPointCloud (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of Point3d.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point cloud.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddPointCloud Overload
Rhino.FileIO Namespace