RhinoCommon SDK
Point2d.Addition Operator (Point2d, Vector2d)
 Adds a point with a vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d operator +(
	Point2d point,
	Vector2d vector
)
Public Shared Operator + (
	point As Point2d,
	vector As Vector2d
) As Point2d
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
vector
Type: Rhino.Geometry.Vector2d
A vector.
Return Value
Type: Point2d
A new point that is coordinatewise summed with the vector.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point2d Structure
Addition Overload
Rhino.Geometry Namespace