RhinoCommon SDK
LayerTable.AddReferenceLayer Method
 Adds a new reference layer with default definition to the layer table. Reference layers are not saved in files.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddReferenceLayer()
Public Function AddReferenceLayer As Integer
Return Value
Type: Int32
index of new layer.
See Also
Reference
LayerTable Class
AddReferenceLayer Overload
Rhino.DocObjects.Tables Namespace