RhinoCommon API
ColorHSV.ToArgbColor Method
 Convert HSV color to an equivalent System.Drawing.Color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ToArgbColor()
Public Function ToArgbColor As Color
Return Value
Type: Color
A .Net framework library color value.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace