RhinoCommon API
Interpolator.InterpolateCosine Method
 Sample the list of numbers with cosine interpolation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double InterpolateCosine(
	double t
)
Public Function InterpolateCosine (
	t As Double
) As Double
Parameters
t
Type: System.Double
Parameter to sample at. The integer portion of the parameter indicates the index of the left-hand value. If this Interpolator is cyclical, parameters will be wrapped.
Return Value
Type: Double
The sampled value at t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace