RhinoCommon API
TextEntity.CreatePolySurfaces Method
 Creates breps from the outline curves with specified height.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep[] CreatePolySurfaces(
	DimensionStyle dimstyle,
	double height,
	double smallCapsScale = 1,
	double spacing = 0
)
Public Function CreatePolySurfaces (
	dimstyle As DimensionStyle,
	height As Double,
	Optional smallCapsScale As Double = 1,
	Optional spacing As Double = 0
) As Brep()
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreatePolySurfaces(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)"]
height
Type: System.Double
 Height in direction perpedicular to plane of text.
smallCapsScale (Optional)
Type: System.Double
 Set to create small caps out of lower case letters.
spacing (Optional)
Type: System.Double
 Set to add additional spacing between glyph output.
Return Value
Type: Brep[]
An array of planar breps.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace