RhinoCommon API
MeshNgonList.GetNgonCenter Method (Int32)
 Gets the center point of an ngon.
This the avarage of the corner points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d GetNgonCenter(
	int index
)
Public Function GetNgonCenter (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
A ngon index.
Return Value
Type: Point3d
The center point.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshNgonList Class
GetNgonCenter Overload
Rhino.Geometry.Collections Namespace