RhinoCommon API
Vector3d.Negate Method
 Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d Negate(
	Vector3d vector
)
Public Shared Function Negate (
	vector As Vector3d
) As Vector3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector to negate.
Return Value
Type: Vector3d
A new vector where all components were multiplied by -1.
Remarks
Similar to Reverse(), but static for CLR compliance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace