RhinoCommon API
RhinoView.Equals Method (Object)
[Missing <summary> documentation for "M:Rhino.Display.RhinoView.Equals(System.Object)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
[Missing <param name="obj"/> documentation for "M:Rhino.Display.RhinoView.Equals(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoView.Equals(System.Object)"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoView Class
Equals Overload
Rhino.Display Namespace