RhinoCommon API
Material.GetTransparencyTexture Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetTransparencyTexture()
Public Function GetTransparencyTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Material Class
Rhino.DocObjects Namespace