RhinoCommon API
SupportOptions.PreferredUnpackFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.PreferredUnpackFolder"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string PreferredUnpackFolder()
Public Shared Function PreferredUnpackFolder As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.PreferredUnpackFolder"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SupportOptions Class
Rhino.Render Namespace