RhinoCommon API
ViewportInfo.ZoomToScreenRect Method (Rectangle)
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ZoomToScreenRect(
	Rectangle windowRectangle
)
Public Function ZoomToScreenRect (
	windowRectangle As Rectangle
) As Boolean
Parameters
windowRectangle
Type: System.Drawing.Rectangle
The new window rectangle in screen space.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewportInfo Class
ZoomToScreenRect Overload
Rhino.DocObjects Namespace