RhinoCommon API
GetLine.EnableFromBothSidesOption Method
 If true, then the "BothSides" option shows up when the start point is inteactively picked.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableFromBothSidesOption(
	bool on
)
Public Sub EnableFromBothSidesOption (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Input.Custom.GetLine.EnableFromBothSidesOption(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace