RhinoCommon SDK
SubDVertexSectorIterator.IncrementFace Method (Boolean, Boolean)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFace(System.Boolean,System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IncrementFace(
	bool ccwForward,
	bool stopAtCrease
)
Public Function IncrementFace (
	ccwForward As Boolean,
	stopAtCrease As Boolean
) As Boolean
Parameters
ccwForward
Type: System.Boolean
[Missing <param name="ccwForward"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFace(System.Boolean,System.Boolean)"]
stopAtCrease
Type: System.Boolean
[Missing <param name="stopAtCrease"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFace(System.Boolean,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.IncrementFace(System.Boolean,System.Boolean)"]
See Also
Reference
SubDVertexSectorIterator Class
IncrementFace Overload
Rhino.Geometry Namespace