RhinoCommon SDK
CachedTextureCoordinates.Contains Method
 Determines whether this collection contains a specific value.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Contains(
	Point3d item
)
Public Function Contains (
	item As Point3d
) As Boolean
Parameters
item
Type: Rhino.Geometry.Point3d
[Missing <param name="item"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.Contains(Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.CachedTextureCoordinates.Contains(Rhino.Geometry.Point3d)"]
Implements
ICollection<T>.Contains(T)
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace