RhinoCommon SDK
Interop.RhinoObjectConstPointer Method
 Returns the underlying const CRhinoObject* for a RhinoCommon class. You should only be interested in using this function if you are writing C++ code.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static IntPtr RhinoObjectConstPointer(
	RhinoObject rhinoObject
)
Public Shared Function RhinoObjectConstPointer (
	rhinoObject As RhinoObject
) As IntPtr
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
A Rhino object.
Return Value
Type: IntPtr
A pointer to the Rhino const object.
See Also
Reference
Interop Class
Rhino.Runtime Namespace