RhinoCommon API
ControlPoint Constructor (Point3d)
 Constructs a new world 3-D, or Euclidean, control point. The 4-D representation of this is (x, y, z, 1.0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ControlPoint(
	Point3d pt
)
Public Sub New (
	pt As Point3d
)
Parameters
pt
Type: Rhino.Geometry.Point3d
Coordinates of the control point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace