RhinoCommon API
LengthValue.Length Method (UnitSystem)
 Length value in a given unit system
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Length(
	UnitSystem units
)
Public Function Length (
	units As UnitSystem
) As Double
Parameters
units
Type: Rhino.UnitSystem
[Missing <param name="units"/> documentation for "M:Rhino.LengthValue.Length(Rhino.UnitSystem)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.LengthValue.Length(Rhino.UnitSystem)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
LengthValue Class
Length Overload
Rhino Namespace