RhinoCommon API
Arc Constructor (Circle, Interval)
 Initializes a new instance of an arc from a base circle and an interval of angles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Arc(
	Circle circle,
	Interval angleIntervalRadians
)
Public Sub New (
	circle As Circle,
	angleIntervalRadians As Interval
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to base arc upon.
angleIntervalRadians
Type: Rhino.Geometry.Interval
 Increasing angle interval in radians with angleIntervalRadians.Length() <= 2.0*Math.PI.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace