RhinoCommon API
Line.ExtendThroughBox Method (BoundingBox)
 Ensure the line extends all the way through a box. Note, this does not result in the shortest possible line that overlaps the box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExtendThroughBox(
	BoundingBox box
)
Public Function ExtendThroughBox (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to extend through.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Line Structure
ExtendThroughBox Overload
Rhino.Geometry Namespace