RhinoCommon API
ViewTable.FourViewLayout Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewTable.FourViewLayout(System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void FourViewLayout(
	bool useMatchingViews
)
Public Sub FourViewLayout (
	useMatchingViews As Boolean
)
Parameters
useMatchingViews
Type: System.Boolean
[Missing <param name="useMatchingViews"/> documentation for "M:Rhino.DocObjects.Tables.ViewTable.FourViewLayout(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace