RhinoCommon API
Brep Constructor
Initializes a new empty brep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Brep Class
Brep Overload
Rhino.Geometry Namespace