RhinoCommon API
LayerTable.FindNext Method (Int32, String)
 Use FindName(name, index).
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer FindNext(
	int index,
	string layerName
)
Public Function FindNext (
	index As Integer,
	layerName As String
) As Layer
Parameters
index
Type: System.Int32
Do not use.
layerName
Type: System.String
Do not use.
Return Value
Type: Layer
Do not use.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LayerTable Class
FindNext Overload
Rhino.DocObjects.Tables Namespace