RhinoCommon API
VisualAnalysisMode.DrawPointCloudObject Method
 Draws one point cloud. Override this method to add your custom behavior.
The default implementation does nothing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void DrawPointCloudObject(
	PointCloudObject pointCloud,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawPointCloudObject (
	pointCloud As PointCloudObject,
	pipeline As DisplayPipeline
)
Parameters
pointCloud
Type: Rhino.DocObjects.PointCloudObject
A point cloud object.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace