RhinoCommon API
ColorXYZ Constructor (Color)
 Constructs a new instance of ColorXYZ that is equivalent to an RGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorXYZ(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
RGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ColorXYZ Structure
ColorXYZ Overload
Rhino.Display Namespace