RhinoCommon API
BinaryArchiveReader.ReadPoint Method
 Reads a Point from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point ReadPoint()
Public Function ReadPoint As Point
Return Value
Type: Point
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace