RhinoCommon SDK
Curve.NormalizedLengthParameter Method (Double, Double, Interval)
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool NormalizedLengthParameter(
	double s,
	out double t,
	Interval subdomain
)
Public Function NormalizedLengthParameter (
	s As Double,
	<OutAttribute> ByRef t As Double,
	subdomain As Interval
) As Boolean
Parameters
s
Type: System.Double
 Normalized arc length parameter. E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t
Type: System.Double
 Parameter such that the length of the curve from its start to t is arc_length.
subdomain
Type: Rhino.Geometry.Interval
 The calculation is performed on the specified sub-domain of the curve.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
NormalizedLengthParameter Overload
Rhino.Geometry Namespace