RhinoCommon API
Box.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EpsilonEquals(
	Box other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Box,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Box
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Box.EpsilonEquals(Rhino.Geometry.Box,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Box.EpsilonEquals(Rhino.Geometry.Box,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Box.EpsilonEquals(Rhino.Geometry.Box,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Box Structure
Rhino.Geometry Namespace