RhinoCommon API
LayerTable.FindByFullPath Method (String, Int32)
 Searches for a layer using the fully qualified name, that includes ancestors.
Deleted layers have no name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FindByFullPath(
	string layerPath,
	int notFoundReturnValue
)
Public Function FindByFullPath (
	layerPath As String,
	notFoundReturnValue As Integer
) As Integer
Parameters
layerPath
Type: System.String
The full layer name.
notFoundReturnValue
Type: System.Int32
Should be -1 to get the index of the OpenNURBS default layer, or UnsetIntIndex to get an always-out-of-bound value.
Return Value
Type: Int32
The index of the found layer, or notFoundReturnValue.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
LayerTable Class
FindByFullPath Overload
Rhino.DocObjects.Tables Namespace