RhinoCommon SDK
Interop.NativeNonConstPointer Method
 Get ON_Viewport* from a ViewportInfo instance
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static IntPtr NativeNonConstPointer(
	ViewportInfo viewport
)
Public Shared Function NativeNonConstPointer (
	viewport As ViewportInfo
) As IntPtr
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="viewport"/> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.DocObjects.ViewportInfo)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.DocObjects.ViewportInfo)"]
See Also
Reference
Interop Class
Rhino.Runtime Namespace