RhinoCommon API
DisplayMaterial.GetTransparencyTexture Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.GetTransparencyTexture(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetTransparencyTexture(
	bool front
)
Public Function GetTransparencyTexture (
	front As Boolean
) As Texture
Parameters
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.GetTransparencyTexture(System.Boolean)"]
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.Display.DisplayMaterial.GetTransparencyTexture(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace