RhinoCommon SDK
Thumbnail.GetDib Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.Thumbnail.GetDib"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Bitmap GetDib()
Public Function GetDib As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.Controls.Thumbnail.GetDib"]
Implements
IRhRdkThumbnail.GetDib()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace