RhinoCommon API
RhinoApp.ReleaseMouseCapture Method
Releases the mouse capture.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ReleaseMouseCapture()
Public Shared Function ReleaseMouseCapture As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoApp.ReleaseMouseCapture"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoApp Class
Rhino Namespace