RhinoCommon API
ContentCollectionIterator.DeleteThis Method
[Missing <summary> documentation for "M:Rhino.Render.ContentCollectionIterator.DeleteThis"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DeleteThis()
Public Sub DeleteThis
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace