RhinoCommon API
BoundingBox.Contains Method (BoundingBox)
 Determines whether this boundingbox contains another boundingbox.
This is the same as calling Contains(box,false).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	BoundingBox box
)
Public Function Contains (
	box As BoundingBox
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to test.
Return Value
Type: Boolean
true if the box is on the inside of this boundingbox, or is coincident with the surface of it.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BoundingBox Structure
Contains Overload
Rhino.Geometry Namespace