RhinoCommon API
ISettingsService.TestHarness Method
[Missing <summary> documentation for "M:Rhino.Runtime.ISettingsService.TestHarness"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void TestHarness()
Sub TestHarness
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace