RhinoCommon API
Dialogs.ShowMultiListBox Method
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] ShowMultiListBox(
	string title,
	string message,
	IList<string> items,
	IList<string> defaults = null
)
Public Shared Function ShowMultiListBox (
	title As String,
	message As String,
	items As IList(Of String),
	Optional defaults As IList(Of String) = Nothing
) As String()
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
items
Type: System.Collections.Generic.IList<String>
[Missing <param name="items"/> documentation for "M:Rhino.UI.Dialogs.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
defaults (Optional)
Type: System.Collections.Generic.IList<String>
[Missing <param name="defaults"/> documentation for "M:Rhino.UI.Dialogs.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.UI.Dialogs.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Dialogs Class
Rhino.UI Namespace