RhinoCommon API
RealtimeDisplayMode.HudCustomStatusText Method
 Override to display status of the render engine.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string HudCustomStatusText()
Public Overridable Function HudCustomStatusText As String
Return Value
Type: String
Status text to display
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace