RhinoCommon API
Sphere Constructor (Plane, Double)
 Initializes a new sphere given the plane of the equator circle and radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Sphere(
	Plane equatorialPlane,
	double radius
)
Public Sub New (
	equatorialPlane As Plane,
	radius As Double
)
Parameters
equatorialPlane
Type: Rhino.Geometry.Plane
A plane that will be intesecting the sphere at the same distance from both poles (parameterization singularieties).
radius
Type: System.Double
A radius value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Sphere Structure
Sphere Overload
Rhino.Geometry Namespace