RhinoCommon SDK
File3dmObjectTable.AddEllipse Method (Ellipse, ObjectAttributes)
Adds a curve object to the document representing an ellipse.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddEllipse(
	Ellipse ellipse,
	ObjectAttributes attributes
)
Public Function AddEllipse (
	ellipse As Ellipse,
	attributes As ObjectAttributes
) As Guid
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to ellipse.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddEllipse Overload
Rhino.FileIO Namespace