RhinoCommon API
Point2d Constructor (Double, Double)
 Initializes a new instance of Point2d from coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d(
	double x,
	double y
)
Public Sub New (
	x As Double,
	y As Double
)
Parameters
x
Type: System.Double
The X (first) coordinate.
y
Type: System.Double
The Y (second) coordinate.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace