RhinoCommon API
TextLog.ToString Method
 If the TextLog was constructed using the empty constructor, then the text information is stored in a runtime string. The contents of this string is retrieved using ToString for this case
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.TextLog.ToString"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
TextLog Class
Rhino.FileIO Namespace