RhinoCommon API
TransformObjectList.GripOwnerArray Method
 Gets access to the GripOwner array of the TransformObjectList object.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] GripOwnerArray()
Public Function GripOwnerArray As RhinoObject()
Return Value
Type: RhinoObject[]
An array of GripOwner, empty if there were no GripOwners.
Remarks
Count may not necessarily equal count of GripObjects from GripArray().
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace