RhinoCommon API
NameHash.Clone Method
 Creates a copy of this name hash. Because content hash is immutable, this can be used as a deep copy.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NameHash Clone()
Public Function Clone As NameHash
Return Value
Type: NameHash
A different instance of the same name hash.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
NameHash Class
Rhino.FileIO Namespace