RhinoCommon API
RenderPrimitiveList.Add Method (Box, RenderMaterial)
 Add primitive box and material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Box box,
	RenderMaterial material
)
Public Sub Add (
	box As Box,
	material As RenderMaterial
)
Parameters
box
Type: Rhino.Geometry.Box
Box to add.
material
Type: Rhino.Render.RenderMaterial
 Material to add, may be null if not needed.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderPrimitiveList Class
Add Overload
Rhino.Render Namespace