RhinoCommon API
GetBaseClass.AddOptionEnumList<T> Method (String, T, T[])
 Adds a choice of enum values as list option. Allows to include only some enum values.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddOptionEnumList<T>(
	string englishOptionName,
	T defaultValue,
	T[] include
)
where T : struct, new(), IConvertible
Public Function AddOptionEnumList(Of T As {Structure, New, IConvertible}) (
	englishOptionName As String,
	defaultValue As T,
	include As T()
) As Integer
Parameters
englishOptionName
Type: System.String
The name of the option
defaultValue
Type: T
The default value
include
Type: T[]
An array of enum values to use. This argument can also be null; in this case, the whole enum is used.
Type Parameters
T
The enum type
Return Value
Type: Int32
Option index
Exceptions
Exception | Condition
ArgumentException | Gets thrown if defaultValue provided is not an enum type.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetBaseClass Class
AddOptionEnumList Overload
Rhino.Input.Custom Namespace