RhinoCommon SDK
RenderContent.CalculateRenderHash Method
 Override this method to calculate the render hash of the state that affects how the content is rendered. Does not include children or perform any caching. Render hash values are now automatically cached by the content framework and you do not have to worry about caching. You also do not have to worry about iterating into children. This method is now only called internally by the framework, use the RenderHash property to get the current hash value.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual uint CalculateRenderHash(
	ulong rcrcFlags
)
Protected Overridable Function CalculateRenderHash (
	rcrcFlags As ULong
) As UInteger
Parameters
rcrcFlags
Type: System.UInt64
[Missing <param name="rcrcFlags"/> documentation for "M:Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace