RhinoCommon SDK
UserData.OnTransform Method
 Is called when the object associated with this data is transformed. If you override this function, make sure to call the base class if you want the stored Transform to be updated.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnTransform(
	Transform transform
)
Protected Overridable Sub OnTransform (
	transform As Transform
)
Parameters
transform
Type: Rhino.Geometry.Transform
The transform being applied.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace