RhinoCommon API
ConstructionPlane Constructor
 Initializes a new instance of ConstructionPlane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ConstructionPlane()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace