RhinoCommon API
ArchivableDictionary.GetGuid Method (String)
 Get value as Guid, will only succeed if value was created using Set(string key, Guid value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid GetGuid(
	string key
)
Public Function GetGuid (
	key As String
) As Guid
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetGuid(System.String)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetGuid(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ArchivableDictionary Class
GetGuid Overload
Rhino.Collections Namespace