RhinoCommon API
GetBaseClass.Color Method
Gets a color if Get*() returns GetResult.Color.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Color()
Public Function Color As Color
Return Value
Type: Color
The color chosen by the user.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace