RhinoCommon API
BezierCurve Constructor (IEnumerable<Point4d>)
 Create bezier curve with controls defined by a list of 4d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BezierCurve(
	IEnumerable<Point4d> controlPoints
)
Public Sub New (
	controlPoints As IEnumerable(Of Point4d)
)
Parameters
controlPoints
Type: System.Collections.Generic.IEnumerable<Point4d>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BezierCurve Class
BezierCurve Overload
Rhino.Geometry Namespace