RhinoCommon API
ChangeQueue.GetQueueGroundPlane Method
 Get groundplane known to the queue at the time of the Flush
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GroundPlane GetQueueGroundPlane()
Public Function GetQueueGroundPlane As GroundPlane
Return Value
Type: GroundPlane
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.GetQueueGroundPlane"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace