RhinoCommon API
ChangeQueue.GetQueueSun Method
 Get sun known to the queue at the time of the Flush
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light GetQueueSun()
Public Function GetQueueSun As Light
Return Value
Type: Light
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSun"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace