RhinoCommon API
Skylight Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Skylight()
Public Sub New
See Also
Reference
Skylight Class
Skylight Overload
Rhino.Render Namespace