RhinoCommon API
SimulatedTexture Constructor
Initializes a new instance of the SimulatedTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimulatedTexture()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace