RhinoCommon API
IPanel.PanelShown Method (UInt32, ShowPanelReason)
[Missing <summary> documentation for "M:Rhino.UI.IPanel.PanelShown(System.UInt32,Rhino.UI.ShowPanelReason)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void PanelShown(
	uint documentSerialNumber,
	ShowPanelReason reason
)
Sub PanelShown (
	documentSerialNumber As UInteger,
	reason As ShowPanelReason
)
Parameters
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanel.PanelShown(System.UInt32,Rhino.UI.ShowPanelReason)"]
reason
Type: Rhino.UI.ShowPanelReason
[Missing <param name="reason"/> documentation for "M:Rhino.UI.IPanel.PanelShown(System.UInt32,Rhino.UI.ShowPanelReason)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
IPanel Interface
PanelShown Overload
Rhino.UI Namespace