RhinoCommon SDK
CachedTextureCoordinates.IndexOf Method
 Determines the index of a specific point in this collection.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int IndexOf(
	Point3d item
)
Public Function IndexOf (
	item As Point3d
) As Integer
Parameters
item
Type: Rhino.Geometry.Point3d
 The point (UV or UVW) to locate in this collection.
Return Value
Type: Int32
 The index of item if found in the list; otherwise, -1.
Implements
IList<T>.IndexOf(T)
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace