RhinoCommon API
Brep.GetWireframe Method
 Constructs all the Wireframe curves for this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] GetWireframe(
	int density
)
Public Function GetWireframe (
	density As Integer
) As Curve()
Parameters
density
Type: System.Int32
Wireframe density. Valid values range between -1 and 99.
Return Value
Type: Curve[]
An array of Wireframe curves or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Brep Class
Rhino.Geometry Namespace