RhinoCommon API
SimpleArrayUint Constructor
 Initializes a new SimpleArrayInt class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayUint()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayUint Class
SimpleArrayUint Overload
Rhino.Runtime.InteropWrappers Namespace