RhinoCommon SDK
ToolbarFile.SaveAs Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SaveAs(
	string path
)
Public Function SaveAs (
	path As String
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace