RhinoCommon SDK
BinaryArchiveWriter.WriteUtf8String Method
 Writes a String value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteUtf8String(
	string value
)
Public Sub WriteUtf8String (
	value As String
)
Parameters
value
Type: System.String
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace