RhinoCommon API
File3dmObjectTable.AddPoints Method (IEnumerable<Point3d>)
 Adds multiple points to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] AddPoints(
	IEnumerable<Point3d> points
)
Public Function AddPoints (
	points As IEnumerable(Of Point3d)
) As Guid()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
Return Value
Type: Guid[]
List of object ids.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmObjectTable Class
AddPoints Overload
Rhino.FileIO Namespace