RhinoCommon SDK
Point4d.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EpsilonEquals(
	Point4d other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Point4d,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Point4d
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Point4d.EpsilonEquals(Rhino.Geometry.Point4d,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Point4d.EpsilonEquals(Rhino.Geometry.Point4d,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Point4d.EpsilonEquals(Rhino.Geometry.Point4d,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace