RhinoCommon API
ObjectAttributes.RemoveFromAllGroups Method
Removes object from all groups.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveFromAllGroups()
Public Sub RemoveFromAllGroups
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace