RhinoCommon SDK
CustomBrepObject.Dispose Method
Releases all resources used by the CustomBrepObject
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomBrepObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace