RhinoCommon SDK
Surface.PointAt Method
 Evaluates a point at a given parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double u,
	double v
)
Public Function PointAt (
	u As Double,
	v As Double
) As Point3d
Parameters
u
Type: System.Double
evaluation parameters.
v
Type: System.Double
evaluation parameters.
Return Value
Type: Point3d
Point3d.Unset on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace