RhinoCommon API
MeshTextureCoordinateList.Add Method (Double, Double)
 Adds a new texture coordinate to the end of the Texture list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	double s,
	double t
)
Public Function Add (
	s As Double,
	t As Double
) As Integer
Parameters
s
Type: System.Double
S component of new texture coordinate.
t
Type: System.Double
T component of new texture coordinate.
Return Value
Type: Int32
The index of the newly added texture coordinate.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshTextureCoordinateList Class
Add Overload
Rhino.Geometry.Collections Namespace