RhinoCommon API
Interval.MakeIncreasing Method
 Ensures this Interval is either singleton or increasing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void MakeIncreasing()
Public Sub MakeIncreasing
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Interval Structure
Rhino.Geometry Namespace