RhinoCommon API
RhinoDoc.WriteFile Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WriteFile(
	string path,
	FileWriteOptions options
)
Public Function WriteFile (
	path As String,
	options As FileWriteOptions
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
options
Type: Rhino.FileIO.FileWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDoc Class
Rhino Namespace