RhinoCommon API
RhinoObject.Highlight Method
 Modifies the highlighting of the object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Highlight(
	bool enable
)
Public Function Highlight (
	enable As Boolean
) As Boolean
Parameters
enable
Type: System.Boolean
true if highlighting should be enabled.
Return Value
Type: Boolean
true if the object is now highlighted.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace