RhinoCommon API
DisplayModeDescription.CopyDisplayMode Method
 Copies an existing display mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CopyDisplayMode(
	Guid id,
	string name
)
Public Shared Function CopyDisplayMode (
	id As Guid,
	name As String
) As Guid
Parameters
id
Type: System.Guid
The id of the existing display mode to copy.
name
Type: System.String
The name of the new display mode.
Return Value
Type: Guid
The id of the new display mode if successful. Guid.Empty on error.
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace