RhinoCommon API
SupportOptions.SetLastNavigatedLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLastNavigatedLocation(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetLastNavigatedLocation(
	string folder
)
Public Shared Sub SetLastNavigatedLocation (
	folder As String
)
Parameters
folder
Type: System.String
[Missing <param name="folder"/> documentation for "M:Rhino.Render.SupportOptions.SetLastNavigatedLocation(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
SupportOptions Class
Rhino.Render Namespace