RhinoCommon SDK
IStackedDialogPageService.ModifyPropertiesPage Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.ModifyPropertiesPage(Rhino.UI.ObjectPropertiesPage,System.Action{Rhino.UI.ObjectPropertiesPageEventArgs})"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void ModifyPropertiesPage(
	ObjectPropertiesPage page,
	Action<ObjectPropertiesPageEventArgs> callbackAction
)
Sub ModifyPropertiesPage (
	page As ObjectPropertiesPage,
	callbackAction As Action(Of ObjectPropertiesPageEventArgs)
)
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.ModifyPropertiesPage(Rhino.UI.ObjectPropertiesPage,System.Action{Rhino.UI.ObjectPropertiesPageEventArgs})"]
callbackAction
Type: System.Action<ObjectPropertiesPageEventArgs>
[Missing <param name="callbackAction"/> documentation for "M:Rhino.UI.IStackedDialogPageService.ModifyPropertiesPage(Rhino.UI.ObjectPropertiesPage,System.Action{Rhino.UI.ObjectPropertiesPageEventArgs})"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace