RhinoCommon API
NurbsSurfaceKnotList.KnotMultiplicity Method
Get knot multiplicity.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int KnotMultiplicity(
	int index
)
Public Function KnotMultiplicity (
	index As Integer
) As Integer
Parameters
index
Type: System.Int32
Index of knot to query.
Return Value
Type: Int32
The multiplicity (valence) of the knot.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace