RhinoCommon API
AsyncRenderContext.JoinRenderThread Method
 Join the render thread, then set to null;
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void JoinRenderThread()
Public Sub JoinRenderThread
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace