RhinoCommon API
SimpleArrayDouble.NonConstPointer Method
 Gets the non-const pointer (for modification) of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
The non-const pointer.
See Also
Reference
SimpleArrayDouble Class
Rhino.Runtime.InteropWrappers Namespace