RhinoCommon SDK
DisplayPipeline.DrawTorus Method (Torus, Color, Int32)
 Draw a wireframe torus.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawTorus(
	Torus torus,
	Color color,
	int thickness
)
Public Sub DrawTorus (
	torus As Torus,
	color As Color,
	thickness As Integer
)
Parameters
torus
Type: Rhino.Geometry.Torus
Torus to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of torus wires.
See Also
Reference
DisplayPipeline Class
DrawTorus Overload
Rhino.Display Namespace