RhinoCommon API
RenderContent.Initialize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.Initialize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Initialize()
Public Function Initialize As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.Initialize"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace