RhinoCommon API
Mesh.Reduce Method (Int32, Boolean, Int32, Boolean, Boolean)
 Reduce polygon count
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Reduce(
	int desiredPolygonCount,
	bool allowDistortion,
	int accuracy,
	bool normalizeSize,
	bool threaded
)
Public Function Reduce (
	desiredPolygonCount As Integer,
	allowDistortion As Boolean,
	accuracy As Integer,
	normalizeSize As Boolean,
	threaded As Boolean
) As Boolean
Parameters
desiredPolygonCount
Type: System.Int32
desired or target number of faces
allowDistortion
Type: System.Boolean
 If true mesh appearance is not changed even if the target polygon count is not reached
accuracy
Type: System.Int32
Integer from 1 to 10 telling how accurate reduction algorithm to use. Greater number gives more accurate results
normalizeSize
Type: System.Boolean
If true mesh is fitted to an axis aligned unit cube until reduction is complete
threaded
Type: System.Boolean
 If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters. If False then will run on main thread.
Return Value
Type: Boolean
True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Mesh Class
Reduce Overload
Rhino.Geometry Namespace