RhinoCommon SDK
Light.GetAttenuation Method
 Gets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetAttenuation(
	double d
)
Public Function GetAttenuation (
	d As Double
) As Double
Parameters
d
Type: System.Double
The distance to evaluate.
Return Value
Type: Double
0 if a0 + d*a1 + d^2*a2 <= 0.
See Also
Reference
Light Class
Rhino.Geometry Namespace