RhinoCommon API
GeneralSettings.GetDefaultState Method
 Gets the factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static GeneralSettingsState GetDefaultState()
Public Shared Function GetDefaultState As GeneralSettingsState
Return Value
Type: GeneralSettingsState
A new general state with factory settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace