RhinoCommon SDK
Quaternion.DistanceTo Method
 Computes the distance or norm of the difference between this and another quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double DistanceTo(
	Quaternion q
)
Public Function DistanceTo (
	q As Quaternion
) As Double
Parameters
q
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Double
(this - q).Length.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace