RhinoCommon API
MeshVertexList.Align Method (Double, IEnumerable<Boolean>)
 Moves mesh vertices that belong to naked edges to neighboring vertices, within the specified distance.
This forces unaligned mesh vertices to the same location and is helpful to clean meshes for 3D printing.
See the
_AlignMeshVertices
 Rhino command for more information.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Align(
	double distance,
	IEnumerable<bool> whichVertices = null
)
Public Function Align (
	distance As Double,
	Optional whichVertices As IEnumerable(Of Boolean) = Nothing
) As Integer
Parameters
distance
Type: System.Double
Distance that should not be exceed when modifying the mesh.
whichVertices (Optional)
Type: System.Collections.Generic.IEnumerable<Boolean>
If not null, defines which vertices should be considered for adjustment.
Return Value
Type: Int32
If the operation succeeded, the number of moved vertices, or -1 on error.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshVertexList Class
Align Overload
Rhino.Geometry.Collections Namespace