RhinoCommon SDK
GumballObject.SetFromHatch Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromHatch(Rhino.Geometry.Hatch)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromHatch(
	Hatch hatch
)
Public Function SetFromHatch (
	hatch As Hatch
) As Boolean
Parameters
hatch
Type: Rhino.Geometry.Hatch
[Missing <param name="hatch"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromHatch(Rhino.Geometry.Hatch)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromHatch(Rhino.Geometry.Hatch)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace