RhinoCommon API
DisplayPipeline.DrawMeshVertices Method
 Draws all the vertices in a given mesh.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawMeshVertices(
	Mesh mesh,
	Color color
)
Public Sub DrawMeshVertices (
	mesh As Mesh,
	color As Color
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh for vertex drawing.
color
Type: System.Drawing.Color
Color of mesh vertices.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace