RhinoCommon SDK
GetPoint.OnMouseMove Method
Calls the MouseMove event and can/should be called by overriding implementation.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnMouseMove(
	GetPointMouseEventArgs e
)
Protected Overridable Sub OnMouseMove (
	e As GetPointMouseEventArgs
)
Parameters
e
Type: Rhino.Input.Custom.GetPointMouseEventArgs
Current argument for the event.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace