RhinoCommon SDK
InstanceDefinitionTable.DestroySourceArchive Method
 Destroys all source archive information. Specifically: * SourceArchive is set to the empty string. * SourceRelativePath is set to false * The alternative source archive path is set to the empty string. * Checksum.Zero() is used to private destroy all checksum information. * UpdateType is set to Static.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DestroySourceArchive(
	InstanceDefinition definition,
	bool quiet
)
Public Function DestroySourceArchive (
	definition As InstanceDefinition,
	quiet As Boolean
) As Boolean
Parameters
definition
Type: Rhino.DocObjects.InstanceDefinition
The instance definition to be modified.
quiet
Type: System.Boolean
If true, then message boxes about erroneous parameters will not be shown.
Return Value
Type: Boolean
 Returns true if the definition was successfully modified otherwise returns false.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace