RhinoCommon API
StackedDialogPage.RemovePage Method
 Remove this page from the dialog box
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemovePage()
Public Sub RemovePage
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace