RhinoCommon API
ViewportInfo.SetScreenPort Method (Rectangle)
 Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetScreenPort(
	Rectangle windowRectangle
)
Public Function SetScreenPort (
	windowRectangle As Rectangle
) As Boolean
Parameters
windowRectangle
Type: System.Drawing.Rectangle
A new rectangle.
Return Value
Type: Boolean
true if input is valid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
SetScreenPort Overload
Rhino.DocObjects Namespace