RhinoCommon API
LengthValue.IsUnset Method
 Test IsUnset
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsUnset()
Public Function IsUnset As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.LengthValue.IsUnset"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
LengthValue Class
Rhino Namespace