RhinoCommon API
RenderPanels.RegisterPanel Method
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RegisterPanel(
	PlugIn plugin,
	RenderPanelType renderPanelType,
	Type panelType,
	string caption,
	bool alwaysShow,
	bool initialShow
)
Public Sub RegisterPanel (
	plugin As PlugIn,
	renderPanelType As RenderPanelType,
	panelType As Type,
	caption As String,
	alwaysShow As Boolean,
	initialShow As Boolean
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
 The plug-in providing the custom user interface
renderPanelType
Type: Rhino.Render.RenderPanelType
 See RenderPanelType for supported user interface types.
panelType
Type: System.Type
 The type of object to be created and added to the render container.
caption
Type: System.String
 The caption for the custom user interface.
alwaysShow
Type: System.Boolean
 If true the custom user interface will always be visible, if false then it may be hidden or shown as requested by the user.
initialShow
Type: System.Boolean
 Initial visibility state of the custom user interface control.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderPanels Class
Rhino.Render Namespace