RhinoCommon API
Unroller.AddFollowingGeometry Method (IEnumerable<Point3d>)
 Adds points that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddFollowingGeometry(
	IEnumerable<Point3d> points
)
Public Sub AddFollowingGeometry (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
An array, a list or any enumerable set of points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace