RhinoCommon API
AreaMassProperties.WorldCoordinatesPrincipalMoments Method
 Calculates the principal moments and principal axes with repect to world coordinates. These are simply the eigenvalues and eigenvectors of the world coordinate inertia matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WorldCoordinatesPrincipalMoments(
	out double x,
	out Vector3d xaxis,
	out double y,
	out Vector3d yaxis,
	out double z,
	out Vector3d zaxis
)
Public Function WorldCoordinatesPrincipalMoments (
	<OutAttribute> ByRef x As Double,
	<OutAttribute> ByRef xaxis As Vector3d,
	<OutAttribute> ByRef y As Double,
	<OutAttribute> ByRef yaxis As Vector3d,
	<OutAttribute> ByRef z As Double,
	<OutAttribute> ByRef zaxis As Vector3d
) As Boolean
Parameters
x
Type: System.Double
Principal moment.
xaxis
Type: Rhino.Geometry.Vector3d
Principal axis for x.
y
Type: System.Double
Principal moment.
yaxis
Type: Rhino.Geometry.Vector3d
Principal axis for y.
z
Type: System.Double
Principal moment.
zaxis
Type: Rhino.Geometry.Vector3d
Principal axis for z.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace