RhinoCommon SDK
IStackedDialogPageService.UnManagedPointerCreated Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.UnManagedPointerCreated(Rhino.UI.StackedDialogPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool UnManagedPointerCreated(
	StackedDialogPage page
)
Function UnManagedPointerCreated (
	page As StackedDialogPage
) As Boolean
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.UnManagedPointerCreated(Rhino.UI.StackedDialogPage)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.UnManagedPointerCreated(Rhino.UI.StackedDialogPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace