RhinoCommon API
Sun.ShowDialog Method
Note: This API is now obsolete.
Show the tabbed sun dialog.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use Rhino.UI.Dialogs.ShowSunDialog(Sun sun) instead")]
public void ShowDialog()
<ObsoleteAttribute("Use Rhino.UI.Dialogs.ShowSunDialog(Sun sun) instead")>
Public Sub ShowDialog
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
Sun Class
Rhino.Render Namespace