RhinoCommon API
LicenseLease Constructor (IntPtr)
Initializes a new instance of the LicenseLease class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseLease(
	IntPtr unmanagedPointer
)
Public Sub New (
	unmanagedPointer As IntPtr
)
Parameters
unmanagedPointer
Type: System.IntPtr
[Missing <param name="unmanagedPointer"/> documentation for "M:Rhino.PlugIns.LicenseLease.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
LicenseLease Class
LicenseLease Overload
Rhino.PlugIns Namespace