RhinoCommon API
StackedDialogPage.OnHelp Method
 Called when the parent dialog requests help for this page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void OnHelp()
Public Overridable Sub OnHelp
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace