RhinoCommon API
DecalCreateParams Constructor
Initializes a new instance of the DecalCreateParams class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DecalCreateParams()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace