RhinoCommon API
ParticleSystem.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Geometry.ParticleSystem.GetEnumerator"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Particle> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Particle)
Return Value
Type: IEnumerator<Particle>
[Missing <returns> documentation for "M:Rhino.Geometry.ParticleSystem.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace