RhinoCommon API
Vector3f Constructor
 Constructs a new vector from 3 single precision numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3f(
	float x,
	float y,
	float z
)
Public Sub New (
	x As Single,
	y As Single,
	z As Single
)
Parameters
x
Type: System.Single
X component of vector.
y
Type: System.Single
Y component of vector.
z
Type: System.Single
Z component of vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace