RhinoCommon SDK
Mesh.DestroyTopology Method
 Removes topology data, forcing all topology information to be recomputed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DestroyTopology()
Public Sub DestroyTopology
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace