RhinoCommon API
Mesh.GetNakedEdgePointStatus Method
 Returns an array of bool values equal in length to the number of vertices in this mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is not completely surrounded by faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool[] GetNakedEdgePointStatus()
Public Function GetNakedEdgePointStatus As Boolean()
Return Value
Type: Boolean[]
An array of true/false flags that, at each index, reveals if the corresponding vertex is completely surrounded by faces.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Mesh Class
Rhino.Geometry Namespace