RhinoCommon API
LicenseUtils.AskUserForLicense Method (Int32, Boolean, Object, String, ValidateProductKeyDelegate)
 This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense is used by Rhino C++ plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AskUserForLicense(
	int productType,
	bool standAlone,
	Object parentWindow,
	string textMask,
	ValidateProductKeyDelegate validateDelegate
)
Public Shared Function AskUserForLicense (
	productType As Integer,
	standAlone As Boolean,
	parentWindow As Object,
	textMask As String,
	validateDelegate As ValidateProductKeyDelegate
) As Boolean
Parameters
productType
Type: System.Int32
[Missing <param name="productType"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)"]
standAlone
Type: System.Boolean
[Missing <param name="standAlone"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)"]
parentWindow
Type: System.Object
[Missing <param name="parentWindow"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)"]
textMask
Type: System.String
[Missing <param name="textMask"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)"]
validateDelegate
Type: Rhino.PlugIns.ValidateProductKeyDelegate
[Missing <param name="validateDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LicenseUtils Class
AskUserForLicense Overload
Rhino.PlugIns Namespace