RhinoCommon API
ObjectTable.AddLeader Method (Leader, ObjectAttributes)
 Addsa Leader object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLeader(
	Leader leader,
	ObjectAttributes attributes
)
Public Function AddLeader (
	leader As Leader,
	attributes As ObjectAttributes
) As Guid
Parameters
leader
Type: Rhino.Geometry.Leader
The leader object.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to rich text.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjectTable Class
AddLeader Overload
Rhino.DocObjects.Tables Namespace