RhinoCommon SDK
MeshNgon.FaceIndexList Method
 Get the ngon's mesh face index list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint[] FaceIndexList()
Public Function FaceIndexList As UInteger()
Return Value
Type: UInt32[]
A list of mesh face indexes.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace