RhinoCommon API
Point2d Constructor (Point3d)
 Initializes a new instance of Point3d by copying the first two coordiantes of a Point3d.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
The point that will be used: the Z (third) coordinate is discarded.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace