RhinoCommon SDK
ObjectTable.Undelete Method (RhinoObject)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Undelete(Rhino.DocObjects.RhinoObject)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Undelete(
	RhinoObject rhinoObject
)
Public Function Undelete (
	rhinoObject As RhinoObject
) As Boolean
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhinoObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Undelete(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Undelete(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
ObjectTable Class
Undelete Overload
Rhino.DocObjects.Tables Namespace