RhinoCommon SDK
SubDVertexPtr.Inequality Operator
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.op_Inequality(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDVertexPtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool operator !=(
	SubDVertexPtr a,
	SubDVertexPtr b
)
Public Shared Operator <> (
	a As SubDVertexPtr,
	b As SubDVertexPtr
) As Boolean
Parameters
a
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="a"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.op_Inequality(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDVertexPtr)"]
b
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="b"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.op_Inequality(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDVertexPtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.op_Inequality(Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDVertexPtr)"]
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace