RhinoCommon SDK
ControlPoint Constructor (Point4d)
 Constructs a new weighted control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ControlPoint(
	Point4d pt
)
Public Sub New (
	pt As Point4d
)
Parameters
pt
Type: Rhino.Geometry.Point4d
Control point values.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace