RhinoCommon API
Polyline.MergeColinearSegments Method
 Merge co-linear consecutive segments in a polyline. This method will automatically remove any zero-length segments as well.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MergeColinearSegments(
	double angleTolerance,
	bool includeSeam
)
Public Function MergeColinearSegments (
	angleTolerance As Double,
	includeSeam As Boolean
) As Integer
Parameters
angleTolerance
Type: System.Double
The angle tolerance between adjacent segments for co-linearlity test.
includeSeam
Type: System.Boolean
If true, the seam point of a closed polyline will be moved forwards if it is colinear too.
Return Value
Type: Int32
Number of segments removed from the entire polyline.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Polyline Class
Rhino.Geometry Namespace