RhinoCommon API
BinaryArchiveReader.ReadPoint2d Method
 Reads a Point2d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d ReadPoint2d()
Public Function ReadPoint2d As Point2d
Return Value
Type: Point2d
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace