RhinoCommon API
ObjectTable.AddLine Method (Line, ObjectAttributes)
Adds a line object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLine(
	Line line,
	ObjectAttributes attributes
)
Public Function AddLine (
	line As Line,
	attributes As ObjectAttributes
) As Guid
Parameters
line
Type: Rhino.Geometry.Line
The line value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to line.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectTable Class
AddLine Overload
Rhino.DocObjects.Tables Namespace