RhinoCommon API
ObjectAttributes.GetGroupList Method
 Returns an array of GroupCount group indices. If GroupCount is zero, then GetGroupList() returns null.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] GetGroupList()
Public Function GetGroupList As Integer()
Return Value
Type: Int32[]
An array of group indices. null might be returned in place of an empty array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace