RhinoCommon API
BitmapTable.FindIndex Method
 Retrieves a BitmapEntry object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BitmapEntry FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As BitmapEntry
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: BitmapEntry
A BitmapEntry object, or null if none was found.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace