RhinoCommon API
GeneralSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static GeneralSettingsState GetCurrentState()
Public Shared Function GetCurrentState As GeneralSettingsState
Return Value
Type: GeneralSettingsState
A new general state with current settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace