RhinoCommon SDK
PickContext.SetPickTransform Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.PickContext.SetPickTransform(Rhino.Geometry.Transform)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPickTransform(
	Transform transform
)
Public Sub SetPickTransform (
	transform As Transform
)
Parameters
transform
Type: Rhino.Geometry.Transform
[Missing <param name="transform"/> documentation for "M:Rhino.Input.Custom.PickContext.SetPickTransform(Rhino.Geometry.Transform)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace