RhinoCommon API
SceneServerData.Finalize Method
 Destructor for SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SceneServerData Class
Rhino.Render Namespace