RhinoCommon API
ObjectTable.GetObjectsByType<T> Method (ObjectEnumeratorSettings)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<T> GetObjectsByType<T>(
	ObjectEnumeratorSettings settings
)
where T : RhinoObject
Public Function GetObjectsByType(Of T As RhinoObject) (
	settings As ObjectEnumeratorSettings
) As IEnumerable(Of T)
Parameters
settings
Type: Rhino.DocObjects.ObjectEnumeratorSettings
[Missing <param name="settings"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Return Value
Type: IEnumerable<T>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ObjectTable Class
GetObjectsByType Overload
Rhino.DocObjects.Tables Namespace