RhinoCommon API
RhinoDoc.ReadFileVersion Method
 Returns the file version of the current document. Use this function to determine which version of Rhino last saved the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ReadFileVersion()
Public Function ReadFileVersion As Integer
Return Value
Type: Int32
 The file version (e.g. 1, 2, 3, 4, etc.) or -1 if the document has not been read from disk.
See Also
Reference
RhinoDoc Class
Rhino Namespace