RhinoCommon SDK
BrepFaceList.ExtractFace Method
 Extracts a face from a Brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep ExtractFace(
	int faceIndex
)
Public Function ExtractFace (
	faceIndex As Integer
) As Brep
Parameters
faceIndex
Type: System.Int32
A face index
Return Value
Type: Brep
A brep. This can be null.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace