RhinoCommon API
LinearWorkflow Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LinearWorkflow()
Public Sub New
See Also
Reference
LinearWorkflow Class
LinearWorkflow Overload
Rhino.Render Namespace