RhinoCommon API
Interval.ParameterIntervalAt Method
Converts normalized parameter to interval value, or pair of values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval ParameterIntervalAt(
	Interval normalizedInterval
)
Public Function ParameterIntervalAt (
	normalizedInterval As Interval
) As Interval
Parameters
normalizedInterval
Type: Rhino.Geometry.Interval
[Missing <param name="normalizedInterval"/> documentation for "M:Rhino.Geometry.Interval.ParameterIntervalAt(Rhino.Geometry.Interval)"]
Return Value
Type: Interval
Interval parameter min*(1.0-normalizedParameter) + max*normalized_paramete.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Interval Structure
Rhino.Geometry Namespace
NormalizedParameterAt