RhinoCommon SDK
Mesh.Weld Method
 Makes sure that faces sharing an edge and having a difference of normal greater than or equal to angleToleranceRadians share vertexes along that edge, vertex normals are averaged.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Weld(
	double angleToleranceRadians
)
Public Sub Weld (
	angleToleranceRadians As Double
)
Parameters
angleToleranceRadians
Type: System.Double
Angle at which to weld vertices.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace