RhinoCommon API
Command.IsCommand Method
 Determines is a string is a command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsCommand(
	string name
)
Public Shared Function IsCommand (
	name As String
) As Boolean
Parameters
name
Type: System.String
A string.
Return Value
Type: Boolean
true if the string is a command.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Command Class
Rhino.Commands Namespace