RhinoCommon API
InstanceDefinition.GetReferences Method
 Gets a list of the CRhinoInstanceObjects (inserts) that contains a reference this instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceObject[] GetReferences(
	int wheretoLook
)
Public Function GetReferences (
	wheretoLook As Integer
) As InstanceObject()
Parameters
wheretoLook
Type: System.Int32
0 = get top level references in active document.
1 = get top level and nested references in active document.
2 = check for references from other instance definitions.
Return Value
Type: InstanceObject[]
An array of instance objects. The returned array can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace