RhinoCommon SDK
GetObject.EnablePreSelect Method
 Control the pre selection behavior GetObjects.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnablePreSelect(
	bool enable,
	bool ignoreUnacceptablePreselectedObjects
)
Public Sub EnablePreSelect (
	enable As Boolean,
	ignoreUnacceptablePreselectedObjects As Boolean
)
Parameters
enable
Type: System.Boolean
if true, pre-selection is enabled.
ignoreUnacceptablePreselectedObjects
Type: System.Boolean
 If true and some acceptable objects are pre-selected, then any unacceptable pre-selected objects are ignored. If false and any unacceptable are pre-selected, then the user is forced to post-select.
Remarks
 By default, if valid input is pre-selected when GetObjects() is called, then that input is returned and the user is not given the opportunity to post-select. If you want to force the user to post-select, then call EnablePreSelect(false).
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace