RhinoCommon API
LayerTable.Find Method (Guid, String, Int32)
Finds a layer with a given name and matching parent ID.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	Guid parentId,
	string layerName,
	int notFoundReturnValue
)
Public Function Find (
	parentId As Guid,
	layerName As String,
	notFoundReturnValue As Integer
) As Integer
Parameters
parentId
Type: System.Guid
A valid layer ID.
layerName
Type: System.String
name of layer to search for. The search ignores case.
notFoundReturnValue
Type: System.Int32
Should be -1 to get the index of the OpenNURBS default layer, or UnsetIntIndex to get an always-out-of-bound value.
Return Value
Type: Int32
The index of the found layer, or notFoundReturnValue.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
LayerTable Class
Find Overload
Rhino.DocObjects.Tables Namespace