RhinoCommon SDK
ThumbnailViewModelFactory Constructor
Initializes a new instance of the ThumbnailViewModelFactory class
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ThumbnailViewModelFactory()
Public Sub New
See Also
Reference
ThumbnailViewModelFactory Class
Rhino.UI.Controls Namespace