RhinoCommon API
WaitCursor Constructor
Initializes a new instance of the WaitCursor class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public WaitCursor()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
WaitCursor Class
Rhino.UI Namespace