RhinoCommon API
LightManagerSupportClient.GetLights Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLights"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LightArray GetLights()
Public Function GetLights As LightArray
Return Value
Type: LightArray
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLights"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace