RhinoCommon API
MeshingParameters Constructor
 Initializes a new instance with default values.
Initial values are same as Default.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshingParameters Class
MeshingParameters Overload
Rhino.Geometry Namespace