RhinoCommon API
ObjectPropertiesPage.PageIcon Method
 Icon to display in the object properties tab control. Will not get called if PageIconEmbeddedResourceString is overriden and provides a string for a successfully loaded icon resrouce.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Icon PageIcon(
	Size sizeInPixels
)
Public Overridable Function PageIcon (
	sizeInPixels As Size
) As Icon
Parameters
sizeInPixels
Type: System.Drawing.Size
 The requested icon size in pixels, DPI scaling has been applied. The default value is 24 X DPI scale.
Return Value
Type: Icon
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.PageIcon(System.Drawing.Size)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace