RhinoCommon API
RhinoDocObserverArgs Constructor
Initializes a new instance of the RhinoDocObserverArgs class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDocObserverArgs(
	RhinoDoc doc
)
Public Sub New (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.RhinoDocObserverArgs.#ctor(Rhino.RhinoDoc)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDocObserverArgs Class
Rhino Namespace