RhinoCommon SDK
Linetype.RemoveSegment Method
Removes a segment in the linetype.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemoveSegment(
	int index
)
Public Function RemoveSegment (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero based index of the segment to remove.
Return Value
Type: Boolean
true if the segment index was removed.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace