RhinoCommon SDK
Unroller.AddFollowingGeometry Method (Curve)
 Adds a curve that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddFollowingGeometry(
	Curve curve
)
Public Sub AddFollowingGeometry (
	curve As Curve
)
Parameters
curve
Type: Rhino.Geometry.Curve
The curve.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace