RhinoCommon SDK
Localization.LocalizeCommandName Method (String, Object)
[Missing <summary> documentation for "M:Rhino.UI.Localization.LocalizeCommandName(System.String,System.Object)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string LocalizeCommandName(
	string english,
	Object assemblyOrObject
)
Public Shared Function LocalizeCommandName (
	english As String,
	assemblyOrObject As Object
) As String
Parameters
english
Type: System.String
[Missing <param name="english"/> documentation for "M:Rhino.UI.Localization.LocalizeCommandName(System.String,System.Object)"]
assemblyOrObject
Type: System.Object
[Missing <param name="assemblyOrObject"/> documentation for "M:Rhino.UI.Localization.LocalizeCommandName(System.String,System.Object)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Localization.LocalizeCommandName(System.String,System.Object)"]
See Also
Reference
Localization Class
LocalizeCommandName Overload
Rhino.UI Namespace