RhinoCommon API
IAssemblyRestrictedObject.Editable Method
 Determines whether an assembly can modify the instance.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool Editable()
Function Editable As Boolean
Return Value
Type: Boolean
true if the instance can be edited by the assembly, otherwise returns false.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
IAssemblyRestrictedObject Interface
Rhino.Runtime.Notifications Namespace