RhinoCommon SDK
Brep.CreateFromSweep Method (Curve, IEnumerable<Curve>, Boolean, Double)
 General 1 rail sweep. If you are not producing the sweep results that you are after, then use the SweepOneRail class with options to generate the swept geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreateFromSweep(
	Curve rail,
	IEnumerable<Curve> shapes,
	bool closed,
	double tolerance
)
Public Shared Function CreateFromSweep (
	rail As Curve,
	shapes As IEnumerable(Of Curve),
	closed As Boolean,
	tolerance As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
Rail to sweep shapes along
shapes
Type: System.Collections.Generic.IEnumerable<Curve>
Shape curves
closed
Type: System.Boolean
Only matters if shapes are closed
tolerance
Type: System.Double
Tolerance for fitting surface and rails
Return Value
Type: Brep[]
Array of Brep sweep results
See Also
Reference
Brep Class
CreateFromSweep Overload
Rhino.Geometry Namespace