RhinoCommon API
FileObj.Write Method
Write an obj file based on the contents of a RhinoDoc
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static WriteFileResult Write(
	string filename,
	RhinoDoc doc,
	FileObjWriteOptions options
)
Public Shared Function Write (
	filename As String,
	doc As RhinoDoc,
	options As FileObjWriteOptions
) As WriteFileResult
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.FileObj.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.FileIO.FileObj.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
options
Type: Rhino.FileIO.FileObjWriteOptions
[Missing <param name="options"/> documentation for "M:Rhino.FileIO.FileObj.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
Return Value
Type: WriteFileResult
[Missing <returns> documentation for "M:Rhino.FileIO.FileObj.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
FileObj Class
Rhino.FileIO Namespace