RhinoCommon API
ThumbnailViewModelFactory Constructor
Initializes a new instance of the ThumbnailViewModelFactory class
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ThumbnailViewModelFactory()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ThumbnailViewModelFactory Class
Rhino.UI.Controls.ThumbnailUI Namespace