RhinoCommon API
File3dm.GetPreviewImage Method
 Preview image used for file explorer
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap GetPreviewImage()
Public Function GetPreviewImage As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.FileIO.File3dm.GetPreviewImage"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dm Class
Rhino.FileIO Namespace