RhinoCommon SDK
FileWriteOptions.Dispose Method (Boolean)
Releases the unmanaged resources used by the FileWriteOptions and optionally releases the managed resources
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
FileWriteOptions Class
Dispose Overload
Rhino.FileIO Namespace