RhinoCommon API
FieldDictionary.Set Method (String, DateTime)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Set(
	string key,
	DateTime value
)
Public Sub Set (
	key As String,
	value As DateTime
)
Parameters
key
Type: System.String
Key name for the field value to change.
value
Type: System.DateTime
New value for this field.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
FieldDictionary Class
Set Overload
Rhino.Render.Fields Namespace