RhinoCommon API
BinaryArchiveWriter.WriteVector3f Method
 Writes a Vector3f value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteVector3f(
	Vector3f value
)
Public Sub WriteVector3f (
	value As Vector3f
)
Parameters
value
Type: Rhino.Geometry.Vector3f
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace