RhinoCommon API
MeshVertexNormalList.Destroy Method
 Releases all memory allocated to store vertex normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Destroy()
Public Sub Destroy
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace