RhinoCommon API
FileSettings.GetSearchPaths Method
 Returns all of the imagePath items in Rhino's search imagePath list. See "Options Files settings" in the Rhino help file for more details.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] GetSearchPaths()
Public Shared Function GetSearchPaths As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.FileSettings.GetSearchPaths"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace