RhinoCommon API
RhinoViewport.SetConstructionPlane Method (ConstructionPlane)
 Sets the construction plane to cplane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetConstructionPlane(
	ConstructionPlane cplane
)
Public Sub SetConstructionPlane (
	cplane As ConstructionPlane
)
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The constuction plane to set.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoViewport Class
SetConstructionPlane Overload
Rhino.Display Namespace