RhinoCommon API
AngularDimension.AdjustFromPoints Method (Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d extpoint1,
	Point3d extpoint2,
	Point3d dirpoint1,
	Point3d dirpoint2,
	Point3d dimlinepoint
)
Public Function AdjustFromPoints (
	plane As Plane,
	extpoint1 As Point3d,
	extpoint2 As Point3d,
	dirpoint1 As Point3d,
	dirpoint2 As Point3d,
	dimlinepoint As Point3d
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Dimension's plane
extpoint1
Type: Rhino.Geometry.Point3d
First dimension point
extpoint2
Type: Rhino.Geometry.Point3d
Second definition point
dirpoint1
Type: Rhino.Geometry.Point3d
First direction point
dirpoint2
Type: Rhino.Geometry.Point3d
Second direction point
dimlinepoint
Type: Rhino.Geometry.Point3d
Point on dimension line
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
AngularDimension Class
AdjustFromPoints Overload
Rhino.Geometry Namespace