RhinoCommon API
BinaryArchiveWriter.WriteRectangle Method
 Writes a Rectangle value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteRectangle(
	Rectangle value
)
Public Sub WriteRectangle (
	value As Rectangle
)
Parameters
value
Type: System.Drawing.Rectangle
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace