RhinoCommon API
GroupTable.Add Method
Adds a new empty group to the group table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
 >=0 index of new group. -1 group not added because a group with that name already exists.
Remarks
 In some cases, calling Add() can cause the group indices to become invalid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
GroupTable Class
Add Overload
Rhino.DocObjects.Tables Namespace