RhinoCommon API
File3dmObjectTable.AddPointCloud Method (IEnumerable<Point3d>)
Adds a point cloud object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPointCloud(
	IEnumerable<Point3d> points
)
Public Function AddPointCloud (
	points As IEnumerable(Of Point3d)
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of Point3d.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmObjectTable Class
AddPointCloud Overload
Rhino.FileIO Namespace