RhinoCommon API
Decals.Clear Method
[Missing <summary> documentation for "M:Rhino.Render.Decals.Clear"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Decals Class
Rhino.Render Namespace