RhinoCommon SDK
BinaryArchiveReader.ReadVector3d Method
 Reads a Vector3d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d ReadVector3d()
Public Function ReadVector3d As Vector3d
Return Value
Type: Vector3d
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace