RhinoCommon API
RenderContent.Ungroup Method
 Remove this content from any instance group it may be a member of. Does not record undo but does send the OnContentGroupIdChanged event.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Ungroup()
Public Function Ungroup As Boolean
Return Value
Type: Boolean
true if content was ungrouped, \e false if it was not part of a group.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderContent Class
Rhino.Render Namespace