RhinoCommon API
RhinoViewport.GetUserStrings Method
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NameValueCollection GetUserStrings()
Public Function GetUserStrings As NameValueCollection
Return Value
Type: NameValueCollection
A collection of key strings and values strings. This
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace