RhinoCommon API
SweepOneRail.SetToRoadlikeTop Method
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetToRoadlikeTop"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetToRoadlikeTop()
Public Sub SetToRoadlikeTop
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace