RhinoCommon SDK
RhinoObject.IsMeshable Method
 Returns true if the object is capable of having a mesh of the specified type
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool IsMeshable(
	MeshType meshType
)
Public Overridable Function IsMeshable (
	meshType As MeshType
) As Boolean
Parameters
meshType
Type: Rhino.Geometry.MeshType
[Missing <param name="meshType"/> documentation for "M:Rhino.DocObjects.RhinoObject.IsMeshable(Rhino.Geometry.MeshType)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.IsMeshable(Rhino.Geometry.MeshType)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace