RhinoCommon API
DisplayPipeline.DrawMeshShaded Method (Mesh, DisplayMaterial, Int32[])
 Draws the shaded faces of a given mesh.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawMeshShaded(
	Mesh mesh,
	DisplayMaterial material,
	int[] faceIndices
)
Public Sub DrawMeshShaded (
	mesh As Mesh,
	material As DisplayMaterial,
	faceIndices As Integer()
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
material
Type: Rhino.Display.DisplayMaterial
Material to draw faces with.
faceIndices
Type: System.Int32[]
Indices of specific faces to draw
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipeline Class
DrawMeshShaded Overload
Rhino.Display Namespace