RhinoCommon SDK
GetBaseClass.OptionIndex Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.OptionIndex"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int OptionIndex()
Public Function OptionIndex As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.OptionIndex"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace