RhinoCommon API
DisplayModeDescription.Finalize Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.Finalize"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace