RhinoCommon API
PointCloud.Add Method (Point3d, Vector3d, Color)
 Append a new point to the end of the list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Point3d point,
	Vector3d normal,
	Color color
)
Public Sub Add (
	point As Point3d,
	normal As Vector3d,
	color As Color
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to append.
normal
Type: Rhino.Geometry.Vector3d
Normal vector of new point.
color
Type: System.Drawing.Color
Color of new point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
PointCloud Class
Add Overload
Rhino.Geometry Namespace