RhinoCommon API
PersistentSettings.SetDefault Method (String, Int32)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Int32)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	int value
)
Public Sub SetDefault (
	key As String,
	value As Integer
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Int32)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace