RhinoCommon API
BinaryArchiveReader.ReadInt64 Method
 Reads a Int64 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public long ReadInt64()
Public Function ReadInt64 As Long
Return Value
Type: Int64
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace