RhinoCommon API
Point4dField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.Point4dField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.Point4dField.ValueAsObject"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Point4dField Class
Rhino.Render.Fields Namespace