RhinoCommon API
RenderTexture.GetOffsetLocked Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetOffsetLocked"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool GetOffsetLocked()
Public Overridable Function GetOffsetLocked As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetOffsetLocked"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderTexture Class
Rhino.Render Namespace