RhinoCommon API
Curve.Split Method (Brep, Double, Double)
 Splits a curve into pieces using a polysurface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] Split(
	Brep cutter,
	double tolerance,
	double angleToleranceRadians
)
Public Function Split (
	cutter As Brep,
	tolerance As Double,
	angleToleranceRadians As Double
) As Curve()
Parameters
cutter
Type: Rhino.Geometry.Brep
A cutting surface or polysurface.
tolerance
Type: System.Double
A tolerance for computing intersections.
angleToleranceRadians
Type: System.Double
[Missing <param name="angleToleranceRadians"/> documentation for "M:Rhino.Geometry.Curve.Split(Rhino.Geometry.Brep,System.Double,System.Double)"]
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace