RhinoCommon SDK
AnnotationObjectBase.GetArrowHeadCorners3d Method
 Get the corners of a polygon that contains the arrowhead
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d[] GetArrowHeadCorners3d(
	Vector2d direction,
	Point2d tip,
	double scale
)
Public Function GetArrowHeadCorners3d (
	direction As Vector2d,
	tip As Point2d,
	scale As Double
) As Point3d()
Parameters
direction
Type: Rhino.Geometry.Vector2d
direction of arrow head in annotation plane coordinates (ECS)
tip
Type: Rhino.Geometry.Point2d
location of arrowhead tip in annotation plane coordinates (ECS)
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.DocObjects.AnnotationObjectBase.GetArrowHeadCorners3d(Rhino.Geometry.Vector2d,Rhino.Geometry.Point2d,System.Double)"]
Return Value
Type: Point3d[]
The arrowhead polygon corners
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace