RhinoCommon SDK
Quaternion.Rotation Method (Plane, Plane)
 Returns the unit quaternion that represents the the rotation that maps plane0.xaxis to plane1.xaxis, plane0.yaxis to plane1.yaxis, and plane0.zaxis to plane1.zaxis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion Rotation(
	Plane plane0,
	Plane plane1
)
Public Shared Function Rotation (
	plane0 As Plane,
	plane1 As Plane
) As Quaternion
Parameters
plane0
Type: Rhino.Geometry.Plane
The first plane.
plane1
Type: Rhino.Geometry.Plane
The second plane.
Return Value
Type: Quaternion
A quaternion value.
Remarks
The plane origins are ignored
See Also
Reference
Quaternion Structure
Rotation Overload
Rhino.Geometry Namespace