RhinoCommon API
RhinoGet.GetCircle Method
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetCircle(Rhino.Geometry.Circle@)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result GetCircle(
	out Circle circle
)
Public Shared Function GetCircle (
	<OutAttribute> ByRef circle As Circle
) As Result
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.Input.RhinoGet.GetCircle(Rhino.Geometry.Circle@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetCircle(Rhino.Geometry.Circle@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoGet Class
Rhino.Input Namespace