RhinoCommon SDK
Brep.Split Method (Brep, Double, Boolean)
 Splits a Brep into pieces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] Split(
	Brep splitter,
	double intersectionTolerance,
	out bool toleranceWasRaised
)
Public Function Split (
	splitter As Brep,
	intersectionTolerance As Double,
	<OutAttribute> ByRef toleranceWasRaised As Boolean
) As Brep()
Parameters
splitter
Type: Rhino.Geometry.Brep
The splitting polysurface.
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
toleranceWasRaised
Type: System.Boolean
 set to true if the split failed at intersectionTolerance but succeeded when the tolerance was increased to twice intersectionTolerance.
Return Value
Type: Brep[]
A new array of breps. This array can be empty.
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace