RhinoCommon API
BrepSurfaceList.GetEnumerator Method
 Gets an enumerator that visits all surfaces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Surface> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Surface)
Return Value
Type: IEnumerator<Surface>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
BrepSurfaceList Class
Rhino.Geometry.Collections Namespace