RhinoCommon API
PersistentSettings Constructor (PersistentSettings)
Initializes a new instance of the PersistentSettings class
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PersistentSettings(
	PersistentSettings allUserSettings
)
Public Sub New (
	allUserSettings As PersistentSettings
)
Parameters
allUserSettings
Type: Rhino.PersistentSettings
[Missing <param name="allUserSettings"/> documentation for "M:Rhino.PersistentSettings.#ctor(Rhino.PersistentSettings)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
PersistentSettings Class
PersistentSettings Overload
Rhino Namespace