RhinoCommon API
Arc.Reverse Method
 Reverses the orientation of the arc. Changes the domain from [a,b] to [-b,-a].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Reverse()
Public Sub Reverse
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Arc Structure
Rhino.Geometry Namespace