RhinoCommon API
RenderPrimitiveList.Add Method (Sphere, RenderMaterial)
 Add primitive sphere and material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Sphere sphere,
	RenderMaterial material
)
Public Sub Add (
	sphere As Sphere,
	material As RenderMaterial
)
Parameters
sphere
Type: Rhino.Geometry.Sphere
Sphere to add.
material
Type: Rhino.Render.RenderMaterial
 Material to add, may be null if not needed.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderPrimitiveList Class
Add Overload
Rhino.Render Namespace