RhinoCommon API
DisplayPipeline.DrawPoint Method (Point3d)
 Draws a point using the current display attribute size, style and color
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawPoint(
	Point3d point
)
Public Sub DrawPoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Location of point in world coordinates.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipeline Class
DrawPoint Overload
Rhino.Display Namespace