RhinoCommon API
Cone.AngleInDegrees Method
 Computes the angle (in degrees) between the axis and the side of the cone. The angle and the height have the same sign.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AngleInDegrees()
Public Function AngleInDegrees As Double
Return Value
Type: Double
An angle in degrees.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Cone Structure
Rhino.Geometry Namespace