RhinoCommon API
ModelAidSettings.UpdateFromState Method
 Updates from a particular setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void UpdateFromState(
	ModelAidSettingsState state
)
Public Shared Sub UpdateFromState (
	state As ModelAidSettingsState
)
Parameters
state
Type: Rhino.ApplicationSettings.ModelAidSettingsState
The new states that will be set.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace