RhinoCommon SDK
Point Constructor (Point3d)
 Initializes a new point instance with a location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point(
	Point3d location
)
Public Sub New (
	location As Point3d
)
Parameters
location
Type: Rhino.Geometry.Point3d
A position in 3D space.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point Class
Point Overload
Rhino.Geometry Namespace