RhinoCommon API
Matrix.Zero Method
 Sets all values inside the matrix to zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Zero()
Public Sub Zero
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Matrix Class
Rhino.Geometry Namespace