RhinoCommon API
IZooClientUtilities.Initialize Method
[Missing <summary> documentation for "M:Rhino.Runtime.IZooClientUtilities.Initialize(System.Object)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool Initialize(
	Object verify
)
Function Initialize (
	verify As Object
) As Boolean
Parameters
verify
Type: System.Object
[Missing <param name="verify"/> documentation for "M:Rhino.Runtime.IZooClientUtilities.Initialize(System.Object)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.IZooClientUtilities.Initialize(System.Object)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace