RhinoCommon API
GetOption.Get Method
 Call to get an option. A return value of "option" means the user selected a valid option. Use Option() the determine which option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
If the user chose an option, then Option; another enumeration value otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GetOption Class
Rhino.Input.Custom Namespace