RhinoCommon API
MetaData.Dispose Method
Releases all resources used by the MetaData
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace