RhinoCommon SDK
PickContext Constructor
Initializes a new instance of the PickContext class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PickContext()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace