RhinoCommon API
Curve.Split Method (Brep, Double)
 Splits a curve into pieces using a polysurface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] Split(
	Brep cutter,
	double tolerance
)
Public Function Split (
	cutter As Brep,
	tolerance As Double
) As Curve()
Parameters
cutter
Type: Rhino.Geometry.Brep
A cutting surface or polysurface.
tolerance
Type: System.Double
A tolerance for computing intersections.
Return Value
Type: Curve[]
An array of curves. This array can be empty.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.24
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace