RhinoCommon API
BinaryArchiveWriter.WriteBoolArray Method
 Writes a list, an array, or any enumerable of Boolean to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteBoolArray(
	IEnumerable<bool> value
)
Public Sub WriteBoolArray (
	value As IEnumerable(Of Boolean)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Boolean>
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace