RhinoCommon API
CurveObject.DuplicateCurveGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.CurveObject.DuplicateCurveGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve DuplicateCurveGeometry()
Public Function DuplicateCurveGeometry As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.DocObjects.CurveObject.DuplicateCurveGeometry"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace