RhinoCommon API
City.FindNearest Method
 Finds nearest city of specified input parameters.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static City FindNearest(
	double latitude,
	double longitude
)
Public Shared Function FindNearest (
	latitude As Double,
	longitude As Double
) As City
Parameters
latitude
Type: System.Double
latitude.
longitude
Type: System.Double
longitude.
Return Value
Type: City
Nearest city.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
City Class
Rhino.Render Namespace