RhinoCommon API
Unroller.AddFollowingGeometry Method (IEnumerable<TextDot>)
 Adds text dots that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddFollowingGeometry(
	IEnumerable<TextDot> dots
)
Public Sub AddFollowingGeometry (
	dots As IEnumerable(Of TextDot)
)
Parameters
dots
Type: System.Collections.Generic.IEnumerable<TextDot>
An array, a list or any enumerable set of text dots.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace