RhinoCommon API
PreviewSceneServer.Dispose Method
 Dispose for PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace