RhinoCommon API
NurbsCurvePointList.MakeNonRational Method
 Converts the curve to a Non-rational NURBS curve. Non-rational curves have unweighted control points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace