RhinoCommon API
BrepCurveList.GetEnumerator Method
Get an enumerator that visits all curves.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Curve> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Curve)
Return Value
Type: IEnumerator<Curve>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace