RhinoCommon SDK
Thumbnail.Id Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.Thumbnail.Id"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.Thumbnail.Id"]
Implements
IRhRdkThumbnail.Id()
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace