RhinoCommon API
PlugIn Constructor
Initializes a new instance of the PlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PlugIn()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace