RhinoCommon API
LicenseIdAttribute Constructor
Initializes a new instance of the LicenseIdAttribute class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseIdAttribute(
	string value
)
Public Sub New (
	value As String
)
Parameters
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.PlugIns.LicenseIdAttribute.#ctor(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
LicenseIdAttribute Class
Rhino.PlugIns Namespace