RhinoCommon API
BinaryArchiveReader.ReadRay3d Method
 Reads a Ray3d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Ray3d ReadRay3d()
Public Function ReadRay3d As Ray3d
Return Value
Type: Ray3d
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace