RhinoCommon API
File3dm.DumpSummary Method
Prepares a text dump of model properties and settings.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DumpSummary()
Public Function DumpSummary As String
Return Value
Type: String
The text dump.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dm Class
Rhino.FileIO Namespace