RhinoCommon API
PreviewBackground.ElementKind Method
 ElementKind
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ElementKind()
Public Function ElementKind As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.PreviewBackground.ElementKind"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace