RhinoCommon API
Extrusion.Profile3d Method (ComponentIndex)
 Gets one of the profiles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Profile3d(
	ComponentIndex ci
)
Public Function Profile3d (
	ci As ComponentIndex
) As Curve
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
The index of this profile.
Return Value
Type: Curve
The profile.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Extrusion Class
Profile3d Overload
Rhino.Geometry Namespace