RhinoCommon API
Sphere.PointAt Method
Evaluates the sphere at specific longitude and latitude angles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double longitudeRadians,
	double latitudeRadians
)
Public Function PointAt (
	longitudeRadians As Double,
	latitudeRadians As Double
) As Point3d
Parameters
longitudeRadians
Type: System.Double
A number within the interval [0, 2pi].
latitudeRadians
Type: System.Double
A number within the interval [-pi/2,pi/2].
Return Value
Type: Point3d
A point value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace