RhinoCommon API
RhinoViewport.GetPickTransform Method (Rectangle)
 Takes a rectangle in screen coordinates and returns a transformation that maps the 3d frustum defined by the rectangle to a -1/+1 clipping coordinate box.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GetPickTransform(
	Rectangle clientRectangle
)
Public Function GetPickTransform (
	clientRectangle As Rectangle
) As Transform
Parameters
clientRectangle
Type: System.Drawing.Rectangle
The client rectangle.
Return Value
Type: Transform
A transformation matrix.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoViewport Class
GetPickTransform Overload
Rhino.Display Namespace