RhinoCommon API
ClassArrayOnObjRef Constructor
 Initializes a new ClassArrayOnObjRef instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClassArrayOnObjRef()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ClassArrayOnObjRef Class
ClassArrayOnObjRef Overload
Rhino.Runtime.InteropWrappers Namespace