RhinoCommon API
ObjectTable.AddRhinoObject Method (MeshObject, Mesh)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.MeshObject,Rhino.Geometry.Mesh)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddRhinoObject(
	MeshObject meshObject,
	Mesh mesh
)
Public Sub AddRhinoObject (
	meshObject As MeshObject,
	mesh As Mesh
)
Parameters
meshObject
Type: Rhino.DocObjects.MeshObject
[Missing <param name="meshObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.MeshObject,Rhino.Geometry.Mesh)"]
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.MeshObject,Rhino.Geometry.Mesh)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace