RhinoCommon API
Vector3d Constructor (Vector3f)
 Initializes a new instance of a vector, copying the three components from a single-precision vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d(
	Vector3f vector
)
Public Sub New (
	vector As Vector3f
)
Parameters
vector
Type: Rhino.Geometry.Vector3f
A single-precision vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3d Structure
Vector3d Overload
Rhino.Geometry Namespace