RhinoCommon SDK
ObjectTable.GetSelectedObjects Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjects(System.Boolean,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerable<RhinoObject> GetSelectedObjects(
	bool includeLights,
	bool includeGrips
)
Public Function GetSelectedObjects (
	includeLights As Boolean,
	includeGrips As Boolean
) As IEnumerable(Of RhinoObject)
Parameters
includeLights
Type: System.Boolean
[Missing <param name="includeLights"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjects(System.Boolean,System.Boolean)"]
includeGrips
Type: System.Boolean
[Missing <param name="includeGrips"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjects(System.Boolean,System.Boolean)"]
Return Value
Type: IEnumerable<RhinoObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjects(System.Boolean,System.Boolean)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace