RhinoCommon API
IStackedDialogPageService.GetNativePageWindow Method (Object, Object, Object)
 Get the unmanaged pointer associated with the pages content control
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IntPtr GetNativePageWindow(
	Object pageObject,
	out Object nativeWindowObject,
	out Object host
)
Function GetNativePageWindow (
	pageObject As Object,
	<OutAttribute> ByRef nativeWindowObject As Object,
	<OutAttribute> ByRef host As Object
) As IntPtr
Parameters
pageObject
Type: System.Object
[Missing <param name="pageObject"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Object@,System.Object@)"]
nativeWindowObject
Type: System.Object
[Missing <param name="nativeWindowObject"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Object@,System.Object@)"]
host
Type: System.Object
[Missing <param name="host"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Object@,System.Object@)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Object@,System.Object@)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
IStackedDialogPageService Interface
GetNativePageWindow Overload
Rhino.UI Namespace