RhinoCommon API
ObjectTable.AddExplodedInstancePieces Method (InstanceObject)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] AddExplodedInstancePieces(
	InstanceObject instance
)
Public Function AddExplodedInstancePieces (
	instance As InstanceObject
) As Guid()
Parameters
instance
Type: Rhino.DocObjects.InstanceObject
[Missing <param name="instance"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject)"]
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
ObjectTable Class
AddExplodedInstancePieces Overload
Rhino.DocObjects.Tables Namespace