RhinoCommon API
GumballDisplayConduit.Dispose Method
Releases all resources used by the GumballDisplayConduit
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GumballDisplayConduit Class
Dispose Overload
Rhino.UI.Gumball Namespace