RhinoCommon API
MeshFaceList.AdjacentFaces Method
 Gets all faces that share a topological edge with a given face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] AdjacentFaces(
	int faceIndex
)
Public Function AdjacentFaces (
	faceIndex As Integer
) As Integer()
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Int32[]
All indices that share an edge.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace