RhinoCommon API
Quaternion.Subtraction Operator
 Subtracts a quaternion from another one.
This computes the difference of each quaternion coefficient with its correspondant and returns a new result quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion operator -(
	Quaternion a,
	Quaternion b
)
Public Shared Operator - (
	a As Quaternion,
	b As Quaternion
) As Quaternion
Parameters
a
Type: Rhino.Geometry.Quaternion
A quaternion.
b
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Quaternion
A new quaternion.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace