RhinoCommon API
ComponentIndex Constructor
 Construct component index with a specific type/index combination
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex(
	ComponentIndexType type,
	int index
)
Public Sub New (
	type As ComponentIndexType,
	index As Integer
)
Parameters
type
Type: Rhino.Geometry.ComponentIndexType
[Missing <param name="type"/> documentation for "M:Rhino.Geometry.ComponentIndex.#ctor(Rhino.Geometry.ComponentIndexType,System.Int32)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.ComponentIndex.#ctor(Rhino.Geometry.ComponentIndexType,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace