RhinoCommon API
SnapShotsClient.PlugInId Method
 The plug-in id that registers this client.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid PlugInId()
Public MustOverride Function PlugInId As Guid
Return Value
Type: Guid
The plug-in id that registers this client.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace