RhinoCommon API
Layer.UnsetPersistentLocking Method
 Remove any explicity persistent locking settings from this layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UnsetPersistentLocking()
Public Sub UnsetPersistentLocking
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Layer Class
Rhino.DocObjects Namespace