RhinoCommon SDK
ParticleSystem.Clear Method
 Remove all Particles from this system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void Clear()
Public Overridable Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace