RhinoCommon SDK
GeometryBase.DuplicateShallow Method
 Constructs a light copy of this object. By "light", it is meant that the same underlying data is used until something is done to attempt to change it. For example, you could have a shallow copy of a very heavy mesh object and the same underlying data will be used when doing things like inspecting the number of faces on the mesh. If you modify the location of one of the mesh vertices, the shallow copy will create a full duplicate of the underlying mesh data and the shallow copy will become a deep copy.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GeometryBase DuplicateShallow()
Public Function DuplicateShallow As GeometryBase
Return Value
Type: GeometryBase
An object of the same type as this object.
This behavior is overridden by implementing classes.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace