RhinoCommon API
Interpolator Constructor (Int32)
 Constructs an empty Interpolator with a certain capacity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interpolator(
	int initialCapacity
)
Public Sub New (
	initialCapacity As Integer
)
Parameters
initialCapacity
Type: System.Int32
Number of items this interpolator can store without resizing.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace