RhinoCommon SDK
Mesh.CreateBooleanUnion Method
 Computes the solid union of a set of meshes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh[] CreateBooleanUnion(
	IEnumerable<Mesh> meshes
)
Public Shared Function CreateBooleanUnion (
	meshes As IEnumerable(Of Mesh)
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to union.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace