RhinoCommon SDK
DisplayPipeline.DrawCone Method (Cone, Color)
 Draw a wireframe cone.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawCone(
	Cone cone,
	Color color
)
Public Sub DrawCone (
	cone As Cone,
	color As Color
)
Parameters
cone
Type: Rhino.Geometry.Cone
Cone to draw.
color
Type: System.Drawing.Color
Color to draw with.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
DrawCone Overload
Rhino.Display Namespace