RhinoCommon SDK
IRhRdkThumbnail.IsSelected Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.IsSelected"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool IsSelected()
Function IsSelected As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.IsSelected"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls Namespace