RhinoCommon API
Vector3d.Addition Operator
 Sums up two vectors.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d operator +(
	Vector3d vector1,
	Vector3d vector2
)
Public Shared Operator + (
	vector1 As Vector3d,
	vector2 As Vector3d
) As Vector3d
Parameters
vector1
Type: Rhino.Geometry.Vector3d
A vector.
vector2
Type: Rhino.Geometry.Vector3d
A second vector.
Return Value
Type: Vector3d
A new vector that results from the componentwise addition of the two vectors.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace