RhinoCommon API
SmartTrackSettings.GetDefaultState Method
 Gets the Smart Track factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static SmartTrackSettingsState GetDefaultState()
Public Shared Function GetDefaultState As SmartTrackSettingsState
Return Value
Type: SmartTrackSettingsState
A new Smart Track state with factory settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace