RhinoCommon SDK
Material.SetBumpTexture Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetBumpTexture(
	string filename
)
Public Function SetBumpTexture (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetBumpTexture(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
SetBumpTexture Overload
Rhino.DocObjects Namespace