RhinoCommon SDK
Plane.Transform Method
 Transform the plane with a Transformation matrix.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply to plane.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace