RhinoCommon API
RhinoApp.ExecuteCommand Method (RhinoDoc, String)
 Execute a Rhino command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result ExecuteCommand(
	RhinoDoc document,
	string commandName
)
Public Shared Function ExecuteCommand (
	document As RhinoDoc,
	commandName As String
) As Result
Parameters
document
Type: Rhino.RhinoDoc
Document to execute the command for
commandName
Type: System.String
Name of command to run. Use command's localized name or preface with an underscore.
Return Value
Type: Result
Returns the reult of the command.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoApp Class
ExecuteCommand Overload
Rhino Namespace