RhinoCommon API
Curve.ProjectToPlane Method
 Constructs a curve by projecting an existing curve to a plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve ProjectToPlane(
	Curve curve,
	Plane plane
)
Public Shared Function ProjectToPlane (
	curve As Curve,
	plane As Plane
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
A curve.
plane
Type: Rhino.Geometry.Plane
A plane.
Return Value
Type: Curve
The projected curve on success; null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Curve Class
Rhino.Geometry Namespace