RhinoCommon SDK
RenderContentCollection.SetKind Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.SetKind(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetKind(
	string kind
)
Public Sub SetKind (
	kind As String
)
Parameters
kind
Type: System.String
[Missing <param name="kind"/> documentation for "M:Rhino.Render.RenderContentCollection.SetKind(System.String)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace