RhinoCommon SDK
BrepFace.PullPointsToFace Method
 Pulls one or more points to a brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] PullPointsToFace(
	IEnumerable<Point3d> points,
	double tolerance
)
Public Function PullPointsToFace (
	points As IEnumerable(Of Point3d),
	tolerance As Double
) As Point3d()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to pull.
tolerance
Type: System.Double
Tolerance for pulling operation. Only points that are closer than tolerance will be pulled to the face.
Return Value
Type: Point3d[]
An array of pulled points.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace