RhinoCommon SDK
ObjectTable.Replace Method (Guid, Surface)
Replaces one object with new surface object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	Surface surface
)
Public Function Replace (
	objectId As Guid,
	surface As Surface
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
surface
Type: Rhino.Geometry.Surface
 new surface to be added A duplicate of the surface is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace