RhinoCommon SDK
SubD.SubDTypeFromInt Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.SubDTypeFromInt(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static SubD.SubDType SubDTypeFromInt(
	int subdTypeAsInt
)
Public Shared Function SubDTypeFromInt (
	subdTypeAsInt As Integer
) As SubD.SubDType
Parameters
subdTypeAsInt
Type: System.Int32
[Missing <param name="subdTypeAsInt"/> documentation for "M:Rhino.Geometry.SubD.SubDTypeFromInt(System.Int32)"]
Return Value
Type: SubD.SubDType
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.SubDTypeFromInt(System.Int32)"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace