RhinoCommon SDK
SubDVertexSectorIterator.Duplicate Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Duplicate"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexSectorIterator Duplicate()
Public Function Duplicate As SubDVertexSectorIterator
Return Value
Type: SubDVertexSectorIterator
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.Duplicate"]
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace