RhinoCommon API
UserDataListEnumerator.Reset Method
 Reset the enumerator
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Reset()
Public Sub Reset
Implements
IEnumerator.Reset()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace