RhinoCommon API
Mesh.Id Method
 Get the Object Guid this mesh is for.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
Guid of parent object.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace