RhinoCommon API
Material.SetTransparencyTexture Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTransparencyTexture(
	string filename
)
Public Function SetTransparencyTexture (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Material Class
SetTransparencyTexture Overload
Rhino.DocObjects Namespace