RhinoCommon SDK
SubDEdgeDirPair Constructor
Initializes a new instance of the SubDEdgeDirPair class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgeDirPair(
	SubDEdgePtr value,
	bool flipped
)
Public Sub New (
	value As SubDEdgePtr,
	flipped As Boolean
)
Parameters
value
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="value"/> documentation for "M:Rhino.Geometry.SubDEdgeDirPair.#ctor(Rhino.Geometry.SubDEdgePtr,System.Boolean)"]
flipped
Type: System.Boolean
[Missing <param name="flipped"/> documentation for "M:Rhino.Geometry.SubDEdgeDirPair.#ctor(Rhino.Geometry.SubDEdgePtr,System.Boolean)"]
See Also
Reference
SubDEdgeDirPair Structure
Rhino.Geometry Namespace