RhinoCommon API
ContentCollectionIterator.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.ContentCollectionIterator.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace