RhinoCommon API
IPanel.PanelHidden Method (UInt32)
[Missing <summary> documentation for "M:Rhino.UI.IPanel.PanelHidden(System.UInt32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void PanelHidden(
	uint documentSerialNumber
)
Sub PanelHidden (
	documentSerialNumber As UInteger
)
Parameters
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanel.PanelHidden(System.UInt32)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
IPanel Interface
PanelHidden Overload
Rhino.UI Namespace