RhinoCommon API
ObjectTable.Replace Method (Guid, Polyline)
Replaces one object with new curve object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	Guid objectId,
	Polyline polyline
)
Public Function Replace (
	objectId As Guid,
	polyline As Polyline
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
polyline
Type: Rhino.Geometry.Polyline
new polyline to be added. The polyline is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace