RhinoCommon API
BinaryArchiveReader.ReadFont Method
 Reads a Font from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Font ReadFont()
Public Function ReadFont As Font
Return Value
Type: Font
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace