RhinoCommon API
BoundingBox Constructor (IEnumerable<Point3d>, Transform)
 Constructs a boundingbox from a collection of points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox(
	IEnumerable<Point3d> points,
	Transform xform
)
Public Sub New (
	points As IEnumerable(Of Point3d),
	xform As Transform
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to include in the boundingbox.
xform
Type: Rhino.Geometry.Transform
Transformation.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
BoundingBox Structure
BoundingBox Overload
Rhino.Geometry Namespace