RhinoCommon API
LinetypeTable.LoadDefaultLinetypes Method
 Fills in the linetype table with any default linetypes not already included.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LoadDefaultLinetypes()
Public Function LoadDefaultLinetypes As Integer
Return Value
Type: Int32
The number of default linetypes added to the linetype table.
Remarks
 New documents only contain the continuous linetype. Other default linetypes are added, on demand, when the user needs them. Calling this function ensures that the linetype table is populated with the default linetypes.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace