RhinoCommon API
BezierCurve.GetControlVertex2d Method
Get location of a control vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d GetControlVertex2d(
	int index
)
Public Function GetControlVertex2d (
	index As Integer
) As Point2d
Parameters
index
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount)
Return Value
Type: Point2d
 If the bezier is rational, the euclidean location is returned.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | when index is out of range
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace