RhinoCommon API
Point4d.Subtraction Operator
 Subtracts the second point from the first point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point4d operator -(
	Point4d point1,
	Point4d point2
)
Public Shared Operator - (
	point1 As Point4d,
	point2 As Point4d
) As Point4d
Parameters
point1
Type: Rhino.Geometry.Point4d
First point.
point2
Type: Rhino.Geometry.Point4d
Second point.
Return Value
Type: Point4d
A new point that results from the weighted subtraction of point2 from point1.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace