RhinoCommon API
PolyCurve.RemoveNesting Method
 Explodes nested polycurve segments and reconstructs this curve from the shattered remains. The result will have not have any PolyCurves as segments but it will have identical locus and parameterization.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemoveNesting()
Public Function RemoveNesting As Boolean
Return Value
Type: Boolean
 true if any nested PolyCurve was found and absorbed, false if no PolyCurve segments could be found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace
PolyCurve.IsNested