RhinoCommon API
TextureGraphInfo Constructor
Initializes a new instance of the TextureGraphInfo class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureGraphInfo()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace