RhinoCommon API
SimpleArray2dex.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SimpleArray2dex Class
Rhino.Runtime.InteropWrappers Namespace