RhinoCommon API
SelCommand.SelFilter Method
 Override this virtual function and return true if object should be selected.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract bool SelFilter(
	RhinoObject rhObj
)
Protected MustOverride Function SelFilter (
	rhObj As RhinoObject
) As Boolean
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
The object to check regarding selection status.
Return Value
Type: Boolean
true if the object should be selected; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
SelCommand Class
Rhino.Commands Namespace