RhinoCommon API
PythonScript.SetupScriptContext Method
 Setups the script context. Use a RhinoDoc instance unless unsure.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void SetupScriptContext(
	Object doc
)
Public Overridable Sub SetupScriptContext (
	doc As Object
)
Parameters
doc
Type: System.Object
Document.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace