RhinoCommon API
File3dmGroupTable.FindName Method
 Finds a Group given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Group FindName(
	string name
)
Public Function FindName (
	name As String
) As Group
Parameters
name
Type: System.String
The name of the Group to be searched.
Return Value
Type: Group
A Group, or null on error.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace