RhinoCommon SDK
ViewTable.GetStandardRhinoViews Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ViewTable.GetStandardRhinoViews"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoView[] GetStandardRhinoViews()
Public Function GetStandardRhinoViews As RhinoView()
Return Value
Type: RhinoView[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ViewTable.GetStandardRhinoViews"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace