RhinoCommon API
GroupTable.FindIndex Method
 Retrieves a Group object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Group FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Group
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Group
A Group object, or null if none was found.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace