RhinoCommon SDK
IRhRdkThumbnail.Id Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.Id"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Guid Id()
Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnail.Id"]
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls Namespace