RhinoCommon SDK
ColorLCH Implicit Conversion (ColorLCH to Color)
 Implicitly converts a LCH color into a .Net library color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator Color (
	ColorLCH lch
)
Public Shared Widening Operator CType (
	lch As ColorLCH
) As Color
Parameters
lch
Type: Rhino.Display.ColorLCH
A LCH color.
Return Value
Type: Color
A ARGB .Net library color.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace