RhinoCommon SDK
File3dmObjectTable.AddCircle Method (Circle)
Adds a curve object to the document representing a circle.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddCircle(
	Circle circle
)
Public Function AddCircle (
	circle As Circle
) As Guid
Parameters
circle
Type: Rhino.Geometry.Circle
A circle to add.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddCircle Overload
Rhino.FileIO Namespace