RhinoCommon API
FileSettings.RecentlyOpenedFiles Method
 Returns a list of recently opened files. Note that this function does not check to make sure that these files still exist.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] RecentlyOpenedFiles()
Public Shared Function RecentlyOpenedFiles As String()
Return Value
Type: String[]
An array of strings with the paths to the recently opened files.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace