RhinoCommon API
Sun.SetPosition Method (DateTime, Double, Double)
 Sets position of the sun based on physical location and time.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPosition(
	DateTime when,
	double latitudeDegrees,
	double longitudeDegrees
)
Public Sub SetPosition (
	when As DateTime,
	latitudeDegrees As Double,
	longitudeDegrees As Double
)
Parameters
when
Type: System.DateTime
A DateTime instance.
If the date Kind is DateTimeKind.Local, or DateTimeKind.Unspecified, the date is considered local.
latitudeDegrees
Type: System.Double
The latitude, in degrees, of the location on Earth.
longitudeDegrees
Type: System.Double
The longitude, in degrees, of the location on Earth.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Sun Class
SetPosition Overload
Rhino.Render Namespace