RhinoCommon API
Plane.Translate Method
 Translate (move) the plane along a vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Translate(
	Vector3d delta
)
Public Function Translate (
	delta As Vector3d
) As Boolean
Parameters
delta
Type: Rhino.Geometry.Vector3d
Translation (motion) vector.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Plane Structure
Rhino.Geometry Namespace