RhinoCommon SDK
NurbsCurvePointList.MakeRational Method
 Turns the curve into a Rational nurbs curve.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace