RhinoCommon API
SimpleArrayBinaryArchiveReader.Get Method
 Get the Guid at index
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BinaryArchiveReader Get(
	int index
)
Public Function Get (
	index As Integer
) As BinaryArchiveReader
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Get(System.Int32)"]
Return Value
Type: BinaryArchiveReader
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Get(System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace