RhinoCommon SDK
GetBaseClass.CustomMessage Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.CustomMessage"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Object CustomMessage()
Public Function CustomMessage As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.CustomMessage"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace