RhinoCommon API
SimpleArrayUint Constructor (IEnumerable<UInt32>)
 Initializes a new SimpleArrayInt class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayUint(
	IEnumerable<uint> values
)
Public Sub New (
	values As IEnumerable(Of UInteger)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<UInt32>
A list, an array or any collection of unsigned ints that implements the enumerable interface.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
SimpleArrayUint Class
SimpleArrayUint Overload
Rhino.Runtime.InteropWrappers Namespace