RhinoCommon API
BinaryArchiveWriter.WriteVector2d Method
 Writes a Vector2d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteVector2d(
	Vector2d value
)
Public Sub WriteVector2d (
	value As Vector2d
)
Parameters
value
Type: Rhino.Geometry.Vector2d
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace