RhinoCommon API
Box.Union Method
 Constructs a union between this Box and the given point. This grows the box in directions so it contains the point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Union(
	Point3d point
)
Public Sub Union (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to include.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Box Structure
Rhino.Geometry Namespace