RhinoCommon API
Layer.GetChildren Method
 Gets immediate children of this layer. Note that child layers may have their own children.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer[] GetChildren()
Public Function GetChildren As Layer()
Return Value
Type: Layer[]
Array of child layers. null if this layer does not have any children.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Layer Class
Rhino.DocObjects Namespace