RhinoCommon SDK
ChangeQueue.MaterialFromId Method
 Get the RenderMaterial from the ChangeQueue material cache based on RenderHash
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterial MaterialFromId(
	uint crc
)
Public Function MaterialFromId (
	crc As UInteger
) As RenderMaterial
Parameters
crc
Type: System.UInt32
The RenderHash
Return Value
Type: RenderMaterial
RenderMaterial
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace