RhinoCommon SDK
Mesh.CreateFromClosedPolyline Method
 Attempts to create a Mesh that is a triangulation of a closed polyline
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromClosedPolyline(
	Polyline polyline
)
Public Shared Function CreateFromClosedPolyline (
	polyline As Polyline
) As Mesh
Parameters
polyline
Type: Rhino.Geometry.Polyline
must be closed
Return Value
Type: Mesh
 New mesh on success or null on failure.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace