RhinoCommon API
ArchivableDictionary.GetPoint3d Method (String)
 Get value as Point3d, will only succeed if value was created using Set(string key, Point3d value)
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d GetPoint3d(
	string key
)
Public Function GetPoint3d (
	key As String
) As Point3d
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3d(System.String)"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3d(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ArchivableDictionary Class
GetPoint3d Overload
Rhino.Collections Namespace