RhinoCommon SDK
GetBaseClass.AddOption Method (LocalizeStringPair)
 Adds a command line option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddOption(
	LocalizeStringPair optionName
)
Public Function AddOption (
	optionName As LocalizeStringPair
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
 Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
Return Value
Type: Int32
 option index value (>0) or 0 if option cannot be added.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetBaseClass Class
AddOption Overload
Rhino.Input.Custom Namespace