RhinoCommon SDK
SubDVertexPtr.EdgeFlipAt Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeFlipAt(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool EdgeFlipAt(
	int index
)
Public Function EdgeFlipAt (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeFlipAt(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeFlipAt(System.Int32)"]
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace