RhinoCommon API
StatusBar.SetMessagePane Method
 Sets the message pane to a message.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetMessagePane(
	string message
)
Public Shared Sub SetMessagePane (
	message As String
)
Parameters
message
Type: System.String
The message value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
StatusBar Class
Rhino.UI Namespace