RhinoCommon API
SimpleArrayLinetypePointer Constructor
 Initializes a new SimpleArrayLinetypePointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayLinetypePointer()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimpleArrayLinetypePointer Class
Rhino.Runtime.InteropWrappers Namespace