RhinoCommon API
SimpleArraySurfacePointer Constructor
 Initializes a new SimpleArraySurfacePointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArraySurfacePointer()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
SimpleArraySurfacePointer Class
Rhino.Runtime.InteropWrappers Namespace