RhinoCommon API
CustomDisplay.AddCurve Method (Curve)
 Adds a new, black curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddCurve(
	Curve curve
)
Public Sub AddCurve (
	curve As Curve
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to add.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
CustomDisplay Class
AddCurve Overload
Rhino.Display Namespace