RhinoCommon API
TextureGraphInfo.AmountU Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.AmountU"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AmountU()
Public Function AmountU As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.TextureGraphInfo.AmountU"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace