RhinoCommon API
ObjectAttributes.RemoveFromGroup Method
 removes object from the group with specified index.
If the object is not in the group, nothing is changed.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveFromGroup(
	int groupIndex
)
Public Sub RemoveFromGroup (
	groupIndex As Integer
)
Parameters
groupIndex
Type: System.Int32
The index that will be removed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace