RhinoCommon API
Surface.IsIsoparametric Method (Curve)
 Determines if a 2d curve is iso-parameteric in the parameter space of this surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IsoStatus IsIsoparametric(
	Curve curve
)
Public Function IsIsoparametric (
	curve As Curve
) As IsoStatus
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to test.
Return Value
Type: IsoStatus
IsoStatus flag describing the iso-parametric relationship between the surface and the curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Surface Class
IsIsoparametric Overload
Rhino.Geometry Namespace