RhinoCommon API
ColorHSL Constructor (Color)
 Constructs a new instance of ColorHSL that is equivalent to an RGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorHSL(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
RGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ColorHSL Structure
ColorHSL Overload
Rhino.Display Namespace