RhinoCommon API
Polyline.Smooth Method
 Smoothens the polyline segments by averaging adjacent vertices. Smoothing requires a polyline with exclusively valid vertices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Smooth(
	double amount
)
Public Function Smooth (
	amount As Double
) As Boolean
Parameters
amount
Type: System.Double
Amount to smooth. Zero equals no smoothing, one equals complete smoothing.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Polyline Class
Rhino.Geometry Namespace