RhinoCommon API
ColorHSL.ToArgbColor Method
 Convert HSL color to an equivalent System.Drawing.Color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ToArgbColor()
Public Function ToArgbColor As Color
Return Value
Type: Color
A .Net framework library color value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace