RhinoCommon API
File3dmObjectTable.AddPoint Method (Point3d)
Adds a point object to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPoint(
	Point3d point
)
Public Function AddPoint (
	point As Point3d
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3d
A location for point.
Return Value
Type: Guid
Id of new object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace