RhinoCommon API
CurvatureAnalysisSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CurvatureAnalysisSettingsState GetDefaultState()
Public Shared Function GetDefaultState As CurvatureAnalysisSettingsState
Return Value
Type: CurvatureAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetDefaultState"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace