RhinoCommon API
GroupTable.FindNameHash Method
 Finds a Linetype given its name hash.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Group FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As Group
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the Linetype to be searched.
Return Value
Type: Group
An Linetype, or null on error.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace