RhinoCommon SDK
TwoColorRenderTexture Constructor
Initializes a new instance of the TwoColorRenderTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected TwoColorRenderTexture()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace