RhinoCommon API
NurbsCurveKnotList.Contains Method
 Returns an indication of the presence of a value in the knot list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	double item
)
Public Function Contains (
	item As Double
) As Boolean
Parameters
item
Type: System.Double
The item.
Return Value
Type: Boolean
true if present, false otherwise.
Implements
ICollection<T>.Contains(T)
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace