RhinoCommon API
RhinoViewport.KeyboardDolly Method
 Emulates the keyboard arrow key in terms of interaction.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool KeyboardDolly(
	bool leftRight,
	double amount
)
Public Function KeyboardDolly (
	leftRight As Boolean,
	amount As Double
) As Boolean
Parameters
leftRight
Type: System.Boolean
left/right dolly if true, up/down dolly if false.
amount
Type: System.Double
The dolly amount.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace