RhinoCommon API
DisplayPipeline.DrawDottedPolyline Method
 Draws a set of connected lines (polyline) in a dotted pattern (0x00001111).
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawDottedPolyline(
	IEnumerable<Point3d> points,
	Color color,
	bool close
)
Public Sub DrawDottedPolyline (
	points As IEnumerable(Of Point3d),
	color As Color,
	close As Boolean
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
End points of each line segment.
color
Type: System.Drawing.Color
Color of polyline.
close
Type: System.Boolean
Draw a line between the first and last points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace