RhinoCommon API
NurbsCurveKnotList.CreatePeriodicKnots Method
 Compute a clamped, uniform, periodic knot vector based on the current degree and control point count. Does not change values of control vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CreatePeriodicKnots(
	double knotSpacing
)
Public Function CreatePeriodicKnots (
	knotSpacing As Double
) As Boolean
Parameters
knotSpacing
Type: System.Double
Spacing of subsequent knots.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace