RhinoCommon SDK
MeshingParameters Constructor (Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters(
	double density
)
Public Sub New (
	density As Double
)
Parameters
density
Type: System.Double
 The density and number of mesh polygons, where 0.0 <= density <= 1.0, where 0 quickly creates coarse meshes, and 1 slowly creates dense meshes.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshingParameters Class
MeshingParameters Overload
Rhino.Geometry Namespace