RhinoCommon API
GetTransform Constructor
Initializes a new instance of the GetTransform class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected GetTransform()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace