RhinoCommon SDK
SubDFacePtr.Equals Method (SubDFacePtr)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.Equals(Rhino.Geometry.SubDFacePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Equals(
	SubDFacePtr other
)
Public Function Equals (
	other As SubDFacePtr
) As Boolean
Parameters
other
Type: Rhino.Geometry.SubDFacePtr
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.SubDFacePtr.Equals(Rhino.Geometry.SubDFacePtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.Equals(Rhino.Geometry.SubDFacePtr)"]
Implements
IEquatable<T>.Equals(T)
See Also
Reference
SubDFacePtr Structure
Equals Overload
Rhino.Geometry Namespace