RhinoCommon API
TextEntity.Explode Method
 Explodes this text entity into an array of curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] Explode()
Public Function Explode As Curve()
Return Value
Type: Curve[]
An array of curves that forms the outline or content of this text entity.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace