RhinoCommon SDK
UserData.OnDuplicate Method
 Is called when the object is being duplicated.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnDuplicate(
	UserData source
)
Protected Overridable Sub OnDuplicate (
	source As UserData
)
Parameters
source
Type: Rhino.DocObjects.Custom.UserData
The source data.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace