RhinoCommon SDK
Transform.ToFloatArray Method
 Return the matrix as a linear array of 16 float values
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float[] ToFloatArray(
	bool rowDominant
)
Public Function ToFloatArray (
	rowDominant As Boolean
) As Single()
Parameters
rowDominant
Type: System.Boolean
[Missing <param name="rowDominant"/> documentation for "M:Rhino.Geometry.Transform.ToFloatArray(System.Boolean)"]
Return Value
Type: Single[]
[Missing <returns> documentation for "M:Rhino.Geometry.Transform.ToFloatArray(System.Boolean)"]
See Also
Reference
Transform Structure
Rhino.Geometry Namespace