RhinoCommon SDK
MeshVertexColorList.AppendColors Method
 Appends a collection of colors to the vertex color list. For the Mesh to be valid, the number of colors must match the number of vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AppendColors(
	Color[] colors
)
Public Function AppendColors (
	colors As Color()
) As Boolean
Parameters
colors
Type: System.Drawing.Color[]
Colors to append.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace