RhinoCommon API
SupportOptions.LightPreviewCheckerColor Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LightPreviewCheckerColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int LightPreviewCheckerColor()
Public Shared Function LightPreviewCheckerColor As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LightPreviewCheckerColor"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SupportOptions Class
Rhino.Render Namespace