RhinoCommon API
Sun.TwilightZone Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.TwilightZone"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double TwilightZone()
Public Shared Function TwilightZone As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.Sun.TwilightZone"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Sun Class
Rhino.Render Namespace