RhinoCommon SDK
SubDVertexPtr.EdgeAt Method (Int32, Boolean)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeAt(System.Int32,System.Boolean@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr EdgeAt(
	int index,
	out bool flipped
)
Public Function EdgeAt (
	index As Integer,
	<OutAttribute> ByRef flipped As Boolean
) As SubDEdgePtr
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeAt(System.Int32,System.Boolean@)"]
flipped
Type: System.Boolean
[Missing <param name="flipped"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeAt(System.Int32,System.Boolean@)"]
Return Value
Type: SubDEdgePtr
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexPtr.EdgeAt(System.Int32,System.Boolean@)"]
See Also
Reference
SubDVertexPtr Structure
EdgeAt Overload
Rhino.Geometry Namespace