RhinoCommon API
Line.GetHashCode Method
 Computes a hash number that represents this line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A number that is not unique to the value of this line.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Line Structure
Rhino.Geometry Namespace