RhinoCommon SDK
IStackedDialogPageService.AddChildPage Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.AddChildPage(Rhino.UI.StackedDialogPage,System.IntPtr)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool AddChildPage(
	StackedDialogPage page,
	IntPtr pageToAdd
)
Function AddChildPage (
	page As StackedDialogPage,
	pageToAdd As IntPtr
) As Boolean
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.AddChildPage(Rhino.UI.StackedDialogPage,System.IntPtr)"]
pageToAdd
Type: System.IntPtr
[Missing <param name="pageToAdd"/> documentation for "M:Rhino.UI.IStackedDialogPageService.AddChildPage(Rhino.UI.StackedDialogPage,System.IntPtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.AddChildPage(Rhino.UI.StackedDialogPage,System.IntPtr)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace