RhinoCommon API
UserDataListEnumerator.Dispose Method
 Implement Dispose(). NOP.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace