RhinoCommon SDK
IRhRdkThumbnailList.GetSize Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.GetSize"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IRhRdkContentThumbnailList_Sizes GetSize()
Function GetSize As IRhRdkContentThumbnailList_Sizes
Return Value
Type: IRhRdkContentThumbnailList_Sizes
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.GetSize"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace