RhinoCommon SDK
TextLog Constructor (String)
 Creates a text log that writes all text to a file. If no filename is provided, then text is written to StdOut
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextLog(
	string filename
)
Public Sub New (
	filename As String
)
Parameters
filename
Type: System.String
 Name of file to create and write to. If null, then text output is sent to StdOut
See Also
Reference
TextLog Class
TextLog Overload
Rhino.FileIO Namespace