RhinoCommon API
GetBaseClass.Line2d Method
 Returns two points defining the location in the view window of the 2d line selected in GetPoint::Get2dLine().
(0,0) = upper left corner of window.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point[] Line2d()
Public Function Line2d As Point()
Return Value
Type: Point[]
An array with two 2D points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace