RhinoCommon API
RenderContentCollection Constructor
Initializes a new instance of the RenderContentCollection class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentCollection()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContentCollection Class
RenderContentCollection Overload
Rhino.Render Namespace