RhinoCommon API
ObjRef.TextDot Method
 Gets the text dot if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextDot TextDot()
Public Function TextDot As TextDot
Return Value
Type: TextDot
A text dot; or null if the referenced object is not a text dot, or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace