RhinoCommon API
MeshVertexList.GetVertexFaces Method
 Gets a list of all of the faces that share a given vertex.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] GetVertexFaces(
	int vertexIndex
)
Public Function GetVertexFaces (
	vertexIndex As Integer
) As Integer()
Parameters
vertexIndex
Type: System.Int32
The index of a vertex in the mesh.
Return Value
Type: Int32[]
An array of indices of faces on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace