RhinoCommon SDK
MouseCallback.OnMouseLeave Method
[Missing <summary> documentation for "M:Rhino.UI.MouseCallback.OnMouseLeave(Rhino.Display.RhinoView)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnMouseLeave(
	RhinoView view
)
Protected Overridable Sub OnMouseLeave (
	view As RhinoView
)
Parameters
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.UI.MouseCallback.OnMouseLeave(Rhino.Display.RhinoView)"]
See Also
Reference
MouseCallback Class
Rhino.UI Namespace