RhinoCommon API
BinaryArchiveWriter.WriteLine Method
 Writes a Line value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteLine(
	Line value
)
Public Sub WriteLine (
	value As Line
)
Parameters
value
Type: Rhino.Geometry.Line
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace