RhinoCommon API
Brep.CullUnused2dCurves Method
Culls 3d curves not referenced by an edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullUnused2dCurves()
Public Function CullUnused2dCurves As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Brep Class
Rhino.Geometry Namespace