RhinoCommon API
ClassArrayString.Add Method
 Adds a string to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	string s
)
Public Sub Add (
	s As String
)
Parameters
s
Type: System.String
A string to add.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace