RhinoCommon API
InstanceDefinition.GetContainers Method
 Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinition[] GetContainers()
Public Function GetContainers As InstanceDefinition()
Return Value
Type: InstanceDefinition[]
An array of instance definitions. The returned array can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace