RhinoCommon API
Point3d Explicit Conversion (Vector3d to Point3d)
 Converts a vector in a point, needing casting.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static explicit operator Point3d (
	Vector3d vector
)
Public Shared Narrowing Operator CType (
	vector As Vector3d
) As Point3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Point3d
The resulting point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Point3d Structure
Explicit Overload
Rhino.Geometry Namespace