RhinoCommon API
Point2f.CompareTo Method
 Compares this Point2f with another Point2f.
Coordinates evaluation priority is first X, then Y.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CompareTo(
	Point2f other
)
Public Function CompareTo (
	other As Point2f
) As Integer
Parameters
other
Type: Rhino.Geometry.Point2f
The other Point2f to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Implements
IComparable<T>.CompareTo(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace