RhinoCommon SDK
Thumbnail.Dib Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.Thumbnail.Dib(System.Drawing.Bitmap@)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dib(
	ref Bitmap dibOut
)
Public Sub Dib (
	ByRef dibOut As Bitmap
)
Parameters
dibOut
Type: System.Drawing.Bitmap
[Missing <param name="dibOut"/> documentation for "M:Rhino.UI.Controls.Thumbnail.Dib(System.Drawing.Bitmap@)"]
Implements
IRhRdkThumbnail.Dib(Bitmap)
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace