RhinoCommon SDK
HistoryRecord.SetBrep Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBrep(System.Int32,Rhino.Geometry.Brep)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetBrep(
	int id,
	Brep value
)
Public Function SetBrep (
	id As Integer,
	value As Brep
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBrep(System.Int32,Rhino.Geometry.Brep)"]
value
Type: Rhino.Geometry.Brep
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBrep(System.Int32,Rhino.Geometry.Brep)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBrep(System.Int32,Rhino.Geometry.Brep)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace