RhinoCommon SDK
StringTable.GetValue Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.String)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetValue(
	string key
)
Public Function GetValue (
	key As String
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.String)"]
See Also
Reference
StringTable Class
GetValue Overload
Rhino.DocObjects.Tables Namespace