RhinoCommon API
BinaryArchiveReader.ReadRectangle Method
 Reads a Rectangle from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle ReadRectangle()
Public Function ReadRectangle As Rectangle
Return Value
Type: Rectangle
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace