RhinoCommon SDK
SubDVertexPtr.RemoveEdge Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexPtr.RemoveEdge(Rhino.Geometry.SubDEdgePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void RemoveEdge(
	SubDEdgePtr edge
)
Public Sub RemoveEdge (
	edge As SubDEdgePtr
)
Parameters
edge
Type: Rhino.Geometry.SubDEdgePtr
[Missing <param name="edge"/> documentation for "M:Rhino.Geometry.SubDVertexPtr.RemoveEdge(Rhino.Geometry.SubDEdgePtr)"]
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace