RhinoCommon API
DimensionStyle.CommitChanges Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.CommitChanges"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CommitChanges()
Public Function CommitChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.DimensionStyle.CommitChanges"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace