RhinoCommon API
BinaryArchiveWriter.WriteFont Method
 Writes a Font value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteFont(
	Font value
)
Public Sub WriteFont (
	value As Font
)
Parameters
value
Type: System.Drawing.Font
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace