RhinoCommon API
GetPoint.ClearConstructionPoints Method
 Remove all construction points.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearConstructionPoints()
Public Sub ClearConstructionPoints
Remarks
 Construction points are like snap points except that they get snapped to even when point osnap is off. Typically, there are only a few construction points while there can be many snap points. For example, when polylines are drawn the start point is a construction point and the other points are snap points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace