RhinoCommon API
MeshVertexNormalList.UnitizeNormals Method
 Unitizes all vertex normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UnitizeNormals()
Public Function UnitizeNormals As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace