RhinoCommon API
LayerTable.Find Method (Guid, Boolean, Int32)
Finds a layer with a matching ID.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	Guid layerId,
	bool ignoreDeletedLayers,
	int notFoundReturnValue
)
Public Function Find (
	layerId As Guid,
	ignoreDeletedLayers As Boolean,
	notFoundReturnValue As Integer
) As Integer
Parameters
layerId
Type: System.Guid
A valid layer ID.
ignoreDeletedLayers
Type: System.Boolean
If true, deleted layers are not checked.
notFoundReturnValue
Type: System.Int32
Should be -1 to get the index of the OpenNURBS default layer, or UnsetIntIndex to get an always-out-of-bound value.
Return Value
Type: Int32
The index of the found layer, or notFoundReturnValue.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LayerTable Class
Find Overload
Rhino.DocObjects.Tables Namespace