RhinoCommon API
InstanceDefinitionGeometry.GetObjectIds Method
 list of object ids in the instance geometry table
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] GetObjectIds()
Public Function GetObjectIds As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.Geometry.InstanceDefinitionGeometry.GetObjectIds"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace