RhinoCommon SDK
MeshTopologyEdgeList.GetEdgeIndex Method
 Returns index of edge that connects topological vertices. returns -1 if no edge is found.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int GetEdgeIndex(
	int topologyVertex1,
	int topologyVertex2
)
Public Function GetEdgeIndex (
	topologyVertex1 As Integer,
	topologyVertex2 As Integer
) As Integer
Parameters
topologyVertex1
Type: System.Int32
The first topology vertex index.
topologyVertex2
Type: System.Int32
The second topology vertex index.
Return Value
Type: Int32
The edge index.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace