RhinoCommon API
RenderContent.GetEmbeddedFilesList Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.GetEmbeddedFilesList"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] GetEmbeddedFilesList()
Public Function GetEmbeddedFilesList As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.GetEmbeddedFilesList"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContent Class
Rhino.Render Namespace