RhinoCommon API
ParticleSystem.Remove Method
 Removes a single particle from this system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void Remove(
	Particle particle
)
Public Overridable Sub Remove (
	particle As Particle
)
Parameters
particle
Type: Rhino.Geometry.Particle
The particle to be removed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace