RhinoCommon API
File3dm.ReadArchiveVersion Method
 Reads only the archive 3dm version from an existing 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int ReadArchiveVersion(
	string path
)
Public Shared Function ReadArchiveVersion (
	path As String
) As Integer
Parameters
path
Type: System.String
The file from which to read the archive version.
Return Value
Type: Int32
The 3dm file archive version.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist, is null or cannot be accessed because of permissions.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
File3dm Class
Rhino.FileIO Namespace