RhinoCommon API
FileImportPlugIn Constructor
Initializes a new instance of the FileImportPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected FileImportPlugIn()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
FileImportPlugIn Class
Rhino.PlugIns Namespace