RhinoCommon API
CustomDisplay.AddCircle Method (Circle, Color, Int32)
 Adds a new, colored circle to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddCircle(
	Circle circle,
	Color color,
	int thickness
)
Public Sub AddCircle (
	circle As Circle,
	color As Color,
	thickness As Integer
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to add.
color
Type: System.Drawing.Color
Color of circle.
thickness
Type: System.Int32
Thickness of circle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomDisplay Class
AddCircle Overload
Rhino.Display Namespace