RhinoCommon API
MeshVertexNormalList.Add Method (Double, Double, Double)
 Adds a new vertex normal at the end of the list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	double x,
	double y,
	double z
)
Public Function Add (
	x As Double,
	y As Double,
	z As Double
) As Integer
Parameters
x
Type: System.Double
X component of new vertex normal.
y
Type: System.Double
Y component of new vertex normal.
z
Type: System.Double
Z component of new vertex normal.
Return Value
Type: Int32
The index of the newly added vertex normal.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshVertexNormalList Class
Add Overload
Rhino.Geometry.Collections Namespace