RhinoCommon API
RevSurface.CreateFromSphere Method
 Constructs a new surface of revolution from the values of a sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RevSurface CreateFromSphere(
	Sphere sphere
)
Public Shared Function CreateFromSphere (
	sphere As Sphere
) As RevSurface
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere.
Return Value
Type: RevSurface
A new surface of revolution, or null if any of the inputs is invalid or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace