RhinoCommon API
RTree.Clear Method
 Removes all elements.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RTree Class
Rhino.Geometry Namespace