RhinoCommon API
RhinoDoc.SupportsRenderPrimitiveList Method
 Determines if custom render meshes will be built for this document (ie - GH meshes).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SupportsRenderPrimitiveList(
	ViewportInfo viewport,
	DisplayPipelineAttributes attrs
)
Public Function SupportsRenderPrimitiveList (
	viewport As ViewportInfo,
	attrs As DisplayPipelineAttributes
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
 Type of mesh to build. If attrs is non-null then a smaller mesh may be generated in less time, false is meant when actually rendering.
Return Value
Type: Boolean
 Returns true if custom render mesh(es) will get built for this document.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoDoc Class
Rhino Namespace