RhinoCommon SDK
PanelEventArgs Constructor
Initializes a new instance of the PanelEventArgs class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PanelEventArgs(
	Guid panelId,
	uint documentSerialNumber
)
Public Sub New (
	panelId As Guid,
	documentSerialNumber As UInteger
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.PanelEventArgs.#ctor(System.Guid,System.UInt32)"]
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.PanelEventArgs.#ctor(System.Guid,System.UInt32)"]
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace