RhinoCommon API
BinaryArchiveWriter.WriteMeshingParameters Method
 Writes a MeshingParameters value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteMeshingParameters(
	MeshingParameters value
)
Public Sub WriteMeshingParameters (
	value As MeshingParameters
)
Parameters
value
Type: Rhino.Geometry.MeshingParameters
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace