RhinoCommon API
GetObject.ClearObjects Method
 Clear possible special object drawing
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearObjects()
Public Sub ClearObjects
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace