RhinoCommon API
BezierCurve.PointAt Method
Evaluates point at a curve parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Evaluation parameter.
Return Value
Type: Point3d
Point (location of curve at the parameter t).
Remarks
No error handling.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace