RhinoCommon API
Line.Extend Method
 Extend the line by custom distances on both sides.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Extend(
	double startLength,
	double endLength
)
Public Function Extend (
	startLength As Double,
	endLength As Double
) As Boolean
Parameters
startLength
Type: System.Double
 Distance to extend the line at the start point. Positive distance result in longer lines.
endLength
Type: System.Double
 Distance to extend the line at the end point. Positive distance result in longer lines.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Line Structure
Rhino.Geometry Namespace