RhinoCommon SDK
LinetypeTable.Add Method (String, IEnumerable<Double>)
 Adds a new linetype with specified definition to the linetype table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	string name,
	IEnumerable<double> segmentLengths
)
Public Function Add (
	name As String,
	segmentLengths As IEnumerable(Of Double)
) As Integer
Parameters
name
Type: System.String
A name for the new linetype.
segmentLengths
Type: System.Collections.Generic.IEnumerable<Double>
Positive values are dashes, negative values are gaps.
Return Value
Type: Int32
 Index of new linetype or -1 on error.
See Also
Reference
LinetypeTable Class
Add Overload
Rhino.DocObjects.Tables Namespace