RhinoCommon API
Point2d.Equality Operator
 Determines whether two Point2d have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Point2d a,
	Point2d b
)
Public Shared Operator = (
	a As Point2d,
	b As Point2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point2d
The first point.
b
Type: Rhino.Geometry.Point2d
The second point.
Return Value
Type: Boolean
true if the coordinates of the two points are exactly equal; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace