RhinoCommon API
PreviewBackground.SetEnvironmentInstanceId Method
 SetEnvironmentInstanceId
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetEnvironmentInstanceId(
	Guid guid
)
Public Sub SetEnvironmentInstanceId (
	guid As Guid
)
Parameters
guid
Type: System.Guid
[Missing <param name="guid"/> documentation for "M:Rhino.Render.PreviewBackground.SetEnvironmentInstanceId(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace