RhinoCommon API
AnnotationBase.FirstCharProperties Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool FirstCharProperties(
	string rtf_str,
	ref bool bold,
	ref bool italic,
	ref bool underline,
	ref string facename
)
Public Shared Function FirstCharProperties (
	rtf_str As String,
	ByRef bold As Boolean,
	ByRef italic As Boolean,
	ByRef underline As Boolean,
	ByRef facename As String
) As Boolean
Parameters
rtf_str
Type: System.String
[Missing <param name="rtf_str"/> documentation for "M:Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)"]
bold
Type: System.Boolean
[Missing <param name="bold"/> documentation for "M:Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)"]
italic
Type: System.Boolean
[Missing <param name="italic"/> documentation for "M:Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)"]
underline
Type: System.Boolean
[Missing <param name="underline"/> documentation for "M:Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)"]
facename
Type: System.String
[Missing <param name="facename"/> documentation for "M:Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace