RhinoCommon API
RealtimeDisplayMode Constructor
Initializes a new instance of the RealtimeDisplayMode class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RealtimeDisplayMode()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace