RhinoCommon API
LicenseUtils.LicenseOptionsHandler Method (Guid, Guid, String, Boolean)
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.Guid,System.String,System.Boolean)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool LicenseOptionsHandler(
	Guid pluginId,
	Guid licenseId,
	string productTitle,
	bool standAlone
)
Public Shared Function LicenseOptionsHandler (
	pluginId As Guid,
	licenseId As Guid,
	productTitle As String,
	standAlone As Boolean
) As Boolean
Parameters
pluginId
Type: System.Guid
[Missing <param name="pluginId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.Guid,System.String,System.Boolean)"]
licenseId
Type: System.Guid
[Missing <param name="licenseId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.Guid,System.String,System.Boolean)"]
productTitle
Type: System.String
[Missing <param name="productTitle"/> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.Guid,System.String,System.Boolean)"]
standAlone
Type: System.Boolean
[Missing <param name="standAlone"/> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.Guid,System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.Guid,System.String,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LicenseUtils Class
LicenseOptionsHandler Overload
Rhino.PlugIns Namespace