RhinoCommon API
ViewportInfo.SetCameraLocation Method
 Sets the camera location (position) point.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetCameraLocation(
	Point3d location
)
Public Function SetCameraLocation (
	location As Point3d
) As Boolean
Parameters
location
Type: Rhino.Geometry.Point3d
[Missing <param name="location"/> documentation for "M:Rhino.DocObjects.ViewportInfo.SetCameraLocation(Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace