RhinoCommon API
RevSurface.CreateFromCylinder Method
 Constructs a new surface of revolution from the values of a cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RevSurface CreateFromCylinder(
	Cylinder cylinder
)
Public Shared Function CreateFromCylinder (
	cylinder As Cylinder
) As RevSurface
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
A cylinder.
Return Value
Type: RevSurface
A new surface of revolution, or null if any of the inputs is invalid or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace