RhinoCommon API
RhinoObject.GetTextureMapping Method (Int32)
[Missing <summary> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureMapping GetTextureMapping(
	int channel
)
Public Function GetTextureMapping (
	channel As Integer
) As TextureMapping
Parameters
channel
Type: System.Int32
[Missing <param name="channel"/> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)"]
Return Value
Type: TextureMapping
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoObject Class
GetTextureMapping Overload
Rhino.DocObjects Namespace