RhinoCommon API
File3dmNamedConstructionPlanes.GetEnumerator Method
 Gets an enumerator that yields all construction planes in this collection.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<ConstructionPlane> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ConstructionPlane)
Return Value
Type: IEnumerator<ConstructionPlane>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace