RhinoCommon API
Command Constructor
 Default protected constructor. It only allows instantiation through subclassing.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Command()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Command Class
Rhino.Commands Namespace