RhinoCommon API
GetCancel.WaitAll<TResult> Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetCancel.WaitAll``1(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task{``0}},Rhino.RhinoDoc)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result WaitAll<TResult>(
	IEnumerable<Task<TResult>> tasks,
	RhinoDoc doc
)
Public Function WaitAll(Of TResult) (
	tasks As IEnumerable(Of Task(Of TResult)),
	doc As RhinoDoc
) As Result
Parameters
tasks
Type: System.Collections.Generic.IEnumerable<Task<TResult>>
[Missing <param name="tasks"/> documentation for "M:Rhino.Input.Custom.GetCancel.WaitAll``1(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task{``0}},Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.Custom.GetCancel.WaitAll``1(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task{``0}},Rhino.RhinoDoc)"]
Type Parameters
TResult
[Missing <typeparam name="TResult"/> documentation for "M:Rhino.Input.Custom.GetCancel.WaitAll``1(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task{``0}},Rhino.RhinoDoc)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetCancel.WaitAll``1(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task{``0}},Rhino.RhinoDoc)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace