RhinoCommon API
Vector3d.Inequality Operator
 Determines whether two vectors have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Vector3d a,
	Vector3d b
)
Public Shared Operator <> (
	a As Vector3d,
	b As Vector3d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector3d
A vector.
b
Type: Rhino.Geometry.Vector3d
Another vector.
Return Value
Type: Boolean
true if any coordinate pair is different; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace