RhinoCommon API
PlugIn.GetEnglishCommandNames Method
 Gets names of all "non-test" commands for a given plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] GetEnglishCommandNames(
	Guid pluginId
)
Public Shared Function GetEnglishCommandNames (
	pluginId As Guid
) As String()
Parameters
pluginId
Type: System.Guid
The plug-in ID.
Return Value
Type: String[]
An array with all plug-in names. This can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace