RhinoCommon API
RhinoApp.Write Method (String, Object)
Print formatted text in the command window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void Write(
	string format,
	Object arg0
)
Public Shared Sub Write (
	format As String,
	arg0 As Object
)
Parameters
format
Type: System.String
[Missing <param name="format"/> documentation for "M:Rhino.RhinoApp.Write(System.String,System.Object)"]
arg0
Type: System.Object
[Missing <param name="arg0"/> documentation for "M:Rhino.RhinoApp.Write(System.String,System.Object)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoApp Class
Write Overload
Rhino Namespace