RhinoCommon SDK
Box.GetCorners Method
 Gets an array of the 8 corner points of this box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d[] GetCorners()
Public Function GetCorners As Point3d()
Return Value
Type: Point3d[]
An array of 8 corners.
See Also
Reference
Box Structure
Rhino.Geometry Namespace