RhinoCommon API
StackedDialogPage.MakeActivePage Method
 Make this page the active, visible page
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void MakeActivePage()
Public Sub MakeActivePage
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace