RhinoCommon API
MeshFaceList.Insert Method
 Inserts a mesh face at a defined index in this list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	MeshFace face
)
Public Sub Insert (
	index As Integer,
	face As MeshFace
)
Parameters
index
Type: System.Int32
An index.
face
Type: Rhino.Geometry.MeshFace
A face.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is negative or >= Count.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace