RhinoCommon API
TextLog Constructor (IntPtr)
Initializes a new instance of the TextLog class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextLog(
	IntPtr ptr
)
Public Sub New (
	ptr As IntPtr
)
Parameters
ptr
Type: System.IntPtr
[Missing <param name="ptr"/> documentation for "M:Rhino.FileIO.TextLog.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
TextLog Class
TextLog Overload
Rhino.FileIO Namespace