RhinoCommon SDK
Curve.Split Method (Surface, Double, Double)
 Splits a curve into pieces using a surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] Split(
	Surface cutter,
	double tolerance,
	double angleToleranceRadians
)
Public Function Split (
	cutter As Surface,
	tolerance As Double,
	angleToleranceRadians As Double
) As Curve()
Parameters
cutter
Type: Rhino.Geometry.Surface
A cutting surface or polysurface.
tolerance
Type: System.Double
A tolerance for computing intersections.
angleToleranceRadians
Type: System.Double
[Missing <param name="angleToleranceRadians"/> documentation for "M:Rhino.Geometry.Curve.Split(Rhino.Geometry.Surface,System.Double,System.Double)"]
Return Value
Type: Curve[]
An array of curves. This array can be empty.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace