RhinoCommon API
VisualAnalysisMode.Find Method (Type)
 Finds a visual analysis mode by type.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static VisualAnalysisMode Find(
	Type t
)
Public Shared Function Find (
	t As Type
) As VisualAnalysisMode
Parameters
t
Type: System.Type
A visual analysis mode type.
Return Value
Type: VisualAnalysisMode
A visual analysis mode on success, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
VisualAnalysisMode Class
Find Overload
Rhino.Display Namespace