RhinoCommon SDK
HistoryRecord.SetTransorm Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTransorm(
	int id,
	Transform value
)
Public Function SetTransorm (
	id As Integer,
	value As Transform
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
value
Type: Rhino.Geometry.Transform
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace