RhinoCommon SDK
ColorHSV.CreateFromHSL Method
 Constructs the nearest CMYK equivalent of an HSV color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorHSV CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorHSV
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorHSV
The HSV equivalent of the HSL color.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace