RhinoCommon API
Linetype.Default Method
 Set linetype to default settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Default()
Public Sub Default
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace