RhinoCommon API
File3dmHistoryRecordTable.Clear Method
 Remove all entries from this table
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
File3dmHistoryRecordTable Class
Rhino.FileIO Namespace