RhinoCommon API
MouseCallback.OnMouseLeave Method (MouseCallbackEventArgs)
[Missing <summary> documentation for "M:Rhino.UI.MouseCallback.OnMouseLeave(Rhino.UI.MouseCallbackEventArgs)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseLeave(
	MouseCallbackEventArgs e
)
Protected Overridable Sub OnMouseLeave (
	e As MouseCallbackEventArgs
)
Parameters
e
Type: Rhino.UI.MouseCallbackEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.MouseCallback.OnMouseLeave(Rhino.UI.MouseCallbackEventArgs)"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
MouseCallback Class
OnMouseLeave Overload
Rhino.UI Namespace