RhinoCommon SDK
SubDEdgePtr.GetSavedSubdivisionPoint Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDEdgePtr.GetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetSavedSubdivisionPoint(
	SubD.SubDType type,
	out Point3d pt
)
Public Function GetSavedSubdivisionPoint (
	type As SubD.SubDType,
	<OutAttribute> ByRef pt As Point3d
) As Boolean
Parameters
type
Type: Rhino.Geometry.SubD.SubDType
[Missing <param name="type"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.GetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d@)"]
pt
Type: Rhino.Geometry.Point3d
[Missing <param name="pt"/> documentation for "M:Rhino.Geometry.SubDEdgePtr.GetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdgePtr.GetSavedSubdivisionPoint(Rhino.Geometry.SubD.SubDType,Rhino.Geometry.Point3d@)"]
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace