RhinoCommon API
PointCloud.AddRange Method (IEnumerable<Point3d>)
 Appends a collection of points to this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddRange(
	IEnumerable<Point3d> points
)
Public Sub AddRange (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to append.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PointCloud Class
AddRange Overload
Rhino.Geometry Namespace