RhinoCommon API
DimStyleTable.GetUnusedDimensionStyleName Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetUnusedDimensionStyleName"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetUnusedDimensionStyleName()
Public Function GetUnusedDimensionStyleName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetUnusedDimensionStyleName"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace