RhinoCommon API
RenderPrimitiveList.Clear Method
 Remove all primitives from this list
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace