RhinoCommon API
Brep.CreateCurvatureAnalysisMesh Method
 Create an array of analysis meshes for the brep using the specified settings. Meshes aren't set on the brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh[] CreateCurvatureAnalysisMesh(
	Brep brep,
	CurvatureAnalysisSettingsState state
)
Public Shared Function CreateCurvatureAnalysisMesh (
	brep As Brep,
	state As CurvatureAnalysisSettingsState
) As Mesh()
Parameters
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.Geometry.Brep.CreateCurvatureAnalysisMesh(Rhino.Geometry.Brep,Rhino.ApplicationSettings.CurvatureAnalysisSettingsState)"]
state
Type: Rhino.ApplicationSettings.CurvatureAnalysisSettingsState
 CurvatureAnalysisSettingsState
Return Value
Type: Mesh[]
true if meshes were created
See Also
Reference
Brep Class
Rhino.Geometry Namespace