RhinoCommon API
ObjRef.Face Method
 If the referenced geometry is a brep face, a brep with one face, or a surface, this returns the brep face.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepFace Face()
Public Function Face As BrepFace
Return Value
Type: BrepFace
A boundary representation face; or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace