RhinoCommon API
CommandAliasList.GetNames Method
Returns a list of command alias names.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] GetNames()
Public Shared Function GetNames As String()
Return Value
Type: String[]
An array of strings. This can be empty.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace