RhinoCommon API
RealtimeDisplayMode.IsRendererStarted Method
 Override to tell the started state of your render engine.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool IsRendererStarted()
Public MustOverride Function IsRendererStarted As Boolean
Return Value
Type: Boolean
true if render engine is ready and rendering
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace