RhinoCommon API
PersistentSettings.SetDefault Method (String, Byte)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Byte)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	byte value
)
Public Sub SetDefault (
	key As String,
	value As Byte
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Byte)"]
value
Type: System.Byte
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Byte)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace