RhinoCommon SDK
BrepEdgeList.Add Method (BrepVertex, BrepVertex, Int32, Interval, Double)
 Create and add a new edge to this list
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepEdge Add(
	BrepVertex startVertex,
	BrepVertex endVertex,
	int curve3dIndex,
	Interval subDomain,
	double edgeTolerance
)
Public Function Add (
	startVertex As BrepVertex,
	endVertex As BrepVertex,
	curve3dIndex As Integer,
	subDomain As Interval,
	edgeTolerance As Double
) As BrepEdge
Parameters
startVertex
Type: Rhino.Geometry.BrepVertex
[Missing <param name="startVertex"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)"]
endVertex
Type: Rhino.Geometry.BrepVertex
[Missing <param name="endVertex"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)"]
curve3dIndex
Type: System.Int32
[Missing <param name="curve3dIndex"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)"]
subDomain
Type: Rhino.Geometry.Interval
[Missing <param name="subDomain"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)"]
edgeTolerance
Type: System.Double
[Missing <param name="edgeTolerance"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)"]
Return Value
Type: BrepEdge
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)"]
See Also
Reference
BrepEdgeList Class
Add Overload
Rhino.Geometry.Collections Namespace