RhinoCommon API
ScaleValue.RightLengthValue Method
 Get the Right LengthValue from Scale
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LengthValue RightLengthValue()
Public Function RightLengthValue As LengthValue
Return Value
Type: LengthValue
[Missing <returns> documentation for "M:Rhino.ScaleValue.RightLengthValue"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ScaleValue Class
Rhino Namespace