RhinoCommon SDK
SubDFacePtr.EdgeAt Method (Int32, Boolean)
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.EdgeAt(System.Int32,System.Boolean@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr EdgeAt(
	int index,
	out bool dir
)
Public Function EdgeAt (
	index As Integer,
	<OutAttribute> ByRef dir As Boolean
) As SubDEdgePtr
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDFacePtr.EdgeAt(System.Int32,System.Boolean@)"]
dir
Type: System.Boolean
[Missing <param name="dir"/> documentation for "M:Rhino.Geometry.SubDFacePtr.EdgeAt(System.Int32,System.Boolean@)"]
Return Value
Type: SubDEdgePtr
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.EdgeAt(System.Int32,System.Boolean@)"]
See Also
Reference
SubDFacePtr Structure
EdgeAt Overload
Rhino.Geometry Namespace