RhinoCommon API
GumballObject.SetFromLight Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLight(Rhino.Geometry.Light)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetFromLight(
	Light light
)
Public Function SetFromLight (
	light As Light
) As Boolean
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLight(Rhino.Geometry.Light)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLight(Rhino.Geometry.Light)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace