RhinoCommon SDK
RhinoObject.UnselectAllSubObjects Method
 Removes selection from all subobjects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UnselectAllSubObjects()
Public Function UnselectAllSubObjects As Integer
Return Value
Type: Int32
The number of unselected subobjects.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace