RhinoCommon API
Surface.ToBrep Method
 Converts the surface into a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep with a similar shape like this surface or null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Surface Class
Rhino.Geometry Namespace