RhinoCommon API
AnimationProperties Constructor
 Initializes a new instance of the AnimationProperties class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AnimationProperties()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
AnimationProperties Class
AnimationProperties Overload
Rhino.DocObjects Namespace