RhinoCommon API
ViewportInfo.SetCameraDirection Method
 Sets the direction that the camera faces.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetCameraDirection(
	Vector3d direction
)
Public Function SetCameraDirection (
	direction As Vector3d
) As Boolean
Parameters
direction
Type: Rhino.Geometry.Vector3d
A new direction.
Return Value
Type: Boolean
true if the direction was set; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace