RhinoCommon SDK
Curve.CreateInterpolatedCurve Method (IEnumerable<Point3d>, Int32)
 Interpolates a sequence of points. Used by InterpCurve Command This routine works best when degree=3.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve CreateInterpolatedCurve(
	IEnumerable<Point3d> points,
	int degree
)
Public Shared Function CreateInterpolatedCurve (
	points As IEnumerable(Of Point3d),
	degree As Integer
) As Curve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
 Points to interpolate (Count must be >= 2)
degree
Type: System.Int32
The degree of the curve >=1. Degree must be odd.
Return Value
Type: Curve
interpolated curve on success. null on failure.
See Also
Reference
Curve Class
CreateInterpolatedCurve Overload
Rhino.Geometry Namespace