RhinoCommon SDK
ZBufferCapture.ZValueAt Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float ZValueAt(
	int x,
	int y
)
Public Function ZValueAt (
	x As Integer,
	y As Integer
) As Single
Parameters
x
Type: System.Int32
[Missing <param name="x"/> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
y
Type: System.Int32
[Missing <param name="y"/> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace