RhinoCommon SDK
ToolbarFileCollection.FindByPath Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByPath(System.String)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ToolbarFile FindByPath(
	string path
)
Public Function FindByPath (
	path As String
) As ToolbarFile
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByPath(System.String)"]
Return Value
Type: ToolbarFile
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.FindByPath(System.String)"]
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace