RhinoCommon SDK
RenderSettings.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
RenderSettings Class
Dispose Overload
Rhino.Render Namespace