RhinoCommon API
CustomPointObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomPointObject.Finalize"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomPointObject Class
Rhino.DocObjects.Custom Namespace