RhinoCommon SDK
RhinoObject.SelectSubObject Method
Reports if an object can be selected.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SelectSubObject(
	ComponentIndex componentIndex,
	bool select,
	bool syncHighlight
)
Public Function SelectSubObject (
	componentIndex As ComponentIndex,
	select As Boolean,
	syncHighlight As Boolean
) As Integer
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
Index of subobject to check.
select
Type: System.Boolean
The new selection state; true activates selection.
syncHighlight
Type: System.Boolean
 (default=true) If true, then the object is highlighted if it is selected and unhighlighted if is is not selected.
Return Value
Type: Int32
 0: object is not selected 1: object is selected 2: object is selected persistently.
Remarks
 Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace