RhinoCommon SDK
Polyline.GetSegments Method
 Constructs an array of line segments that make up the entire polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line[] GetSegments()
Public Function GetSegments As Line()
Return Value
Type: Line[]
An array of line segments or null if the polyline contains fewer than 2 points.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace