RhinoCommon API
NameHash Constructor (String)
 Creates a new NameHash, representing a piece of text.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NameHash(
	string name
)
Public Sub New (
	name As String
)
Parameters
name
Type: System.String
A name. This can be null and can refer to a nonexisting path.
Return Value
Type:
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
NameHash Class
NameHash Overload
Rhino.FileIO Namespace