RhinoCommon API
Box.PointAt Method
 Evaluates the box volume at the given unitized parameters.
The box has idealized side length of 1x1x1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double x,
	double y,
	double z
)
Public Function PointAt (
	x As Double,
	y As Double,
	z As Double
) As Point3d
Parameters
x
Type: System.Double
Unitized parameter (between 0 and 1 is inside the box) along box X direction.
y
Type: System.Double
Unitized parameter (between 0 and 1 is inside the box) along box Y direction.
z
Type: System.Double
Unitized parameter (between 0 and 1 is inside the box) along box Z direction.
Return Value
Type: Point3d
The point at (x,y,z).
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Box Structure
Rhino.Geometry Namespace