RhinoCommon API
GeometryBase.MakeDeformable Method
 If possible, converts the object into a form that can be accurately modified with "squishy" transformations like projections, shears, an non-uniform scaling.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeDeformable()
Public Function MakeDeformable As Boolean
Return Value
Type: Boolean
 false if object cannot be converted to a deformable object. true if object was already deformable or was converted into a deformable object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace