RhinoCommon API
StringTable.GetValue Method (String, String)
 Gets a user data string from the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetValue(
	string section,
	string entry
)
Public Function GetValue (
	section As String,
	entry As String
) As String
Parameters
section
Type: System.String
The section at which to get the value.
entry
Type: System.String
The entry to search for.
Return Value
Type: String
The user data.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
StringTable Class
GetValue Overload
Rhino.DocObjects.Tables Namespace