RhinoCommon API
GetCancel Constructor
Initializes a new instance of the GetCancel class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetCancel()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace