RhinoCommon API
RhinoViewport.SetWallpaper Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetWallpaper(
	string imageFilename,
	bool grayscale
)
Public Function SetWallpaper (
	imageFilename As String,
	grayscale As Boolean
) As Boolean
Parameters
imageFilename
Type: System.String
[Missing <param name="imageFilename"/> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
grayscale
Type: System.Boolean
[Missing <param name="grayscale"/> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoViewport Class
SetWallpaper Overload
Rhino.Display Namespace