RhinoCommon API
File3dmObjectTable.AddTextDot Method (TextDot)
Adds a text dot object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddTextDot(
	TextDot dot
)
Public Function AddTextDot (
	dot As TextDot
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
The text dot.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace