RhinoCommon API
ColorCMYK.CreateFromLCH Method
 Constructs the nearest CMYK equivalent of a LCH color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorCMYK CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorCMYK
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the LCH color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace