RhinoCommon API
RenderWindow.SetView Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.SetView(Rhino.DocObjects.ViewInfo)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetView(
	ViewInfo view
)
Public Sub SetView (
	view As ViewInfo
)
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.Render.RenderWindow.SetView(Rhino.DocObjects.ViewInfo)"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderWindow Class
Rhino.Render Namespace