RhinoCommon SDK
Curve.IsInPlane Method (Plane, Double)
Test a curve to see if it lies in a specific plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsInPlane(
	Plane testPlane,
	double tolerance
)
Public Function IsInPlane (
	testPlane As Plane,
	tolerance As Double
) As Boolean
Parameters
testPlane
Type: Rhino.Geometry.Plane
Plane to test for.
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
 true if the maximum distance from the curve to the testPlane is <= tolerance.
See Also
Reference
Curve Class
IsInPlane Overload
Rhino.Geometry Namespace