RhinoCommon SDK
Interval.IncludesParameter Method (Double, Boolean)
 Tests a parameter for Interval inclusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IncludesParameter(
	double t,
	bool strict
)
Public Function IncludesParameter (
	t As Double,
	strict As Boolean
) As Boolean
Parameters
t
Type: System.Double
Parameter to test.
strict
Type: System.Boolean
If true, the parameter must be fully on the inside of the Interval.
Return Value
Type: Boolean
true if t is contained within the limits of this Interval.
See Also
Reference
Interval Structure
IncludesParameter Overload
Rhino.Geometry Namespace