RhinoCommon API
RenderTexture.GetEnvironmentMappingMode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureEnvironmentMappingMode GetEnvironmentMappingMode()
Public Function GetEnvironmentMappingMode As TextureEnvironmentMappingMode
Return Value
Type: TextureEnvironmentMappingMode
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetEnvironmentMappingMode"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderTexture Class
Rhino.Render Namespace