RhinoCommon API
TwistSpaceMorph Constructor
 Constructs a twist space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TwistSpaceMorph()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace