RhinoCommon API
PointCloud.ClearHiddenFlags Method
 Destroys the hidden flag information in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearHiddenFlags()
Public Sub ClearHiddenFlags
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace