RhinoCommon API
RenderContent.Edit Method
 Call this method to open the content in the a modal version of the editor. The content must be in the document or the call will fail.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent Edit()
Public Function Edit As RenderContent
Return Value
Type: RenderContent
 Returns the edited content on succees or null on error.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderContent Class
Rhino.Render Namespace