RhinoCommon SDK
SubDFacePtr.Inequality Operator
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.op_Inequality(Rhino.Geometry.SubDFacePtr,Rhino.Geometry.SubDFacePtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool operator !=(
	SubDFacePtr a,
	SubDFacePtr b
)
Public Shared Operator <> (
	a As SubDFacePtr,
	b As SubDFacePtr
) As Boolean
Parameters
a
Type: Rhino.Geometry.SubDFacePtr
[Missing <param name="a"/> documentation for "M:Rhino.Geometry.SubDFacePtr.op_Inequality(Rhino.Geometry.SubDFacePtr,Rhino.Geometry.SubDFacePtr)"]
b
Type: Rhino.Geometry.SubDFacePtr
[Missing <param name="b"/> documentation for "M:Rhino.Geometry.SubDFacePtr.op_Inequality(Rhino.Geometry.SubDFacePtr,Rhino.Geometry.SubDFacePtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.op_Inequality(Rhino.Geometry.SubDFacePtr,Rhino.Geometry.SubDFacePtr)"]
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace