RhinoCommon SDK
Thumbnail Constructor
 Constructor for Thumbnail
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Thumbnail(
	IntPtr pRdkThumbnail
)
Public Sub New (
	pRdkThumbnail As IntPtr
)
Parameters
pRdkThumbnail
Type: System.IntPtr
[Missing <param name="pRdkThumbnail"/> documentation for "M:Rhino.UI.Controls.Thumbnail.#ctor(System.IntPtr)"]
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace