RhinoCommon API
ObjectAttributes.ComputedPlotWeight Method (RhinoDoc)
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ComputedPlotWeight(
	RhinoDoc document
)
Public Function ComputedPlotWeight (
	document As RhinoDoc
) As Double
Parameters
document
Type: Rhino.RhinoDoc
[Missing <param name="document"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ObjectAttributes Class
ComputedPlotWeight Overload
Rhino.DocObjects Namespace