RhinoCommon API
ReplayHistoryData.TryGetVector3d Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetVector3d(System.Int32,Rhino.Geometry.Vector3d@)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetVector3d(
	int id,
	out Vector3d value
)
Public Function TryGetVector3d (
	id As Integer,
	<OutAttribute> ByRef value As Vector3d
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetVector3d(System.Int32,Rhino.Geometry.Vector3d@)"]
value
Type: Rhino.Geometry.Vector3d
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetVector3d(System.Int32,Rhino.Geometry.Vector3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetVector3d(System.Int32,Rhino.Geometry.Vector3d@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace