RhinoCommon SDK
Brep.Duplicate Method
 Copies this brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
A brep.
See Also
Reference
Brep Class
Rhino.Geometry Namespace