RhinoCommon API
RhinoGet.GetHelix Method
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetHelix(Rhino.Geometry.NurbsCurve@)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result GetHelix(
	out NurbsCurve helix
)
Public Shared Function GetHelix (
	<OutAttribute> ByRef helix As NurbsCurve
) As Result
Parameters
helix
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="helix"/> documentation for "M:Rhino.Input.RhinoGet.GetHelix(Rhino.Geometry.NurbsCurve@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetHelix(Rhino.Geometry.NurbsCurve@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoGet Class
Rhino.Input Namespace