RhinoCommon SDK
Surface.CreateExtrusion Method
 Constructs a surface by extruding a curve along a vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Surface CreateExtrusion(
	Curve profile,
	Vector3d direction
)
Public Shared Function CreateExtrusion (
	profile As Curve,
	direction As Vector3d
) As Surface
Parameters
profile
Type: Rhino.Geometry.Curve
Profile curve to extrude.
direction
Type: Rhino.Geometry.Vector3d
Direction and length of extrusion.
Return Value
Type: Surface
A surface on success or null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace