RhinoCommon SDK
Vector3f.Unitize Method
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Unitize()
Public Function Unitize As Boolean
Return Value
Type: Boolean
true on success or false on failure.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace