RhinoCommon SDK
Sphere.Rotate Method (Double, Vector3d)
 Rotates the sphere about the center point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Rotate(
	double angleRadians,
	Vector3d axisOfRotation
)
Public Function Rotate (
	angleRadians As Double,
	axisOfRotation As Vector3d
) As Boolean
Parameters
angleRadians
Type: System.Double
Angle of rotation (in radians)
axisOfRotation
Type: Rhino.Geometry.Vector3d
Rotation axis.
Return Value
Type: Boolean
true on success; false on failure.
See Also
Reference
Sphere Structure
Rotate Overload
Rhino.Geometry Namespace