RhinoCommon API
RenderPipeline.RenderSize Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.RenderSize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public static Size RenderSize()
<ObsoleteAttribute>
Public Shared Function RenderSize As Size
Return Value
Type: Size
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.RenderSize"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.27
See Also
Reference
RenderPipeline Class
RenderSize Overload
Rhino.Render Namespace