RhinoCommon SDK
Extrusion.AddInnerProfile Method
 Adds an inner profile.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AddInnerProfile(
	Curve innerProfile
)
Public Function AddInnerProfile (
	innerProfile As Curve
) As Boolean
Parameters
innerProfile
Type: Rhino.Geometry.Curve
Closed curve in the XY plane or a 2d curve.
Return Value
Type: Boolean
true if the profile was set.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace