RhinoCommon API
Transform.TransformBoundingBox Method
 Computes a new boundingbox that is the smallest axis aligned boundingbox that contains the transformed result of its 8 original corner points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox TransformBoundingBox(
	BoundingBox bbox
)
Public Function TransformBoundingBox (
	bbox As BoundingBox
) As BoundingBox
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
[Missing <param name="bbox"/> documentation for "M:Rhino.Geometry.Transform.TransformBoundingBox(Rhino.Geometry.BoundingBox)"]
Return Value
Type: BoundingBox
A new bounding box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Transform Structure
Rhino.Geometry Namespace