RhinoCommon API
NamedConstructionPlaneTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedConstructionPlaneTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<ConstructionPlane> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ConstructionPlane)
Return Value
Type: IEnumerator<ConstructionPlane>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedConstructionPlaneTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace