RhinoCommon API
StringHolder.Finalize Method
 Destructor
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace