RhinoCommon API
BrepTrimList.GetEnumerator Method
 Gets an enumerator that visits all edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<BrepTrim> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepTrim)
Return Value
Type: IEnumerator<BrepTrim>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace