RhinoCommon API
TransformObjectList Constructor
Initializes a new instance of the TransformObjectList class
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TransformObjectList()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace