RhinoCommon API
LicenseLease.Finalize Method
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseLease.Finalize"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace