RhinoCommon SDK
TextLog.Finalize Method
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
TextLog Class
Rhino.FileIO Namespace