RhinoCommon API
ObjectTable.GetObjectList Method (ObjectType)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectType)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<RhinoObject> GetObjectList(
	ObjectType typeFilter
)
Public Function GetObjectList (
	typeFilter As ObjectType
) As IEnumerable(Of RhinoObject)
Parameters
typeFilter
Type: Rhino.DocObjects.ObjectType
[Missing <param name="typeFilter"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectType)"]
Return Value
Type: IEnumerable<RhinoObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectType)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ObjectTable Class
GetObjectList Overload
Rhino.DocObjects.Tables Namespace