RhinoCommon API
MeshFaceList.GetFaceBoundingBox Method
 Gets the bounding box of a face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox GetFaceBoundingBox(
	int faceIndex
)
Public Function GetFaceBoundingBox (
	faceIndex As Integer
) As BoundingBox
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: BoundingBox
A new bounding box, or Empty on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace