RhinoCommon API
ObjectTable.AddAngularDimension Method (AngularDimension)
 Adds a angular dimension object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddAngularDimension(
	AngularDimension dimension
)
Public Function AddAngularDimension (
	dimension As AngularDimension
) As Guid
Parameters
dimension
Type: Rhino.Geometry.AngularDimension
 Dimension object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ObjectTable Class
AddAngularDimension Overload
Rhino.DocObjects.Tables Namespace