RhinoCommon API
PreviewAppearance.Size Method
 Size
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Size()
Public Function Size As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Size"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace