RhinoCommon API
Box.ClosestPoint Method
 Finds the closest point on or in the Box. The box should be Valid for this to work.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClosestPoint(
	Point3d point
)
Public Function ClosestPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Sample point.
Return Value
Type: Point3d
The point on or in the box that is closest to the sample point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Box Structure
Rhino.Geometry Namespace