RhinoCommon API
HistoryRecord.SetVector3ds Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetVector3ds(
	int id,
	IEnumerable<Vector3d> values
)
Public Function SetVector3ds (
	id As Integer,
	values As IEnumerable(Of Vector3d)
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})"]
values
Type: System.Collections.Generic.IEnumerable<Vector3d>
[Missing <param name="values"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace