RhinoCommon API
RadialDimension Constructor
Initializes a new instance of the RadialDimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RadialDimension()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RadialDimension Class
RadialDimension Overload
Rhino.Geometry Namespace