RhinoCommon API
ViewportInfo.UnlockCamera Method
 Unlocks the camera vectors and location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UnlockCamera()
Public Sub UnlockCamera
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace