RhinoCommon API
RenderContent.FromXml Method (String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public static RenderContent FromXml(
	string xml
)
<ObsoleteAttribute>
Public Shared Function FromXml (
	xml As String
) As RenderContent
Parameters
xml
Type: System.String
[Missing <param name="xml"/> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.26
See Also
Reference
RenderContent Class
FromXml Overload
Rhino.Render Namespace