RhinoCommon SDK
Vector3d.Multiply Method (Vector3d, Vector3d)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double Multiply(
	Vector3d vector1,
	Vector3d vector2
)
Public Shared Function Multiply (
	vector1 As Vector3d,
	vector2 As Vector3d
) As Double
Parameters
vector1
Type: Rhino.Geometry.Vector3d
A vector.
vector2
Type: Rhino.Geometry.Vector3d
A second vector.
Return Value
Type: Double
 A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y + v1.Z*v2.Z.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.
See Also
Reference
Vector3d Structure
Multiply Overload
Rhino.Geometry Namespace