RhinoCommon API
RhinoViewport.IsVisible Method (Point3d)
 Deterines if a world coordinate point is visible in the viewing frustum.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsVisible(
	Point3d point
)
Public Function IsVisible (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
A point that is tested for visibility.
Return Value
Type: Boolean
true if the point is visible; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoViewport Class
IsVisible Overload
Rhino.Display Namespace