RhinoCommon API
CurveList.Add Method (IEnumerable<Point3d>)
 Adds a polyline to this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	IEnumerable<Point3d> polyline
)
Public Sub Add (
	polyline As IEnumerable(Of Point3d)
)
Parameters
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
A polyline value that will be copied in a new polyline.
This argument can be null, an array, a list or any enumerable set of Point3d.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace