RhinoCommon API
Plane.Rotate Method (Double, Vector3d)
 Rotate the plane about its origin point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Rotate(
	double angle,
	Vector3d axis
)
Public Function Rotate (
	angle As Double,
	axis As Vector3d
) As Boolean
Parameters
angle
Type: System.Double
Angle in radians.
axis
Type: Rhino.Geometry.Vector3d
Axis of rotation.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Plane Structure
Rotate Overload
Rhino.Geometry Namespace