RhinoCommon API
MeshFaceList.Clear Method
 Clears the Face list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace