RhinoCommon API
GetTransform.CalculateTransform Method
 Retrieves the final transformation.
Override this virtual function to provide your own custom transformation method.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Transform CalculateTransform(
	RhinoViewport viewport,
	Point3d point
)
Public MustOverride Function CalculateTransform (
	viewport As RhinoViewport,
	point As Point3d
) As Transform
Parameters
viewport
Type: Rhino.Display.RhinoViewport
A Rhino viewport that the user is using.
point
Type: Rhino.Geometry.Point3d
A point that the user is selecting.
Return Value
Type: Transform
A transformation matrix value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace