RhinoCommon API
Polyline.ToNurbsCurve Method
 Constructs a nurbs curve representation of this polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A Nurbs curve shaped like this polyline or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Polyline Class
Rhino.Geometry Namespace