RhinoCommon SDK
SubD.SetSubDType Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.SetSubDType(Rhino.Geometry.SubD.SubDType)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SetSubDType(
	SubD.SubDType subDType
)
Public Function SetSubDType (
	subDType As SubD.SubDType
) As Boolean
Parameters
subDType
Type: Rhino.Geometry.SubD.SubDType
[Missing <param name="subDType"/> documentation for "M:Rhino.Geometry.SubD.SetSubDType(Rhino.Geometry.SubD.SubDType)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.SetSubDType(Rhino.Geometry.SubD.SubDType)"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace