RhinoCommon API
SupportOptions.UsePreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UsePreview"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UsePreview()
Public Shared Function UsePreview As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UsePreview"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
SupportOptions Class
Rhino.Render Namespace