RhinoCommon API
RhinoGet.InGet Method
 Returns true if the document is current in a "Get" operation.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool InGet(
	RhinoDoc doc
)
Public Shared Function InGet (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.RhinoGet.InGet(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
true if a getter is currently active.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoGet Class
Rhino.Input Namespace