RhinoCommon API
RenderContentType Constructor
Initializes a new instance of the RenderContentType class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentType(
	Guid typeId
)
Public Sub New (
	typeId As Guid
)
Parameters
typeId
Type: System.Guid
[Missing <param name="typeId"/> documentation for "M:Rhino.Render.RenderContentType.#ctor(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderContentType Class
Rhino.Render Namespace