RhinoCommon SDK
ColorXYZ.CreateFromHSL Method
 Create the nearest XYZ equivalent of an HSL color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorXYZ CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorXYZ
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the HSL color.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace