RhinoCommon API
PythonScript.SetIntellisenseVariable Method
 Sets a variable for runtime introspection.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void SetIntellisenseVariable(
	string name,
	Object value
)
Public Overridable Sub SetIntellisenseVariable (
	name As String,
	value As Object
)
Parameters
name
Type: System.String
A variable name.
value
Type: System.Object
A variable value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace