RhinoCommon SDK
Curve.CreateTweenCurves Method
 Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves. That means the first control point of first curve is matched to first control point of the second curve and so on. There is no matching of curves direction. Caller must match input curves direction before calling the function.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] CreateTweenCurves(
	Curve curve0,
	Curve curve1,
	int numCurves
)
Public Shared Function CreateTweenCurves (
	curve0 As Curve,
	curve1 As Curve,
	numCurves As Integer
) As Curve()
Parameters
curve0
Type: Rhino.Geometry.Curve
The first, or starting, curve.
curve1
Type: Rhino.Geometry.Curve
The second, or ending, curve.
numCurves
Type: System.Int32
Number of tween curves to create.
Return Value
Type: Curve[]
An array of joint curves. This array can be empty.
See Also
Reference
Curve Class
Rhino.Geometry Namespace