RhinoCommon API
StringHolder.ConstPointer Method
 C++ pointer used to access the ON_wString, managed plug-ins should never need this.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.InteropWrappers.StringHolder.ConstPointer"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
StringHolder Class
Rhino.Runtime.InteropWrappers Namespace