RhinoCommon SDK
ObjectAttributes.ComputedPlotWeight Method (RhinoDoc, Guid)
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc,System.Guid)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ComputedPlotWeight(
	RhinoDoc document,
	Guid viewportId
)
Public Function ComputedPlotWeight (
	document As RhinoDoc,
	viewportId As Guid
) As Double
Parameters
document
Type: Rhino.RhinoDoc
[Missing <param name="document"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc,System.Guid)"]
viewportId
Type: System.Guid
[Missing <param name="viewportId"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc,System.Guid)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc,System.Guid)"]
See Also
Reference
ObjectAttributes Class
ComputedPlotWeight Overload
Rhino.DocObjects Namespace