RhinoCommon API
BlockEditCommand.RunCommand Method
 Called by the internal BlockEdit command when the command is executed.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Result RunCommand(
	RhinoDoc doc,
	RunMode mode
)
Public MustOverride Function RunCommand (
	doc As RhinoDoc,
	mode As RunMode
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Commands.BlockEditCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
mode
Type: Rhino.Commands.RunMode
[Missing <param name="mode"/> documentation for "M:Rhino.Commands.BlockEditCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Commands.BlockEditCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace