RhinoCommon SDK
VisualAnalysisMode.Find Method (Guid)
 Finds a visual analysis mode by guid.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static VisualAnalysisMode Find(
	Guid id
)
Public Shared Function Find (
	id As Guid
) As VisualAnalysisMode
Parameters
id
Type: System.Guid
The globally unique identifier to search for.
Return Value
Type: VisualAnalysisMode
The found visual analysis mode, or null if it was not found, or on error.
See Also
Reference
VisualAnalysisMode Class
Find Overload
Rhino.Display Namespace