RhinoCommon SDK
SupportOptions.SetShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowDocuments(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetShowDocuments(
	bool b
)
Public Shared Sub SetShowDocuments (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowDocuments(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace