RhinoCommon API
BoolField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.BoolField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.BoolField.ValueAsObject"]
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
BoolField Class
Rhino.Render.Fields Namespace