RhinoCommon SDK
Arc Constructor (Plane, Point3d, Double, Double)
 Initializes a new aligned arc at the given center point, with a custom radius and angle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc(
	Plane plane,
	Point3d center,
	double radius,
	double angleRadians
)
Public Sub New (
	plane As Plane,
	center As Point3d,
	radius As Double,
	angleRadians As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Alignment plane for arc. The arc will be parallel to this plane.
center
Type: Rhino.Geometry.Point3d
Center point for arc.
radius
Type: System.Double
Radius of arc.
angleRadians
Type: System.Double
Sweep angle of arc (in radians)
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace