RhinoCommon API
Plane.Inequality Operator
 Determines if two planes are different.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Plane a,
	Plane b
)
Public Shared Operator <> (
	a As Plane,
	b As Plane
) As Boolean
Parameters
a
Type: Rhino.Geometry.Plane
A first plane.
b
Type: Rhino.Geometry.Plane
A second plane.
Return Value
Type: Boolean
true if the two planes have any different componet components; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Plane Structure
Rhino.Geometry Namespace