RhinoCommon SDK
BinaryArchiveReader.SeekFromCurrentPosition Method (Int64)
 seek from current position ( like fseek( ,SEEK_CUR) )
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SeekFromCurrentPosition(
	long byteOffset
)
Public Function SeekFromCurrentPosition (
	byteOffset As Long
) As Boolean
Parameters
byteOffset
Type: System.Int64
[Missing <param name="byteOffset"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.SeekFromCurrentPosition(System.Int64)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.SeekFromCurrentPosition(System.Int64)"]
See Also
Reference
BinaryArchiveReader Class
SeekFromCurrentPosition Overload
Rhino.FileIO Namespace