RhinoCommon API
RhinoViewport Constructor
Initializes a new instance of the RhinoViewport class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoViewport Class
RhinoViewport Overload
Rhino.Display Namespace