RhinoCommon API
DisplayPipeline.DrawCircle Method (Circle, Color, Int32)
 Draw a single circle object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawCircle(
	Circle circle,
	Color color,
	int thickness
)
Public Sub DrawCircle (
	circle As Circle,
	color As Color,
	thickness As Integer
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of circle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipeline Class
DrawCircle Overload
Rhino.Display Namespace