RhinoCommon API
LinetypeTable.Find Method (String, Boolean)
Obsolete. Use the other overload.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	string name,
	bool ignoreDeletedLinetypes
)
Public Function Find (
	name As String,
	ignoreDeletedLinetypes As Boolean
) As Integer
Parameters
name
Type: System.String
search ignores case.
ignoreDeletedLinetypes
Type: System.Boolean
If true, deleted linetypes are not checked.
Return Value
Type: Int32
 >=0 index of the linetype with the given name -1 no linetype has the given name.
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LinetypeTable Class
Find Overload
Rhino.DocObjects.Tables Namespace