RhinoCommon API
SimpleArrayGuidPointer Constructor
 Initializes a new SimpleArrayGuidPointer class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayGuidPointer()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
SimpleArrayGuidPointer Class
Rhino.Runtime.InteropWrappers Namespace