RhinoCommon API
RealtimeDisplayMode.HudProductName Method
 Override to return the name of your product. This will be printed in the HUD.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string HudProductName()
Public Overridable Function HudProductName As String
Return Value
Type: String
Name of the product.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace