RhinoCommon API
ColorHSV Constructor (Color)
 Constructs a new instance of ColorHSV that is equivalent to an RGB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorHSV(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
RGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ColorHSV Structure
ColorHSV Overload
Rhino.Display Namespace