RhinoCommon SDK
SubDVertexAccess.AddVertices Method (SubD.SubDVertexTag, IEnumerable<Point3f>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void AddVertices(
	SubD.SubDVertexTag tag,
	IEnumerable<Point3f> vertices
)
Public Sub AddVertices (
	tag As SubD.SubDVertexTag,
	vertices As IEnumerable(Of Point3f)
)
Parameters
tag
Type: Rhino.Geometry.SubD.SubDVertexTag
The type of vertex tag, such as smooth or corner.
vertices
Type: System.Collections.Generic.IEnumerable<Point3f>
A list, an array or any enumerable set of Point3d.
See Also
Reference
SubDVertexAccess Class
AddVertices Overload
Rhino.Geometry.Collections Namespace