RhinoCommon API
Layer.SetPersistentVisibility Method
 Set the persistent visibility setting for this layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPersistentVisibility(
	bool persistentVisibility
)
Public Sub SetPersistentVisibility (
	persistentVisibility As Boolean
)
Parameters
persistentVisibility
Type: System.Boolean
[Missing <param name="persistentVisibility"/> documentation for "M:Rhino.DocObjects.Layer.SetPersistentVisibility(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Layer Class
Rhino.DocObjects Namespace