RhinoCommon API
CachedTextureCoordinates.GetEnumerator Method
 Returns an enumerator that iterates through this collection.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Point3d> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Point3d)
Return Value
Type: IEnumerator<Point3d>
 A enumerator that can be used to iterate through this collection.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace