RhinoCommon API
Quaternion.Equality Operator
 Determines whether two quaternions have the same value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Quaternion a,
	Quaternion b
)
Public Shared Operator = (
	a As Quaternion,
	b As Quaternion
) As Boolean
Parameters
a
Type: Rhino.Geometry.Quaternion
A quaternion.
b
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Boolean
true if the quaternions have exactly equal coefficients; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace