RhinoCommon API
RhinoView.CaptureToBitmap Method
 Capture View contents to a bitmap.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap CaptureToBitmap()
Public Function CaptureToBitmap As Bitmap
Return Value
Type: Bitmap
The bitmap of the complete view.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace