RhinoCommon SDK
SubDFacePtr.VertexAt Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacePtr.VertexAt(System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr VertexAt(
	int index
)
Public Function VertexAt (
	index As Integer
) As SubDVertexPtr
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.SubDFacePtr.VertexAt(System.Int32)"]
Return Value
Type: SubDVertexPtr
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacePtr.VertexAt(System.Int32)"]
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace