RhinoCommon API
PreviewAppearance.SetRotationY Method
 SetRotationY
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetRotationY(
	double d
)
Public Sub SetRotationY (
	d As Double
)
Parameters
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Render.PreviewAppearance.SetRotationY(System.Double)"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace