RhinoCommon API
DisplayPipeline.PushCullFaceMode Method
 Push a FaceCull flag on the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PushCullFaceMode(
	CullFaceMode mode
)
Public Sub PushCullFaceMode (
	mode As CullFaceMode
)
Parameters
mode
Type: Rhino.Display.CullFaceMode
FaceCull flag.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace