RhinoCommon SDK
IStackedDialogPageService.SelectedObjectTypes Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectTypes(Rhino.UI.ObjectPropertiesPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
uint SelectedObjectTypes(
	ObjectPropertiesPage page
)
Function SelectedObjectTypes (
	page As ObjectPropertiesPage
) As UInteger
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectTypes(Rhino.UI.ObjectPropertiesPage)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.SelectedObjectTypes(Rhino.UI.ObjectPropertiesPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace