RhinoCommon API
LinetypeTable.UndoModify Method
 If the linetype has been modified and the modifcation can be undone, then UndoModify() will restore the linetype to its previous state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UndoModify(
	int index
)
Public Function UndoModify (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Zero based index of linetype for which to undo changes.
Return Value
Type: Boolean
 true if this linetype had been modified and the modifications were undone.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace