RhinoCommon API
RealtimeDisplayMode.HudShowCustomStatusText Method
 Override to show status text in HUD. By default disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool HudShowCustomStatusText()
Public Overridable Function HudShowCustomStatusText As Boolean
Return Value
Type: Boolean
Return true to show status text in HUD
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace