RhinoCommon API
Vector2d.UnaryNegation Operator
 Computes the opposite vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2d operator -(
	Vector2d vector
)
Public Shared Operator - (
	vector As Vector2d
) As Vector2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector to negate.
Return Value
Type: Vector2d
A new vector where all components were multiplied by -1.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace