RhinoCommon API
RenderContentKindList Constructor
Initializes a new instance of the RenderContentKindList class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentKindList()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContentKindList Class
RenderContentKindList Overload
Rhino.Render Namespace