RhinoCommon SDK
ObjectTable.FindByCrossingWindowRegion Method (RhinoViewport, Point2d, Point2d, Boolean, ObjectType)
 Finds objects bounded by a region
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByCrossingWindowRegion(
	RhinoViewport viewport,
	Point2d screen1,
	Point2d screen2,
	bool inside,
	ObjectType filter
)
Public Function FindByCrossingWindowRegion (
	viewport As RhinoViewport,
	screen1 As Point2d,
	screen2 As Point2d,
	inside As Boolean,
	filter As ObjectType
) As RhinoObject()
Parameters
viewport
Type: Rhino.Display.RhinoViewport
viewport to use for selection
screen1
Type: Rhino.Geometry.Point2d
first screen corner
screen2
Type: Rhino.Geometry.Point2d
second screen corner
inside
Type: System.Boolean
should objects returned be the ones inside of this region (or outside)
filter
Type: Rhino.DocObjects.ObjectType
filter down list by object type
Return Value
Type: RhinoObject[]
An array of RhinoObjects that are inside of this region
See Also
Reference
ObjectTable Class
FindByCrossingWindowRegion Overload
Rhino.DocObjects.Tables Namespace