RhinoCommon API
FileObjReadOptions.GetTransform Method
 Calculates the YToZ transform.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.FileIO.FileObjReadOptions.GetTransform"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace