RhinoCommon SDK
IStackedDialogPageService.NewObjectPropertiesDialogPagePointer Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.NewObjectPropertiesDialogPagePointer(Rhino.UI.ObjectPropertiesPage)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
IntPtr NewObjectPropertiesDialogPagePointer(
	ObjectPropertiesPage page
)
Function NewObjectPropertiesDialogPagePointer (
	page As ObjectPropertiesPage
) As IntPtr
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.NewObjectPropertiesDialogPagePointer(Rhino.UI.ObjectPropertiesPage)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.NewObjectPropertiesDialogPagePointer(Rhino.UI.ObjectPropertiesPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace