RhinoCommon API
Interop.NativeGeometryNonConstPointer Method
 Returns the underlying non-const ON_Geometry* for a RhinoCommon class. You should only be interested in using this function if you are writing C++ code.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static IntPtr NativeGeometryNonConstPointer(
	GeometryBase geometry
)
Public Shared Function NativeGeometryNonConstPointer (
	geometry As GeometryBase
) As IntPtr
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
A geometry object. This can be null and in such a case Zero is returned.
Return Value
Type: IntPtr
A pointer to the non-const geometry.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Interop Class
Rhino.Runtime Namespace