RhinoCommon API
CurveList.Add Method (Arc)
 Adds an arc to this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Arc arc
)
Public Sub Add (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
An arc value that will be the model of the new internal curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace