RhinoCommon API
MeshVertexList.ToPoint3fArray Method
 Copies all vertices to a new array of Point3f.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3f[] ToPoint3fArray()
Public Function ToPoint3fArray As Point3f()
Return Value
Type: Point3f[]
A new array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace