RhinoCommon API
Interpolator Constructor (Int32, Double)
 Constructs a new Interpolator with a specified amount of numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interpolator(
	int amount,
	double defaultValue
)
Public Sub New (
	amount As Integer,
	defaultValue As Double
)
Parameters
amount
Type: System.Int32
Number of values to add to this Interpolator. Must be equal to or larger than zero.
defaultValue
Type: System.Double
Number to add.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace