RhinoCommon API
NamedParametersEventArgs.SetDouble Method
 Set a double value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDouble(
	string name,
	double value
)
Public Sub SetDouble (
	name As String,
	value As Double
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetDouble(System.String,System.Double)"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetDouble(System.String,System.Double)"]
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace