RhinoCommon SDK
IRhRdkThumbnailList.UUID Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.UUID"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Guid UUID()
Function UUID As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.UUID"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace