RhinoCommon API
SelCommand Constructor
Initializes a new instance of the SelCommand class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected SelCommand()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
SelCommand Class
Rhino.Commands Namespace