RhinoCommon API
RenderPrimitiveList.AutoDeleteMaterialsOn Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitiveList.AutoDeleteMaterialsOn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AutoDeleteMaterialsOn()
Public Function AutoDeleteMaterialsOn As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPrimitiveList.AutoDeleteMaterialsOn"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace