RhinoCommon API
BrepVertexList.GetEnumerator Method
 Gets an enumerator that visits all surfaces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<BrepVertex> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepVertex)
Return Value
Type: IEnumerator<BrepVertex>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace