RhinoCommon API
Polyline.ClosestParameter Method
 Gets the parameter along the polyline which is closest to a test-point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ClosestParameter(
	Point3d testPoint
)
Public Function ClosestParameter (
	testPoint As Point3d
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to approximate.
Return Value
Type: Double
The parameter along the polyline closest to testPoint.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Polyline Class
Rhino.Geometry Namespace