RhinoCommon API
RhinoSettings.RenderingView Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.RenderingView"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewInfo RenderingView()
Public Function RenderingView As ViewInfo
Return Value
Type: ViewInfo
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.RenderingView"]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace