RhinoCommon SDK
InstanceDefinitionTable.Purge Method
 Purges an instance definition and its definition geometry.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Purge(
	int idefIndex
)
Public Function Purge (
	idefIndex As Integer
) As Boolean
Parameters
idefIndex
Type: System.Int32
 zero based index of instance definition to delete. This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
Return Value
Type: Boolean
 True if successful. False if the instance definition cannot be purged because it is in use by reference objects or undo information.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace