RhinoCommon SDK
MeshVertexList.HideAll Method
 Hides all vertices in the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void HideAll()
Public Sub HideAll
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace