RhinoCommon API
CachedTextureCoordinates.RemoveAt Method
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.RemoveAt(System.Int32)"]
Implements
IList<T>.RemoveAt(Int32)
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace