RhinoCommon API
DisplayPipelineAttributes.Dispose Method
Releases all resources used by the DisplayPipelineAttributes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipelineAttributes Class
Dispose Overload
Rhino.Display Namespace