RhinoCommon API
Curve.CreateBooleanUnion Method (IEnumerable<Curve>)
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve[] CreateBooleanUnion(
	IEnumerable<Curve> curves
)
Public Shared Function CreateBooleanUnion (
	curves As IEnumerable(Of Curve)
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
The co-planar curves to union.
Return Value
Type: Curve[]
Result curves on success, empty array if no union could be calculated.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.23
See Also
Reference
Curve Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace