RhinoCommon API
StringTable.GetSectionNames Method
 Returns a list of all the section names for user data strings in the document.
By default a section name is a key that is prefixed with a string separated by a backslash.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] GetSectionNames()
Public Function GetSectionNames As String()
Return Value
Type: String[]
An array of section names. This can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace