RhinoCommon SDK
MaterialTable.Add Method
 Adds a new material to the table based on the default material.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
The position of the new material in the table.
See Also
Reference
MaterialTable Class
Add Overload
Rhino.DocObjects.Tables Namespace