RhinoCommon SDK
Localization.LocalizeCommandOptionValue Method (String, Int32)
[Missing <summary> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionValue(System.String,System.Int32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static LocalizeStringPair LocalizeCommandOptionValue(
	string english,
	int contextId
)
Public Shared Function LocalizeCommandOptionValue (
	english As String,
	contextId As Integer
) As LocalizeStringPair
Parameters
english
Type: System.String
[Missing <param name="english"/> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionValue(System.String,System.Int32)"]
contextId
Type: System.Int32
[Missing <param name="contextId"/> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionValue(System.String,System.Int32)"]
Return Value
Type: LocalizeStringPair
[Missing <returns> documentation for "M:Rhino.UI.Localization.LocalizeCommandOptionValue(System.String,System.Int32)"]
See Also
Reference
Localization Class
LocalizeCommandOptionValue Overload
Rhino.UI Namespace