RhinoCommon SDK
Brep.MergeBreps Method
 Combines two or more breps into one. A merge is like a boolean union that keeps the inside pieces. This function creates non-manifold Breps which in general are unusual in Rhino. You may want to consider using JoinBreps or CreateBooleanUnion functions instead.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep MergeBreps(
	IEnumerable<Brep> brepsToMerge,
	double tolerance
)
Public Shared Function MergeBreps (
	brepsToMerge As IEnumerable(Of Brep),
	tolerance As Double
) As Brep
Parameters
brepsToMerge
Type: System.Collections.Generic.IEnumerable<Brep>
must contain more than one Brep.
tolerance
Type: System.Double
the tolerance to use when merging.
Return Value
Type: Brep
Single merged Brep on success. Null on error.
See Also
Reference
Brep Class
Rhino.Geometry Namespace
Brep.JoinBreps(IEnumerable<Brep>, Double)
Brep.CreateBooleanUnion(IEnumerable<Brep>, Double)