RhinoCommon SDK
File3dm.DumpToTextLog Method
Prepares a text dump of the entire model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DumpToTextLog(
	TextLog log
)
Public Sub DumpToTextLog (
	log As TextLog
)
Parameters
log
Type: Rhino.FileIO.TextLog
[Missing <param name="log"/> documentation for "M:Rhino.FileIO.File3dm.DumpToTextLog(Rhino.FileIO.TextLog)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace