RhinoCommon API
GetBaseClass.Vector Method
 Gets a direction if Get*() returns GetResult.Point (Set by some digitizers, but in general it's (0,0,0).
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Vector()
Public Function Vector As Vector3d
Return Value
Type: Vector3d
The vector chosen by the user.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace