RhinoCommon API
SimpleArrayExtrusionPointer Constructor
 Initializes a new SimpleArrayExtrusionPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayExtrusionPointer()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace