RhinoCommon API
ModelAidSettings.GetDefaultState Method
 Gets the factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ModelAidSettingsState GetDefaultState()
Public Shared Function GetDefaultState As ModelAidSettingsState
Return Value
Type: ModelAidSettingsState
A new model aid state with factory settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace