RhinoCommon API
TextEntity.CreateCurves Method
 Returns the outline curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] CreateCurves(
	DimensionStyle dimstyle,
	bool bAllowOpen,
	double smallCapsScale = 1,
	double spacing = 0
)
Public Function CreateCurves (
	dimstyle As DimensionStyle,
	bAllowOpen As Boolean,
	Optional smallCapsScale As Double = 1,
	Optional spacing As Double = 0
) As Curve()
Parameters
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.TextEntity.CreateCurves(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)"]
bAllowOpen
Type: System.Boolean
 Set to true to prevent forced closing of open curves retrieved from glyphs.
smallCapsScale (Optional)
Type: System.Double
 Set to create small caps out of lower case letters.
spacing (Optional)
Type: System.Double
 Set to add additional spacing between glyph output.
Return Value
Type: Curve[]
An array of curves that forms the outline or content of this text entity.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace