RhinoCommon API
RhinoApp.WriteLine Method
Print a newline in the command window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void WriteLine()
Public Shared Sub WriteLine
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoApp Class
WriteLine Overload
Rhino Namespace