RhinoCommon API
Vector2d.Equals Method (Vector2d)
 Determines whether the specified vector has the same value as the present vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Vector2d vector
)
Public Function Equals (
	vector As Vector2d
) As Boolean
Parameters
vector
Type: Rhino.Geometry.Vector2d
The specified vector.
Return Value
Type: Boolean
true if vector has the same components as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Vector2d Structure
Equals Overload
Rhino.Geometry Namespace