RhinoCommon SDK
Material.GetBumpTexture Method
 Gets the bump texture of this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetBumpTexture()
Public Function GetBumpTexture As Texture
Return Value
Type: Texture
A texture; or null if no bump texture has been added to this material.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace