RhinoCommon API
GroupTable.Find Method (String, Boolean)
Finds a group with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	string groupName,
	bool ignoreDeletedGroups
)
Public Function Find (
	groupName As String,
	ignoreDeletedGroups As Boolean
) As Integer
Parameters
groupName
Type: System.String
 Name of group to search for. Ignores case.
ignoreDeletedGroups
Type: System.Boolean
 This parameter is ignored. Deleted groups are never searched.
Return Value
Type: Int32
 >=0 index of the group with the given name. -1 no group found with the given name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
GroupTable Class
Find Overload
Rhino.DocObjects.Tables Namespace