RhinoCommon API
Mesh.CreateFromPlanarBoundary Method (Curve, MeshingParameters)
 Do not use this overload. Use version that takes a tolerance parameter instead.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateFromPlanarBoundary(
	Curve boundary,
	MeshingParameters parameters
)
Public Shared Function CreateFromPlanarBoundary (
	boundary As Curve,
	parameters As MeshingParameters
) As Mesh
Parameters
boundary
Type: Rhino.Geometry.Curve
Do not use.
parameters
Type: Rhino.Geometry.MeshingParameters
Do not use.
Return Value
Type: Mesh
 Do not use.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.24
See Also
Reference
Mesh Class
CreateFromPlanarBoundary Overload
Rhino.Geometry Namespace