RhinoCommon API
PlugIn.GetLicenseOwner Method
 Get the customer name and organization used when entering the product license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetLicenseOwner(
	out string registeredOwner,
	out string registeredOrganization
)
Public Function GetLicenseOwner (
	<OutAttribute> ByRef registeredOwner As String,
	<OutAttribute> ByRef registeredOrganization As String
) As Boolean
Parameters
registeredOwner
Type: System.String
[Missing <param name="registeredOwner"/> documentation for "M:Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)"]
registeredOrganization
Type: System.String
[Missing <param name="registeredOrganization"/> documentation for "M:Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace