RhinoCommon API
RhinoObject.IsSubObjectSelected Method
Check sub-object selection state.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSubObjectSelected(
	ComponentIndex componentIndex
)
Public Function IsSubObjectSelected (
	componentIndex As ComponentIndex
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
Index of subobject to check.
Return Value
Type: Boolean
true if the subobject is selected.
Remarks
A subobject cannot be persistently selected.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace