RhinoCommon API
LicenseUtils.ShowLicenseValidationUi Method
 ShowLicenseValidationUi
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowLicenseValidationUi(
	string cdkey
)
Public Shared Function ShowLicenseValidationUi (
	cdkey As String
) As Boolean
Parameters
cdkey
Type: System.String
[Missing <param name="cdkey"/> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowLicenseValidationUi(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.ShowLicenseValidationUi(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace