RhinoCommon API
CurveList Constructor
 Initializes a new empty list of curves.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CurveList()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
CurveList Class
CurveList Overload
Rhino.Collections Namespace