RhinoCommon API
Command.IsValidCommandName Method
 Determines if a string is a valid command name.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsValidCommandName(
	string name
)
Public Shared Function IsValidCommandName (
	name As String
) As Boolean
Parameters
name
Type: System.String
A string.
Return Value
Type: Boolean
true if the string is a valid command name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Command Class
Rhino.Commands Namespace