RhinoCommon API
GetObject.Objects Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetObject.Objects"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef[] Objects()
Public Function Objects As ObjRef()
Return Value
Type: ObjRef[]
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetObject.Objects"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace