RhinoCommon API
RenderWindow.Channel.Dispose Method
Releases all resources used by the RenderWindow.Channel
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderWindow.Channel Class
Dispose Overload
Rhino.Render Namespace