RhinoCommon API
ModelComponent.ClearName Method
 Resets the HasName property of the model component to false, if possible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearName()
Public Sub ClearName
Exceptions
Exception | Condition
InvalidOperationException | If the name is locked.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace