RhinoCommon API
Vector3f.Rotate Method
 Rotates this vector around a given axis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Rotate(
	double angleRadians,
	Vector3f rotationAxis
)
Public Function Rotate (
	angleRadians As Double,
	rotationAxis As Vector3f
) As Boolean
Parameters
angleRadians
Type: System.Double
Angle of rotation (in radians).
rotationAxis
Type: Rhino.Geometry.Vector3f
Axis of rotation.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace