RhinoCommon API
Point3d.Addition Operator (Vector3d, Point3d)
 Sums up a point and a vector, and returns a new point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d operator +(
	Vector3d vector,
	Point3d point
)
Public Shared Operator + (
	vector As Vector3d,
	point As Point3d
) As Point3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
A new point that results from the addition of point and vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Point3d Structure
Addition Overload
Rhino.Geometry Namespace