RhinoCommon API
DetailViewObject.CommitViewportChanges Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DetailViewObject.CommitViewportChanges"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CommitViewportChanges()
Public Function CommitViewportChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.DetailViewObject.CommitViewportChanges"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace