RhinoCommon API
File3dm.Read Method (String)
 Reads a 3dm file from a specified location.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static File3dm Read(
	string path
)
Public Shared Function Read (
	path As String
) As File3dm
Parameters
path
Type: System.String
The file to read.
Return Value
Type: File3dm
new File3dm on success, null on error.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dm Class
Read Overload
Rhino.FileIO Namespace