RhinoCommon SDK
RhinoView.ScreenToClient Method (Point)
 Converts a point in screen coordinates to client coordinates for this view.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point ScreenToClient(
	Point screenPoint
)
Public Function ScreenToClient (
	screenPoint As Point
) As Point
Parameters
screenPoint
Type: System.Drawing.Point
The 2D screen point.
Return Value
Type: Point
A 2D point in client coordinates.
See Also
Reference
RhinoView Class
ScreenToClient Overload
Rhino.Display Namespace