RhinoCommon API
ObjectTable.Replace Method (Guid, Line)
Replaces one object with new line curve object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	Guid objectId,
	Line line
)
Public Function Replace (
	objectId As Guid,
	line As Line
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
line
Type: Rhino.Geometry.Line
new line to be added. The line is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace