RhinoCommon API
File3dmObjectTable.AddLinearDimension Method (LinearDimension)
 Adds a linear dimension to the 3dm file object table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLinearDimension(
	LinearDimension dimension
)
Public Function AddLinearDimension (
	dimension As LinearDimension
) As Guid
Parameters
dimension
Type: Rhino.Geometry.LinearDimension
A dimension.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dmObjectTable Class
AddLinearDimension Overload
Rhino.FileIO Namespace