RhinoCommon SDK
SubDFaceAccess.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Geometry.Collections.SubDFaceAccess.GetEnumerator"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<SubDFacePtr> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SubDFacePtr)
Return Value
Type: IEnumerator<SubDFacePtr>
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDFaceAccess.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
SubDFaceAccess Class
Rhino.Geometry.Collections Namespace