RhinoCommon API
GroupTable.Find Method (String)
Finds a group with a given name.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Find(
	string groupName
)
Public Function Find (
	groupName As String
) As Integer
Parameters
groupName
Type: System.String
 Name of group to search for. Ignores case.
Return Value
Type: Int32
 >=0 index of the group with the given name. UnsetIntIndex no group found with the given name.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
GroupTable Class
Find Overload
Rhino.DocObjects.Tables Namespace