RhinoCommon API
BezierCurve Constructor (IEnumerable<Point3d>)
 Create bezier curve with controls defined by a list of 3d points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BezierCurve(
	IEnumerable<Point3d> controlPoints
)
Public Sub New (
	controlPoints As IEnumerable(Of Point3d)
)
Parameters
controlPoints
Type: System.Collections.Generic.IEnumerable<Point3d>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BezierCurve Class
BezierCurve Overload
Rhino.Geometry Namespace