RhinoCommon SDK
SubDObject.DuplicateSubDGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.SubDObject.DuplicateSubDGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubD DuplicateSubDGeometry()
Public Function DuplicateSubDGeometry As SubD
Return Value
Type: SubD
[Missing <returns> documentation for "M:Rhino.DocObjects.SubDObject.DuplicateSubDGeometry"]
See Also
Reference
SubDObject Class
Rhino.DocObjects Namespace