RhinoCommon API
RhinoApp.MainWindowHandle Method
 Gets the WindowHandle of the Rhino main window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static IntPtr MainWindowHandle()
Public Shared Function MainWindowHandle As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.RhinoApp.MainWindowHandle"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoApp Class
Rhino Namespace