RhinoCommon API
NamedViewTable.FindByName Method
Finds a named view.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FindByName(
	string name
)
Public Function FindByName (
	name As String
) As Integer
Parameters
name
Type: System.String
name to search for.
Return Value
Type: Int32
 >=0 index of the found named view -1 no named view found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace