RhinoCommon API
Layer.GetHashCode Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.GetHashCode"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.GetHashCode"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Layer Class
GetHashCode Overload
Rhino.DocObjects Namespace