RhinoCommon API
GetLine.EnableAllVariations Method
 If true, then all line variations are shown if the default line mode is used
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableAllVariations(
	bool on
)
Public Sub EnableAllVariations (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Input.Custom.GetLine.EnableAllVariations(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace