RhinoCommon API
DisplayMaterial Constructor (Color, Double)
 Constructs a default material with a specific diffuse color and transparency.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayMaterial(
	Color diffuse,
	double transparency
)
Public Sub New (
	diffuse As Color,
	transparency As Double
)
Parameters
diffuse
Type: System.Drawing.Color
Diffuse color of material. The alpha component of the Diffuse color is ignored.
transparency
Type: System.Double
Transparency factor (0.0 = opaque, 1.0 = transparent)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace