RhinoCommon API
Point2d.Addition Operator (Point2d, Point2d)
 Adds a point with a point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d operator +(
	Point2d point1,
	Point2d point2
)
Public Shared Operator + (
	point1 As Point2d,
	point2 As Point2d
) As Point2d
Parameters
point1
Type: Rhino.Geometry.Point2d
A point.
point2
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
A new point that is coordinatewise summed with the other point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Point2d Structure
Addition Overload
Rhino.Geometry Namespace