RhinoCommon API
WorldMapDayNight.MakeMapBitmap Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.MakeMapBitmap"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void MakeMapBitmap()
Public Sub MakeMapBitmap
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace