RhinoCommon SDK
ObjectTable.AddPoints Method (IEnumerable<Point3d>, ObjectAttributes)
 Adds multiple points to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoList<Guid> AddPoints(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes
)
Public Function AddPoints (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes
) As RhinoList(Of Guid)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point objects.
Return Value
Type: RhinoList<Guid>
List of object ids.
See Also
Reference
ObjectTable Class
AddPoints Overload
Rhino.DocObjects.Tables Namespace