RhinoCommon API
RhinoObject.GetSelectedSubObjects Method
Get a list of all selected sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex[] GetSelectedSubObjects()
Public Function GetSelectedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of subobject indices, or null if there are none.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace