RhinoCommon API
BitmapTable.DeleteBitmap Method
Deletes a bitmap.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DeleteBitmap(
	string bitmapFilename
)
Public Function DeleteBitmap (
	bitmapFilename As String
) As Boolean
Parameters
bitmapFilename
Type: System.String
The bitmap file name.
Return Value
Type: Boolean
 true if successful. false if the bitmap cannot be deleted because it is the current bitmap or because it bitmap contains active geometry.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace