RhinoCommon SDK
Dimension.SetUnderline Method
[Missing <summary> documentation for "M:Rhino.Geometry.Dimension.SetUnderline(System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool SetUnderline(
	bool setOn
)
Public Overrides Function SetUnderline (
	setOn As Boolean
) As Boolean
Parameters
setOn
Type: System.Boolean
[Missing <param name="setOn"/> documentation for "M:Rhino.Geometry.Dimension.SetUnderline(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Dimension.SetUnderline(System.Boolean)"]
See Also
Reference
Dimension Class
Rhino.Geometry Namespace