RhinoCommon API
ISettingsWriteErrorService.LogSuccess Method
 If there is a entry for this settings file then increment the settings file successfully saved counter otherwise; do nothing.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void LogSuccess(
	string fileName
)
Sub LogSuccess (
	fileName As String
)
Parameters
fileName
Type: System.String
 Used to generate registry key unique to this file name
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ISettingsWriteErrorService Interface
Rhino.Runtime Namespace