RhinoCommon API
Brep.SetTolerancesBoxesAndFlags Method
 Set tolerances and flags in a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetTolerancesBoxesAndFlags()
Public Sub SetTolerancesBoxesAndFlags
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Brep Class
SetTolerancesBoxesAndFlags Overload
Rhino.Geometry Namespace