RhinoCommon API
Circle Constructor (Arc)
 Initializes a circle from an arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle(
	Arc arc
)
Public Sub New (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc that defines the plane and radius.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace