RhinoCommon SDK
Sphere.ClosestParameter Method
 Finds the angle parameters on this sphere that are closest to a test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ClosestParameter(
	Point3d testPoint,
	out double longitudeRadians,
	out double latitudeRadians
)
Public Function ClosestParameter (
	testPoint As Point3d,
	<OutAttribute> ByRef longitudeRadians As Double,
	<OutAttribute> ByRef latitudeRadians As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to project onto the sphere.
longitudeRadians
Type: System.Double
The longitudinal angle (in radians; 0.0 to 2pi) where the sphere approaches testPoint best.
latitudeRadians
Type: System.Double
The latitudinal angle (in radians; -0.5pi to +0.5pi) where the sphere approaches testPoint best.
Return Value
Type: Boolean
true on success, false on failure. This function will fail if the point it coincident with the sphere center.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace