RhinoCommon API
ViewportInfo.GetFarPlaneCorners Method
 Gets the corners of far clipping plane rectangle. 4 points are returned in the order of bottom left, bottom right, top left, top right.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] GetFarPlaneCorners()
Public Function GetFarPlaneCorners As Point3d()
Return Value
Type: Point3d[]
 Four corner points on success. Empty array if viewport is not valid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace