RhinoCommon API
MeshNgonList.Clear Method
 Clears the Ngon list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace