RhinoCommon API
PlugIn.Icon Method
 Returns the plug-in's icon in bitmap form.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap Icon(
	Size size
)
Public Function Icon (
	size As Size
) As Bitmap
Parameters
size
Type: System.Drawing.Size
The desired size in pixels.
Return Value
Type: Bitmap
The icon if successful, null otherwise.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace