RhinoCommon SDK
Circle.Transform Method
 Transforms this circle using an xform matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 Circles may not be transformed accurately if the xform defines a non-euclidian transformation.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace