RhinoCommon SDK
SubD.ToLimitSurfaceMesh Method (SubDDisplayParameters)
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(Rhino.Geometry.SubDDisplayParameters)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh ToLimitSurfaceMesh(
	SubDDisplayParameters limitMeshParameters
)
Public Function ToLimitSurfaceMesh (
	limitMeshParameters As SubDDisplayParameters
) As Mesh
Parameters
limitMeshParameters
Type: Rhino.Geometry.SubDDisplayParameters
[Missing <param name="limitMeshParameters"/> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(Rhino.Geometry.SubDDisplayParameters)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.ToLimitSurfaceMesh(Rhino.Geometry.SubDDisplayParameters)"]
See Also
Reference
SubD Class
ToLimitSurfaceMesh Overload
Rhino.Geometry Namespace