RhinoCommon API
RenderPlugInList Constructor
Initializes a new instance of the RenderPlugInList class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderPlugInList()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderPlugInList Class
Rhino.Render Namespace