RhinoCommon API
LicenseUtils.GetLicenseStatus Method
 Returns the current status of every license for ui purposes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static LicenseStatus[] GetLicenseStatus()
Public Shared Function GetLicenseStatus As LicenseStatus()
Return Value
Type: LicenseStatus[]
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicenseStatus"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace