RhinoCommon API
StackedDialogPage.OnApply Method
Called when stacked dialog OK button is pressed.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool OnApply()
Public Overridable Function OnApply As Boolean
Return Value
Type: Boolean
 If return value is true then the dialog will be closed. A return of false means there was an error and dialog remains open so page can be properly updated.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace