RhinoCommon API
File3dmObjectTable.Delete Method (Guid)
 Deletes object from document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	Guid objectId
)
Public Function Delete (
	objectId As Guid
) As Boolean
Parameters
objectId
Type: System.Guid
Id of the object to delete.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmObjectTable Class
Delete Overload
Rhino.FileIO Namespace