RhinoCommon SDK
SubD.Subdivide Method (Int32, SubD.SubDType, Int32, Int32)
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.Subdivide(System.Int32,Rhino.Geometry.SubD.SubDType,System.Int32,System.Int32)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Subdivide(
	int meshDensity,
	SubD.SubDType subDType,
	int levelIndex,
	int count
)
Public Sub Subdivide (
	meshDensity As Integer,
	subDType As SubD.SubDType,
	levelIndex As Integer,
	count As Integer
)
Parameters
meshDensity
Type: System.Int32
[Missing <param name="meshDensity"/> documentation for "M:Rhino.Geometry.SubD.Subdivide(System.Int32,Rhino.Geometry.SubD.SubDType,System.Int32,System.Int32)"]
subDType
Type: Rhino.Geometry.SubD.SubDType
[Missing <param name="subDType"/> documentation for "M:Rhino.Geometry.SubD.Subdivide(System.Int32,Rhino.Geometry.SubD.SubDType,System.Int32,System.Int32)"]
levelIndex
Type: System.Int32
[Missing <param name="levelIndex"/> documentation for "M:Rhino.Geometry.SubD.Subdivide(System.Int32,Rhino.Geometry.SubD.SubDType,System.Int32,System.Int32)"]
count
Type: System.Int32
[Missing <param name="count"/> documentation for "M:Rhino.Geometry.SubD.Subdivide(System.Int32,Rhino.Geometry.SubD.SubDType,System.Int32,System.Int32)"]
See Also
Reference
SubD Class
Subdivide Overload
Rhino.Geometry Namespace