RhinoCommon API
SupportOptions.SetSupportSharedUIs Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetSupportSharedUIs(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetSupportSharedUIs(
	bool b
)
Public Shared Sub SetSupportSharedUIs (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetSupportSharedUIs(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
SupportOptions Class
Rhino.Render Namespace