RhinoCommon API
ObjectAttributes.GetUserStrings Method
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NameValueCollection GetUserStrings()
Public Function GetUserStrings As NameValueCollection
Return Value
Type: NameValueCollection
A collection of key strings and values strings. This
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace