RhinoCommon API
SimpleArrayInterval Constructor
 Initializes a new SimpleArrayInterval class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayInterval()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimpleArrayInterval Class
Rhino.Runtime.InteropWrappers Namespace