RhinoCommon API
OpenGLSettings Constructor
Initializes a new instance of the OpenGLSettings class
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OpenGLSettings()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace