RhinoCommon API
Polyline.CreateCircumscribedPolygon Method
 Create a regular polygon circumscribe about a circle. The midpoints of the polygon's edges will be tanget to the circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Polyline CreateCircumscribedPolygon(
	Circle circle,
	int sideCount
)
Public Shared Function CreateCircumscribedPolygon (
	circle As Circle,
	sideCount As Integer
) As Polyline
Parameters
circle
Type: Rhino.Geometry.Circle
The circle.
sideCount
Type: System.Int32
The number of sides
Return Value
Type: Polyline
A closed polyline if successful, null otherwise.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Polyline Class
Rhino.Geometry Namespace