RhinoCommon API
RealtimeDisplayMode.SetView Method
 Set ViewInfo for this RealtimeDisplayMode instance.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetView(
	ViewInfo view
)
Public Sub SetView (
	view As ViewInfo
)
Parameters
view
Type: Rhino.DocObjects.ViewInfo
The ViewInfo to set for subsequent tests.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace