RhinoCommon SDK
BinaryArchiveWriter.WriteSingle Method
 Writes a Single value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteSingle(
	float value
)
Public Sub WriteSingle (
	value As Single
)
Parameters
value
Type: System.Single
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace