RhinoCommon SDK
Utilities.SetDefaultRenderPlugIn Method
 Set default render application
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SetDefaultRenderPlugIn(
	Guid pluginId
)
Public Shared Function SetDefaultRenderPlugIn (
	pluginId As Guid
) As Boolean
Parameters
pluginId
Type: System.Guid
ID of render plug-in
Return Value
Type: Boolean
 True if plug-in found and loaded successfully. False if pluginId is invalid or was unable to load plug-in
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Utilities Class
Rhino.Render Namespace