RhinoCommon API
RenderContentType.NewRenderContent Method
 Returns a new instance of the render content of this type. This content can be added to a persistant list.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent NewRenderContent()
Public Function NewRenderContent As RenderContent
Return Value
Type: RenderContent
A new render content instance.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderContentType Class
Rhino.Render Namespace