RhinoCommon API
ZBufferCapture.MaxZ Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.MaxZ"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float MaxZ()
Public Function MaxZ As Single
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.MaxZ"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace