RhinoCommon API
SimpleArrayPoint2d.ConstPointer Method
 Gets the const (immutable) pointer of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The const pointer.
See Also
Reference
SimpleArrayPoint2d Class
Rhino.Runtime.InteropWrappers Namespace