RhinoCommon API
SpaceMorph.Morph Method (GeometryBase)
Apply the space morph to geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Morph(
	GeometryBase geometry
)
Public Function Morph (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
Geometry to morph.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
SpaceMorph Class
Morph Overload
Rhino.Geometry Namespace