RhinoCommon API
RealtimeDisplayMode.GetView Method
 Get ViewInfo that has been registered with this RealtimeDisplayMode instance.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewInfo GetView()
Public Function GetView As ViewInfo
Return Value
Type: ViewInfo
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetView"]
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace