RhinoCommon API
LicenseData.IsValid Method
 Public validator.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseData.IsValid"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LicenseData Class
IsValid Overload
Rhino.PlugIns Namespace