RhinoCommon SDK
LinetypeTable.LinetypeIndexForObject Method
 Returns the effective linetype index to be used to find the linetype definition to draw an object. If an object's linetype source is LinetypeFromObject, the linetype index in the object's attributes is used. If an object's linetype source is LinetypeFromLayer the linetype index from the object's layer is used.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LinetypeIndexForObject(
	RhinoObject rhinoObject
)
Public Function LinetypeIndexForObject (
	rhinoObject As RhinoObject
) As Integer
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
The Rhino object to use in the query.
Return Value
Type: Int32
The effective linetype index.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace