RhinoCommon API
FilePdf.PdfDocumentImplementation Method
 Get actual implementation of PdfDocument class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Object PdfDocumentImplementation()
Public MustOverride Function PdfDocumentImplementation As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.FileIO.FilePdf.PdfDocumentImplementation"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace