RhinoCommon SDK
ObjectTable.AddPictureFrame Method
 Creates a PictureFrame object from a plane and a path to an image file, Note, a PictureFrame object is just a Plane surface or mesh that has a material with a texture assigned to it that displays in all display modes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPictureFrame(
	Plane plane,
	string texturePath,
	bool asMesh,
	double width,
	double height,
	bool selfIllumination,
	bool embedBitmap
)
Public Function AddPictureFrame (
	plane As Plane,
	texturePath As String,
	asMesh As Boolean,
	width As Double,
	height As Double,
	selfIllumination As Boolean,
	embedBitmap As Boolean
) As Guid
Parameters
plane
Type: Rhino.Geometry.Plane
 Plane in which the PictureFrame will be created. Bottom left corner of picture will be at plane's origin, width will be in the plane's x axis direction, height will be in the plane's y axis direction.
texturePath
Type: System.String
path to an image file
asMesh
Type: System.Boolean
 If true, the function will make a MeshObject rather than a surface
width
Type: System.Double
 Width of the resulting PictureFrame. If 0.0, the width of the pictureframe is the width of the image if height is also 0.0 or calculated from the height and aspect ratio of the image if height is not 0.0.
height
Type: System.Double
 Height of the resulting PictureFrame. If 0.0, the height of the pictureframe is the height of the image if width is also 0.0 or calculated from the width and aspect ratio of the image if width is not 0.0.
selfIllumination
Type: System.Boolean
 If true, the image mapped to the picture frame plane always displays at full intensity and is not affected by light or shadow.
embedBitmap
Type: System.Boolean
 If true, the funtion adds the the image to the bitmaptable of the document to which the PictureFrame will be added
Return Value
Type: Guid
A unique identifier for the object
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace