RhinoCommon API
ObjectTable.Hide Method (Guid, Boolean)
 If Object().IsNormal() is true, then the object will be hidden.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Hide(
	Guid objectId,
	bool ignoreLayerMode
)
Public Function Hide (
	objectId As Guid,
	ignoreLayerMode As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to hide.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be hidden even if it is on a layer that is locked or off.
Return Value
Type: Boolean
true if the object was successfully hidden.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectTable Class
Hide Overload
Rhino.DocObjects.Tables Namespace