RhinoCommon API
Plane.RemapToPlaneSpace Method
 Convert a point from World space coordinates into Plane space coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemapToPlaneSpace(
	Point3d ptSample,
	out Point3d ptPlane
)
Public Function RemapToPlaneSpace (
	ptSample As Point3d,
	<OutAttribute> ByRef ptPlane As Point3d
) As Boolean
Parameters
ptSample
Type: Rhino.Geometry.Point3d
World point to remap.
ptPlane
Type: Rhino.Geometry.Point3d
Point in plane (s,t,d) coordinates.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
D stands for distance, not disease.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Plane Structure
Rhino.Geometry Namespace