RhinoCommon API
RhinoGet.GetPolyline Method
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetPolyline(Rhino.Geometry.Polyline@)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result GetPolyline(
	out Polyline polyline
)
Public Shared Function GetPolyline (
	<OutAttribute> ByRef polyline As Polyline
) As Result
Parameters
polyline
Type: Rhino.Geometry.Polyline
[Missing <param name="polyline"/> documentation for "M:Rhino.Input.RhinoGet.GetPolyline(Rhino.Geometry.Polyline@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetPolyline(Rhino.Geometry.Polyline@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoGet Class
Rhino.Input Namespace