RhinoCommon API
Unroller.AddFollowingGeometry Method (IEnumerable<Curve>)
 Adds curves that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddFollowingGeometry(
	IEnumerable<Curve> curves
)
Public Sub AddFollowingGeometry (
	curves As IEnumerable(Of Curve)
)
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
An array, a list or any enumerable set of curves.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace