RhinoCommon SDK
Curve.ProjectToMesh Method (IEnumerable<Curve>, IEnumerable<Mesh>, Vector3d, Double)
 Projects a curve to a set of meshes using a direction and tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] ProjectToMesh(
	IEnumerable<Curve> curves,
	IEnumerable<Mesh> meshes,
	Vector3d direction,
	double tolerance
)
Public Shared Function ProjectToMesh (
	curves As IEnumerable(Of Curve),
	meshes As IEnumerable(Of Mesh),
	direction As Vector3d,
	tolerance As Double
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
A list, an array or any enumerable of curves.
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, an array or any enumerable of meshes.
direction
Type: Rhino.Geometry.Vector3d
A direction vector.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: Curve[]
A curve array.
See Also
Reference
Curve Class
ProjectToMesh Overload
Rhino.Geometry Namespace