RhinoCommon API
PolyCurve.SegmentCurveParameter Method
 Converts a polycurve parameter to a segment curve parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SegmentCurveParameter(
	double polycurveParameter
)
Public Function SegmentCurveParameter (
	polycurveParameter As Double
) As Double
Parameters
polycurveParameter
Type: System.Double
Parameter on PolyCurve to convert.
Return Value
Type: Double
 Segment curve evaluation parameter or UnsetValue if the segment curve parameter could not be computed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace