RhinoCommon API
FileSettings.AutoSaveBeforeCommands Method
Input list of commands that force AutoSave prior to running.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] AutoSaveBeforeCommands()
Public Shared Function AutoSaveBeforeCommands As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.FileSettings.AutoSaveBeforeCommands"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace