RhinoCommon API
InstanceDefinition.Equals Method (Object)
 Equality is checked against InstanceDefinition.Id
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Return Value
Type: Boolean
True if obj.Id equals Id
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
InstanceDefinition Class
Equals Overload
Rhino.DocObjects Namespace