RhinoCommon API
Vector3f.Equality Operator
 Determines whether two vectors have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Vector3f a,
	Vector3f b
)
Public Shared Operator = (
	a As Vector3f,
	b As Vector3f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector3f
The first vector.
b
Type: Rhino.Geometry.Vector3f
The second vector.
Return Value
Type: Boolean
true if the components of the two vectors are exactly equal; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace