RhinoCommon API
TimeZone.TimeZoneAt Method
 Returns a time zone at given index.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static TimeZone TimeZoneAt(
	int index
)
Public Shared Function TimeZoneAt (
	index As Integer
) As TimeZone
Parameters
index
Type: System.Int32
index.
Return Value
Type: TimeZone
Time zone at index.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
TimeZone Class
Rhino.Render Namespace