RhinoCommon SDK
DisplayBitmap.GetBlendModes Method
 Gets the source and destination blend modes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void GetBlendModes(
	out BlendMode source,
	out BlendMode destination
)
Public Sub GetBlendModes (
	<OutAttribute> ByRef source As BlendMode,
	<OutAttribute> ByRef destination As BlendMode
)
Parameters
source
Type: Rhino.Display.BlendMode
The source blend mode is assigned to this out parameter.
destination
Type: Rhino.Display.BlendMode
The destination blend mode is assigned to this out parameter.
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace