RhinoCommon API
GetLine.Get Method
 Perform the 'get' operation.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result Get(
	out Line line
)
Public Function Get (
	<OutAttribute> ByRef line As Line
) As Result
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.Input.Custom.GetLine.Get(Rhino.Geometry.Line@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetLine.Get(Rhino.Geometry.Line@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace