RhinoCommon API
SnapShotsClient.DocumentCategory Method
 Predefined document category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string DocumentCategory()
Public Shared Function DocumentCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.DocumentCategory"]
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace