RhinoCommon API
Curve.ToNurbsCurve Method (Interval)
 Constructs a NURBS curve representation of this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve ToNurbsCurve(
	Interval subdomain
)
Public Function ToNurbsCurve (
	subdomain As Interval
) As NurbsCurve
Parameters
subdomain
Type: Rhino.Geometry.Interval
The NURBS representation for this portion of the curve is returned.
Return Value
Type: NurbsCurve
NURBS representation of the curve on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Curve Class
ToNurbsCurve Overload
Rhino.Geometry Namespace