RhinoCommon API
RenderTexture.GetWrapType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetWrapType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual TextureWrapType GetWrapType()
Public Overridable Function GetWrapType As TextureWrapType
Return Value
Type: TextureWrapType
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetWrapType"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderTexture Class
Rhino.Render Namespace