RhinoCommon API
Brep.Split Method (Brep, Double)
 Splits a Brep into pieces using a Brep as a cutter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep[] Split(
	Brep splitter,
	double intersectionTolerance
)
Public Function Split (
	splitter As Brep,
	intersectionTolerance As Double
) As Brep()
Parameters
splitter
Type: Rhino.Geometry.Brep
[Missing <param name="splitter"/> documentation for "M:Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double)"]
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
Return Value
Type: Brep[]
A new array of Breps. This array can be empty.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace