RhinoCommon SDK
MorphControl Constructor (SerializationInfo, StreamingContext)
 Protected constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected MorphControl(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
MorphControl Class
MorphControl Overload
Rhino.Geometry Namespace