RhinoCommon API
HostUtils.GetPlatformService<T> Method
For internal use only
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static T GetPlatformService<T>()
where T : class
Public Shared Function GetPlatformService(Of T As Class) As T
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.Runtime.HostUtils.GetPlatformService``1"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.Runtime.HostUtils.GetPlatformService``1"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
HostUtils Class
GetPlatformService Overload
Rhino.Runtime Namespace