RhinoCommon API
NamedLayerStateTable.Import Method
 Imports named layer states from a 3dm file.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Import(
	string filename
)
Public Function Import (
	filename As String
) As Integer
Parameters
filename
Type: System.String
The name of the file to import.
Return Value
Type: Int32
The number of named layers states imported.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace