RhinoCommon API
BinaryArchiveWriter.WriteString Method
 Writes a String value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteString(
	string value
)
Public Sub WriteString (
	value As String
)
Parameters
value
Type: System.String
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace