RhinoCommon SDK
IPanelsService.ClosePanel Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.ClosePanel(System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
void ClosePanel(
	Guid panelId
)
Sub ClosePanel (
	panelId As Guid
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.ClosePanel(System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace