RhinoCommon SDK
Curve.DerivativeAt Method (Double, Int32, CurveEvaluationSide)
 Evaluate the derivatives at the specified curve parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d[] DerivativeAt(
	double t,
	int derivativeCount,
	CurveEvaluationSide side
)
Public Function DerivativeAt (
	t As Double,
	derivativeCount As Integer,
	side As CurveEvaluationSide
) As Vector3d()
Parameters
t
Type: System.Double
Curve parameter to evaluate.
derivativeCount
Type: System.Int32
Number of derivatives to evaluate, must be at least 0.
side
Type: Rhino.Geometry.CurveEvaluationSide
Side of parameter to evaluate. If the parameter is at a kink, it makes a big difference whether the evaluation is from below or above.
Return Value
Type: Vector3d[]
An array of vectors that represents all the derivatives starting at zero.
See Also
Reference
Curve Class
DerivativeAt Overload
Rhino.Geometry Namespace