RhinoCommon API
CommandAliasList.Add Method
Adds a new command alias to Rhino.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool Add(
	string alias,
	string macro
)
Public Shared Function Add (
	alias As String,
	macro As String
) As Boolean
Parameters
alias
Type: System.String
[in] The name of the command alias.
macro
Type: System.String
[in] The command macro to run when the alias is executed.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace