RhinoCommon API
Mesh.CreateBooleanDifference Method
 Computes the solid difference of two sets of Meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh[] CreateBooleanDifference(
	IEnumerable<Mesh> firstSet,
	IEnumerable<Mesh> secondSet
)
Public Shared Function CreateBooleanDifference (
	firstSet As IEnumerable(Of Mesh),
	secondSet As IEnumerable(Of Mesh)
) As Mesh()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Mesh>
First set of Meshes (the set to subtract from).
secondSet
Type: System.Collections.Generic.IEnumerable<Mesh>
Second set of Meshes (the set to subtract).
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Mesh Class
Rhino.Geometry Namespace