RhinoCommon API
IRhRdkContentThumbnail.ChildContent Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.ChildContent"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RenderContent ChildContent()
Function ChildContent As RenderContent
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.ChildContent"]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
IRhRdkContentThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace