RhinoCommon API
ToolbarFile.Close Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.Close(System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Close(
	bool prompt
)
Public Function Close (
	prompt As Boolean
) As Boolean
Parameters
prompt
Type: System.Boolean
[Missing <param name="prompt"/> documentation for "M:Rhino.UI.ToolbarFile.Close(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.Close(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace