RhinoCommon API
PersistentSettings.ContainsChangedValues Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.ContainsChangedValues"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ContainsChangedValues()
Public Function ContainsChangedValues As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.ContainsChangedValues"]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
PersistentSettings Class
Rhino Namespace