RhinoCommon SDK
IStackedDialogPageService.RemovePage Method
[Missing <summary> documentation for "M:Rhino.UI.IStackedDialogPageService.RemovePage(Rhino.UI.StackedDialogPage)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void RemovePage(
	StackedDialogPage page
)
Sub RemovePage (
	page As StackedDialogPage
)
Parameters
page
Type: Rhino.UI.StackedDialogPage
[Missing <param name="page"/> documentation for "M:Rhino.UI.IStackedDialogPageService.RemovePage(Rhino.UI.StackedDialogPage)"]
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace