RhinoCommon API
Point4d Constructor (Double, Double, Double, Double)
 Initializes a new instance of the Point4d class based on coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point4d(
	double x,
	double y,
	double z,
	double w
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double,
	w As Double
)
Parameters
x
Type: System.Double
The X (first) dimension.
y
Type: System.Double
The Y (second) dimension.
z
Type: System.Double
The Z (third) dimension.
w
Type: System.Double
The W (fourth) dimension, or weight.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Point4d Structure
Point4d Overload
Rhino.Geometry Namespace