RhinoCommon API
RenderTexture.GetRepeatLocked Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetRepeatLocked"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool GetRepeatLocked()
Public Overridable Function GetRepeatLocked As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetRepeatLocked"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderTexture Class
Rhino.Render Namespace