RhinoCommon API
ObjectTable.Replace Method (ObjRef, PointCloud)
 Replaces one object with new pointcloud object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	ObjRef objref,
	PointCloud pointcloud
)
Public Function Replace (
	objref As ObjRef,
	pointcloud As PointCloud
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
reference to old object to be replaced. The objref.Object() will be deleted.
pointcloud
Type: Rhino.Geometry.PointCloud
 new pointcloud to be added A duplicate of the pointcloud is added to the Rhino model.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace