RhinoCommon API
Vector2f.Inequality Operator
 Determines whether two vectors have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Vector2f a,
	Vector2f b
)
Public Shared Operator <> (
	a As Vector2f,
	b As Vector2f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2f
The first vector.
b
Type: Rhino.Geometry.Vector2f
The second vector.
Return Value
Type: Boolean
true if the two vectors differ in any component; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace