RhinoCommon API
Interval.GetHashCode Method
 Computes the hash code for this Interval object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A hash value that might be equal for two different Interval values.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Interval Structure
Rhino.Geometry Namespace