RhinoCommon API
RhinoGet.GetLine Method
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetLine(Rhino.Geometry.Line@)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result GetLine(
	out Line line
)
Public Shared Function GetLine (
	<OutAttribute> ByRef line As Line
) As Result
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.Input.RhinoGet.GetLine(Rhino.Geometry.Line@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetLine(Rhino.Geometry.Line@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoGet Class
Rhino.Input Namespace