RhinoCommon SDK
RhinoObject.GetRenderMeshParameters Method
 Meshing parameters that this object uses for generating render meshes. If the object's attributes do not have custom meshing parameters, then the document's meshing parameters are used.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshingParameters GetRenderMeshParameters()
Public Function GetRenderMeshParameters As MeshingParameters
Return Value
Type: MeshingParameters
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.GetRenderMeshParameters"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace