RhinoCommon API
IPanelsService.OpenPanel Method (Guid)
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void OpenPanel(
	Guid panelId
)
Sub OpenPanel (
	panelId As Guid
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.OpenPanel(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
IPanelsService Interface
OpenPanel Overload
Rhino.UI Namespace