RhinoCommon SDK
Curve.CreateBooleanDifference Method (Curve, IEnumerable<Curve>)
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] CreateBooleanDifference(
	Curve curveA,
	IEnumerable<Curve> subtractors
)
Public Shared Function CreateBooleanDifference (
	curveA As Curve,
	subtractors As IEnumerable(Of Curve)
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
subtractors
Type: System.Collections.Generic.IEnumerable<Curve>
curves to subtract from the first closed curve.
Return Value
Type: Curve[]
Result curves on success, empty array if no difference could be calculated.
See Also
Reference
Curve Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace