RhinoCommon API
SimpleArrayBinaryArchiveReader.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace