RhinoCommon API
ClippingPlaneSurface.ViewportIds Method
 Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] ViewportIds()
Public Function ViewportIds As Guid()
Return Value
Type: Guid[]
The ids of RhinoViewport objects.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace