RhinoCommon API
MeshVertexColorList.GetEnumerator Method
 Gets an enumerator that yields all colors in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Color> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Color)
Return Value
Type: IEnumerator<Color>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace