RhinoCommon SDK
Arc.BoundingBox Method
 Computes the 3D axis aligned bounding box for this arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox()
Public Function BoundingBox As BoundingBox
Return Value
Type: BoundingBox
Bounding box of arc.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace