RhinoCommon SDK
Unroller.AddFollowingGeometry Method (Point)
 Adds a point that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	Point point
)
Public Sub AddFollowingGeometry (
	point As Point
)
Parameters
point
Type: Rhino.Geometry.Point
A point.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace