RhinoCommon API
Interval.Swap Method
 Exchanges T0 and T1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Swap()
Public Sub Swap
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Interval Structure
Rhino.Geometry Namespace