RhinoCommon SDK
Curve.Trim Method (Double, Double)
 Removes portions of the curve outside the specified interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Trim(
	double t0,
	double t1
)
Public Function Trim (
	t0 As Double,
	t1 As Double
) As Curve
Parameters
t0
Type: System.Double
 Start of the trimming interval. Portions of the curve before curve(t0) are removed.
t1
Type: System.Double
 End of the trimming interval. Portions of the curve after curve(t1) are removed.
Return Value
Type: Curve
Trimmed portion of this curve is successfull, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
Trim Overload
Rhino.Geometry Namespace