RhinoCommon API
ModelComponent.LockName Method
 Locks the component Name property.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void LockName()
Public Sub LockName
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace