RhinoCommon SDK
Light.SetAttenuation Method
 Sets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetAttenuation(
	double a0,
	double a1,
	double a2
)
Public Sub SetAttenuation (
	a0 As Double,
	a1 As Double,
	a2 As Double
)
Parameters
a0
Type: System.Double
The new constant attenuation divisor term.
a1
Type: System.Double
The new reverse linear attenuation divisor term.
a2
Type: System.Double
The new reverse quadratic attenuation divisor term.
See Also
Reference
Light Class
Rhino.Geometry Namespace