RhinoCommon API
SupportOptions.LibrariesInitialLocationCustomFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocationCustomFolder"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string LibrariesInitialLocationCustomFolder()
Public Shared Function LibrariesInitialLocationCustomFolder As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocationCustomFolder"]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
SupportOptions Class
Rhino.Render Namespace