RhinoCommon API
BinaryArchiveWriter.WriteDictionary Method
 Delivers the complete content of a dictionary to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteDictionary(
	ArchivableDictionary dictionary
)
Public Sub WriteDictionary (
	dictionary As ArchivableDictionary
)
Parameters
dictionary
Type: Rhino.Collections.ArchivableDictionary
A dictionary to archive.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace