RhinoCommon SDK
RenderPlugIn.SunCustomSections Method
 Override this function to provide custom sections for the sun panel that are displayed when your plug-in is the current render plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void SunCustomSections(
	List<ICollapsibleSection> sections
)
Public Overridable Sub SunCustomSections (
	sections As List(Of ICollapsibleSection)
)
Parameters
sections
Type: System.Collections.Generic.List<ICollapsibleSection>
Create your sections and return a list of them
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPlugIn Class
Rhino.PlugIns Namespace