RhinoCommon API
Command.DisplayHelp Method
 Displays help for a command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void DisplayHelp(
	Guid commandId
)
Public Shared Sub DisplayHelp (
	commandId As Guid
)
Parameters
commandId
Type: System.Guid
A command ID.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Command Class
Rhino.Commands Namespace