RhinoCommon API
RhinoObject.UnhighlightAllSubObjects Method
 Removes highlighting from all subobjects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UnhighlightAllSubObjects()
Public Function UnhighlightAllSubObjects As Integer
Return Value
Type: Int32
The number of changed subobjects.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace