RhinoCommon API
BinaryArchiveReader.ReadUShort Method
 Reads a UInt16 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ushort ReadUShort()
Public Function ReadUShort As UShort
Return Value
Type: UInt16
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace