RhinoCommon API
DisplayPipeline.DrawSurface Method
 Draw wireframe display for a single surface.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawSurface(
	Surface surface,
	Color wireColor,
	int wireDensity
)
Public Sub DrawSurface (
	surface As Surface,
	wireColor As Color,
	wireDensity As Integer
)
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to draw.
wireColor
Type: System.Drawing.Color
Color to draw with.
wireDensity
Type: System.Int32
Thickness (in pixels) or wires to draw.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace