RhinoCommon API
Polyline.CenterPoint Method
 Compute the center point of the polyline as the weighted average of all segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d CenterPoint()
Public Function CenterPoint As Point3d
Return Value
Type: Point3d
The weighted average of all segments.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Polyline Class
Rhino.Geometry Namespace