RhinoCommon API
Point3f.Equals Method (Point3f)
 Determines whether the specified Point3f has the same values as the present point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Point3f point
)
Public Function Equals (
	point As Point3f
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3f
The specified point.
Return Value
Type: Boolean
true if point has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Point3f Structure
Equals Overload
Rhino.Geometry Namespace