RhinoCommon API
GroupTable.Undelete Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Undelete(System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Undelete(
	int groupIndex
)
Public Function Undelete (
	groupIndex As Integer
) As Boolean
Parameters
groupIndex
Type: System.Int32
[Missing <param name="groupIndex"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Undelete(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.Undelete(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace