RhinoCommon API
Brep.CreateBooleanSplit Method (IEnumerable<Brep>, IEnumerable<Brep>, Double)
 Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreateBooleanSplit(
	IEnumerable<Brep> firstSet,
	IEnumerable<Brep> secondSet,
	double tolerance
)
Public Shared Function CreateBooleanSplit (
	firstSet As IEnumerable(Of Brep),
	secondSet As IEnumerable(Of Brep),
	tolerance As Double
) As Brep()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Brep>
The Breps to split.
secondSet
Type: System.Collections.Generic.IEnumerable<Brep>
The cutting Breps.
tolerance
Type: System.Double
Tolerance to use for splitting operation. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep[]
An array of Brep if successful, an empty array on failure.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Brep Class
CreateBooleanSplit Overload
Rhino.Geometry Namespace