RhinoCommon API
NamedLayerStateTable.Delete Method
 Deletes an exising named layer state.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	string name
)
Public Function Delete (
	name As String
) As Boolean
Parameters
name
Type: System.String
The name of the layer state.
Return Value
Type: Boolean
True if successful, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace