RhinoCommon API
Brep.CreateFromBox Method (Box)
 Constructs new brep that matches an aligned box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep CreateFromBox(
	Box box
)
Public Shared Function CreateFromBox (
	box As Box
) As Brep
Parameters
box
Type: Rhino.Geometry.Box
Box to match.
Return Value
Type: Brep
A Brep with 6 faces that is similar to the Box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Brep Class
CreateFromBox Overload
Rhino.Geometry Namespace