RhinoCommon API
DimensionStyle.ClearAllFieldOverrides Method
 Sets all the fields in this DimensionStyle to be not overridden Does not change any dimstyle_id's or parent_id's
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearAllFieldOverrides()
Public Sub ClearAllFieldOverrides
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace