RhinoCommon API
FileTypeList Constructor
Initializes a new instance of the FileTypeList class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileTypeList()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
FileTypeList Class
FileTypeList Overload
Rhino.PlugIns Namespace