RhinoCommon API
Point3f.EpsilonEquals Method
 Check that all values in other are withing epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EpsilonEquals(
	Point3f other,
	float epsilon
)
Public Function EpsilonEquals (
	other As Point3f,
	epsilon As Single
) As Boolean
Parameters
other
Type: Rhino.Geometry.Point3f
epsilon
Type: System.Single
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Point3f.EpsilonEquals(Rhino.Geometry.Point3f,System.Single)"]
Implements
IEpsilonFComparable<T>.EpsilonEquals(T, Single)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace