RhinoCommon API
MeshFaceList.ToIntArray Method
 Copies all of the faces to a linear array of indices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] ToIntArray(
	bool asTriangles
)
Public Function ToIntArray (
	asTriangles As Boolean
) As Integer()
Parameters
asTriangles
Type: System.Boolean
If set to true as triangles.
Return Value
Type: Int32[]
The int array. This method never returns null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace