RhinoCommon API
Curve.Contains Method (Point3d)
 Computes the relationship between a point and a closed curve region. This curve must be closed or the return value will be Unset. Both curve and point are projected to the World XY plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointContainment Contains(
	Point3d testPoint
)
Public Function Contains (
	testPoint As Point3d
) As PointContainment
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to test.
Return Value
Type: PointContainment
Relationship between point and curve region.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.4
See Also
Reference
Curve Class
Contains Overload
Rhino.Geometry Namespace