RhinoCommon API
FileReadOptions.Finalize Method
[Missing <summary> documentation for "M:Rhino.FileIO.FileReadOptions.Finalize"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace