RhinoCommon SDK
SubDVertexSectorIterator.ResetToCurrentFace Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.ResetToCurrentFace(Rhino.Geometry.SubDVertexPtr)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ResetToCurrentFace(
	SubDVertexPtr vertex
)
Public Function ResetToCurrentFace (
	vertex As SubDVertexPtr
) As Boolean
Parameters
vertex
Type: Rhino.Geometry.SubDVertexPtr
[Missing <param name="vertex"/> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.ResetToCurrentFace(Rhino.Geometry.SubDVertexPtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubDVertexSectorIterator.ResetToCurrentFace(Rhino.Geometry.SubDVertexPtr)"]
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace