RhinoCommon API
RenderContent.LoadFromFile Method
 Loads content from a library file. Does not add the content to the persistent content list. Use AddPersistantContent to add it to the list.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderContent LoadFromFile(
	string filename
)
Public Shared Function LoadFromFile (
	filename As String
) As RenderContent
Parameters
filename
Type: System.String
full path to the file to be loaded.
Return Value
Type: RenderContent
The loaded content or null if an error occurred.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContent Class
Rhino.Render Namespace