RhinoCommon API
RhinoObject.GetRenderPrimitiveList Method (ViewportInfo, DisplayPipelineAttributes)
 Build custom render mesh(es) for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderPrimitiveList GetRenderPrimitiveList(
	ViewportInfo viewport,
	DisplayPipelineAttributes attrs
)
Public Function GetRenderPrimitiveList (
	viewport As ViewportInfo,
	attrs As DisplayPipelineAttributes
) As RenderPrimitiveList
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
attrs
Type: Rhino.Display.DisplayPipelineAttributes
 Attributes for the view mode you are supplying meshes for. Will be null if this is a modal rendering.
Return Value
Type: RenderPrimitiveList
 Returns a RenderPrimitiveList if successful otherwise returns null.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoObject Class
GetRenderPrimitiveList Overload
Rhino.DocObjects Namespace