RhinoCommon SDK
Panels.GetOpenPanelIds Method
 Get a list of the currently open panel tabs in Windows Rhino, on Mac Rhino it will be a list of the currently visible modeless panel dialogs.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid[] GetOpenPanelIds()
Public Shared Function GetOpenPanelIds As Guid()
Return Value
Type: Guid[]
 Returns an array of panel class Id's for the currently open panels, if there are no open panels it will be an empty array.
See Also
Reference
Panels Class
Rhino.UI Namespace