RhinoCommon API
ChangeQueue.CreateWorld Method
 Calls CreateWorld with true passed.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void CreateWorld()
Public Sub CreateWorld
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ChangeQueue Class
CreateWorld Overload
Rhino.Render.ChangeQueue Namespace