RhinoCommon SDK
BinaryArchiveWriter.WriteStringArray Method
 Writes a list, an array, or any enumerable of String to the archive.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteStringArray(
	IEnumerable<string> value
)
Public Sub WriteStringArray (
	value As IEnumerable(Of String)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<String>
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace