RhinoCommon API
Particle Constructor
 Initializes a new instance of the Particle class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Particle()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Particle Class
Rhino.Geometry Namespace