RhinoCommon SDK
UserData.Copy Method
 Expert user tool that copies user data that has a positive CopyCount from the source object to a destination object. Generally speaking you don't need to use Copy(). Simply rely on things like the copy constructors to do the right thing.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void Copy(
	CommonObject source,
	CommonObject destination
)
Public Shared Sub Copy (
	source As CommonObject,
	destination As CommonObject
)
Parameters
source
Type: Rhino.Runtime.CommonObject
A source object for the data.
destination
Type: Rhino.Runtime.CommonObject
A destination object for the data.
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace