RhinoCommon API
Transform.Clone Method
 Returns a deep copy of the transform. For languages that treat structures as value types, this can be accomplished by a simple assignment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Clone()
Public Function Clone As Transform
Return Value
Type: Transform
A deep copy of this data structure.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Transform Structure
Rhino.Geometry Namespace