RhinoCommon API
FileReadOptions.Dispose Method
Releases all resources used by the FileReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
FileReadOptions Class
Dispose Overload
Rhino.FileIO Namespace