RhinoCommon API
PolyCurve.Append Method (Line)
 Appends and matches the start of the line to the end of polycurve. This function will fail if the polycurve is closed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Append(
	Line line
)
Public Function Append (
	line As Line
) As Boolean
Parameters
line
Type: Rhino.Geometry.Line
Line segment to append.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
PolyCurve Class
Append Overload
Rhino.Geometry Namespace