RhinoCommon SDK
DisplayMaterial Constructor (Material)
Initializes a new instance of the DisplayMaterial class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayMaterial(
	Material material
)
Public Sub New (
	material As Material
)
Parameters
material
Type: Rhino.DocObjects.Material
[Missing <param name="material"/> documentation for "M:Rhino.Display.DisplayMaterial.#ctor(Rhino.DocObjects.Material)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace