RhinoCommon SDK
GetBaseClass.AddOptionColor Method (LocalizeStringPair, OptionColor, String)
 Add a command line option to get colors and automatically save the value.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOptionColor(
	LocalizeStringPair optionName,
	ref OptionColor colorValue,
	string prompt
)
Public Function AddOptionColor (
	optionName As LocalizeStringPair,
	ByRef colorValue As OptionColor,
	prompt As String
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
option description.
colorValue
Type: Rhino.Input.Custom.OptionColor
The current color value.
prompt
Type: System.String
option prompt shown if the user selects this option
Return Value
Type: Int32
option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOptionColor Overload
Rhino.Input.Custom Namespace