RhinoCommon SDK
Curve.GetLength Method (Interval)
Get the length of a sub-section of the curve with a fractional tolerance of 1e-8.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GetLength(
	Interval subdomain
)
Public Function GetLength (
	subdomain As Interval
) As Double
Parameters
subdomain
Type: Rhino.Geometry.Interval
 The calculation is performed on the specified sub-domain of the curve (must be non-decreasing).
Return Value
Type: Double
The length of the sub-curve on success, or zero on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
GetLength Overload
Rhino.Geometry Namespace