RhinoCommon API
CommonObject.NonConstOperation Method
 For derived classes implementers.
Defines the necessary implementation to free the instance from being const.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void NonConstOperation()
Protected Overridable Sub NonConstOperation
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace