RhinoCommon API
CurveIntersections.GetEnumerator Method
 Returns an enumerator that is capable of yielding all IntersectionEvents in the collection.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<IntersectionEvent> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of IntersectionEvent)
Return Value
Type: IEnumerator<IntersectionEvent>
The constructed enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace