RhinoCommon API
File3dmStringTable.GetValue Method (String)
 Returns a string value at a key.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetValue(
	string key
)
Public Function GetValue (
	key As String
) As String
Parameters
key
Type: System.String
The key at which to get the value.
Return Value
Type: String
The string value if successful.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmStringTable Class
GetValue Overload
Rhino.FileIO Namespace