RhinoCommon API
Vector3d Implicit Conversion (Vector3f to Vector3d)
 Converts a single-precision (float) vector in a double-precision vector, without needing casting.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator Vector3d (
	Vector3f vector
)
Public Shared Widening Operator CType (
	vector As Vector3f
) As Vector3d
Parameters
vector
Type: Rhino.Geometry.Vector3f
A single-precision vector.
Return Value
Type: Vector3d
The same vector, expressed using double-precision values.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace