RhinoCommon API
NeverRepeatList.SetList Method
Puts the command name tokens in m_dont_repeat_list.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int SetList(
	string[] commandNames
)
Public Shared Function SetList (
	commandNames As String()
) As Integer
Parameters
commandNames
Type: System.String[]
[Missing <param name="commandNames"/> documentation for "M:Rhino.ApplicationSettings.NeverRepeatList.SetList(System.String[])"]
Return Value
Type: Int32
Number of items added to m_dont_repeat_list.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
NeverRepeatList Class
Rhino.ApplicationSettings Namespace