RhinoCommon API
File3dmPlugInDataTable.GetEnumerator Method
 Gets the enumerator that visits any File3dmPlugInData in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<File3dmPlugInData> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmPlugInData)
Return Value
Type: IEnumerator<File3dmPlugInData>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace