RhinoCommon API
LengthValue.Length Method
 Length value in this instance's current unit system
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Length()
Public Function Length As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.LengthValue.Length"]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LengthValue Class
Length Overload
Rhino Namespace