RhinoCommon SDK
BinaryArchiveReader.ReadPlane Method
 Reads a Plane from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane ReadPlane()
Public Function ReadPlane As Plane
Return Value
Type: Plane
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace