RhinoCommon SDK
BrepRegion.GetFaceSides Method
 Gets an array of BrepRegionFaceSide entities delimiting this region.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepRegionFaceSide[] GetFaceSides()
Public Function GetFaceSides As BrepRegionFaceSide()
Return Value
Type: BrepRegionFaceSide[]
An array of region face sides. This array might be empty on failure.
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace