RhinoCommon API
ArchivableDictionary.ReplaceContentsWith Method
 Replace the contents of the dictionary with that of the given source dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReplaceContentsWith(
	ArchivableDictionary source
)
Public Function ReplaceContentsWith (
	source As ArchivableDictionary
) As Boolean
Parameters
source
Type: Rhino.Collections.ArchivableDictionary
[Missing <param name="source"/> documentation for "M:Rhino.Collections.ArchivableDictionary.ReplaceContentsWith(Rhino.Collections.ArchivableDictionary)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.ReplaceContentsWith(Rhino.Collections.ArchivableDictionary)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace