RhinoCommon API
BrepFace.ClearMaterialChannelIndex Method
 Clear this face's rendering material channel index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearMaterialChannelIndex()
Public Sub ClearMaterialChannelIndex
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace