RhinoCommon API
PointCloud.GetEnumerator Method
 Gets an enumerator that allows to modify each pointcloud point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<PointCloudItem> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of PointCloudItem)
Return Value
Type: IEnumerator<PointCloudItem>
A instance of IEnumerator<T>.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace