RhinoCommon API
RenderContentCollection.Dispose Method
Releases all resources used by the RenderContentCollection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace