RhinoCommon API
AppearanceSettings.GetDefaultState Method
 Gets the factory settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AppearanceSettingsState GetDefaultState()
Public Shared Function GetDefaultState As AppearanceSettingsState
Return Value
Type: AppearanceSettingsState
An instance of a class that represents all the default settings joined together.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace