RhinoCommon SDK
SubDVertexAccess.AddVertices Method (SubD.SubDVertexTag, IEnumerable<Point3d>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts double-precision points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void AddVertices(
	SubD.SubDVertexTag tag,
	IEnumerable<Point3d> vertices
)
Public Sub AddVertices (
	tag As SubD.SubDVertexTag,
	vertices As IEnumerable(Of Point3d)
)
Parameters
tag
Type: Rhino.Geometry.SubD.SubDVertexTag
The type of vertex tag, such as smooth or corner.
vertices
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of Point3d.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If tag is unset or non-defined.
See Also
Reference
SubDVertexAccess Class
AddVertices Overload
Rhino.Geometry.Collections Namespace