RhinoCommon API
SweepOneRail.SetToRoadlikeFront Method
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetToRoadlikeFront"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetToRoadlikeFront()
Public Sub SetToRoadlikeFront
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace