RhinoCommon SDK
RhinoObject.OnDraw Method
 Called when Rhino wants to draw this object
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnDraw(
	DrawEventArgs e
)
Protected Overridable Sub OnDraw (
	e As DrawEventArgs
)
Parameters
e
Type: Rhino.Display.DrawEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnDraw(Rhino.Display.DrawEventArgs)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace