RhinoCommon API
DoubleField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.DoubleField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.DoubleField.ValueAsObject"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DoubleField Class
Rhino.Render.Fields Namespace