RhinoCommon API
RenderTexture.IsLinear Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.IsLinear"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool IsLinear()
Public Overridable Function IsLinear As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.IsLinear"]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderTexture Class
Rhino.Render Namespace