RhinoCommon API
SimpleArrayExtrusionPointer.NonConstPointer Method
 Gets the non-const pointer (for modification) of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
The non-const pointer.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace