RhinoCommon SDK
FilePdf Methods
The FilePdf type exposes the following members.
Methods
Name | Description
AddPage
 Add a new page to this document
Create
 Create a new instance of a FilePdf class
FirePreWriteEvent
 Called by the framework to fire a PreWrite event
PdfDocumentImplementation
 Get actual implementation of PdfDocument class
Write(Stream)
 Write pdf to a stream
Write(String)
 Write pdf to a file
Top
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace