RhinoCommon API
ViewCaptureWriter Methods
The ViewCaptureWriter type exposes the following members.
Methods
Name | Description
Draw
DrawBitmap
DrawCircle
DrawPath
DrawRectangle
DrawScreenText
FillPolygon
PopClipPath
PushClipPath(RectangleF)
PushClipPath(ViewCaptureWriter.PathPoint[])
SetClipPath
Top
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace