RhinoCommon API
CurvatureAnalysisSettings Methods
The CurvatureAnalysisSettings type exposes the following members.
Methods
Name | Description
CalculateCurvatureAutoRange
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace