RhinoCommon API
AppearanceSettings Methods
The AppearanceSettings type exposes the following members.
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
GetPaintColor
 Gets the .Net library color that is currently associated with a paint color.
GetWidgetColor
 Gets the .Net library color that is currently associated with a widget color.
InitialMainWindowPosition
 Location where the Main Rhino window attempts to show when the application is first started.
RestoreDefaults
 Commits the default settings as the current settings.
SetPaintColor(PaintColor, Color)
 Sets the logical paint color association to a spacific .Net library color, without forced UI update.
SetPaintColor(PaintColor, Color, Boolean)
 Sets the logical paint color association to a spacific .Net library color.
SetWidgetColor(WidgetColor, Color)
 Sets the logical widget color association to a spacific .Net library color, without forced UI update.
SetWidgetColor(WidgetColor, Color, Boolean)
 Sets the logical widget color association to a spacific .Net library color.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace