RhinoCommon API
RhinoMath Methods
The RhinoMath type exposes the following members.
Methods
Name | Description
Clamp(Double, Double, Double)
 Restricts a Double to be specified within an interval of two numbers.
Clamp(Int32, Int32, Int32)
 Restricts a Int32 to be specified within an interval of two integers.
CRC32(UInt32, Byte[])
 Advances the cyclic redundancy check value remainder given a byte array. http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
CRC32(UInt32, Double)
 Advances the cyclic redundancy check value remainder given a Double. http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
CRC32(UInt32, Int32)
 Advances the cyclic redundancy check value remainder given a Int32. http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
EpsilonEquals(Double, Double, Double)
 Compare two doubles for equality within some "epsilon" range
EpsilonEquals(Single, Single, Single)
 Compare to floats for equality within some "epsilon" range
IntIndexToString
 Portrays an Int32 index in text.
IsValidDouble
 Determines whether a Double value is valid within the RhinoCommon context.
Rhino does not use Double.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue
System.Double.IsNaN(x) evaluates to false
System.Double.IsInfinity(x) evaluates to false
IsValidSingle
 Determines whether a Single value is valid within the RhinoCommon context.
Rhino does not use Single.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue,
System.Single.IsNaN(x) evaluates to false
System.Single.IsInfinity(x) evaluates to false
ParseNumber
 Evaluates command line math expression.
ToDegrees
 Convert an angle from radians to degrees.
ToRadians
 Convert an angle from degrees to radians.
TryParseNumber
 Evaluates command line math expression.
UnitScale
Computes the scale factor for changing the measurements unit systems.
Top
See Also
Reference
RhinoMath Class
Rhino Namespace