RhinoCommon API
Ellipse Methods
The Ellipse type exposes the following members.
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
ToNurbsCurve
 Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
Top
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace