RhinoCommon SDK
OrdinateDimension Methods
The OrdinateDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace