RhinoCommon SDK
SelCommand Methods
The SelCommand type exposes the following members.
Methods
Name | Description
RunCommand |  (Overrides Command.RunCommand(RhinoDoc, RunMode).)
SelFilter
 Override this virtual function and return true if object should be selected.
Top
See Also
Reference
SelCommand Class
Rhino.Commands Namespace