RhinoCommon API
BrepLoop Methods
The BrepLoop type exposes the following members.
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
To2dCurve
 Create a 2d curve that traces the entire loop
To3dCurve
 Create a 3D curve that approximates the loop geometry.
Top
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace