RhinoCommon API
ViewCaptureSettings Methods
The ViewCaptureSettings type exposes the following members.
Methods
Name | Description
Dispose
Actively reclaims unmanaged resources that this instance uses.
Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetMargins
 Get distances from the edge of the paper (MediaSize) to the CropRectangle in a defined unit system
GetModelScale
 Returns the model scale factor.
GetOffset
SetLayout
SetMargins
 Set distances from the edge of the paper (MediaSize) to the CropRectange in a defined unit system
SetModelScaleToFit
 Scales the model to fit.
SetModelScaleToValue
 Sets the model scale to a value.
SetOffset
SetViewport
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace