RhinoCommon API
File3dmHistoryRecordTable Methods
The File3dmHistoryRecordTable type exposes the following members.
Methods
Name | Description
Clear
 Remove all entries from this table
Dump
Prepares a text dump of table.
Top
See Also
Reference
File3dmHistoryRecordTable Class
Rhino.FileIO Namespace