RhinoCommon API
GroundPlane Methods
The GroundPlane type exposes the following members.
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Top
See Also
Reference
GroundPlane Class
Rhino.Render Namespace