RhinoCommon API
HatchPattern Methods
The HatchPattern type exposes the following members.
Methods
Name | Description
CreatePreviewGeometry
 Creates preview line segments of the hatch pattern.
ReadFromFile
 Reads hatch pattern definitions from a file.
Top
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace