RhinoCommon API
ShortcutKeySettings Methods
The ShortcutKeySettings type exposes the following members.
Methods
Name | Description
GetMacro
 Get macro associated with a given keyboard shortcut
SetMacro
 Set macro associated with a keyboard shortcut
Top
See Also
Reference
ShortcutKeySettings Class
Rhino.ApplicationSettings Namespace