RhinoCommon API
GetCancel Methods
The GetCancel type exposes the following members.
Methods
Name | Description
Wait<TResult>
WaitAll<TResult>
Top
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace