RhinoCommon SDK
Panels Methods
The Panels type exposes the following members.
Methods
Name | Description
ChangePanelIcon
 Update the icon used for a panel tab.
ClosePanel(Guid)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
ClosePanel(Type)
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
GetOpenPanelIds
 Get a list of the currently open panel tabs in Windows Rhino, on Mac Rhino it will be a list of the currently visible modeless panel dialogs.
GetPanel(Guid)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel(Guid, RhinoDoc)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel(Guid, UInt32)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
GetPanel<T>() |  Obsolete.
 Return an instance of a .Net panel
GetPanel<T>(UInt32)
 Return an instance of a .Net panel
GetPanel<T>(RhinoDoc)
 Return an instance of a .Net panel
IsHiding
 Check to see if reason is equal to any of the show events
IsPanelVisible(Guid)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Type)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Guid, Boolean)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Type, Boolean)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsShowing
 Check to see if reason is equal to any of the hide events
OnClosePanel
 Call this method to raise the Closed event
OnShowPanel
 Call this method to raise the Show event
OpenPanel(Guid)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Type)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Guid)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Guid, Type)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Guid, Boolean)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Type, Boolean)
 Open the specified panel in its current or default location and if it is in a dock bar containing more than one tab, make it the current tab.
OpenPanel(Guid, Guid, Boolean)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanel(Guid, Type, Boolean)
 In Mac Rhino this will just call the version of OpenPanel that takes a class type Id. In Windows Rhino this will look for a dock bar with the specified Id and open or move the specified panel to that dock bar.
OpenPanelAsSibling(Guid, Guid)
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
OpenPanelAsSibling(Guid, Guid, Boolean)
 In Mac Rhino this will currently just call OpenPanel, in Windows Rhino this will look for a dock bar which contains the sibling panel and add this panel to that dock bar as necessary, if the panel was in another dock bar it will be moved to this dock bar.
PanelDockBar(Guid)
 Will always return Guid.Emty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
PanelDockBar(Type)
 Will always return Guid.Emty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
RegisterPanel
 You typically register your panel class in your plug-in's OnLoad function. This will register your custom call with Rhino, Rhino will create an instance of your class the first time your panel is created and embed this instance of your class in a panel container.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace