RhinoCommon API
Box Methods
The Box type exposes the following members.
Methods
Name | Description
ClosestPoint
 Finds the closest point on or in the Box. The box should be Valid for this to work.
Contains(BoundingBox)
 Test a boundingbox for Box inclusion. This is the same as calling Contains(box,false)
Contains(Box)
 Test a box for Box inclusion. This is the same as calling Contains(box,false)
Contains(Point3d)
 Determines whether a point is included in this box. This is the same as calling Contains(point,false)
Contains(BoundingBox, Boolean)
 Test a boundingbox for Box inclusion.
Contains(Box, Boolean)
 Test a box for Box inclusion.
Contains(Point3d, Boolean)
 Determines whether a point is included in this box.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
FurthestPoint
 Finds the furthest point on the Box. The Box should be Valid for this to work properly.
GetCorners
 Gets an array of the 8 corner points of this box.
Inflate(Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
Inflate(Double, Double, Double)
 Inflates the box by a given offset in each direction. Inflating with negative amounts may result in decreasing boxes. InValid boxes cannot be inflated.
MakeValid
 Attempts to make the Box valid. This is not always possible.
PointAt
 Evaluates the box volume at the given unitized parameters.
The box has idealized side length of 1x1x1.
RepositionBasePlane
 Repositions the origin of the Base plane for this box without affecting the physical dimensions.
ToBrep
 Constructs a brep representation of this box.
ToExtrusion
 Constructs an extrusion representation of this box.
Transform
 Transforms this Box using a Transformation matrix. If the Transform does not preserve Similarity, the dimensions of the resulting box cannot be trusted.
Union
 Constructs a union between this Box and the given point. This grows the box in directions so it contains the point.
Top
See Also
Reference
Box Structure
Rhino.Geometry Namespace