RhinoCommon API
Skin Methods
The Skin type exposes the following members.
Methods
Name | Description
HideSplash
Is called when the splash screen should be hidden.
OnBeginLoadAtStartPlugIns
Is called when the first plug-in that loads at start-up is going to be loaded.
OnBeginLoadPlugIn
Is called when a specific plug-in is going to be loaded.
OnBuiltInCommandsRegistered
Is called when built-in commands are registered.
OnEndLoadAtStartPlugIns
Is called after all of the load at start plug-ins have been loaded.
OnEndLoadPlugIn
Is called after each plug-in has been loaded.
OnLicenseCheckCompleted
Is called when the license check is completed.
OnMainFrameWindowCreated
Is called when the main frame window is created.
ShowHelp
 Called when the "help" splash screen should be shown. Default implementation just calls ShowSplash()
ShowSplash
Is called when the splash screen should be shown.
Top
See Also
Reference
Skin Class
Rhino.Runtime Namespace