RhinoCommon SDK
GripObject Methods
The GripObject type exposes the following members.
Methods
Name | Description
GetCageParameters
 Retrieves the 2d parameter space values of this GripObject from the cage it's associated with.
GetCurveParameters
 Retrieves the 2d parameter space values of this GripObject from the curve it's associated with.
GetGripDirections
 Sometimes grips have directions. These directions can have any length and do not have to be orthoganal.
GetSurfaceParameters
 Retrieves the 2d parameter space values of this GripObject from the surface it's associated with.
Move(Point3d)
 Moves the grip to a new location.
Move(Transform)
 Moves the grip to a new location.
Move(Vector3d)
 Moves the grip to a new location.
NeighborGrip
 Used to get a grip's logical neighbors, like NURBS curve, suface, and cage control point grips.
UndoMove
 Undoes any grip moves made by calling Move.
Top
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace