RhinoCommon API
Decal Methods
The Decal type exposes the following members.
Methods
Name | Description
ConstPointer
Create
CustomData
 Gets custom data associated with this decal - see Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
NonConstPointer
TryGetColor
 Blend color with the decal color at a given point.
UVBounds
 The UV bounds of the decal. Only used when mapping is UV.
Top
See Also
Reference
Decal Class
Rhino.Render Namespace