RhinoCommon API
InstanceDefinitionGeometry Methods
The InstanceDefinitionGeometry type exposes the following members.
Methods
Name | Description
GetObjectIds
 list of object ids in the instance geometry table
In Rhino for Windows 6.5, this member is inherited from .CommonObjectOnSwitchToNonConst().
Top
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace