RhinoCommon SDK
RhinoDoc Methods
The RhinoDoc type exposes the following members.
Methods
Name | Description
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>)
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>, Object)
 Add a custom undo event so you can undo private plug-in data when the user performs an undo or redo
AdjustModelUnitSystem
AdjustPageUnitSystem
BeginUndoRecord
 Instructs Rhino to begin recording undo information when the document is changed outside of a command. We use this, e.g., to save changes caused by the modeless layer or object properties dialogs when commands are not running.
ClearRedoRecords
ClearUndoRecords(Boolean)
ClearUndoRecords(UInt32, Boolean)
CreateDefaultAttributes
 Gets the default object attributes for this document. The attributes will be linked to the currently active layer and they will inherit the Document WireDensity setting.
EndUndoRecord
 Ends the undo record.
Equals(Object) |  (Overrides Object.Equals(Object).)
ExtractPreviewImage
Extracts the bitmap preview image from the specified model (3DM).
FindFile
 Search for a file using Rhino's search path. Rhino will look in the following places: 1. Current model folder 2. Path specified in options dialog/File tab 3. Rhino system folders 4. Rhino executable folder
FromFilePath
 Search the open document list for a document with a Path equal to the specified file path.
FromId |  Obsolete.
FromRuntimeSerialNumber
GetAnalysisMeshingParameters
 Get analysis meshing parameters currently used by the document
GetCurrentMeshingParameters
 Get the custom meshing parameters that this document will use.
GetEmbeddedFilesList
GetGumballPlane
 Returns the active plane of Rhino's auto-gumball widget. Note, when calling from a Rhino command, make sure the command class has the Rhino.Commands.Style.Transparent command style attribute.
GetHashCode() |  (Overrides Object.GetHashCode().)
GetMeshingParameters
 Get MeshingParameters currently used by the document
GetRenderPrimitives(Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(ViewportInfo, Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(Guid, ViewportInfo, Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetUnitSystemName
Open
 Opens a 3dm file and makes it the active document. If called on windows the active document will be saved and closed and the new document will be opened and become the active document. If called on the Mac the file will be opened in a new document window.
OpenDocuments
 Returns a list of currently open Rhino documents
OpenFile |  Obsolete.
ReadFile
ReadFileVersion
 Returns the file version of the current document. Use this function to determine which version of Rhino last saved the document.
SetCustomMeshingParameters
 Set the custom meshing parameters that this document will use. You must also modify the MeshingParameterStyle property on the document to Custom if you want these meshing parameters to be used
WriteFile
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace