RhinoCommon API
ClippingPlaneObject Methods
The ClippingPlaneObject type exposes the following members.
Methods
Name | Description
AddClipViewport
 Adds a viewport to the list of viewports that this clipping plane clips.
RemoveClipViewport
 Removes a viewport from the list of viewports that this clipping plane clips.
Top
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace