RhinoCommon SDK
LinearWorkflow Methods
The LinearWorkflow type exposes the following members.
Methods
Name | Description
CopyFrom
 Create a copy of linearworkflow
 (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Equals
 Compare two LinearWorkflow objects. They are considered equal when their Hashes match.
 (Overrides Object.Equals(Object).)
GetHashCode
 Get hash code for this object. It is the Hash property cast to int.
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace