RhinoCommon API
DisplayMaterial Methods
The DisplayMaterial type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetBitmapTexture
GetBumpTexture
 Gets the bump texture for this display material.
GetEnvironmentTexture
GetTransparencyTexture
SetBitmapTexture(String, Boolean)
SetBitmapTexture(Texture, Boolean)
SetBumpTexture(String, Boolean)
SetBumpTexture(Texture, Boolean)
SetEnvironmentTexture(String, Boolean)
SetEnvironmentTexture(Texture, Boolean)
SetTransparencyTexture(String, Boolean)
SetTransparencyTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace