RhinoCommon API
SupportOptions Methods
The SupportOptions type exposes the following members.
Methods
Name | Description
AlwaysShowSunPreview
AutoSaveKeepAmount
AutoSaveRenderings
CheckSupportFilesBeforeRendering
CombineEditors
CustomLibraryPath
CustomPaths
DarkPreviewCheckerColor
EnablePreviewJobLog
HarvestContentParameters
LabelFormatLoc
LabelFormatUtc
LastNavigatedLocation
LibrariesInitialLocation
LibrariesInitialLocationCustomFolder
LightPreviewCheckerColor
MaxPreviewCacheMB
MaxPreviewSeconds
MultithreadedTextureEvaluation
PreferNativeRenderer
PreferredUnpackFolder
PreviewCustomRenderMeshes
SetAlwaysShowSunPreview
SetAutoSaveKeepAmount
SetAutoSaveRenderings
SetCheckSupportFilesBeforeRendering
SetCombineEditors
SetCustomLibraryPath
SetCustomPaths
SetHarvestContentParameters
SetLabelFormatLoc
SetLabelFormatUtc
SetLastNavigatedLocation
SetLibrariesInitialLocation
SetLibrariesInitialLocationCustomFolder
SetMultithreadedTextureEvaluation
SetPreferNativeRenderer
SetPreferredUnpackFolder
SetPreviewCustomRenderMeshes
SetShowCustom
SetShowDetailsPanel
SetShowDocuments
SetShowRenderContent
SetSupportSharedUIs
SetTextureSize |  Obsolete.
SetUseDefaultLibraryPath
SetUsePreviewCache
SetUseQuickInitialPreview
ShowCustom
ShowDetailsPanel
ShowDocuments
ShowRenderContent
SupportSharedUIs
SupportSharedUIsNoCache
TextureSize
UseDefaultLibraryPath
UsePreview
UsePreviewCache
UseQuickInitialPreview
UseRenderedPreview
Top
See Also
Reference
SupportOptions Class
Rhino.Render Namespace