RhinoCommon API
ObjectAttributes Methods
The ObjectAttributes type exposes the following members.
Methods
Name | Description
AddHideInDetailOverride
 Make this object hidden in a given detail
AddToGroup
 Adds object to the group with specified index by appending index to group list.
If the object is already in group, nothing is changed.
ComputedPlotColor(RhinoDoc)
ComputedPlotColor(RhinoDoc, Guid)
ComputedPlotWeight(RhinoDoc)
ComputedPlotWeight(RhinoDoc, Guid)
DeleteAllUserStrings
DeleteUserString
DrawColor(RhinoDoc)
DrawColor(RhinoDoc, Guid)
Duplicate
 Constructs a copy of this ObjectAttributes instance.
GetDisplayModeOverride
 Returns the id of the display mode of an objects. Object display modes are view based. Thus, it is possible to have an object display different in different views.
GetGroupList
 Returns an array of GroupCount group indices. If GroupCount is zero, then GetGroupList() returns null.
GetHideInDetailOverrides
 Get list of details that this object is supposed to be hidden in
GetUserString
 Gets a user string.
GetUserStrings
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
HasDisplayModeOverride
 Determines if an object has a display mode override for a given viewport.
HasHideInDetailOverrideSet
Is this object supposed to be hidden in a given detail
RemoveDisplayModeOverride()
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This function resets an object to use the viewport's display mode for all viewports.
RemoveDisplayModeOverride(Guid)
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This function resets an object to use the viewport's display mode.
RemoveFromAllGroups
Removes object from all groups.
RemoveFromGroup
 removes object from the group with specified index.
If the object is not in the group, nothing is changed.
RemoveHideInDetailOverride
 Remove hidden in detail flag for a specific detail
SetDisplayModeOverride(DisplayModeDescription)
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This version affects the object's display mode for all viewports.
SetDisplayModeOverride(DisplayModeDescription, Guid)
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This version sets a display mode for a specific viewport.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Transform
 Apply a transformation.
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace