RhinoCommon API
ViewTable Methods
The ViewTable type exposes the following members.
Methods
Name | Description
Add
 Constructs a new Rhino view and, at the same time, adds it to the list.
AddPageView(String)
 Constructs a new page view with a given title and, at the same time, adds it to the list.
AddPageView(String, Double, Double)
 Constructs a new page view with a given title and size and, at the same time, adds it to the list.
DefaultViewLayout
EnableCameraIcon
 Use to turn camera icon on and off
Find(Guid)
 Finds a view in this document with a given main viewport Id.
Find(String, Boolean)
 Finds a view in this document with a main viewport that has a given name. Note that there may be multiple views in this document that have the same name. This function only returns the first view found. If you want to find all the views with a given name, use the GetViewList function and iterate through the views.
FlashObjects
 Cause objects selection state to change momentarily so the object appears to flash on the screen.
FourViewLayout
GetEnumerator
GetPageViews
 Gets all page views in the document.
GetStandardRhinoViews
GetViewList
Gets an array of all the views.
IsCameraIconVisible
 Determine if a camera icon is being shown
Redraw
Redraws all views.
ThreeViewLayout
Top
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace