RhinoCommon API
DisplayConduit Methods
The DisplayConduit type exposes the following members.
Methods
Name | Description
CalculateBoundingBox
 Library developers should override this function to increase the bounding box of scene so it includes the geometry that you plan to draw in the "Draw" virtual functions.
The default implementation does nothing.
CalculateBoundingBoxZoomExtents
 If you want to participate in the Zoom Extents command with your display conduit, then you will need to override ZoomExtentsBoundingBox. Typically you could just call your CalculateBoundingBox override, but you may also want to spend a little more time here and compute a tighter bounding box for your conduit geometry if that is needed.
The default implementation does nothing.
DrawForeground
 Called after all non-highlighted objects have been drawn and PostDrawObjects has been called. Depth writing and testing are turned OFF. If you want to draw with depth writing/testing, see PostDrawObjects.
The default implementation does nothing.
DrawOverlay
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
The default implementation does nothing.
ObjectCulling
The default implementation does nothing.
PostDrawObjects
 Called after all non-highlighted objects have been drawn. Depth writing and testing are still turned on. If you want to draw without depth writing/testing, see DrawForeground.
The default implementation does nothing.
PreDrawObject
 Called before every object in the scene is drawn.
PreDrawObjects
 Called before objects are been drawn. Depth writing and testing are on.
The default implementation does nothing.
Top
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace