RhinoCommon API
ISettingsService Methods
The ISettingsService type exposes the following members.
Methods
Name | Description
DeleteSettingsFile
 Deletes the settings file.
ReadSettings
 Read settings XML contents into a Stream which will get passed to a XML document for parsing.
TestHarness
WriteSettings
 Writes the settings to OS specific location.
Top
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace