RhinoCommon API
SimpleArrayBinaryArchiveReader Methods
The SimpleArrayBinaryArchiveReader type exposes the following members.
Methods
Name | Description
Add
 Adds a new Interval at the end of this array.
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Get the Guid at index
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
Top
See Also
Reference
SimpleArrayBinaryArchiveReader Class
Rhino.Runtime.InteropWrappers Namespace