RhinoCommon SDK
SubDVertexSectorIterator Methods
The SubDVertexSectorIterator type exposes the following members.
Methods
Name | Description
AdvanceToNextFace
Dispose
Duplicate
Finalize |  (Overrides Object.Finalize().)
IncrementFace()
IncrementFace(Boolean, Boolean)
IncrementFaceToCrease
RecedeToPreviousFace
Reset
ResetToCurrentFace
ResetToFirstFace
Top
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace