RhinoCommon SDK
Channel Methods
The RenderWindow.Channel type exposes the following members.
Methods
Name | Description
AddValue
 Add value to existing values at point x, y. If x or y are out of range, the function will fail and may crash Rhino.
Dispose()
Dispose(Boolean)
PixelSize
 Returns the size of the data in one pixel in the channel. For RDK standard channels, this value is always sizeof(float). For the special chanRGBA collective channel, this value is 4 * sizeof(float).
SetValue(Int32, Int32, Color4f)
 If x or y are out of range, the function will fail and may crash Rhino.
SetValue(Int32, Int32, Single)
 If x or y are out of range, the function will fail and may crash Rhino.
SetValues
 Set a pixel buffer
Top
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace