RhinoCommon API
Mesh Methods
The Mesh type exposes the following members.
Methods
Name | Description
GetMeshes
 Get a SimpleArrayMeshPointer containing all meshes for the related Mesh
Id
 Get the Object Guid this mesh is for.
Top
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace