RhinoCommon API
PointCloud Methods
The PointCloud type exposes the following members.
Methods
Name | Description
Add(Point3d)
 Append a new point to the end of the list.
Add(Point3d, Vector3d)
 Append a new point to the end of the list.
Add(Point3d, Color)
 Append a new point to the end of the list.
Add(Point3d, Vector3d, Color)
 Append a new point to the end of the list.
AddRange(IEnumerable<Point3d>)
 Appends a collection of points to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Vector3d>)
 Appends a collection of points and normal vectors to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Color>)
 Appends a collection of points and normal vectors to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Vector3d>, IEnumerable<Color>)
 Appends a collection of points and normal vectors to this point cloud.
AppendNew
 Appends a new PointCloudItem to the end of this point cloud.
AsReadOnlyListOfPoints
 Returns an enumerator and list indexer over point cloud locations.
ClearColors
 Destroys the color information in this point cloud.
ClearHiddenFlags
 Destroys the hidden flag information in this point cloud.
ClearNormals
 Destroys the normal vector information in this point cloud.
ClosestPoint
 Returns index of the closest point in the point cloud to a given test point.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
GetColors
 Copy all the point colors in this point cloud to an array.
GetEnumerator
 Gets an enumerator that allows to modify each pointcloud point.
GetNormals
 Copy all the normal vectors in this point cloud to an array.
GetPoints
 Copy all the point coordinates in this point cloud to an array.
Insert(Int32, Point3d)
Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d)
Inserts a new point into the point list.
Insert(Int32, Point3d, Color)
 Inserts a new point into the point list.
Insert(Int32, Point3d, Vector3d, Color)
 Inserts a new point into the point list.
InsertNew
 Inserts a new PointCloudItem at a specific position of the point cloud.
InsertRange
 Append a collection of points to this point cloud.
Merge
 Copies the point values of another pointcloud into this one.
In Rhino for Windows, this member is overridden by NonConstOperation().
PointAt
 Returns the location of the point at a specific index.
RemoveAt
 Remove the point at the given index.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace