RhinoCommon API
InstanceDefinition Methods
The InstanceDefinition type exposes the following members.
Methods
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
CreatePreviewBitmap(DefinedViewportProjection, Size, Boolean)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size, Boolean)
Equals(Object)
 Equality is checked against InstanceDefinition.Id
 (Overrides Object.Equals(Object).)
GetContainers
 Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
GetHashCode()
 Use Id.GetHashCode()
 (Overrides Object.GetHashCode().)
GetObjects
 Gets an array with the objects that belong to this instance definition.
GetReferences
 Gets a list of the CRhinoInstanceObjects (inserts) that contains a reference this instance definition.
InUse
 Determines whether the instance definition is referenced.
Object
 returns an object used as part of this definition.
UsesDefinition
 Determines if this instance definition contains a reference to another instance definition.
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace