RhinoCommon SDK
MeshClash Methods
The MeshClash type exposes the following members.
Methods
Name | Description
Search(Mesh, Mesh, Double, Int32)
 Searches the locations where the distance from the first mesh to the second mesh is less than the provided value.
Search(Mesh, IEnumerable<Mesh>, Double, Int32)
 Searches the locations where the distance from the first mesh to a mesh in the second set of meshes is less than the provided value.
Search(IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Int32)
 Searches for locations where the distance from a mesh in one set of meshes is less than distance to another mesh in a second set of meshes.
Top
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace