RhinoCommon API
RenderMaterial Methods
The RenderMaterial type exposes the following members.
Methods
Name | Description
CreateBasicMaterial(Material)
 Constructs a new basic material from a Material.
CreateBasicMaterial(Material, RhinoDoc)
GetTextureAmountFromUsage
GetTextureFromUsage
GetTextureOnFromUsage
HandleTexturedValue<T>
 Handle a textured content field. Values will be read into an instance of TexturedColor
SimulateMaterial(Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
SimulateMaterial(Material, Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
TextureChildSlotName
 Override this function to provide information about which texture is used for the standard (ie - defined in ON_Texture) texture channels.
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace