RhinoCommon SDK
File3dmLayerTable Methods
The File3dmLayerTable type exposes the following members.
Methods
Name | Description
FindIndex
 Retrieves a Layer object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Layer given its name.
FindNameHash
 Finds a Layer given its name hash.
Top
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace