RhinoCommon API
BlockEditCommand Methods
The BlockEditCommand type exposes the following members.
Methods
Name | Description
InBlockEditMode
 Call this method to determine if a document is being blocked edited.
IsBlockEditing
 Called to determine if the specified document was not block edit mode.
ReplaceWith
 Call this method to register your replacement command, the last command registered will be called.
RunCommand
 Called by the internal BlockEdit command when the command is executed.
Top
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace