RhinoCommon SDK
CurveObject Methods
The CurveObject type exposes the following members.
Methods
Name | Description
DuplicateCurveGeometry
Top
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace