RhinoCommon API
TextEntity Methods
The TextEntity type exposes the following members.
Methods
Name | Description
Create
 Create Text geometry or null if input is invalid
CreateCurves
 Returns the outline curves.
CreateExtrusions
 Creates extrusions from the outline curves with specified height.
CreatePolySurfaces
 Creates breps from the outline curves with specified height.
CreateSurfaces
 Creates planar breps from the outline curves.
CreateWithRichText
 Create RichText geometry or null if input is invalid
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Explode
 Explodes this text entity into an array of curves.
In Rhino for Windows, this member is overridden by GetBoundingBox(Transform).
GetTextTransform
 Get the transform for this text object's text geometry
In Rhino for Windows, this member is overridden by NonConstOperation().
Transform(Transform, DimensionStyle)
 Transform the object by a 4x4 transform matrix and change text height override to accommodate scaling in the transform if necessary
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace