RhinoCommon API
CachedTextureCoordinates Methods
The CachedTextureCoordinates type exposes the following members.
Methods
Name | Description
Add
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Clear
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Contains
 Determines whether this collection contains a specific value.
CopyTo
 Copies the elements of the this collection to an System.Array, starting at a particular System.Array index.
GetEnumerator
 Returns an enumerator that iterates through this collection.
IndexOf
 Determines the index of a specific point in this collection.
Insert
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Remove
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
RemoveAt
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
TryGetAt
 Use this method to iterate the cached texture coordinate array.
Top
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace