RhinoCommon API
BrepTrimList Methods
The BrepTrimList type exposes the following members.
Methods
Name | Description
Add(Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
Add(Boolean, BrepEdge, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep
Add(Boolean, BrepLoop, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep
Add(BrepEdge, Boolean, BrepLoop, Int32)
 Add a new trim that will be part of an inner, outer, or slit loop to the brep.
AddCurveOnFace
Add a new curve on face to the brep
AddSingularTrim
 Add a new singular trim to the brep.
GetEnumerator
 Gets an enumerator that visits all edges.
Top
See Also
Reference
BrepTrimList Class
Rhino.Geometry.Collections Namespace