RhinoCommon API
GroupTable Methods
The GroupTable type exposes the following members.
Methods
Name | Description
Add()
Adds a new empty group to the group table.
Add(IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Add(String)
Adds a new empty group to the group table.
Add(String, IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
AddToGroup(Int32, IEnumerable<Guid>)
 Adds a list of objects to an existing group.
AddToGroup(Int32, Guid)
 Adds an object to an existing group.
ChangeGroupName
Delete(Int32)
 Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo will work with groups. Call IsDeleted() to determine if a group is deleted.
Delete(Group) |  (Overrides CommonComponentTable<T>.Delete(T).)
Find
Finds a group with a given name.
FindIndex
 Retrieves a Group object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Linetype given its name. Returns the instance, rather than the index.
FindNameHash
 Finds a Linetype given its name hash.
GroupMembers
 Gets an array of all of the objects in a group.
GroupName
GroupNames
GroupObjectCount
Hide
IsDeleted
Lock
Show
Undelete
Unlock
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace