RhinoCommon API
CustomMeshObject Methods
The CustomMeshObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
CustomMeshObject Class
Rhino.DocObjects.Custom Namespace