RhinoCommon API
Linetype Methods
The Linetype type exposes the following members.
Methods
Name | Description
AppendSegment
Adds a segment to the pattern.
CommitChanges
Default
 Set linetype to default settings.
GetSegment
 Gets the segment information at a index.
ReadFromFile
 Reads linetypes from either a Rhino .3dm file or an AutoCAD .lin file.
RemoveSegment
Removes a segment in the linetype.
SetSegment
Sets the length and type of the segment at index.
SetSegments
Set all segments.
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace