RhinoCommon API
MorphControl Methods
The MorphControl type exposes the following members.
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Morph
Applies the space morph to geometry.
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace