RhinoCommon API
Point2f Methods
The Point2f type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this Point2f with another Point2f.
Coordinates evaluation priority is first X, then Y.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Point2f and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point2f)
 Determines whether the specified Point2f has the same values as the present point.
GetHashCode
 Computes a hash number that represents the current point.
 (Overrides ValueType.GetHashCode().)
ToString
 Constructs the string representation for the current point.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace