RhinoCommon API
Sun Methods
The Sun type exposes the following members.
Methods
Name | Description
AltitudeFromValues
ColorFromAltitude
Get sun color based on altitude.
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Finalize |  (Overrides FreeFloatingBase.Finalize().)
GetDateTime
Here
JulianDay
SetDateTime
SetPosition(Double, Double)
 Sets position of the Sun based on azimuth and altitude values. Using this function will also set sun to manual.
SetPosition(DateTime, Double, Double)
 Sets position of the sun based on physical location and time.
SunDirection
TwilightZone
Top
See Also
Reference
Sun Class
Rhino.Render Namespace