RhinoCommon API
IPanel Methods
Methods
Name | Description
PanelClosing(UInt32)
PanelClosing(UInt32, Boolean)
PanelHidden(UInt32)
PanelHidden(UInt32, ShowPanelReason)
PanelShown(UInt32)
PanelShown(UInt32, ShowPanelReason)
Top
See Also
Reference
IPanel Interface
Rhino.UI Namespace