RhinoCommon API
DocumentOrFreeFloatingBase Methods
The DocumentOrFreeFloatingBase type exposes the following members.
Methods
Name | Description
BeginChange
 Call this function before making any change to this object (calling a setter) otherwise undo will not work correctly. Calls to BeginChange must be paired with a call to EndChange.
EndChange
 See BeginChange
Top
See Also
Reference
DocumentOrFreeFloatingBase Class
Rhino.Render Namespace