RhinoCommon API
MaterialTable Methods
The MaterialTable type exposes the following members.
Methods
Name | Description
Add()
 Adds a new material to the table based on the default material.
Add(Material)
 Adds a new material to the table based on a given material.
Add(Material, Boolean)
 Adds a new material to the table based on a given material.
Delete |  (Overrides CommonComponentTable<T>.Delete(T).)
DeleteAt
 Removes a material at a specific position from this material table.
Find(Guid, Boolean)
Finds a material with a matching id.
Find(String, Boolean)
 Finds a meterial with a given name.
FindIndex
 Retrieves a Material object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
GetEnumerator
In Rhino for Windows 6.3, this member is inherited from .CommonComponentTable<T>GetEnumerator().
Modify
Modify material settings.
ResetMaterial
Top
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace