RhinoCommon API
TextureEvaluator Methods
The TextureEvaluator type exposes the following members.
Methods
Name | Description
Dispose()
 For Dispose pattern
Dispose(Boolean)
 For Dispose pattern
Finalize
 For Dispose pattern
 (Overrides Object.Finalize().)
GetColor
 Get the color of the texture at a particular point in uvw space. May be called from within a rendering shade pipeline. note For ray differentials see Pharr Humphreys, "Physically Based Rendering", chapter 11.
Initialize
 Call this function before calling GetColor for the first time. Ideally, this should be on the main thread, but you can also call it on a worker thread as long as you are sure that Initialize() or GetColor() cannot be called at the same time on another thread.
Top
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace