RhinoCommon API
RhinoObject Methods
The RhinoObject type exposes the following members.
Methods
Name | Description
CommitChanges
 Moves changes made to this RhinoObject into the RhinoDoc.
CreateMeshes
 Create meshes used to render and analyze surface and polysrf objects.
Description
 Get a brief description of a object, including it's attributes and geometry.
DuplicateGeometry
 Constructs a deep (full) copy of the geometry.
EnableCustomGrips
Turns on/off the object's editing grips.
EnableVisualAnalysisMode
 Used to turn analysis modes on and off.
FromRuntimeSerialNumber
 Get a Rhino object for a unique runtime serial number
GetActiveVisualAnalysisModes
 Gets a list of currently enabled analysis modes for this object.
GetCustomRenderMeshParameter
 Query the object for the value of a given named custom render mesh parameter.
GetDynamicTransform
 While an object is being dynamically tranformed (dragged, rotated, ...), the current transformation can be retrieved and used for creating dynamic display.
GetFillSurfaces(RhinoObject, ClippingPlaneObject)
 Return list of fill surfaces if any for object and clipping plane.
GetFillSurfaces(RhinoObject, IEnumerable<ClippingPlaneObject>)
 Return list of fill surfaces if any for object and clipping plane. Fills are trimmed by clipping planes that did not generate them.
GetFillSurfaces(RhinoObject, IEnumerable<ClippingPlaneObject>, Boolean)
 Return list of fill surfaces if any for object and clipping plane.
GetGrips
 Returns grips for this object If grips are enabled. If grips are not enabled, returns null.
GetGroupList
 Allocates an array of group indices of length GroupCount. If GroupCount is 0, then this method returns null.
GetHighlightedSubObjects
 Gets a list of all highlighted subobjects.
GetMaterial(Boolean)
 Gets material that this object uses based on it's attributes and the document that the object is associated with. In the rare case that a document is not associated with this object, null will be returned.
GetMaterial(ComponentIndex)
 Get the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
GetMaterial(ComponentIndex, Guid)
 Get the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
GetMaterial(ComponentIndex, Guid, ObjectAttributes)
 Get the Material associated with the sub object identified by componentIndex if the component index is set to ComponentIndex.Unset then the top level material is returned.
GetMeshes
 Get existing meshes used to render and analyze surface and polysrf objects.
GetRenderMaterial(Boolean)
 Gets the RenderMaterial that this object uses based on it's attributes and the document that the object is associated with. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
GetRenderMaterial(ComponentIndex)
 Gets the RenderMaterial associated with this object if there is one. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
GetRenderMaterial(ComponentIndex, Guid)
 Gets the RenderMaterial associated with this object if there is one. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
GetRenderMaterial(ComponentIndex, Guid, ObjectAttributes)
 Gets the RenderMaterial associated with this object if there is one. If there is no RenderMaterial associated with this object then null is returned. If null is returned you should call GetMaterial to get the material used to render this object.
GetRenderMeshes
 Gets the render meshes of some objects.
GetRenderMeshParameters
 Meshing parameters that this object uses for generating render meshes. If the object's attributes do not have custom meshing parameters, then the document's meshing parameters are used.
GetRenderPrimitiveList(ViewportInfo, DisplayPipelineAttributes)
 Build custom render mesh(es) for this object.
GetRenderPrimitiveList(ViewportInfo, Boolean) |  Obsolete.
 Build custom render mesh(es) for this object.
GetSelectedSubObjects
Get a list of all selected sub-objects.
GetSubObjects
 Gets an array of sub-objects.
GetTextureChannels
 Get a list of the texture mapping channel Id's associated with object.
GetTextureMapping(Int32)
GetTextureMapping(Int32, Transform)
 Get objects texture mapping
HasTextureMapping
 Returns true if this object has a texture mapping form any source (pluginId)
Highlight
 Modifies the highlighting of the object.
HighlightSubObject
 Highlights a subobject.
InVisualAnalysisMode()
 Reports if any visual analysis mode is currently active for an object.
InVisualAnalysisMode(VisualAnalysisMode)
 Reports if a visual analysis mode is currently active for an object.
IsActiveInViewport
 Determine if this object is active in a particular viewport.
IsHighlighted
Check highlight state.
IsMeshable
 Returns true if the object is capable of having a mesh of the specified type
IsSelectable()
Reports if an object can be selected.
IsSelectable(Boolean, Boolean, Boolean, Boolean)
Reports if an object can be selected.
IsSelected
Check selection state.
IsSubObjectHighlighted
 Determines if a subobject is highlighted.
IsSubObjectSelectable
Reports if a subobject can be selected.
IsSubObjectSelected
Check sub-object selection state.
MemoryEstimate
 Computes an estimate of the number of bytes that this object is using in memory. Note that this is a runtime memory estimate and does not directly compare to the amount of space take up by the object when saved to a file.
MeshCount
 RhinoObjects can have several different types of meshes and different numbers of meshes. A b-rep can have a render and an analysis mesh on each face. A mesh object has a single render mesh and no analysis mesh. Curve, point, and annotation objects have no meshes.
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Boolean, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Int32, Transform, Mesh[], ObjectAttributes[])
Meshes Rhino objects.
OnAddToDocument
 This call informs an object it is about to be added to the list of active objects in the document.
OnDeleteFromDocument
 This call informs an object it is about to be deleted. Some objects, like clipping planes, need to do a little extra cleanup before they are deleted.
OnDraw
 Called when Rhino wants to draw this object
OnDuplicate
 Called when this a new instance of this object is created and copied from an existing object
OnPick
 Called to determine if this object or some sub-portion of this object should be picked given a pick context.
OnPicked
 Called when this object has been picked
OnSelectionChanged
 Called when the selection state of this object has changed
OnSpaceMorph
 Called when a space morph has been applied to the geometry. Currently this only works for CustomMeshObject instances
OnTransform
 Called when a transformation has been applied to the geometry
Select(Boolean)
Selects an object.
Select(Boolean, Boolean)
Selects an object.
Select(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
Selects an object.
SelectSubObject(ComponentIndex, Boolean, Boolean)
Reports if an object can be selected.
SelectSubObject(ComponentIndex, Boolean, Boolean, Boolean)
Reports if an object can be selected.
SetCustomRenderMeshParameter
 Set the named custom render mesh parameter value for this object.
SetTextureMapping(Int32, TextureMapping)
SetTextureMapping(Int32, TextureMapping, Transform)
 Sets texture mapping and mapping object transform for a channel
ShortDescription
 Gets a localized short descriptive name of the object.
SupportsRenderPrimitiveList(ViewportInfo, DisplayPipelineAttributes)
 Determines if custom render meshes will be built for a particular object.
SupportsRenderPrimitiveList(ViewportInfo, Boolean) |  Obsolete.
 Determines if custom render meshes will be built for a particular object.
TryGetRenderPrimitiveBoundingBox(ViewportInfo, DisplayPipelineAttributes, BoundingBox)
 Get the bounding box for the custom render meshes associated with this object.
TryGetRenderPrimitiveBoundingBox(ViewportInfo, Boolean, BoundingBox) |  Obsolete.
 Get the bounding box for the custom render meshes associated with this object.
UnhighlightAllSubObjects
 Removes highlighting from all subobjects.
UnselectAllSubObjects
 Removes selection from all subobjects.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace