RhinoCommon API
SweepTwoRail Methods
The SweepTwoRail type exposes the following members.
Methods
Name | Description
PerformSweep(Curve, Curve, Curve)
PerformSweep(Curve, Curve, IEnumerable<Curve>)
PerformSweep(Curve, Curve, Curve, Double, Double)
PerformSweep(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>)
PerformSweepRebuild(Curve, Curve, Curve, Int32)
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, Int32)
PerformSweepRebuild(Curve, Curve, Curve, Double, Double, Int32)
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Int32)
PerformSweepRefit(Curve, Curve, Curve, Double)
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, Double)
PerformSweepRefit(Curve, Curve, Curve, Double, Double, Double)
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Double)
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace