RhinoCommon SDK
Silhouette Methods
The Silhouette type exposes the following members.
Methods
Name | Description
Compute(GeometryBase, SilhouetteType, ViewportInfo, Double, Double)
 Compute silhouettes of a shape for a specified projection.
Compute(GeometryBase, SilhouetteType, Point3d, Double, Double)
 Compute silhouettes of a shape for a perspective projection.
Compute(GeometryBase, SilhouetteType, Vector3d, Double, Double)
 Compute silhouettes of a shape for a parallel projection.
Compute(GeometryBase, SilhouetteType, ViewportInfo, Double, Double, IEnumerable<Plane>, CancellationToken)
 Compute silhouettes of a shape for a specified projection.
Compute(GeometryBase, SilhouetteType, Point3d, Double, Double, IEnumerable<Plane>, CancellationToken)
 Compute silhouettes of a shape for a perspective projection.
Compute(GeometryBase, SilhouetteType, Vector3d, Double, Double, IEnumerable<Plane>, CancellationToken)
 Compute silhouettes of a shape for a parallel projection.
Top
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace