RhinoCommon API
MeshExtruder Methods
The MeshExtruder type exposes the following members.
Methods
Name | Description
Dispose
 Dispose of this object and any unmanaged memory associated with it.
ExtrudedMesh
 Creates new extruded mesh. Returns true if any edges or faces were extruded.
Finalize
 Destructor
 (Overrides Object.Finalize().)
Top
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace