RhinoCommon SDK
AnnotationBase Methods
The AnnotationBase type exposes the following members.
Methods
Name | Description
ClearPropertyOverrides
 Clears all overriden properties for this annotation
FirstCharProperties
FormatRtfString
GetDimensionScale
 Get view dependent dimension scale
GetDimensionStyle
 Return the proper dimension style from which to get properties for this annotation object If this object has style overrides, those will be included in the returned dimension style and the style will be updated to include the current state of the parent style for non-overridden fields
IsPropertyOverridden
 Returns true if a property is overridden
SetBold
SetFacename
SetItalic
SetOverrideDimStyle
 Set a style including overrides for this annotation object. The DimensionStyle OverrideStyle must have the override fields marked as overridden and must have it's Id set to nil. Use DimensinoStyle.SetFieldOverride(Field field) and related functions to manage override settings. To override a field, the field value must be set and the field must be marked as an override. The DimensionStyle passed in here must not be in the dimstyle table
SetRichText
SetUnderline
WrapText
 Wrap text
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace