RhinoCommon SDK
Dimension Methods
The Dimension type exposes the following members.
Methods
Name | Description
GetTextTransform
 Get the transform for this text object's text geometry
SetAltDimensionLengthDisplayWithZeroSuppressionReset
SetDimensionLengthDisplayWithZeroSuppressionReset
Top
See Also
Reference
Dimension Class
Rhino.Geometry Namespace