RhinoCommon API
NurbsCurve Methods
The NurbsCurve type exposes the following members.
Methods
Name | Description
Create
 Constructs a 3D NURBS curve from a list of control points.
CreateFromArc(Arc)
 Gets a rational degree 2 NURBS curve representation of the arc. Note that the parameterization of NURBS curve does not match arc's transcendental paramaterization.
CreateFromArc(Arc, Int32, Int32)
 Create a uniform non-ratonal cubic NURBS approximation of an arc.
CreateFromCircle(Circle)
 Gets a rational degree 2 NURBS curve representation of the circle. Note that the parameterization of NURBS curve does not match circle's transcendental paramaterization. Use GetRadianFromNurbFormParameter() and GetParameterFromRadian() to convert between the NURBS curve parameter and the transcendental parameter.
CreateFromCircle(Circle, Int32, Int32)
 Create a uniform non-ratonal cubic NURBS approximation of a circle.
CreateFromEllipse
 Gets a rational degree 2 NURBS curve representation of the ellipse.
Note that the parameterization of the NURBS curve does not match with the transcendental paramaterization of the ellipsis.
CreateFromLine
 Gets a non-rational, degree 1 Nurbs curve representation of the line.
CreateParabolaFromFocus
 Creates a parabola from focus and end points.
CreateParabolaFromVertex
 Createsa a parabola from vertex and end points.
CreateSpiral(Point3d, Vector3d, Point3d, Double, Double, Double, Double)
 Creates a C1 cubic NURBS approximation of a helix or spiral. For a helix, you may have radius0 == radius1. For a spiral radius0 == radius0 produces a circle. Zero and negative radii are permissible.
CreateSpiral(Curve, Double, Double, Point3d, Double, Double, Double, Double, Int32)
 Create a C2 non-rational uniform cubic NURBS approximation of a swept helix or spiral.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GrevilleParameter
 Gets the greville (edit point) parameter that belongs to the control point at the specified index.
GrevilleParameters
 Gets all Greville parameters for this curve.
GrevillePoint
 Gets the Greville parameter that belongs to the control point at the specified index.
GrevillePoints()
 Gets all Greville points for this curve.
GrevillePoints(Boolean)
 Gets Greville points for this curve.
IncreaseDegree
 Increase the degree of this curve.
IsDuplicate
 Determines if two curves are similar.
MakeCompatible
 For expert use only. From the input curves, make an array of compatible NURBS curves.
MakePiecewiseBezier
 Clamps ends and adds knots so the NURBS curve has bezier spans (all distinct knots have multiplitity = degree).
Reparameterize
 Use a linear fractional transformation to reparameterize the NURBS curve. This does not change the curve's domain.
SetEndCondition(Boolean, NurbsCurve.NurbsCurveEndConditionType, Point3d, Vector3d)
 Set end condition of a nurbs curve to point, tangent and curvature.
SetEndCondition(Boolean, NurbsCurve.NurbsCurveEndConditionType, Point3d, Vector3d, Vector3d)
 Set end condition of a nurbs curve to point, tangent and curvature.
SetGrevillePoints
 Sets all Greville edit points for this curve.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace