RhinoCommon API
InstanceReferenceGeometry Methods
The InstanceReferenceGeometry type exposes the following members.
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace