RhinoCommon SDK
SubDFacePtr Methods
The SubDFacePtr type exposes the following members.
Methods
Name | Description
AddEdgeFaceConnection
CompareTo
EdgeAt(Int32)
EdgeAt(Int32, Boolean)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(SubDFacePtr)
GetHashCode |  (Overrides ValueType.GetHashCode().)
GetSavedSubdivisionPoint
IndexOf(SubDEdgePtr)
IndexOf(SubDVertexPtr)
RemoveEdge(Int32)
RemoveEdge(SubDEdgePtr)
SetSavedSubdivisionPoint
ToString |  (Overrides ValueType.ToString().)
VertexAt
Top
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace