RhinoCommon SDK
SubDEdgePtr Methods
The SubDEdgePtr type exposes the following members.
Methods
Name | Description
ClearFaces
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(SubDEdgePtr)
FaceAt
GetHashCode |  (Overrides ValueType.GetHashCode().)
GetSavedSubdivisionPoint
OtherEnd
SetSavedSubdivisionPoint
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace