RhinoCommon SDK
ViewCapture Methods
The ViewCapture type exposes the following members.
Methods
Name | Description
CaptureToBitmap
CaptureToSvg
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace