RhinoCommon SDK
File3dmCommonComponentTable<T> Methods
The File3dmCommonComponentTable<T> generic type exposes the following members.
Methods
Name | Description
Add
 Adds an item.
Delete(Int32)
 Flags a component as deleted.
Delete(T)
 Flags a component as deleted.
 (Overrides CommonComponentTable<T>.Delete(T).)
Dump
Prepares a text dump of object table.
Top
See Also
Reference
File3dmCommonComponentTable<T> Class
Rhino.FileIO Namespace