RhinoCommon API
ToolbarFile Methods
The ToolbarFile type exposes the following members.
Methods
Name | Description
Close
GetGroup(Int32)
GetGroup(String)
GetToolbar
Save
SaveAs
Top
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace