RhinoCommon API
CommandLineOption Methods
The CommandLineOption type exposes the following members.
Methods
Name | Description
IsValidOptionName
 Test a string to see if it can be used as an option name in any of the RhinoGet::AddCommandOption...() functions.
IsValidOptionValueName
 Test a string to see if it can be used as an option value in RhinoGet::AddCommandOption, RhinoGet::AddCommandOptionToggle, or RhinoGet::AddCommandOptionList.
Top
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace