RhinoCommon API
IPanelsService Methods
The IPanelsService type exposes the following members.
Methods
Name | Description
ClosePanel
DestroyNativeWindow
GetOpenPanelIds
GetPanel
IsPanelVisible
OpenPanel(Guid)
OpenPanel(Guid, Guid)
OpenPanelAsSibling
PanelDockBar
RegisterPanel
SetF1Hook
SupportedType
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace