RhinoCommon API
FileObj Methods
The FileObj type exposes the following members.
Methods
Name | Description
Read
Write
Write an obj file based on the contents of a RhinoDoc
Top
See Also
Reference
FileObj Class
Rhino.FileIO Namespace