RhinoCommon SDK
SubDVertexPtr Methods
The SubDVertexPtr type exposes the following members.
Methods
Name | Description
AddEdge
AddFace
ClearEdges
ClearFaces
EdgeAt(Int32)
EdgeAt(Int32, Boolean)
EdgeFlipAt
EdgesTaggedCount
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(SubDVertexPtr)
FaceAt
FromSubDAndId
GetHashCode |  (Overrides ValueType.GetHashCode().)
GetSavedSubdivisionPoint
GetSectorIterator()
GetSectorIterator(SubDFacePtr, Boolean)
RemoveEdge
SetSavedSubdivisionPoint
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace