RhinoCommon API
RhinoSettings Methods
The RhinoSettings type exposes the following members.
Methods
Name | Description
ActiveView
Dispose
Finalize |  (Overrides Object.Finalize().)
GetCustomRenderSizes
GetRenderSettings
SetRenderSettings
Top
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace