RhinoCommon API
PersistentSettingsConverter Methods
The PersistentSettingsConverter type exposes the following members.
Methods
Name | Description
IsStringDictionary
 Determines if the string value is formatted as a key value pair string list.
IsStringList
 Determines if the string value is formatted as a string list.
ToString(KeyValuePair<String, String>[])
 Converts a key value string pair array to a properly formatted string dictionary XML string.
ToString(String[])
 Converts a string array to a properly formatted string list XML string.
TryParseEnum(Type, String, Int32)
 Converts an enum value name to its integer equivalent.
TryParseEnum(Type, String, String)
 Converts an enum value string (integer as string) to a enum value name.
TryParseStringDictionary
 Attempts to convert a string to a key value string pair array.
TryParseStringList
 Attempts to convert a string to a string value list.
Top
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace