RhinoCommon SDK
AnnotationExtensions Methods
The AnnotationExtensions type exposes the following members.
Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
Top
See Also
Reference
AnnotationExtensions Class
Rhino.Geometry Namespace