RhinoCommon SDK
SubD Methods
The SubD type exposes the following members.
Methods
Name | Description
ChamferVertex
 Removes a vertex and inserts a face using some parameters.
CreateFromMesh
Dispose(Boolean) |  (Overrides GeometryBase.Dispose(Boolean).)
GetLimitSurfaceInPatches
OnSwitchToNonConst |  (Overrides GeometryBase.OnSwitchToNonConst().)
SetSubDType
Subdivide(Int32, SubD.SubDType, Int32)
Subdivide(Int32, SubD.SubDType, Int32, Int32)
SubDTypeFromInt
ToLimitSurfaceMesh(Int32)
ToLimitSurfaceMesh(SubDDisplayParameters)
ToLimitSurfaceMesh(Int32, SubD.SubDType)
UpdateAllTagsAndSectorCoefficients
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace