RhinoCommon API
Intersection Methods
The Intersection type exposes the following members.
Methods
Name | Description
BrepBrep
 Intersects two Breps.
BrepPlane
 Intersects a Brep with an (infinite) plane.
BrepSurface
 Intersects a Brep and a Surface.
CurveBrep(Curve, Brep, Double, Curve[], Point3d[])
 Intersects a curve with a Brep. This function returns the 3D points of intersection and 3D overlap curves. If an error occurs while processing overlap curves, this function will return false, but it will still provide partial results.
CurveBrep(Curve, Brep, Double, Double, Double[])
 Intersect a curve with a Brep. This function returns the intersection parameters on the curve.
CurveBrep(Curve, Brep, Double, Curve[], Point3d[], Double[])
 Intersects a curve with a Brep. This function returns the 3D points of intersection, curve parameters at the intersection locations, and 3D overlap curves. If an error occurs while processing overlap curves, this function will return false, but it will still provide partial results.
CurveBrepFace
 Intersects a curve with a Brep face.
CurveCurve
 Finds the intersections between two curves.
CurveLine
 Intersects a curve and an infinite line.
CurvePlane
 Intersects a curve with an (infinite) plane.
CurveSelf
 Finds the places where a curve intersects itself.
CurveSurface(Curve, Surface, Double, Double)
 Intersects a curve and a surface.
CurveSurface(Curve, Interval, Surface, Double, Double)
 Intersects a (sub)curve and a surface.
LineBox(Line, BoundingBox, Double, Interval)
 Intersects an infinite line and an axis aligned bounding box.
LineBox(Line, Box, Double, Interval)
 Intersects an infinite line with a box volume.
LineCircle
 Intersects a line with a circle using exact calculations.
LineCylinder
 Intersects a line with a cylinder using exact calculations.
LineLine(Line, Line, Double, Double)
 Finds the closest point between two infinite lines.
LineLine(Line, Line, Double, Double, Double, Boolean)
 Intersects two lines.
LinePlane
 Intersects a line and a plane. This function only returns true if the intersection result is a single point (i.e. if the line is coincident with the plane then no intersection is assumed).
LineSphere
 Intersects a line with a sphere using exact calculations.
MeshLine
 Finds the intersection of a mesh and a line
MeshMeshAccurate
 Intersects two meshes. Overlaps and near misses are handled.
MeshMeshFast
 Quickly intersects two meshes. Overlaps and near misses are ignored.
MeshPlane(Mesh, Plane)
 Intersects a mesh with an (infinite) plane.
MeshPlane(Mesh, IEnumerable<Plane>)
 Intersects a mesh with a collection of (infinite) planes.
MeshPolyline
 Finds the intersection of a mesh and a polyline.
MeshRay(Mesh, Ray3d)
Finds the first intersection of a ray with a mesh.
MeshRay(Mesh, Ray3d, Int32[])
Finds the first intersection of a ray with a mesh.
PlaneCircle
 Intersects a plane with a circle using exact calculations.
PlanePlane
 Intersects two planes and return the intersection line. If the planes are parallel or coincident, no intersection is assumed.
PlanePlanePlane
 Intersects three planes to find the single point they all share.
PlaneSphere
 Intersects a plane with a sphere using exact calculations.
ProjectPointsToBreps
 Projects points onto breps.
ProjectPointsToBrepsEx
 Projects points onto breps.
ProjectPointsToMeshes
 Projects points onto meshes.
ProjectPointsToMeshesEx
 Projects points onto meshes.
RayShoot
 Computes point intersections that occur when shooting a ray to a collection of surfaces.
SphereSphere
 Intersects two spheres using exact calculations.
SurfaceSurface
 Intersects two Surfaces.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace