RhinoCommon SDK
DetailView Methods
The DetailView type exposes the following members.
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
SetScale
 Sets the detail viewport's projection so geometry is displayed at a certain scale.
Top
See Also
Reference
DetailView Class
Rhino.Geometry Namespace