RhinoCommon API
ClippingPlaneSurface Methods
The ClippingPlaneSurface type exposes the following members.
Methods
Name | Description
AddClipViewportId
 Adds a viewport id to the list of viewports that this clipping plane clips.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
RemoveClipViewportId
 Removes a viewport id that this being clipped by this clipping plane.
ViewportIds
 Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace