RhinoCommon API
DrawingUtilities Methods
The DrawingUtilities type exposes the following members.
Methods
Name | Description
BitmapFromIconResource(String, Assembly)
 Load a Icon from an embedded resource and convert it to a bitmap of the specified size. Will look for a icon image that is greater than or equal to the requested size, if all images are less than the requested size the largest image will be used.
BitmapFromIconResource(String, Size, Assembly)
 Load a Icon from an embedded resource and convert it to a bitmap of the specified size. Will look for a icon image that is greater than or equal to the requested size, if all images are less than the requested size the largest image will be used.
CreateMeshPreviewImage(Mesh, Color, Size)
 Creates a preview image of a mesh.
CreateMeshPreviewImage(IEnumerable<Mesh>, IEnumerable<Color>, Size)
 Creates a preview image of one or more meshs.
IconFromResource(String, Assembly)
 Load a Icon from an embedded resource.
IconFromResource(String, Size, Assembly)
 Load a Icon from an embedded resource.
ImageFromResource
 Load a Image from an embedded resource.
LoadBitmapWithScaleDown
 Loads an icon from an embedded resource and converts it to a bitmap. If the icon is not a standard size, this function scales down a larger image.
LoadIconWithScaleDown
 Loads an icon from an embedded resource. If the icon is not a standard size, this function scales down a larger image.
Top
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace