RhinoCommon API
SumSurface Methods
The SumSurface type exposes the following members.
Methods
Name | Description
Create
 Constructs a new sum surface by extruding a curve A along a path B.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
SumSurface Class
Rhino.Geometry Namespace