RhinoCommon API
IRhinoUiDialogService Methods
The IRhinoUiDialogService type exposes the following members.
Methods
Name | Description
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowLineTypes
ShowListBox
ShowMultiListBox
ShowNumberBox
ShowPopupMenu
Top
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace