RhinoCommon API
DisplayPipeline Methods
The DisplayPipeline type exposes the following members.
Methods
Name | Description
AddClippingPlane
 Add a clipping plane to be used during the drawing of this frame
CullControlPolygon
 Returns a value indicating if only points on the side of the surface that face the camera are displayed.
Draw2dLine(Point, Point, Color, Single)
Draw2dLine(PointF, PointF, Color, Single)
Draw2dRectangle
Draw2dText(String, Color, Point2d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point2d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Draw2dText(String, Color, Point3d, Boolean, Int32, String)
 Draws 2D text on the viewport.
Draw3dText(Text3d, Color)
Draw3dText(Text3d, Color, Plane)
 Draws 3d text with a different plane than what is defined in the Text3d class.
Draw3dText(Text3d, Color, Point3d)
 Draws 3d text using the Text3d plane with an adjusted origin.
Draw3dText(String, Color, Plane, Double, String)
Draw3dText(String, Color, Plane, Double, String, Boolean, Boolean)
Draw3dText(String, Color, Plane, Double, String, Boolean, Boolean, TextHorizontalAlignment, TextVerticalAlignment)
DrawActivePoint
 Draws a point in style used during "GetPoint" operations
DrawAnnotation
DrawAnnotationArrowhead
DrawArc(Arc, Color)
 Draw a single arc object.
DrawArc(Arc, Color, Int32)
 Draw a single arc object.
DrawArrow(Line, Color)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrow(Line, Color, Double, Double)
 Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrowHead
 Draws a single arrow head.
DrawArrows(Line[], Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawArrows(IEnumerable<Line>, Color)
 Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
DrawBitmap(DisplayBitmap, Int32, Int32)
 Draws a bitmap in screen coordinates
DrawBitmap(DisplayBitmap, Int32, Int32, Color)
 Draws a bitmap in screen coordinates
DrawBox(BoundingBox, Color)
 Draws the edges of a BoundingBox.
DrawBox(Box, Color)
 Draws the edges of a Box object.
DrawBox(BoundingBox, Color, Int32)
 Draws the edges of a BoundingBox.
DrawBox(Box, Color, Int32)
 Draws the edges of a Box object.
DrawBoxCorners(BoundingBox, Color)
 Draws corner widgets of a world aligned boundingbox. Widget size will be 5% of the Box diagonal.
DrawBoxCorners(BoundingBox, Color, Double)
 Draws corner widgets of a world aligned boundingbox.
DrawBoxCorners(BoundingBox, Color, Double, Int32)
 Draws corner widgets of a world aligned boundingbox.
DrawBrepShaded
 Draws a shaded mesh representation of a brep.
DrawBrepWires(Brep, Color)
 Draws all the wireframe curves of a brep object.
DrawBrepWires(Brep, Color, Int32)
 Draws all the wireframe curves of a brep object.
DrawCircle(Circle, Color)
 Draw a single circle object.
DrawCircle(Circle, Color, Int32)
 Draw a single circle object.
DrawCone(Cone, Color)
 Draw a wireframe cone.
DrawCone(Cone, Color, Int32)
 Draw a wireframe cone.
DrawConstructionPlane
DrawCurvatureGraph(Curve, Color)
 Draw a typical Rhino Curvature Graph.
DrawCurvatureGraph(Curve, Color, Int32)
 Draw a typical Rhino Curvature Graph.
DrawCurvatureGraph(Curve, Color, Int32, Int32, Int32)
 Draw a typical Rhino Curvature Graph.
DrawCurve(Curve, Color)
 Draw a single Curve object.
DrawCurve(Curve, Color, Int32)
 Draw a single Curve object.
DrawCylinder(Cylinder, Color)
 Draw a wireframe cylinder.
DrawCylinder(Cylinder, Color, Int32)
 Draw a wireframe cylinder.
DrawDirectionArrow
DrawDot(Point3d, String)
 Draws a text dot in world coordinates.
DrawDot(Int32, Int32, String)
 Draws a text dot in screen coordinates.
DrawDot(Single, Single, String)
 Draws a text dot in screen coordinates.
DrawDot(Point3d, String, Color, Color)
 Draw a text dot in world coordinates.
DrawDot(TextDot, Color, Color, Color)
 Draw a text dot as defined by the text dot class
DrawDot(Int32, Int32, String, Color, Color)
 Draws a text dot in screen coordinates.
DrawDot(Single, Single, String, Color, Color)
 Draws a text dot in screen coordinates.
DrawDottedLine(Line, Color)
 Draws a single dotted line.
DrawDottedLine(Point3d, Point3d, Color)
 Draws a single dotted line.
DrawDottedPolyline
 Draws a set of connected lines (polyline) in a dotted pattern (0x00001111).
DrawExtrusionWires(Extrusion, Color)
 Draws all the wireframe curves of an extrusion object.
DrawExtrusionWires(Extrusion, Color, Int32)
 Draws all the wireframe curves of an extrusion object.
DrawHatch
DrawLine(Line, Color)
 Draws a single line object.
DrawLine(Line, Color, Int32)
 Draws a single line object.
DrawLine(Point3d, Point3d, Color)
 Draws a single line object.
DrawLine(Point3d, Point3d, Color, Int32)
 Draws a single line object.
DrawLineArrow
 Draws an arrow made up of three line segments.
DrawLines(IEnumerable<Line>, Color)
 Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines to be drawn, pass a Line[] for lines.
DrawLines(IEnumerable<Line>, Color, Int32)
 Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines to be drawn, pass a Line[] for lines.
DrawMarker(Point3d, Vector3d, Color)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32, Double)
 Draws an arrow marker as a view-aligned widget.
DrawMarker(Point3d, Vector3d, Color, Int32, Double, Double)
 Draws an arrow marker as a view-aligned widget.
DrawMeshFalseColors
 Draws the mesh faces as false color patches. The mesh must have Vertex Colors defined for this to work.
DrawMeshShaded(Mesh, DisplayMaterial)
 Draws the shaded faces of a given mesh.
DrawMeshShaded(Mesh, DisplayMaterial, Int32[])
 Draws the shaded faces of a given mesh.
DrawMeshVertices
 Draws all the vertices in a given mesh.
DrawMeshWires(Mesh, Color)
 Draws all the wires in a given mesh.
DrawMeshWires(Mesh, Color, Int32)
 Draws all the wires in a given mesh.
DrawObject(RhinoObject)
DrawObject(RhinoObject, Transform)
 Draws a RhinoObject with an applied transformation.
DrawParticles(ParticleSystem)
DrawParticles(ParticleSystem, DisplayBitmap)
DrawParticles(ParticleSystem, DisplayBitmap[])
DrawPatternedLine(Line, Color, Int32, Int32)
 Draws a single line with specified pattern.
DrawPatternedLine(Point3d, Point3d, Color, Int32, Int32)
 Draws a single line with specified pattern.
DrawPatternedPolyline
 Draws a set of connected lines (polyline) with specified pattern.
DrawPoint(Point3d)
 Draws a point using the current display attribute size, style and color
DrawPoint(Point3d, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Int32, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Single, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Color, Color, Single, Single, Single, Single, Boolean, Boolean)
DrawPointCloud(PointCloud, Int32)
 Draws a point cloud.
DrawPointCloud(PointCloud, Single)
 Draws a point cloud.
DrawPointCloud(PointCloud, Int32, Color)
 Draws a point cloud.
DrawPointCloud(PointCloud, Single, Color)
 Draws a point cloud.
DrawPoints(IEnumerable<Point3d>, PointStyle, Int32, Color)
Draw a set of points with a given radius, style and color.
DrawPoints(IEnumerable<Point3d>, PointStyle, Single, Color)
Draw a set of points with a given radius, style and color.
DrawPoints(IEnumerable<Point3d>, PointStyle, Color, Color, Single, Single, Single, Single, Boolean, Boolean)
DrawPolygon
 Draws a filled, convex polygon from a collection of points.
DrawPolyline(IEnumerable<Point3d>, Color)
 Draws a single Polyline object.
DrawPolyline(IEnumerable<Point3d>, Color, Int32)
 Draws a single Polyline object.
DrawRoundedRectangle
DrawSphere(Sphere, Color)
 Draw a wireframe sphere.
DrawSphere(Sphere, Color, Int32)
 Draw a wireframe sphere.
DrawSprite(DisplayBitmap, Point2d, Single)
DrawSprite(DisplayBitmap, Point2d, Single, Color)
DrawSprite(DisplayBitmap, Point3d, Single, Boolean)
DrawSprite(DisplayBitmap, Point3d, Single, Color, Boolean)
DrawSprites(DisplayBitmap, DisplayBitmapDrawList, Single, Boolean)
DrawSprites(DisplayBitmap, DisplayBitmapDrawList, Single, Vector3d, Boolean)
DrawSurface
 Draw wireframe display for a single surface.
DrawText(TextEntity, Color)
DrawText(TextEntity, Color, Transform)
DrawText(TextEntity, Color, Double)
DrawToBitmap
 Draw a given viewport to an off-screen bitmap.
DrawTorus(Torus, Color)
 Draw a wireframe torus.
DrawTorus(Torus, Color, Int32)
 Draw a wireframe torus.
EnableClippingPlanes
 Enable or disable the Clipping Plane logic of the engine.
EnableColorWriting
 Enable or disable the ColorWriting behaviour of the engine.
EnableDepthTesting
 Enable or disable the DepthTesting behaviour of the engine. When DepthTesting is disabled, objects in front will no longer occlude objects behind them.
EnableDepthWriting
 Enable or disable the DepthWriting behaviour of the engine. When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
EnableLighting
 Enable or disable the Lighting logic of the engine.
GetLights
 Get lights that this pipeline is current using
GetOpenGLCameraToClip
 Get an array of 16 floats that represents the "camera" to "clip" coordinate transformation in OpenGL's right handed coordinate system
GetOpenGLWorldToCamera
 Get an array of 16 floats that represents the "world" to "camera" coordinate transformation in OpenGL's right handed coordinate system
GetOpenGLWorldToClip
 Get an array of 16 floats that represents the "world" to "clip" coordinate transformation in OpenGL's right handed coordinate system
InterruptDrawing
 Tests to see if the pipeline should stop drawing more geometry and just show what it has so far. If a drawing operation is taking a long time, this function will return true and tell Rhino it should just finish up and show the frame buffer. This is used in dynamic drawing operations.
IsActive
 Determines if an object can be visible in this viewport based on it's object type and display attributes. This test does not check for visibility based on location of the object. NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on location (is some part of the object in the view frustum). Use CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on object type.
IsVisible(BoundingBox)
 Test a given box for visibility inside the view frustum under the current viewport and model transformation settings.
IsVisible(Point3d)
 Test a given 3d world coordinate point for visibility inside the view frustum under the current viewport and model transformation settings.
IsVisible(RhinoObject)
 Test a given object for visibility inside the view frustum under the current viewport and model transformation settings. This function calls a virtual IsVisibleFinal function that subclassed pipelines can add extra tests to. In the base class, this test only tests visibility based on the objects world coordinates location and does not pay attention to the object's attributes. NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility" tests based on location (is some part of the object in the view frustum). Use CRhinoDisplayPipeline::IsActive() to perform "visibility" tests based on object type.
Measure2dText
 Determines screen rectangle that would be drawn to using the Draw2dText(..) function with the same parameters.
PopClipTesting
 Pop a ClipTesting flag off the engine's stack.
PopCullFaceMode
 Pop a FaceCull flag off the engine's stack.
PopDepthTesting
 Pop a DepthTesting flag off the engine's stack.
PopDepthWriting
 Pop a DepthWriting flag off the engine's stack.
PopModelTransform
 Pop a model transformation off the engine's model transform stack.
PushClipTesting
 Push a ClipTesting flag on the engine's stack.
PushCullFaceMode
 Push a FaceCull flag on the engine's stack.
PushDepthTesting
 Push a DepthTesting flag on the engine's stack.
PushDepthWriting
 Push a DepthWriting flag on the engine's stack.
PushModelTransform
 Push a model transformation on the engine's model transform stack.
RemoveClippingPlane
 Remove a clipping plane from the pipeline for this frame
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace