RhinoCommon API
IDialogService Methods
The IDialogService type exposes the following members.
Methods
Name | Description
ObjectToWindowHandle
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowListBox
ShowMultiListBox
ShowNumberBox
WrapAsIWin32Window
Top
See Also
Reference
IDialogService Interface
Rhino.UI Namespace