RhinoCommon API
PythonScript Methods
The PythonScript type exposes the following members.
Methods
Name | Description
Compile
 Compiles a class in a quick-to-execute proxy.
ContainsVariable
 Determines if the main scripting context has a variable with a name.
Create
 Constructs a new Python script context.
CreateTextEditorControl
 Creates a control where the user is able to type Python code.
EvaluateExpression
 Evaluates statements and an expression in the main scripting context.
ExecuteFile
 Executes a Python file.
ExecuteScript
 Executes a Python string.
GetStackTraceFromException
 Retrieves a meaningful representation of the call stack.
GetVariable
 Gets the object associated with a variable name in the main scripting context.
GetVariableNames
 Retrieves all variable names in the script.
RemoveVariable
 Removes a defined variable from the main scripting context.
SetIntellisenseVariable
 Sets a variable for runtime introspection.
SetupScriptContext
 Setups the script context. Use a RhinoDoc instance unless unsure.
SetVariable
 Sets a variable with a name and an object. Object can be null (Nothing in Visual Basic).
Top
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace