RhinoCommon API
DimensionStyle Methods
The DimensionStyle type exposes the following members.
Methods
Name | Description
AlternateDimensionLengthDisplayUnit
ClearAllFieldOverrides
 Sets all the fields in this DimensionStyle to be not overridden Does not change any dimstyle_id's or parent_id's
ClearFieldOverride
 Set the field as not overridden
CopyFrom
 Copy settings from source dimension style without changing the name, Id or index of this DimensionStyle.
CreatePreviewBitmap
DimensionLengthDisplayUnit
Duplicate()
 Construct a deep (full) copy of this object.
Duplicate(String, Guid, Guid)
 Construct a deep (full) copy of this object.
IsChildOf
 Tests if this DimensionStyle is a child of a specific DimensionStyle
IsFieldOverriden
ScaleLengthValues
 Scales all length values by 'scale'
SetFieldOverride
 Set a field as overridden
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace