RhinoCommon API
Decals Methods
The Decals type exposes the following members.
Methods
Name | Description
Add
 Add a new Decal to the decals list, use Decal.Create to create a new decal instance to add.
Clear
GetEnumerator
Remove
Top
See Also
Reference
Decals Class
Rhino.Render Namespace