RhinoCommon SDK
RenderPanels Methods
The RenderPanels type exposes the following members.
Methods
Name | Description
FromRenderSessionId
 Get the instance of a render panel associated with a specific render session, this is useful when it is necessary to update a control from a RenderPipeline
RegisterPanel
 Register custom render user interface with Rhino. This should only be done in RegisterRenderPanels(RenderPanels). Panels registered after RegisterRenderPanels(RenderPanels) is called will be ignored.
Top
See Also
Reference
RenderPanels Class
Rhino.Render Namespace