RhinoCommon API
File3dmObject Methods
The File3dmObject type exposes the following members.
Methods
Name | Description
Equals(Object)
 Verified that two objects refer to the same object in a document.
 (Overrides Object.Equals(Object).)
Equals(File3dmObject)
 Verified that two File3dmObject items refer to the same object in a document.
GetHashCode
 Provides an hash code for this item.
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace