RhinoCommon API
RenderContentSerializer Methods
The RenderContentSerializer type exposes the following members.
Methods
Name | Description
Read
 Called to when importing a file, file should be parsed and converted to a valid RenderContent object.
RegisterSerializer
 Register the RenderContentSerializer
Write
 Called to save a custom RenderContent object as an external file.
Top
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace