RhinoCommon API
TextLog Methods
The TextLog type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
PopIndent
 Decrease the indentation level
Print(String)
 Send text to the textlog
Print(String, Object)
 Send formatted text to the textlog
Print(String, Object, Object)
 Send formatted text to the textlog
PrintWrappedText
 Send text wrapped at a set line length
PushIndent
 Increase the indentation level
ToString
 If the TextLog was constructed using the empty constructor, then the text information is stored in a runtime string. The contents of this string is retrieved using ToString for this case
 (Overrides Object.ToString().)
Top
See Also
Reference
TextLog Class
Rhino.FileIO Namespace