RhinoCommon API
RhinoApp Methods
The RhinoApp type exposes the following members.
Methods
Name | Description
AskUserForRhinoLicense
 Display UI asking the user to enter a license for Rhino or use one from the Zoo.
ChangeLicenseKey
 Display UI asking the user to enter a license for the product specified by licenseId.
ClearCommandHistoryWindow
 Clear the text in Rhino's command history window.
ExecuteCommand(String)
 Execute a Rhino command.
ExecuteCommand(RhinoDoc, String)
 Execute a Rhino command.
Exit
Exits, or closes, Rhino.
GetDataDirectory(Boolean, Boolean)
 Gets the data directory.
GetDataDirectory(Boolean, Boolean, String)
 Gets the data directory.
GetExecutableDirectory
 directory
GetPlugInObject(Guid)
 Gets the object that is returned by PlugIn.GetPlugInObject for a given plug-in. This function attempts to find and load a plug-in with a given Id. When a plug-in is found, it's GetPlugInObject function is called and the result is returned here. Note the plug-in must have already been installed in Rhino or the plug-in manager will not know where to look for a plug-in with a matching id.
GetPlugInObject(String)
 Gets the object that is returned by PlugIn.GetPlugInObject for a given plug-in. This function attempts to find and load a plug-in with a given name. When a plug-in is found, it's GetPlugInObject function is called and the result is returned here. Note the plug-in must have already been installed in Rhino or the plug-in manager will not know where to look for a plug-in with a matching name.
InFullScreen
 Verifies that Rhino is running in full screen mode.
InvokeAndWait
 Work-In-Progess. Testing this with our unit test framework
InvokeOnUiThread
IsInstallationBeta
 If licenseType is a beta license, returns true. A beta license grants full use of the product during the pre-release development period.
IsInstallationCommercial
 If licenseType is a commercial license, returns true. A commercial license grants full use of the product.
IsInstallationEvaluation
 If licenseType is an evaluation license, returns true. An evaluation license limits the ability of Rhino to save based on either the number of saves or a fixed period of time.
LoginToCloudZoo
 Logs in to the cloud zoo.
MainWindowHandle
 Gets the WindowHandle of the Rhino main window.
OutputDebugString
 Print a string to the Visual Studio Output window, if a debugger is attached. Note that the developer needs to add a newline manually if the next output should come on a separate line.
ParseTextField
RefreshRhinoLicense
 Refresh the license used by Rhino. This allows any part of Rhino to ensure that the most current version of the license file on disk is in use.
ReleaseMouseCapture
Releases the mouse capture.
RunMenuScript
 Run a Rhino menu item script. Will add the selected menu string to the MRU command menu.
RunningInRdp
 Find out if Rhino is running in a remote session
RunningOnVMWare
 Verifies that Rhino is running on VMWare
RunScript(String, Boolean)
Runs a Rhino command script.
RunScript(String, String, Boolean)
Runs a Rhino command script.
SendKeystrokes
Sends a string of printable characters, including spaces, to Rhino's command line.
SetCommandPrompt(String)
Set Rhino command prompt.
SetCommandPrompt(String, String)
Sets the command prompt in Rhino.
SetCommandPromptMessage
 Set the text that appears in the Rhino command prompt. In general, you should use the SetCommandPrompt functions. In rare cases, like worker thread messages, the message that appears in the prompt has non-standard formatting. In these rare cases, SetCommandPromptMessage can be used to literally specify the text that appears in the command prompt window.
SetFocusToMainWindow()
 Sets the focus to the main window. This function attempts to use the ActiveDoc on Mac to figure out which window to set focus to.
SetFocusToMainWindow(RhinoDoc)
 Sets the focus to the main windows for a given document
Wait
 Pauses to keep Windows message pump alive so views will update and windows will repaint.
Write(String)
Print formatted text in the command window.
Write(String, Object)
Print formatted text in the command window.
Write(String, Object, Object)
Print formatted text in the command window.
Write(String, Object, Object, Object)
Print formatted text in the command window.
WriteLine()
Print a newline in the command window.
WriteLine(String)
Print text in the command window.
WriteLine(String, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object)
Print formatted text with a newline in the command window.
WriteLine(String, Object, Object, Object)
Print formatted text with a newline in the command window.
Top
See Also
Reference
RhinoApp Class
Rhino Namespace