RhinoCommon API
NamedViewTable Methods
The NamedViewTable type exposes the following members.
Methods
Name | Description
Add(ViewInfo)
Add(String, Guid)
 Adds named view to document which is based on an existing viewport.
Delete(Int32)
Remove named view from the document.
Delete(String)
Remove named view from the document.
FindByName
Finds a named view.
GetEnumerator
Restore(Int32, RhinoViewport)
 Sets the MainViewport of a standard RhinoView to a named views settings
Restore(Int32, RhinoView, Boolean)
 Sets the MainViewport of a standard RhinoView to a named views settings
Restore(Int32, RhinoViewport, Boolean)
RestoreAnimated(Int32, RhinoView, Boolean)
RestoreAnimated(Int32, RhinoViewport, Boolean)
RestoreAnimated(Int32, RhinoView, Boolean, Int32, Int32)
RestoreAnimated(Int32, RhinoViewport, Boolean, Int32, Int32)
RestoreAnimatedConstantSpeed
RestoreAnimatedConstantTime
RestoreWithAspectRatio
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace