RhinoCommon API
CustomBrepObject Methods
The CustomBrepObject type exposes the following members.
Methods
Name | Description
Dispose()
In Rhino for Windows 6.23, this member is inherited from .CommonObjectDispose().
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace