RhinoCommon API
NurbsSurface Methods
The NurbsSurface type exposes the following members.
Methods
Name | Description
CopyFrom
 Copies this NURBS surface from another NURBS surface.
Create
 Constructs a new NURBS surface with internal uninitialized arrays.
CreateCurveOnSurface
 Fit a sequence of 2d points on a surface to make a curve on the surface.
CreateCurveOnSurfacePoints
 Computes a discrete spline curve on the surface. In other words, computes a sequence of points on the surface, each with a corresponding parameter value.
CreateFromCone
 Constructs a new NURBS surfaces from cone data.
CreateFromCorners(Point3d, Point3d, Point3d)
 Makes a surface from 3 corner points.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d)
 Makes a surface from 4 corner points.
This is the same as calling CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double) with tolerance 0.
CreateFromCorners(Point3d, Point3d, Point3d, Point3d, Double)
 Makes a surface from 4 corner points.
CreateFromCylinder
 Constructs a new NURBS surfaces from cylinder data.
CreateFromPoints
 Constructs a NURBS surface from a 2D grid of control points.
CreateFromSphere
 Constructs a new NURBS surfaces from sphere data.
CreateFromTorus
 Constructs a new NURBS surfaces from torus data.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Double, Double, Double, Int32)
 Builds a surface from an autosorted network of curves/edges.
CreateNetworkSurface(IEnumerable<Curve>, Int32, Int32, IEnumerable<Curve>, Int32, Int32, Double, Double, Double, Int32)
 Builds a surface from an ordered network of curves/edges.
CreateRailRevolvedSurface
 Constructs a railed Surface-of-Revolution.
CreateRuledSurface
 Constructs a ruled surface between two curves. Curves must share the same knot-vector.
CreateThroughPoints
 Constructs a NURBS surface from a 2D grid of points.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
IncreaseDegreeU
 Increase the degree of this surface in U direction.
IncreaseDegreeV
 Increase the degree of this surface in V direction.
MakeCompatible
 For expert use only. Makes a pair of compatible NURBS surfaces based on two input surfaces.
MakeNonRational
 Makes this surface non-rational.
MakeRational
 Makes this surface rational.
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace