RhinoCommon API
RenderTabs Methods
The RenderTabs type exposes the following members.
Methods
Name | Description
FromRenderSessionId
 Get the instance of a render tab associated with a specific render session, this is useful when it is necessary to update a control from a RenderPipeline
RegisterTab
 Register custom render user interface with Rhino. This should only be done in RegisterRenderTabs(RenderTabs). Panels registered after RegisterRenderTabs(RenderTabs) is called will be ignored. If the class includes a public method "void DoHelp()" the method will get called when F1 is pressed and the custom tab is active.
SessionIdFromTab
 Get the session Id that created the specified tab object.
Top
See Also
Reference
RenderTabs Class
Rhino.Render Namespace