RhinoCommon SDK
DisplayModeDescription Methods
The DisplayModeDescription type exposes the following members.
Methods
Name | Description
AddDisplayMode
DeleteDiplayMode
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
FindByName
GetDisplayMode
GetDisplayModes
 Gets all display mode descriptions that Rhino currently knows about.
UpdateDisplayMode
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace