RhinoCommon SDK
SubDFaceAccess Methods
The SubDFaceAccess type exposes the following members.
Methods
Name | Description
Add
 Adds a new edge to the end of the SubDEdgePtr list.
GetEnumerator
Top
See Also
Reference
SubDFaceAccess Class
Rhino.Geometry.Collections Namespace