RhinoCommon API
ISettingsWriteErrorService Methods
The ISettingsWriteErrorService type exposes the following members.
Methods
Name | Description
GeErrorInfo
 Gets the number of failed write attempts as well as successful writes since the first reported failure.
LogFailure
 If there is a entry for this settings file increment the failure counter otherwise create a new entry and set the failure count to one.
LogSuccess
 If there is a entry for this settings file then increment the settings file successfully saved counter otherwise; do nothing.
Top
See Also
Reference
ISettingsWriteErrorService Interface
Rhino.Runtime Namespace