RhinoCommon API
Leader Methods
The Leader type exposes the following members.
Methods
Name | Description
Create
 Creates a Leader geometry object
CreateWithRichText
 Creates a Leader geometry object
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
Leader Class
Rhino.Geometry Namespace