RhinoCommon API
Torus Methods
The Torus type exposes the following members.
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
ToNurbsSurface
 Converts this torus to its nurbs surface representation. This is synonymous with calling NurbsSurface.CreateFromTorus().
ToRevSurface
 Convert this torus to a surface of revolution representation. This is synonymous with calling RevSurface.CreateFromTorus().
Top
See Also
Reference
Torus Structure
Rhino.Geometry Namespace