RhinoCommon API
GeometryBase Methods
The GeometryBase type exposes the following members.
Methods
Name | Description
ComponentIndex
 If this piece of geometry is a component in something larger, like a BrepEdge in a Brep, then this function returns the component index.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Duplicate
 Constructs a deep (full) copy of this object.
DuplicateShallow
 Constructs a light copy of this object. By "light", it is meant that the same underlying data is used until something is done to attempt to change it. For example, you could have a shallow copy of a very heavy mesh object and the same underlying data will be used when doing things like inspecting the number of faces on the mesh. If you modify the location of one of the mesh vertices, the shallow copy will create a full duplicate of the underlying mesh data and the shallow copy will become a deep copy.
GeometryEquals
 Determines if two geometries equal one another, in pure geometrical shape. This version only compares the geometry itself and does not include any user data comparisons. This is a comparison by value: for two identical items it will be true, no matter where in memory they may be stored.
GetBoundingBox(Boolean)
 Boundingbox solver. Gets the world axis aligned boundingbox for the geometry.
GetBoundingBox(Plane)
 Aligned Boundingbox solver. Gets the plane aligned boundingbox.
GetBoundingBox(Transform)
 Aligned Boundingbox solver. Gets the world axis aligned boundingbox for the transformed geometry.
GetBoundingBox(Plane, Box)
 Aligned Boundingbox solver. Gets the plane aligned boundingbox.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
MakeDeformable
 If possible, converts the object into a form that can be accurately modified with "squishy" transformations like projections, shears, an non-uniform scaling.
MemoryEstimate
 Computes an estimate of the number of bytes that this object is using in memory.
In Rhino for Windows, this member is overridden by NonConstOperation().
OnSwitchToNonConst
 Is called when a non-const operation occurs.
 (Overrides CommonObject.OnSwitchToNonConst().)
Rotate
 Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule).
Scale
 Scales the object by the specified factor. The scale is centered at the origin.
SetUserString
 Attach a user string (key,value combination) to this geometry.
Transform
 Transforms the geometry. If the input Transform has a SimilarityType of OrientationReversing, you may want to consider flipping the transformed geometry after calling this function when it makes sense. For example, you may want to call Flip() on a Brep after transforming it.
Translate(Vector3d)
Translates the object along the specified vector.
Translate(Double, Double, Double)
Translates the object along the specified vector.
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace