RhinoCommon API
InstanceDefinitionTable Methods
The InstanceDefinitionTable type exposes the following members.
Methods
Name | Description
Add(String, String, Point3d, IEnumerable<GeometryBase>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Add(String, String, String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Compact
 Purge deleted instance definition information that is not in use. This function is time consuming and should be used in a thoughtful manner.
Delete(InstanceDefinition)
 Deletes the instance definition. This deletes all references too.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean, Boolean)
 Deletes the instance definition.
DestroySourceArchive
 Destroys all source archive information. Specifically: * SourceArchive is set to the empty string. * SourceRelativePath is set to false * The alternative source archive path is set to the empty string. * Checksum.Zero() is used to private destroy all checksum information. * UpdateType is set to Static.
Find(String)
Finds the instance definition with a given name.
Find(Guid, Boolean)
Finds the instance definition with a given id.
Find(String, Boolean)
Finds the instance definition with a given name.
GetEnumerator
GetList
 Gets an array of instance definitions.
GetUnusedInstanceDefinitionName()
 Gets unsed instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String)
 Gets unsed instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String, UInt32)
 Gets unsed instance definition name used as default when creating new instance definitions.
InstanceDefinitionIndex
 Get the index of the instance definition with a given id.
MakeSourcePathRelative
 Obsolete method that always returns false. Marks the source path for a linked instance definition as relative or absolute.
Modify(Int32, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
Modify(InstanceDefinition, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
ModifyGeometry(Int32, IEnumerable<GeometryBase>)
ModifyGeometry(Int32, GeometryBase, ObjectAttributes)
ModifyGeometry(Int32, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Modifies the instance definition geometry and replaces all references to the current definition with references to the new definition.
ModifySourceArchive(Int32, String, InstanceDefinitionUpdateType, Boolean)
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
ModifySourceArchive(Int32, FileReference, InstanceDefinitionUpdateType, Boolean)
 If the instance definition is linked or embedded, use SetSource to specify the source archive.
Purge
 Purges an instance definition and its definition geometry.
RefreshLinkedBlock
 Reload linked block definitions and update the Rhino display.
Undelete
 Undeletes an instance definition that has been deleted by Delete()
UndoModify
 Restores the instance definition to its previous state, if the instance definition has been modified and the modification can be undone.
UpdateLinkedInstanceDefinition
 Read the objects from a file and use them as the instance's definition geometry.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace