RhinoCommon SDK
Layer Methods
The Layer type exposes the following members.
Methods
Name | Description
CommitChanges |  Obsolete.
CopyAttributesFrom
 Copy typical attributes from another layer
Default
 Sets layer to default settings.
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Layer)
GetChildren
 Gets immediate children of this layer. Note that child layers may have their own children.
GetDefaultLayerProperties
 Constructs a layer with the current default properties. The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
iges level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
GetHashCode |  (Overrides Object.GetHashCode().)
GetLeafName(String)
 Get a layer name's "leaf" level name
GetLeafName(Layer)
 Get a layer name's "leaf" level name
GetParentName(String)
 Get a layer's "parent" path name
GetParentName(Layer)
 Get a layer's "parent" path name
GetPersistentLocking
 The persistent locking setting is used for layers that can be locked by a "parent" object. A common case is when a layer is a child layer (Layer.ParentI is not nil). In this case, when a parent layer is locked, then child layers are also locked. The persistent locking setting determines what happens when the parent is unlocked again.
GetPersistentVisibility
 The persistent visbility setting is used for layers whose visibilty can be changed by a "parent" object. A common case is when a layer is a child layer (ParentId is not nil). In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
IsChildOf(Guid)
IsChildOf(Int32)
IsChildOf(Layer)
IsParentOf(Guid)
IsParentOf(Int32)
IsParentOf(Layer)
IsValidName
 Determines if a given string is valid for a layer name.
SetPersistentLocking
 Set the persistent locking setting for this layer
SetPersistentVisibility
 Set the persistent visibility setting for this layer
SetUserString
 Attach a user string (key,value combination) to this geometry.
ToString |  (Overrides ModelComponent.ToString().)
UnsetPersistentLocking
 Remove any explicity persistent locking settings from this layer
UnsetPersistentVisibility
 Remove any explicit persistent visibility setting from this layer
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace