RhinoCommon SDK
SaveFileDialog Methods
The SaveFileDialog type exposes the following members.
Methods
Name | Description
ShowDialog
ShowSaveDialog
Top
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace