RhinoCommon API
Vector2f Methods
The Vector2f type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this Vector2f with another Vector2f.
Components evaluation priority is first X, then Y.
EpsilonEquals
 Check that all values in other are withing epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector2f and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2f)
 Determines whether the specified vector has the same values as the present vector.
GetHashCode
 Computes a hash number that represents the current vector.
 (Overrides ValueType.GetHashCode().)
Multiply
 Multiplies two Vector2f together, returning the dot (internal) product of the two.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
ToString
 Constructs the string representation of the current vector.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace