RhinoCommon SDK
Dialogs Methods
The Dialogs type exposes the following members.
Methods
Name | Description
KillSplash
 Destroy the splash screen if it is being displayed.
SetCustomColorDialog
ShowCheckListBox
 Displays Rhino's check list box.
ShowColorDialog(Color)
 Display Rhino's color selection dialog.
ShowColorDialog(Color, Boolean, String)
 Display Rhino's color selection dialog.
ShowComboListBox
 Displays Rhino's combo list box.
ShowContextMenu
ShowEditBox
Display dialog prompting the user to enter a string.
ShowListBox(String, String, IList)
ShowListBox(String, String, IList, Object)
ShowMessage(String, String)
 Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessage(String, String, ShowMessageButton, ShowMessageIcon)
 Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessageBox(String, String) |  Obsolete.
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessageBox(String, String, MessageBoxButtons, MessageBoxIcon) |  Obsolete.
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowNumberBox(String, String, Double)
ShowNumberBox(String, String, Double, Double, Double)
ShowPropertyListBox
ShowSelectLayerDialog
 Displays Rhino's single layer selection dialog.
ShowTextDialog
 Display a text dialog similar to the dialog used for the "What" command.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace