RhinoCommon SDK
SubDEdgeAccess Methods
The SubDEdgeAccess type exposes the following members.
Methods
Name | Description
Add
 Adds a new edge to the end of the SubDEdgePtr list.
GetEnumerator
Top
See Also
Reference
SubDEdgeAccess Class
Rhino.Geometry.Collections Namespace