RhinoCommon API
MeshUnsafeLock Methods
The MeshUnsafeLock type exposes the following members.
Methods
Name | Description
Release
 Releases the lock and updates the underlying unmanaged data structures.
VertexPoint3fArray
 Retrieves a pointer to the raw mesh vertex array, which uses coordinates defined with single precision floating point numbers.
Top
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace