RhinoCommon API
Rhino.Render Namespace
[Missing <summary> documentation for "N:Rhino.Render"]
Classes
Class | Description
AsyncRenderContext
 \ingroup rhino_render Inherit from AsyncRenderContext to be able to create asynchronous render engine implementations through RhinoCommon.
CachedTextureCoordinates
 Used for cached texture coordinates
City
 City
ContentCollectionIterator
ContentUndoBlocker
ContentUndoHelper
 Content undo helper to be used with "using {}" to enclose a block of changes.
ContentUuids
 Content Guids of RenderContent provided by the RDK SDK. These Guids can be used to check against RenderContent.TypeId.
ConvertibleExtensions
 Extension methods for IConvertible that work when an object is a Variant.
CreatePreviewEventArgs
Used in RenderPlugIn virtual CreatePreview function
CreatePreviewEventArgs.SceneObject
CreateTexture2dPreviewEventArgs
CustomRenderContentAttribute
CustomRenderMeshProvider |  Obsolete.
 You must call CustomRenderMeshProvider.RegisterProviders() from your plug-ins OnLoad override for each assembly containing a custom mesh provider. Only publicly exported classes derived from CustomRenderMeshProvider with a public constructor that has no parameters will get registered.
CustomRenderMeshProvider2
Decal
 Represents a decal, or a picture that can be moved on an object.
DecalCreateParams
 Used by RhinoObject.AddDecal() to create and add a decal
Decals
Represents all the decals of an object.
Dithering
 This is the interface to linear workflow settings.
DocumentOrFreeFloatingBase
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
FreeFloatingBase
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
GroundPlane
 Represents an infinite plane for implementation by renderers. See SupportsFeature.
ImageFile
 Controls interaction with RDK render image files
ImageFileEventArgs
LightArray
LightManagerSupport
 Base class for implementing custom light managers in .NET
LightManagerSupportClient
LinearWorkflow
 This is the interface to linear workflow settings.
MappingTag
 Holds texture mapping information.
MetaDataProxy
 ProxyClass for MetaData
NamedValue
PhysicallyBasedMaterial
 Placeholder class for future PBR implementation
PhysicallyBasedMaterial.ParametersNames
 Helper class with fields containing the names of fields available in our PBR implementation.
PixelBuffer
PreviewAppearance
 PreviewAppearance class
PreviewBackground
 PreviewBackGround takes care of constucting and desctrutction of PreviewLight
PreviewGeometry
 PreviewAppearance takes care of constucting and desctrutction of PreivewGeometry
PreviewLighting
 PreviewAppearance takes care of constucting and desctrutction of PreviewLight
PreviewSceneServer
 PreviewSceneServer
RdkUndo
 RdkUndo class, which is used to get the RdkUndoRecord
RdkUndoRecord
 RdkUndoRecord class
RealtimeDisplayMode
 Base class for implementing real-time display modes in .NET. Pay special attention that in StartRenderer the RenderWindow.SetSize() function is called if the implementation relies on the RenderWindow to do the drawing to the viewport. If i.e. OpenGL is used to draw render results to the viewport then SetSize() doesn't have to be called, nor should the implementation then access channels on the RenderWindow, as those then don't exist. For OpenGL-based drawing the RenderWindow is used as a container for ViewInfo management, nothing else.
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs
RealtimeDisplayMode.DrawMiddlegroundEventArgs
RealtimeDisplayMode.HudMaxPassesChangedEventArgs
RealtimeDisplayMode.InitFramebufferEventArgs
RealtimeDisplayModeClassInfo
 Class information obligatory for registering RealtimeDisplayMode implementations.
RenderContent
RenderContentChangedEventArgs
RenderContentCollection
RenderContentEventArgs
RenderContentFieldChangedEventArgs
RenderContentKindList
RenderContentManager
 RenderContentManager's RestoreRenderContents method unpacks the default render contents from the from the application and places them in the User's folder. Only available on Mac at the moment.
RenderContentSerializer
 Used to import and export custom render content types such as materials, environments and textures. You must override RenderPlugIn.RenderContentSerializers() and return an array of derived RenderContentSerializer class types to add to the content browsers.
RenderContentType
 Represents one of the render content types registered with Rhino.
RenderEndEventArgs
 Contains information about why OnRenderEnd was called
RenderEnvironment
RenderEnvironmentTable
RenderMaterial
RenderMaterial.BasicMaterialParameterNames
 Parameter names for use in GetNamedParameter and SetNamedParameter with basic materials.
RenderMaterialTable
RenderPanels
 This class is used to extend the standard Render user interface
RenderPipeline
 Provides facilities to a render plug-in for integrating with the standard Rhino render window. Also adds helper functions for processing a render scene. This is the suggested class to use when integrating a renderer with Rhino and maintaining a "standard" user interface that users will expect.
RenderPlugInInfo
RenderPlugInList
RenderPrimitive
RenderPrimitiveList
RenderPropertyChangedEvent
 Used by Rhino.Render object property value has changed events.
RenderSettings
 Contains settings used in rendering.
RenderSourceView
 Helper class to get the correct view from the Render View Source settings. An instance of this class is supposed to be used with the using() {} construct.
RenderTabs
RenderTexture
RenderTextureTable
RenderWindow
RenderWindow.Channel
RenderWindow.ImageAdjust
 Class to set image adjusting settings to a RenderWindow. This can't be directly created. Instead, one should use RenderWindow.GetAdjust() to get an ImageAdjust instance that can be modified, then passed into RenderWindow.SetAdjust() to update image adjusting settings.1
RenderWindowClonedEventArgs
SceneServerData
 The Scene Server Data used by the PreviewSceneServer
SimulatedEnvironment
SimulatedTexture
Skylight
Sun
 Represents the Sun on a little portion of Earth.
SupportOptions
TexturedColor
 Color4f specialization of TexturedValue.
TexturedFloat
 float specialization of TexturedValue.
TexturedValue<T>
 Generic class to help holding on to related values. This can be used to get data from textured content fields with the HandleTexturedValue function.
TextureEvaluator
 This is the interface to a lightweight object capable of evaluating texture color throughout uvw space. Derive from this class to create your own texture evaluator to return from a custom RenderTexture.
TextureGraphInfo
TextureMapping
 Represents a texture mapping.
TimeZone
 TimeZone
TwoColorRenderTexture
UndoRedo
 This class contains the event for UndoRedoChanged that is fired from RDK .
Utilities
Interfaces
Interface | Description
ICurrentEnvironment
ICurrentEnvironment_Get
Enumerations
Enumeration | Description
CrcRenderHashFlags
CreatePreviewReason
 Reason the content preview is being generated
DecalMapping
DecalProjection
Dithering.Methods
 Dithering algorithm.
DynamicIconUsage
FilterContentByUsage
 Content collection filter value
ImageFileEvent
IRhRdkPreviewSceneServer_eRotationType
 c# version of IRhRdkPreviewSceneServer eRotationType enum
it_strategy
 Defines the collection type to iterate.
LightMangerSupportCustomEvent
 LightMangerSupportCustomEvent
PreviewSceneQuality
Quality levels when creating preview images
ProxyTypes
 Defines the proxy type of the render content
RenderContent.ChangeContexts
 Context of a change to content parameters.
RenderContent.ExtraRequirementsSetContexts
RenderContent.MatchDataResult
 Return values for MatchData function
RenderContent.ShowContentChooserFlags
RenderContentChangeReason
 Enumeration denoting type of change for attach or detach
RenderContentKind
 Defines constant values for all render content kinds, such as material, environment or texture.
RenderContentStyles
RenderEnvironment.Usage
RenderMaterial.PreviewBackgroundType
 The default scene background for the image that appears in preview panes
RenderMaterial.PreviewGeometryType
 Geometry that appears in preview panes
RenderMaterial.StandardChildSlots
 Defines enumerated constant values for use in TextureChildSlotName(RenderMaterial.StandardChildSlots) method.
RenderPanelType
 Contains the custom user interfaces that may be provided
RenderPipeline.RenderReturnCode
RenderPrimitiveType
RenderSettings.RenderingSources
 Rendering source (render directly from a NamedView or Snapshot)
RenderTexture.eLocalMappingType
RenderTexture.TextureEvaluatorFlags
RenderTexture.TextureGeneration
RenderWindow.RenderSuccessCode
RenderWindow.StandardChannels
SceneServerDataUsage
 SceneServerData Usage (Synchronous or Asynchronous)
SimulatedEnvironment.BackgroundProjections
SimulatedTexture.EnvironmentMappingModes
SimulatedTexture.ProjectionModes
SupportOptions.RdkInitialLocation
SupportOptions.RdkTextureSize
TextureEnvironmentMappingMode
TextureGeneration
TextureGraphInfo.Axis
TextureGraphInfo.Channel
TextureMappingType
 Defines enumerated constants for mapping types such as planar, cylindrical or spherical.
TextureMode
TextureProjectionMode
TextureRenderHashFlags
TextureWrapType
Utilities.ShowContentChooserResults