RhinoCommon API
Rhino.Runtime Namespace
[Missing <summary> documentation for "N:Rhino.Runtime"]
Classes
Class | Description
Analytics
 Provides tools for sending Google Analytics events using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
AssemblyResolver
 Assembly Resolver for the Rhino App Domain.
CommonObject
 Base class for .NET classes that wrap C++ unmanaged Rhino classes.
CorruptGeometryException
 Thrown when Rhino finds a brep or mesh that will cause a crash if used for calculations.
DocumentCollectedException
 Represents the error that happen when a class user attempts to execute a modifying operation on an object that has been added to a document.
HostUtils
 Contains static methods to deal with teh runtime environment.
Interop
 Contains static methods to marshal objects between RhinoCommon and legacy Rhino_DotNet or C++.
NamedParametersEventArgs
 Dictionary style class used for named callbacks from C++ -> .NET
PythonCompiledCode
 Represents scripting compiled code.
PythonScript
 Represents a Python script.
RdkNotLoadedException
 Is thrown when the RDK is not loaded.
RiskyAction
 Defines risky actions that need to be reported in crash exceptions
Skin
 Represents a customized environment that changes the appearance of Rhino.
Skin DLLs must contain a single class that derives from the Skin class.
ViewCaptureWriter
 Callback system used by SVG and PDF exporter to generate documents
ViewCaptureWriter.Pen
ZooClientParameters
 ZooClientParameters is a read-only set of parameters that control the flow of licensing inside ZooClient. Because this class flows through a number of other classes, functions, and UI, it is read-only so that inadvertent changes are not made to the data as it propagates from the caller.
Structures
Structure | Description
ViewCaptureWriter.PathPoint
Interfaces
Interface | Description
IPlatformServiceLocator
 Get platform specific services that are used internally for general cross platform funtions in RhinoCommon. This includes services like localization and GUI components that have concrete implementations in the RhinoWindows or RhinoMac assemblies
IZooClientUtilities
 Interface implemented in ZooClient and added to Rhino via dependency injection
Delegates
Delegate | Description
HostUtils.ExceptionReportDelegate
 Represents a reference to a method that will be called when an exception occurs.
HostUtils.SendLogMessageToCloudDelegate
 Represents a reference to a method that will be called when an exception occurs.
ViewCaptureWriter.FillProc
ViewCaptureWriter.SetClipRectProc
ViewCaptureWriter.VectorArcProc
ViewCaptureWriter.VectorBitmapProc
ViewCaptureWriter.VectorClipPathProc
ViewCaptureWriter.VectorFillPolygonProc
ViewCaptureWriter.VectorPathProc
ViewCaptureWriter.VectorPointProc
ViewCaptureWriter.VectorPolylineProc
ViewCaptureWriter.VectorRoundedRectProc
ViewCaptureWriter.VectorStringProc
Enumerations
Enumeration | Description
HostUtils.LogMessageType
 Represents the type of message that is being sent to the OnSendLogMessageToCloud event
ImportOptionsSections
 Standard CRhImportOptions sections to import
LicenseTypes
 Different licensing modes that Rhino can run in
Mode
 Contains enumerated constant values to represent Rhino's Runtime Mode.
ViewCaptureWriter.PointType