RhinoCommon API
File3dmObjectTable.Delete Method
Overload List
Name | Description
Delete(IEnumerable<Guid>)
 Deletes a collection of objects from the document.
Delete(Guid)
 Deletes object from document.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace