RhinoCommon API
GroupTable.Find Method
Overload List
Name | Description
Find(String)
Finds a group with a given name.
Find(String, Boolean)
Finds a group with a given name.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace