RhinoCommon SDK
SubDVertexAccess.RemoveVertexAndConnections Method
Overload List
Name | Description
RemoveVertexAndConnections(Int32)
 Removes a vertex from the subD. All connected parts are removed, too.
RemoveVertexAndConnections(Int32[])
 Removes some vertices from the subD.
Top
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace