RhinoCommon API
DisplayMaterial.SetBitmapTexture Method
Overload List
Name | Description
SetBitmapTexture(String, Boolean)
SetBitmapTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace