RhinoCommon API
TrulyObservableOrderedSet<T> Constructor
Overload List
Name | Description
TrulyObservableOrderedSet<T>()
 Creates an empty instance.
TrulyObservableOrderedSet<T>(IEnumerable<T>)
 Creates an instance with the given items.
Top
See Also
Reference
TrulyObservableOrderedSet<T> Class
Rhino.Runtime.Notifications Namespace