RhinoCommon API
MeshFace.GetHashCode Method
Overload List
Name | Description
GetHashCode()
 Returns a runtime-stable hashcode for the current mesh face. You are not allowed to rely on persistance of this hashcode in serialization, but for each version of RhinoCommon, this hashcode will be the same for each mesh face.
 (Overrides ValueType.GetHashCode().)
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace