RhinoCommon SDK
Mesh.CreateContourCurves Method
Overload List
Name | Description
CreateContourCurves(Mesh, Plane)
 Constructs contour curves for a mesh, sectioned at a plane.
CreateContourCurves(Mesh, Point3d, Point3d, Double)
 Constructs contour curves for a mesh, sectioned along a linear axis.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace