RhinoCommon SDK
AngularDimension Constructor
Overload List
Name | Description
AngularDimension()
Initializes a new instance of the AngularDimension class
AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
AngularDimension(Arc, Double)
 Create an angular dimension from a given arc
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace