RhinoCommon API
Channel.SetValue Method
Overload List
Name | Description
SetValue(Int32, Int32, Color4f)
 If x or y are out of range, the function will fail and may crash Rhino.
SetValue(Int32, Int32, Single)
 If x or y are out of range, the function will fail and may crash Rhino.
Top
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace