RhinoCommon API
HatchPatternTable.Delete Method
Overload List
Name | Description
Delete(HatchPattern) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(HatchPattern, Boolean)
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace