RhinoCommon SDK
TextLog.Print Method
Overload List
Name | Description
Print(String)
 Send text to the textlog
Print(String, Object)
 Send formatted text to the textlog
Print(String, Object, Object)
 Send formatted text to the textlog
Top
See Also
Reference
TextLog Class
Rhino.FileIO Namespace