RhinoCommon SDK
Curve.Split Method
Overload List
Name | Description
Split(IEnumerable<Double>)
 Splits (divides) the curve at a series of specified parameters. The parameter must be in the interior of the curve's domain.
Split(Double)
 Splits (divides) the curve at the specified parameter. The parameter must be in the interior of the curve's domain.
Split(Brep, Double)
 Splits a curve into pieces using a polysurface.
Split(Surface, Double)
 Splits a curve into pieces using a surface.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace