RhinoCommon API
ObjectTable.Find Method
Overload List
Name | Description
Find(Guid)
 Please use FindId().
Find(UInt32)
 Use the object runtime serial number to find a rhino object in the document. This is the value stored on RhinoObject.RuntimeObjectSerialNumber. The RhinoObject constructor sets the runtime serial number and every instance of a RhinoObject class will have a unique serial number for the duration of the Rhino application. If an object is replaced with a new object, then the new object will have a different runtime serial number. Deleted objects stored in the undo list maintain their runtime serial numbers and this funtion will return pointers to these objects. Call RhinoObject.IsDeleted if you need to determine if the returned object is active or deleted. The runtime serial number is not saved in files.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace