RhinoCommon API
LayerTable.Find Method
Overload List
Name | Description
Find(Guid, Boolean)
Finds a layer with a matching ID.
Find(String, Boolean)
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
Deleted layers have no name.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace