RhinoCommon API
ViewCaptureSettings Constructor
Overload List
Name | Description
ViewCaptureSettings()
Initializes a new instance of the ViewCaptureSettings class
ViewCaptureSettings(RhinoPageView, Double)
Initializes a new instance of the ViewCaptureSettings class
ViewCaptureSettings(RhinoView, Size, Double)
Initializes a new instance of the ViewCaptureSettings class
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace