RhinoCommon SDK
Layer Constructor
Overload List
Name | Description
Layer()
Initializes a new instance of the Layer class
Layer(SerializationInfo, StreamingContext)
Initializes a new instance of the Layer class
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace