RhinoCommon API
Brep.CreateFilletSurface Method
Overload List
Name | Description
CreateFilletSurface(BrepFace, Point2d, BrepFace, Point2d, Double, Boolean, Double)
 Creates a constant-radius round surface between two surfaces.
CreateFilletSurface(BrepFace, Point2d, BrepFace, Point2d, Double, Boolean, Boolean, Double, Brep[], Brep[])
 Creates a constant-radius round surface between two surfaces.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace