RhinoCommon API
ObjectTable.AddExplodedInstancePieces Method
Overload List
Name | Description
AddExplodedInstancePieces(InstanceObject)
AddExplodedInstancePieces(InstanceObject, Boolean, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace