RhinoCommon API
DrawingUtilities.CreateMeshPreviewImage Method
Overload List
Name | Description
CreateMeshPreviewImage(Mesh, Color, Size)
 Creates a preview image of a mesh.
CreateMeshPreviewImage(IEnumerable<Mesh>, IEnumerable<Color>, Size)
 Creates a preview image of one or more meshs.
Top
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace