RhinoCommon API
LinearWorkflow Constructor
Overload List
Name | Description
LinearWorkflow()
 Create an utility object not associated with any document
LinearWorkflow(LinearWorkflow)
 Create utility object not associated with any document from another object
Top
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace