RhinoCommon API
OrdinateDimension Constructor
Overload List
Name | Description
OrdinateDimension()
Initializes a new instance of the OrdinateDimension class
OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace