RhinoCommon SDK
CustomBrepObject.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomBrepObject
In Rhino for Windows 6.0 BETA, this member is inherited from .CommonObjectDispose().
Dispose(Boolean)
Releases the unmanaged resources used by the CustomBrepObject and optionally releases the managed resources
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace