RhinoCommon API
CustomRenderMeshProvider2.BoundingBox Method
Overload List
Name | Description
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
Top
See Also
Reference
CustomRenderMeshProvider2 Class
Rhino.Render Namespace