RhinoCommon API
SweepTwoRail.PerformSweepRebuild Method
Overload List
Name | Description
PerformSweepRebuild(Curve, Curve, Curve, Int32)
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, Int32)
PerformSweepRebuild(Curve, Curve, Curve, Double, Double, Int32)
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Int32)
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace