RhinoCommon SDK
PointCloud.AddRange Method
Overload List
Name | Description
AddRange(IEnumerable<Point3d>)
 Appends a collection of points to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Vector3d>)
 Appends a collection of points and normal vectors to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Color>)
 Appends a collection of points and normal vectors to this point cloud.
AddRange(IEnumerable<Point3d>, IEnumerable<Vector3d>, IEnumerable<Color>)
 Appends a collection of points and normal vectors to this point cloud.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace