RhinoCommon SDK
InstanceDefinitionTable.Modify Method
Overload List
Name | Description
Modify(Int32, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
Modify(InstanceDefinition, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace