RhinoCommon API
ArchivableDictionary.GetBool Method
Overload List
Name | Description
GetBool(String)
 Get value as bool, will only succeed if value was created using Set(string key, bool value)
GetBool(String, Boolean)
 Get value as bool, will return defaultValue unless value was created using Set(string key, bool value)
Top
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace