RhinoCommon API
PersistentSettings.TryGetColor Method
Overload List
Name | Description
TryGetColor(String, Color)
TryGetColor(String, Color, IEnumerable<String>)
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace