RhinoCommon API
ObjectTable.Hide Method
Overload List
Name | Description
Hide(Guid, Boolean)
 If Object().IsNormal() is true, then the object will be hidden.
Hide(ObjRef, Boolean)
 If objref.Object().IsNormal() is true, then the object will be hidden.
Hide(RhinoObject, Boolean)
 If obj.IsNormal() is true, then the object will be hidden.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace