RhinoCommon SDK
SubDVertexPtr.GetSectorIterator Method
Overload List
Name | Description
GetSectorIterator()
GetSectorIterator(SubDFacePtr, Boolean)
Top
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace