RhinoCommon SDK
AreaMassProperties.Compute Method
Overload List
Name | Description
Compute(Brep)
 Computes an AreaMassProperties for a brep.
Compute(Curve)
 Computes an AreaMassProperties for a closed planar curve.
Compute(IEnumerable<GeometryBase>)
 Computes the Area properties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Hatch)
 Computes an AreaMassProperties for a hatch.
Compute(Mesh)
 Computes an AreaMassProperties for a mesh.
Compute(Surface)
 Computes an AreaMassProperties for a surface.
Compute(Curve, Double)
 Computes an AreaMassProperties for a closed planar curve.
Top
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace