RhinoCommon SDK
SubD.Dispose Method
Overload List
Name | Description
Dispose(Boolean)
Releases the unmanaged resources used by the SubD and optionally releases the managed resources
 (Overrides GeometryBase.Dispose(Boolean).)
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace