RhinoCommon API
AnnotationBase.GetBoundingBox Method
Overload List
Name | Description
In Rhino for Windows, this member is overridden by GetBoundingBox(Transform).
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace