RhinoCommon API
LayerTable.FindByFullPath Method
Overload List
Name | Description
FindByFullPath(String, Boolean)
FindByFullPath(String, Int32)
 Searches for a layer using the fully qualified name, that includes ancestors.
Deleted layers have no name.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace