RhinoCommon API
Transform.ChangeBasis Method
Overload List
Name | Description
ChangeBasis(Plane, Plane)
 Computes a change of basis transformation. A basis change is essentially a remapping of geometry from one coordinate system to another.
ChangeBasis(Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
 Computes a change of basis transformation. A basis change is essentially a remapping of geometry from one coordinate system to another.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace