RhinoCommon SDK
Brep.ClosestPoint Method
Overload List
Name | Description
ClosestPoint(Point3d)
 Finds a point on the brep that is closest to testPoint.
ClosestPoint(Point3d, Point3d, ComponentIndex, Double, Double, Double, Vector3d)
 Finds a point on a brep that is closest to testPoint.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace