RhinoCommon API
GroundPlane Constructor
Overload List
Name | Description
GroundPlane()
 Create an utility object not associated with any document
GroundPlane(GroundPlane)
 Create an utility object not associated with any document from another object
Top
See Also
Reference
GroundPlane Class
Rhino.Render Namespace