RhinoCommon API
Brep.CreateFromCornerPoints Method
Overload List
Name | Description
CreateFromCornerPoints(Point3d, Point3d, Point3d, Double)
 Makes a brep with one face.
CreateFromCornerPoints(Point3d, Point3d, Point3d, Point3d, Double)
 make a Brep with one face.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace