RhinoCommon API
ViewInfo Constructor
Overload List
Name | Description
ViewInfo(UInt32)
 Construct the ViewInfo for active viewport of given doc.
ViewInfo(RhinoViewport)
 Access to the ViewInfo for given RhinoViewport
Top
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace