RhinoCommon SDK
SubD.ToLimitSurfaceMesh Method
Overload List
Name | Description
ToLimitSurfaceMesh(Int32)
ToLimitSurfaceMesh(SubDDisplayParameters)
ToLimitSurfaceMesh(Int32, SubD.SubDType)
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace