RhinoCommon API
Mesh.Smooth Method
Overload List
Name | Description
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace