RhinoCommon API
ObjRef Constructor
Overload List
Name | Description
ObjRef(Guid)
 Initializes a new object reference from a globally unique identifier (Guid).
ObjRef(RhinoObject)
 Initializes a new object reference from a Rhino object.
ObjRef(RhinoObject, PickContext)
 Initialized a new object reference from a Rhino object and pick context
Top
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace