RhinoCommon API
PlugIn.AskUserForLicense Method
Overload List
Name | Description
AskUserForLicense(LicenseBuildType, Boolean, String, Object, ValidateProductKeyDelegate)
AskUserForLicense(LicenseBuildType, Boolean, String, Object, ValidateProductKeyDelegate, OnLeaseChangedDelegate)
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace