RhinoCommon API
Curve.CreateBooleanUnion Method
Overload List
Name | Description
CreateBooleanUnion(IEnumerable<Curve>)
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
CreateBooleanUnion(IEnumerable<Curve>, Double)
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace