RhinoCommon API
Quaternion.GetRotation Method
Overload List
Name | Description
GetRotation(Plane)
 Returns the frame created by applying the quaternion's rotation to the canonical world frame (1,0,0),(0,1,0),(0,0,1).
GetRotation(Double, Vector3d)
 Returns the rotation defined by the quaternion.
Top
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace