RhinoCommon API
PersistentSettings.GetValidator Method
Overload List
Name | Description
GetValidator(String)
GetValidator<T>(String)
 Provides a way to find a ready-to-use validator for the PersistentSetting class for the given the key, or obtaining null.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace