RhinoCommon API
LengthValue.Create Method
Overload List
Name | Description
Create(Double, UnitSystem, LengthValue.StringFormat)
Create from Length and UnitSystem
Create(String, StringParserSettings, Boolean)
 Create from string
Create(Double, UnitSystem, LengthValue.StringFormat, UInt32)
Create from Length and UnitSystem
Top
See Also
Reference
LengthValue Class
Rhino Namespace