RhinoCommon API
Centermark Constructor
Overload List
Name | Description
Centermark()
Initializes a new instance of the Centermark class
Centermark(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
Centermark Class
Rhino.Geometry Namespace