RhinoCommon API
DisplayPipeline.DrawBoxCorners Method
Overload List
Name | Description
DrawBoxCorners(BoundingBox, Color)
 Draws corner widgets of a world aligned boundingbox. Widget size will be 5% of the Box diagonal.
DrawBoxCorners(BoundingBox, Color, Double)
 Draws corner widgets of a world aligned boundingbox.
DrawBoxCorners(BoundingBox, Color, Double, Int32)
 Draws corner widgets of a world aligned boundingbox.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace