RhinoCommon API
GeometryBase.GetBoundingBox Method
Overload List
Name | Description
GetBoundingBox(Boolean)
 Boundingbox solver. Gets the world axis aligned boundingbox for the geometry.
GetBoundingBox(Plane)
 Aligned Boundingbox solver. Gets the plane aligned boundingbox.
GetBoundingBox(Transform)
 Aligned Boundingbox solver. Gets the world axis aligned boundingbox for the transformed geometry.
GetBoundingBox(Plane, Box)
 Aligned Boundingbox solver. Gets the plane aligned boundingbox.
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace