RhinoCommon SDK
BrepLoopList.Add Method
Overload List
Name | Description
Add(BrepLoopType)
 Create a new outer boundary loop that runs along the edges of the underlying surface.
Add(BrepLoopType, BrepFace)
 Create a new boundary loop on a face. After you get this BrepLoop, you still need to create the vertices, edges, and trims that define the loop.
Top
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace