RhinoCommon SDK
File3dm.IsValid Method
Overload List
Name | Description
IsValid(String)
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
IsValid(TextLog)
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace