RhinoCommon API
RenderContent.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RenderContent
Dispose(Boolean)
Releases the unmanaged resources used by the RenderContent and optionally releases the managed resources
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace