RhinoCommon API
PersistentSettings.TryGetEnumValue Method
Overload List
Name | Description
TryGetEnumValue<T>(T)
 Attempt to get the stored value for an enum setting. Note: the enum value ALWAYS gets assigned! Be sure to check for success of this method to prevent erroneous use of the value.
TryGetEnumValue<T>(String, T)
 Attempt to get the stored value for an enum setting using a custom key. Note: the enum value ALWAYS gets assigned! Be sure to check for success of this method to prevent erroneous use of the value.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace