RhinoCommon SDK
IPanelsService.OpenPanel Method
Overload List
Name | Description
OpenPanel(Guid)
OpenPanel(Guid, Guid)
OpenPanel(Guid, Boolean)
OpenPanel(Guid, Guid, Boolean)
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace