RhinoCommon SDK
ObjectTable.AddLinearDimension Method
Overload List
Name | Description
AddLinearDimension(LinearDimension)
AddLinearDimension(LinearDimension, ObjectAttributes)
AddLinearDimension(LinearDimension, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace