RhinoCommon API
ObjectAttributes.DrawColor Method
Overload List
Name | Description
DrawColor(RhinoDoc)
DrawColor(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace