RhinoCommon API
ObjectTable.GetObjectList Method
Overload List
Name | Description
GetObjectList(Type)
GetObjectList(ObjectEnumeratorSettings)
GetObjectList(ObjectType)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace