RhinoCommon API
MeshVertexList.Align Method
Overload List
Name | Description
Align(Double, IEnumerable<Boolean>)
 Moves mesh vertices that belong to naked edges to neighboring vertices, within the specified distance.
This forces unaligned mesh vertices to the same location and is helpful to clean meshes for 3D printing.
See the
_AlignMeshVertices
 Rhino command for more information.
Align(IEnumerable<Mesh>, Double, IEnumerable<IEnumerable<Boolean>>)
 Moves mesh vertices that belong to naked edges to neighboring vertices, within the specified distance.
This forces unaligned mesh vertices to the same location and is helpful to clean meshes for 3D printing.
See the
_AlignMeshVertices
 Rhino command for more information.
Top
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace