RhinoCommon SDK
SubDVertexAccess.AddVertices Method
Overload List
Name | Description
AddVertices(SubD.SubDVertexTag, IEnumerable<Point3d>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts double-precision points.
AddVertices(SubD.SubDVertexTag, IEnumerable<Point3f>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
Top
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace