RhinoCommon API
RenderSettings.Dispose Method
Overload List
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
In Rhino for Windows 6.23, this member is inherited from .CommonObjectDispose().
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
In Rhino for Windows 6.23, this member is inherited from .CommonObjectDispose(Boolean).
Top
See Also
Reference
RenderSettings Class
Rhino.Render Namespace