RhinoCommon API
LicenseUtils.ShowRhinoExpiredMessage Method
Overload List
Name | Description
ShowRhinoExpiredMessage(Int32, Int32)
 Show Rhino or Beta expired message
ShowRhinoExpiredMessage(Mode, Int32)
 Show Rhino or Beta expired message
Top
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace