RhinoCommon API
Mesh.Split Method
Overload List
Name | Description
Split(Mesh)
 Split a mesh with another mesh.
Split(IEnumerable<Mesh>)
 Split a mesh with a collection of meshes.
Split(Plane)
 Split a mesh by an infinite plane.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace