RhinoCommon SDK
DisplayPipeline.DrawMeshShaded Method
Overload List
Name | Description
DrawMeshShaded(Mesh, DisplayMaterial)
 Draws the shaded faces of a given mesh.
DrawMeshShaded(Mesh, DisplayMaterial, Int32[])
 Draws the shaded faces of a given mesh.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace