RhinoCommon API
Brep.MergeCoplanarFaces Method
Overload List
Name | Description
MergeCoplanarFaces(Double)
 Merges adjacent coplanar faces into single faces.
MergeCoplanarFaces(Double, Double)
 Merges adjacent coplanar faces into single faces.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace