RhinoCommon SDK
Curve.CreateBooleanDifference Method
Overload List
Name | Description
CreateBooleanDifference(Curve, Curve)
 Calculates the boolean difference between two closed, planar curves. Note, curves must be co-planar.
CreateBooleanDifference(Curve, IEnumerable<Curve>)
 Calculates the boolean difference between a closed planar curve, and a list of closed planar curves. Note, curves must be co-planar.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace