RhinoCommon API
PersistentSettings.GetEnumValue Method
Overload List
Name | Description
GetEnumValue<T>()
 Get a stored enum value.
GetEnumValue<T>(String)
 Get a stored enum value using a custom key.
GetEnumValue<T>(T)
 Get a stored enum value, or return default value if not found
GetEnumValue<T>(String, T)
 Gets a stored enum value using a custom key, or return default value if not found.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace