RhinoCommon API
Box.Contains Method
Overload List
Name | Description
Contains(BoundingBox)
 Test a boundingbox for Box inclusion. This is the same as calling Contains(box,false)
Contains(Box)
 Test a box for Box inclusion. This is the same as calling Contains(box,false)
Contains(Point3d)
 Determines whether a point is included in this box. This is the same as calling Contains(point,false)
Contains(BoundingBox, Boolean)
 Test a boundingbox for Box inclusion.
Contains(Box, Boolean)
 Test a box for Box inclusion.
Contains(Point3d, Boolean)
 Determines whether a point is included in this box.
Top
See Also
Reference
Box Structure
Rhino.Geometry Namespace