RhinoCommon SDK
NamedViewTable.Restore Method
Overload List
Name | Description
Restore(Int32, RhinoView, Boolean)
 Sets the MainViewport of a standard RhinoView to a named views settings
Restore(Int32, RhinoViewport, Boolean)
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace