RhinoCommon API
PlaneSurface.CreateThroughBox Method
Overload List
Name | Description
CreateThroughBox(Plane, BoundingBox)
 Extends a plane into a plane surface so that the latter goes through a bounding box.
CreateThroughBox(Line, Vector3d, BoundingBox)
 Makes a plane that includes a line and a vector and goes through a bounding box.
Top
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace