RhinoCommon SDK
MaterialTable.Find Method
Overload List
Name | Description
Find(Guid, Boolean)
Finds a material with a matching id.
Find(String, Boolean)
 Finds a meterial with a given name.
Top
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace