RhinoCommon SDK
DisplayPipeline.DrawBitmap Method
Overload List
Name | Description
DrawBitmap(DisplayBitmap, Int32, Int32)
 Draws a bitmap in screen coordinates
DrawBitmap(DisplayBitmap, Int32, Int32, Color)
 Draws a bitmap in screen coordinates
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace