RhinoCommon API
LicenseUtils.LicenseOptionsHandler Method
Overload List
Name | Description
LicenseOptionsHandler(Guid, String, Boolean)
LicenseOptionsHandler(Guid, Guid, String, Boolean)
Top
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace