RhinoCommon API
PersistentSettingsConverter.TryParseEnum Method
Overload List
Name | Description
TryParseEnum(Type, String, Int32)
 Converts an enum value name to its integer equivalent.
TryParseEnum(Type, String, String)
 Converts an enum value string (integer as string) to a enum value name.
Top
See Also
Reference
PersistentSettingsConverter Class
Rhino Namespace