RhinoCommon API
Localization.LocalizeCommandOptionName Method
Overload List
Name | Description
LocalizeCommandOptionName(String, Int32)
LocalizeCommandOptionName(String, Object, Int32)
Top
See Also
Reference
Localization Class
Rhino.UI Namespace