RhinoCommon API
ClassArrayObjRef Constructor
Overload List
Name | Description
ClassArrayObjRef()
 Initializes a new ClassArrayObjRef instance.
ClassArrayObjRef(IEnumerable<ObjRef>)
 Initializes a new instances from a set of ObjRefs
Top
See Also
Reference
ClassArrayObjRef Class
Rhino.Runtime.InteropWrappers Namespace