RhinoCommon SDK
Point4d Constructor
Overload List
Name | Description
Point4d(Point3d)
 Initializes a new instance of the Point4d class from the coordinates of a point.
Point4d(Double, Double, Double, Double)
 Initializes a new instance of the Point4d class based on coordinates.
Top
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace