RhinoCommon API
GeometryBase.Dispose Method
Overload List
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Top
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace