RhinoCommon API
ObjectTable.GetObjectsByType Method
Overload List
Name | Description
GetObjectsByType<T>()
GetObjectsByType<T>(ObjectEnumeratorSettings)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace