RhinoCommon API
PersistentSettings.RegisterSettingsValidator Method
Overload List
Name | Description
RegisterSettingsValidator(String, EventHandler<PersistentSettingsEventArgs>)
RegisterSettingsValidator<T>(String, EventHandler<PersistentSettingsEventArgs<T>>)
 Sets a validator for a given key.
Note to implementers: T should be one of the supported types for the PersistentSettings class and should match the type associated with the key.
This method allows to use anonymous methods and lambda expressions.
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace