RhinoCommon API
PlugIn.Find Method
Overload List
Name | Description
Find(Guid)
 Finds the plug-in instance that was loaded from a given plug-in Id.
Find(Assembly)
 Finds the plug-in instance that was loaded from a given assembly.
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace