RhinoCommon SDK
Brep.Split Method
Overload List
Name | Description
Split(Brep, Double)
 Splits a Brep into pieces.
Split(Brep, Double, Boolean)
 Splits a Brep into pieces.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace