RhinoCommon API
Dialogs.ShowNumberBox Method
Overload List
Name | Description
ShowNumberBox(String, String, Double)
ShowNumberBox(String, String, Double, Double, Double)
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace