RhinoCommon SDK
SubDVertexAccess.Add Method
Overload List
Name | Description
Add(SubD.SubDVertexTag, Point3d)
 Adds a new vertex to the end of the Vertex list.
Add(SubD.SubDVertexTag, Double, Double, Double)
 Adds a new vertex to the end of the Vertex list.
Top
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace