RhinoCommon API
Box Constructor
Overload List
Name | Description
Box(BoundingBox)
 Initializes a new Box that mimics a BoundingBox struct.
The orientation plane of the Box is coincident with the World XY plane.
Box(Plane, BoundingBox)
 Initializes a world aligned box from a base plane and a boundingbox.
Box(Plane, GeometryBase)
 Initializes a box that contains a generic piece of geometry. This box will be aligned with an arbitrary plane.
Box(Plane, IEnumerable<Point3d>)
 Initializes the smallest box that contains a set of points.
Box(Plane, Interval, Interval, Interval)
 Initializes a new box from a base Plane and three Intervals.
Top
See Also
Reference
Box Structure
Rhino.Geometry Namespace