RhinoCommon API
RenderMaterial.SimulateMaterial Method
Overload List
Name | Description
SimulateMaterial(Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
SimulateMaterial(Material, Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace