RhinoCommon API
Transform.Rotation Method
Overload List
Name | Description
Rotation(Double, Point3d)
 Constructs a new rotation transformation with specified angle and rotation center.
Rotation(Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
Rotation(Vector3d, Vector3d, Point3d)
 Constructs a new rotation transformation with start and end directions and rotation center.
Rotation(Double, Double, Vector3d, Point3d)
 Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
Rotation(Vector3d, Vector3d, Vector3d, Vector3d, Vector3d, Vector3d)
 Constructs a transformation that maps X0 to X1, Y0 to Y1, Z0 to Z1.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace