RhinoCommon API
DisplayModeDescription.AddDisplayMode Method
Overload List
Name | Description
AddDisplayMode(String)
 Adds a new display mode.
AddDisplayMode(DisplayModeDescription)
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace