RhinoCommon API
SweepTwoRail.PerformSweep Method
Overload List
Name | Description
PerformSweep(Curve, Curve, Curve)
PerformSweep(Curve, Curve, IEnumerable<Curve>)
PerformSweep(Curve, Curve, Curve, Double, Double)
PerformSweep(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>)
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace