RhinoCommon API
BoundingBox Constructor
Overload List
Name | Description
BoundingBox(IEnumerable<Point3d>)
 Constructs a boundingbox from a collection of points.
BoundingBox(Point3d, Point3d)
 Constructs a new boundingbox from two corner points.
BoundingBox(IEnumerable<Point3d>, Transform)
 Constructs a boundingbox from a collection of points.
BoundingBox(Double, Double, Double, Double, Double, Double)
 Constructs a boundingbox from numeric extremes.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace