RhinoCommon SDK
SubD.Subdivide Method
Overload List
Name | Description
Subdivide(Int32, SubD.SubDType, Int32)
Subdivide(Int32, SubD.SubDType, Int32, Int32)
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace