RhinoCommon API
ViewTable.AddPageView Method
Overload List
Name | Description
AddPageView(String)
 Constructs a new page view with a given title and, at the same time, adds it to the list.
AddPageView(String, Double, Double)
 Constructs a new page view with a given title and size and, at the same time, adds it to the list.
Top
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace