RhinoCommon API
BoundingBox.Contains Method
Overload List
Name | Description
Contains(BoundingBox)
 Determines whether this boundingbox contains another boundingbox.
This is the same as calling Contains(box,false).
Contains(Point3d)
 Tests a point for boundingbox inclusion. This is the same as calling Contains(point, false)
Contains(BoundingBox, Boolean)
 Determines whether this boundingbox contains another boundingbox.
The user can choose how to treat boundingboxes with coincidents surfaces.
Contains(Point3d, Boolean)
 Tests a point for BoundingBox inclusion.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace