RhinoCommon API
Curve Constructor
Overload List
Name | Description
Curve()
 Protected constructor for internal use.
Curve(SerializationInfo, StreamingContext)
 Protected serialization constructor for internal use.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace