RhinoCommon API
InstanceDefinition.Equals Method
Overload List
Name | Description
Equals(Object)
 Equality is checked against InstanceDefinition.Id
 (Overrides Object.Equals(Object).)
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace