RhinoCommon API
Localization.LocalizeString Method
Overload List
Name | Description
LocalizeString(String, Int32)
 Returns localized version of a given English string. This function should be autogenerated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
LocalizeString(String, Object, Int32)
 Returns localized version of a given English string. This function should be autogenerated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
Top
See Also
Reference
Localization Class
Rhino.UI Namespace