RhinoCommon API
NameHash.Equals Method
Overload List
Name | Description
Equals(Object)
 Determines if another object is a name hash with same value.
 (Overrides Object.Equals(Object).)
Equals(NameHash)
 Determines if another name hash has the same value.
Top
See Also
Reference
NameHash Class
Rhino.FileIO Namespace