RhinoCommon API
GetBaseClass.AddOptionEnumList Method
Overload List
Name | Description
AddOptionEnumList<T>(String, T)
 Adds a choice of enum values as list option
AddOptionEnumList<T>(String, T, T[])
 Adds a choice of enum values as list option. Allows to include only some enum values.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace