RhinoCommon API
FieldDictionary.Set Method
Overload List
Name | Description
Set(String, Color4f)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point2d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point3d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point4d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Transform)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Vector2d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Vector3d)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Boolean)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Byte[])
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, DateTime)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Double)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Color)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Guid)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Int32)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Single)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, String)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Color4f, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point2d, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point3d, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Point4d, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Transform, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Vector2d, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Vector3d, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Boolean, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Byte[], RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, DateTime, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Double, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Color, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Guid, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Int32, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, Single, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Set(String, String, RenderContent.ChangeContexts) |  Obsolete.
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Top
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace