RhinoCommon API
Leader Constructor
Overload List
Name | Description
Leader()
 Constructor
Leader(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
Leader Class
Rhino.Geometry Namespace