RhinoCommon API
ViewCaptureWriter.PushClipPath Method
Overload List
Name | Description
PushClipPath(RectangleF)
PushClipPath(ViewCaptureWriter.PathPoint[])
Top
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace