RhinoCommon API
MeshFace.ToString Method
Overload List
Name | Description
ToString()
 Returns a string representation for this MeshFace. This is to provide a meaningful visualization of this structure and is subject to change in newer releases.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace