RhinoCommon API
Intersection.MeshPlane Method
Overload List
Name | Description
MeshPlane(Mesh, Plane)
 Intersects a mesh with an (infinite) plane.
MeshPlane(Mesh, IEnumerable<Plane>)
 Intersects a mesh with a collection of (infinite) planes.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace