RhinoCommon API
MeshingParameters Constructor
Overload List
Name | Description
MeshingParameters()
 Initializes a new instance with default values.
Initial values are same as Default.
MeshingParameters(Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
MeshingParameters(Double, Double)
 Initializes a new instance with simple values, similar to that of Rhino's meshing slider interface.
Top
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace