RhinoCommon SDK
Text3d.Finalize Method
Overload List
Name | Description
Finalize()
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Text3d Class
Rhino.Display Namespace