RhinoCommon API
RenderTexture.LocalMappingTransform Property
 Gets the transformation that can be applied to the UVW vector to convert it from normalized texture space into locally mapped space (ie - with repeat, offset and rotation applied.)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform LocalMappingTransform { get; }
Public ReadOnly Property LocalMappingTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderTexture Class
Rhino.Render Namespace