RhinoCommon SDK
SubDVertexSectorIterator.FirstFaceCenterVertexIndex Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.FirstFaceCenterVertexIndex"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FirstFaceCenterVertexIndex { get; }
Public ReadOnly Property FirstFaceCenterVertexIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace