RhinoCommon API
AppearanceSettings.ShowSideBar Property
 Should the side bar be displayed
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowSideBar { get; set; }
Public Shared Property ShowSideBar As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace