RhinoCommon API
Fonts.BoldHeadingFont Property
 Returns a font that is 1.2x NormalFont and Bold
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Font BoldHeadingFont { get; }
Public Shared ReadOnly Property BoldHeadingFont As Font
	Get
Property Value
Type: Font
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Fonts Class
Rhino.UI Namespace