RhinoCommon API
MorphControl.Surface Property
 Returns the morph control's surface. While this should never be null, the calling function should check.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsSurface Surface { get; }
Public ReadOnly Property Surface As NurbsSurface
	Get
Property Value
Type: NurbsSurface
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace