RhinoCommon API
SmartTrackSettings.PointColor Property
Gets or sets the point color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color PointColor { get; set; }
Public Shared Property PointColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace