RhinoCommon SDK
OpenFileDialog.DefaultExt Property
 The default file name extension. The returned string does not include the period.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string DefaultExt { get; set; }
Public Property DefaultExt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace