RhinoCommon API
NodeInCodeTable.Count Property
 Returns the amount of items in this table.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
NodeInCodeTable Class
Rhino.NodeInCode Namespace