RhinoCommon API
SmartTrackSettings.LineColor Property
Gets or sets the smart track line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color LineColor { get; set; }
Public Shared Property LineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace