RhinoCommon SDK
Rectangle3d.Height Property
 Gets the signed height of the rectangle. If the Y dimension is decreasing, the height will be negative.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
Property Value
Type: Double
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace