RhinoCommon API
ProviderIds.Undo Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.Undo"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Undo { get; }
Public Shared ReadOnly Property Undo As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace