RhinoCommon API
ViewInfo.WallpaperFilename Property
 Get filename for wallpaper set to this view, if any.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string WallpaperFilename { get; }
Public ReadOnly Property WallpaperFilename As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace