RhinoCommon API
ViewCaptureSettings.OffsetAnchor Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.OffsetAnchor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewCaptureSettings.AnchorLocation OffsetAnchor { get; set; }
Public Property OffsetAnchor As ViewCaptureSettings.AnchorLocation
	Get
	Set
Property Value
Type: ViewCaptureSettings.AnchorLocation
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace