RhinoCommon API
LinearWorkflow.PreProcessTextures Property
 Linear workflow active state
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PreProcessTextures { get; set; }
Public Property PreProcessTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace