RhinoCommon API
ShutLiningCurveInfo.Profile Property
 >The profile type.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Profile { get; }
Public ReadOnly Property Profile As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace