RhinoCommon API
MaterialTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MaterialTableEventType EventType { get; }
Public ReadOnly Property EventType As MaterialTableEventType
	Get
Property Value
Type: MaterialTableEventType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace