RhinoCommon SDK
Command.LastCommandId Property
 Gets the ID of the last commands.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid LastCommandId { get; }
Public Shared ReadOnly Property LastCommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Command Class
Rhino.Commands Namespace