RhinoCommon API
VisualAnalysisMode.Name Property
 Gets the name of the analysis mode. It is used by the _What command and the object properties details window to describe the object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace