RhinoCommon API
LicenseStatus.CloudZooLeaseExpiration Property
 Returns the expiration date of the lease this instance represents.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Nullable<DateTime> CloudZooLeaseExpiration { get; set; }
Public Property CloudZooLeaseExpiration As Nullable(Of DateTime)
	Get
	Set
Property Value
Type: Nullable<DateTime>
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace