RhinoCommon API
ComponentStatus.IsLocked Property
 Returns true if locked. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsLocked { get; }
Public ReadOnly Property IsLocked As Boolean
	Get
Return Value
Type: Boolean
The component status for locked.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace