RhinoCommon API
ViewCaptureWriter.PathPoint.PointType Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.PathPoint.PointType"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewCaptureWriter.PointType PointType { get; set; }
Public Property PointType As ViewCaptureWriter.PointType
	Get
	Set
Property Value
Type: ViewCaptureWriter.PointType
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureWriter.PathPoint Structure
Rhino.Runtime Namespace