RhinoCommon API
RenderPropertyChangedEvent.Context Property
 Optional argument which may specify the property being modified.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Context { get; }
Public ReadOnly Property Context As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderPropertyChangedEvent Class
Rhino.Render Namespace