RhinoCommon API
RhinoApp.IsInternetAccessAllowed Property
 Returns true when Rhino is allowed to access the internet, false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsInternetAccessAllowed { get; }
Public Shared ReadOnly Property IsInternetAccessAllowed As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoApp Class
Rhino Namespace