RhinoCommon API
NamedLayerStateTable.Count Property
 Returns the number of named layers states in the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace