RhinoCommon SDK
Material.AmbientColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.AmbientColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color AmbientColor { get; set; }
Public Property AmbientColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace