RhinoCommon API
FileSettings.FileLockingOpenWarning Property
Gets or sets whether to display the information dialog which identifies computer files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool FileLockingOpenWarning { get; set; }
Public Shared Property FileLockingOpenWarning As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace