RhinoCommon SDK
DimensionStyle.TextRotation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextRotation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextRotation { get; set; }
Public Property TextRotation As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace