RhinoCommon API
ThumbData.InUse Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.InUse"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InUse { get; set; }
Public Property InUse As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace