RhinoCommon API
Point2f.Unset Property
 Gets the standard unset point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2f Unset { get; }
Public Shared ReadOnly Property Unset As Point2f
	Get
Property Value
Type: Point2f
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace