RhinoCommon API
ContentUuids.ResampleTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.ResampleTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ResampleTextureType { get; }
Public Shared ReadOnly Property ResampleTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ContentUuids Class
Rhino.Render Namespace