RhinoCommon API
GetPolyline.FourthPointPrompt Property
Prompt when getting fourth point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FourthPointPrompt { get; set; }
Public Property FourthPointPrompt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace