RhinoCommon SDK
RhinoViewport.FrustumAspect Property
Gets the width/height ratio of the frustum.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumAspect { get; }
Public ReadOnly Property FrustumAspect As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace