RhinoCommon API
ChangeQueue.IsPreview Property
 Return true if this ChangeQueue is created for preview rendering. No view was set for preview rendering.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPreview { get; }
Public ReadOnly Property IsPreview As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace