RhinoCommon API
ViewInfo.FocalBlurMode Property
 Gets or sets the Focal blur mode of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewInfoFocalBlurModes FocalBlurMode { get; set; }
Public Property FocalBlurMode As ViewInfoFocalBlurModes
	Get
	Set
Property Value
Type: ViewInfoFocalBlurModes
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace