RhinoCommon SDK
SubDVertexSectorIterator.CurrentEdgeCcwPrevFlipped Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentEdgeCcwPrevFlipped"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CurrentEdgeCcwPrevFlipped { get; }
Public ReadOnly Property CurrentEdgeCcwPrevFlipped As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace