RhinoCommon API
DimensionStyle.AngleResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngleResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AngleResolution { get; set; }
Public Property AngleResolution As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace