RhinoCommon API
GroundPlane.Enabled Property
 Return true if ground plane is enabled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; }
Public ReadOnly Property Enabled As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace