RhinoCommon SDK
Interval.Item Property
 Gets or sets the indexed bound of this Interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Bound index (0 = lower; 1 = upper).
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interval Structure
Rhino.Geometry Namespace