RhinoCommon API
FontQuartet.HasRegularFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasRegularFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasRegularFont { get; }
Public ReadOnly Property HasRegularFont As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace