RhinoCommon API
DisplayPipeline.DisplayPipelineAttributes Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.DisplayPipelineAttributes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes DisplayPipelineAttributes { get; }
Public ReadOnly Property DisplayPipelineAttributes As DisplayPipelineAttributes
	Get
Property Value
Type: DisplayPipelineAttributes
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace