RhinoCommon SDK
BrepEdge.EdgeCurve Property
 Get the brep.Curves3D[] 3d curve geometry used by this edge or null.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve EdgeCurve { get; }
Public ReadOnly Property EdgeCurve As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace