RhinoCommon API
Vector3d.Y Property
 Gets or sets the Y (second) component of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace