RhinoCommon API
GetCircle.Deformable Property
 Is the deformable option set
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Deformable { get; set; }
Public Property Deformable As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace