RhinoCommon API
ObjectAttributes.Decals Property
 Gets all object decals associated with this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Decals Decals { get; }
Public ReadOnly Property Decals As Decals
	Get
Property Value
Type: Decals
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace