RhinoCommon API
GetPolyline.MaxPointCount Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPolyline.MaxPointCount"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MaxPointCount { get; set; }
Public Property MaxPointCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace