RhinoCommon API
NurbsSurfacePointList.CountV Property
 Gets the number of control points in the V direction of this surface.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CountV { get; }
Public ReadOnly Property CountV As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace