RhinoCommon API
RhinoApp.Version Property
 File version of the main Rhino process
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Version Version { get; }
Public Shared ReadOnly Property Version As Version
	Get
Property Value
Type: Version
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoApp Class
Rhino Namespace