RhinoCommon SDK
RenderContent.Document Property
 If this content is in a document content list, the document will be returned. Otherwise null.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContent Class
Rhino.Render Namespace