RhinoCommon API
LicenseStatus.LicenseType Property
The license contentType. (e.g. Standalone, Network, etc.)
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseType LicenseType { get; set; }
Public Property LicenseType As LicenseType
	Get
	Set
Property Value
Type: LicenseType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace