RhinoCommon API
Arrowhead.BlockId Property
 Id of block used for user-defined arrowhead
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid BlockId { get; }
Public ReadOnly Property BlockId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Arrowhead Class
Rhino.Geometry Namespace