RhinoCommon SDK
SubDFacePtr.Next Property
 Links to next face on this level.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacePtr Next { get; }
Public ReadOnly Property Next As SubDFacePtr
	Get
Property Value
Type: SubDFacePtr
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace