RhinoCommon SDK
PanelIds.Layers Property
 Rhino Layer panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid Layers { get; }
Public Shared ReadOnly Property Layers As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace