RhinoCommon API
FileReference.IsSet Property
 Returns an indication of the fact that the reference is actually set to a non-null value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSet { get; }
Public ReadOnly Property IsSet As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileReference Class
Rhino.FileIO Namespace