RhinoCommon API
InstanceDefinition.Url Property
 The hyperlink URL that is executed when the UrlDescription hyperlink is clicked on in the Insert and Block UI
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Url { get; }
Public ReadOnly Property Url As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace