RhinoCommon API
Dimension.LengthFactor Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.LengthFactor"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LengthFactor { get; set; }
Public Property LengthFactor As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Dimension Class
Rhino.Geometry Namespace