RhinoCommon API
DecalCreateParams.StartLatitude Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.StartLatitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double StartLatitude { get; set; }
Public Property StartLatitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace