RhinoCommon API
ContentUuids.PerturbingTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PerturbingTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PerturbingTextureType { get; }
Public Shared ReadOnly Property PerturbingTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ContentUuids Class
Rhino.Render Namespace