RhinoCommon API
RhinoWindow.Handle Property
[Missing <summary> documentation for "P:Rhino.RhinoWindow.Handle"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
Implements
IWin32Window.Handle
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoWindow Class
Rhino Namespace