RhinoCommon API
AnnotationBase.TextHasRtfFormatting Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationBase.TextHasRtfFormatting"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TextHasRtfFormatting { get; }
Public ReadOnly Property TextHasRtfFormatting As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace