RhinoCommon API
FileObjWriteOptions.ExportMaterialDefinitions Property
 Setting to write an .mtl file and "usemtl"s in the obj file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportMaterialDefinitions { get; set; }
Public Property ExportMaterialDefinitions As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace