RhinoCommon API
InstanceDefinition.SourceArchive Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.SourceArchive"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SourceArchive { get; }
Public ReadOnly Property SourceArchive As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace