RhinoCommon API
ThumbData.Content Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Content"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent Content { get; set; }
Public Property Content As RenderContent
	Get
	Set
Property Value
Type: RenderContent
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace