RhinoCommon API
LightTableEventArgs.NewState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.NewState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LightObject NewState { get; }
Public ReadOnly Property NewState As LightObject
	Get
Property Value
Type: LightObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace