RhinoCommon API
Dithering.Method Property
[Missing <summary> documentation for "P:Rhino.Render.Dithering.Method"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Dithering.Methods Method { get; set; }
Public Property Method As Dithering.Methods
	Get
	Set
Property Value
Type: Dithering.Methods
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Dithering Class
Rhino.Render Namespace