RhinoCommon API
Decal.StartLongitude Property
 Gets the start angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double StartLongitude { get; }
Public ReadOnly Property StartLongitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Decal Class
Rhino.Render Namespace