RhinoCommon API
DocumentOpenEventArgs.Reference Property
 true if file is opened as a reference file.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Reference { get; }
Public ReadOnly Property Reference As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DocumentOpenEventArgs Class
Rhino Namespace