RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Metallic Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Metallic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Metallic { get; }
Public Shared ReadOnly Property Metallic As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace