RhinoCommon API
File3dm.PlugInData Property
 Custom plug-in data in this file. This data is not attached to any geometry or attributes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmPlugInDataTable PlugInData { get; }
Public ReadOnly Property PlugInData As File3dmPlugInDataTable
	Get
Property Value
Type: File3dmPlugInDataTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dm Class
Rhino.FileIO Namespace