RhinoCommon SDK
Plane.ZAxis Property
 Gets or sets the Z axis vector of this plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d ZAxis { get; set; }
Public Property ZAxis As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Plane Structure
Rhino.Geometry Namespace