RhinoCommon API
Dimension.ForceTextPosition Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ForceTextPosition"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Dimension.ForceText ForceTextPosition { get; set; }
Public Property ForceTextPosition As Dimension.ForceText
	Get
	Set
Property Value
Type: Dimension.ForceText
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Dimension Class
Rhino.Geometry Namespace