RhinoCommon API
RhinoApp.UpdatesAndStatisticsStatus Property
 Returns true when Rhino is allowed to access the internet, false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int UpdatesAndStatisticsStatus { get; }
Public Shared ReadOnly Property UpdatesAndStatisticsStatus As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoApp Class
Rhino Namespace