RhinoCommon API
Font.LogfontName Property
 Returns Windows Logfont Facename
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LogfontName { get; }
Public ReadOnly Property LogfontName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Font Class
Rhino.DocObjects Namespace