RhinoCommon SDK
ThumbData.Image Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Image"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Bitmap Image { get; set; }
Public Property Image As Bitmap
	Get
	Set
Property Value
Type: Bitmap
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace