RhinoCommon API
DimensionStyle.FitArrow Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FitArrow"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ArrowFit FitArrow { get; set; }
Public Property FitArrow As DimensionStyle.ArrowFit
	Get
	Set
Property Value
Type: DimensionStyle.ArrowFit
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace