RhinoCommon SDK
SubDEdgePtr.FaceCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.FaceCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FaceCount { get; }
Public ReadOnly Property FaceCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace