RhinoCommon API
Vector3d.MinimumCoordinate Property
 Gets the smallest (both positive and negative) component value in this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MinimumCoordinate { get; }
Public ReadOnly Property MinimumCoordinate As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace