RhinoCommon API
RhinoDocObserverArgs.Doc Property
 Document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Doc { get; }
Public ReadOnly Property Doc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDocObserverArgs Class
Rhino Namespace