RhinoCommon SDK
RenderSettings.RenderBackfaces Property
 Gets or sets a value indicating whether to render back faces.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RenderBackfaces { get; set; }
Public Property RenderBackfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace