RhinoCommon API
RenderContentChangedEventArgs.ChangeContext Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentChangedEventArgs.ChangeContext"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent.ChangeContexts ChangeContext { get; }
Public ReadOnly Property ChangeContext As RenderContent.ChangeContexts
	Get
Property Value
Type: RenderContent.ChangeContexts
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderContentChangedEventArgs Class
Rhino.Render Namespace