RhinoCommon SDK
Material.Id Property
Gets or sets the ID of this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
Material Class
Rhino.DocObjects Namespace