RhinoCommon API
Line.ToY Property
 Gets or sets the Y coordinate of the line To point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ToY { get; set; }
Public Property ToY As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Line Structure
Rhino.Geometry Namespace