RhinoCommon API
DisplayRenderSettings.SceneLightingOn Property
 True if scene lighting is enabled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SceneLightingOn { get; }
Public ReadOnly Property SceneLightingOn As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace