RhinoCommon SDK
GumballDisplayConduit.Enabled Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballDisplayConduit.Enabled"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace