RhinoCommon API
SweepTwoRail.AngleToleranceRadians Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepTwoRail.AngleToleranceRadians"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AngleToleranceRadians { get; set; }
Public Property AngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace