RhinoCommon SDK
SubDFacePtr.EdgeVertexCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDFacePtr.EdgeVertexCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int EdgeVertexCount { get; }
Public ReadOnly Property EdgeVertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace