RhinoCommon API
ProviderIds.LinearWorkflow Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.LinearWorkflow"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid LinearWorkflow { get; }
Public Shared ReadOnly Property LinearWorkflow As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace