RhinoCommon API
RenderSettings.LinearWorkflow Property
 Get the document linear workflow interface
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LinearWorkflow LinearWorkflow { get; }
Public ReadOnly Property LinearWorkflow As LinearWorkflow
	Get
Property Value
Type: LinearWorkflow
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderSettings Class
Rhino.Render Namespace