RhinoCommon SDK
Layer.PathSeparator Property
 The string "::" (colon,colon) is used to separate parent and child layer names.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string PathSeparator { get; }
Public Shared ReadOnly Property PathSeparator As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Layer Class
Rhino.DocObjects Namespace