RhinoCommon SDK
RenderSettings.FocalBlurSampleCount Property
 Get or set the amount of focal blur samples to take
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FocalBlurSampleCount { get; set; }
Public Property FocalBlurSampleCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RenderSettings Class
Rhino.Render Namespace