RhinoCommon API
ComponentStatus.IsSelectedPersistent Property
 Returns true if selected persistent. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSelectedPersistent { get; }
Public ReadOnly Property IsSelectedPersistent As Boolean
	Get
Return Value
Type: Boolean
The component status for selected.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace