RhinoCommon API
RhinoViewport.Camera35mmLensLength Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.Camera35mmLensLength"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Camera35mmLensLength { get; set; }
Public Property Camera35mmLensLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace