RhinoCommon API
GetCone.Cap Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCone.Cap"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Cap { get; set; }
Public Property Cap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace