RhinoCommon API
VolumeMassProperties.WorldCoordinatesFirstMoments Property
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "x dm" over the volume Y is integral of "y dm" over the volume Z is integral of "z dm" over the volume.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d WorldCoordinatesFirstMoments { get; }
Public ReadOnly Property WorldCoordinatesFirstMoments As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace