RhinoCommon API
RhinoApp.Rhino5Id Property
Gets the ID of Rhino 5.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Rhino5Id { get; }
Public Shared ReadOnly Property Rhino5Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoApp Class
Rhino Namespace