RhinoCommon SDK
RhinoViewport.WorldAxesVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WorldAxesVisible"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WorldAxesVisible { get; set; }
Public Property WorldAxesVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace