RhinoCommon API
DisplayPipeline.ActiveTopLevelObject Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ActiveTopLevelObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject ActiveTopLevelObject { get; }
Public ReadOnly Property ActiveTopLevelObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace