RhinoCommon API
Arc.Length Property
 Gets the length of the arc. (Length = Radius * (subtended angle in radians)).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Arc Structure
Rhino.Geometry Namespace