RhinoCommon API
Transform.M10 Property
Gets or sets this[1,0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M10 { get; set; }
Public Property M10 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Transform Structure
Rhino.Geometry Namespace