RhinoCommon API
PointCloud.ContainsHiddenFlags Property
 Gets a value indicating whether or not the points in this pointcloud have hidden flags assigned to them.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ContainsHiddenFlags { get; }
Public ReadOnly Property ContainsHiddenFlags As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace