RhinoCommon API
ViewCaptureSettings.DrawBackground Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawBackground"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawBackground { get; set; }
Public Property DrawBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace