RhinoCommon API
LinearDimension.Arrowhead1End Property
 Gets the arrow head end of the first extension line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d Arrowhead1End { get; }
Public ReadOnly Property Arrowhead1End As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace