RhinoCommon API
RhinoDoc.AnimationProperties Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.AnimationProperties"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AnimationProperties AnimationProperties { get; set; }
Public Property AnimationProperties As AnimationProperties
	Get
	Set
Property Value
Type: AnimationProperties
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDoc Class
Rhino Namespace