RhinoCommon API
ContentUuids.Texture3DCheckerTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.Texture3DCheckerTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Texture3DCheckerTextureType { get; }
Public Shared ReadOnly Property Texture3DCheckerTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentUuids Class
Rhino.Render Namespace