RhinoCommon API
DisplayPipelineAttributes.ShowSurfaceEdges Property
Show surface edges.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowSurfaceEdges { get; set; }
Public Property ShowSurfaceEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace