RhinoCommon API
GeneralSettingsState.MouseSelectMode Property
 Gets or sets the current selection mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MouseSelectMode MouseSelectMode { get; set; }
Public Property MouseSelectMode As MouseSelectMode
	Get
	Set
Property Value
Type: MouseSelectMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace