RhinoCommon API
PlugInInfo.UpdateUrl Property
 Returns the web site, or url, were an updated version of the plug-in can be found.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string UpdateUrl { get; }
Public ReadOnly Property UpdateUrl As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace