RhinoCommon API
RenderPrimitiveList.RhinoObject Property
 The Rhino object associated with this list
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace