RhinoCommon SDK
DimensionStyle.AlternateLengthFormat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateLengthFormat"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LengthDisplayFormat AlternateLengthFormat { get; set; }
Public Property AlternateLengthFormat As DimensionStyle.LengthDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplayFormat
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace