RhinoCommon API
FileSettings.TemplateFile Property
Returns or sets the location of Rhino's template file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string TemplateFile { get; set; }
Public Shared Property TemplateFile As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace