RhinoCommon API
DimensionStyle.ForceDimensionLineBetweenExtensionLines Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ForceDimensionLineBetweenExtensionLines"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ForceDimensionLineBetweenExtensionLines { get; set; }
Public Property ForceDimensionLineBetweenExtensionLines As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace