RhinoCommon API
FileObjReadOptions.UseObjObjects Property
 Determines whether or not "o"s in the obj file will be interpreted as objects in the Rhino model
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseObjObjects { get; set; }
Public Property UseObjObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 If UseObjGsAs is OBJGroupsAsObjects this value is ignored.
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace