RhinoCommon API
RhinoDoc.Bitmaps Property
 bitmaps used in textures, backgrounds, wallpapers, ...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BitmapTable Bitmaps { get; }
Public ReadOnly Property Bitmaps As BitmapTable
	Get
Property Value
Type: BitmapTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoDoc Class
Rhino Namespace