RhinoCommon SDK
InstanceDefinition.ComponentType Property
 Returns InstanceDefinition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace