RhinoCommon API
FileObjWriteOptions.UseSimpleDialog Property
 Determines whether to use the simple or detailed meshing dialog.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseSimpleDialog { get; set; }
Public Property UseSimpleDialog As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace