RhinoCommon API
CommonObject.PerformCorruptionTesting Property
 Used to test ON_Object* pointers to see if they are a brep or mesh that is corrupt enough to crash Rhino.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool PerformCorruptionTesting { get; set; }
Public Shared Property PerformCorruptionTesting As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace