RhinoCommon API
Notification.Description Property
 The description of the notification. The description is displayed in the Notifications panel in Rhino.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace