RhinoCommon API
ContentUuids.StuccoTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.StuccoTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid StuccoTextureType { get; }
Public Shared ReadOnly Property StuccoTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentUuids Class
Rhino.Render Namespace