RhinoCommon API
Torus.MinorRadius Property
 Gets or sets the radius of the torus section.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MinorRadius { get; set; }
Public Property MinorRadius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Torus Structure
Rhino.Geometry Namespace