RhinoCommon API
Interval.T0 Property
 Gets or sets the lower bound of the Interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double T0 { get; set; }
Public Property T0 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Interval Structure
Rhino.Geometry Namespace