RhinoCommon API
LinetypeTable.ComponentType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LinetypeTable.ComponentType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace