RhinoCommon SDK
AnnotationBase.TextRotationDegrees Property
 Rotation of text in degrees
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextRotationDegrees { get; set; }
Public Property TextRotationDegrees As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace