RhinoCommon SDK
ThumbData.PreviewAppearance Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.PreviewAppearance"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PreviewAppearance PreviewAppearance { get; set; }
Public Property PreviewAppearance As PreviewAppearance
	Get
	Set
Property Value
Type: PreviewAppearance
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace