RhinoCommon API
GumballObject.Frame Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballObject.Frame"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballFrame Frame { get; set; }
Public Property Frame As GumballFrame
	Get
	Set
Property Value
Type: GumballFrame
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace