RhinoCommon API
ObjectEnumeratorSettings.IncludePhantoms Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.IncludePhantoms"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludePhantoms { get; set; }
Public Property IncludePhantoms As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace