RhinoCommon API
ComponentFunctionInfo.DelegateTreeNoWarnings Property
 Returns a delegate that can be directly invoked using a list of arguments. This considers trees and simplifies single-output components.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Delegate DelegateTreeNoWarnings { get; }
Public ReadOnly Property DelegateTreeNoWarnings As Delegate
	Get
Property Value
Type: Delegate
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace