RhinoCommon SDK
MorphControl.SpaceMorphTolerance Property
 The 3d fitting tolerance used when morphing surfaces and breps. The default is 0.0 and any value <= 0.0 is ignored by morphing functions. The value returned by Tolerance does not affect the way meshes and points are morphed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SpaceMorphTolerance { get; set; }
Public Property SpaceMorphTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace