RhinoCommon API
ClippingPlaneObject.ClippingPlaneGeometry Property
 Gets the clipping plane surface.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClippingPlaneSurface ClippingPlaneGeometry { get; }
Public ReadOnly Property ClippingPlaneGeometry As ClippingPlaneSurface
	Get
Property Value
Type: ClippingPlaneSurface
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace