RhinoCommon API
GetPointMouseEventArgs.ShiftKeyDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.ShiftKeyDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShiftKeyDown { get; }
Public ReadOnly Property ShiftKeyDown As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace