RhinoCommon API
StringParserSettings.ParseFeetInches Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseFeetInches"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseFeetInches { get; set; }
Public Property ParseFeetInches As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace