RhinoCommon API
GetObject.ObjectsWerePreselected Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetObject.ObjectsWerePreselected"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ObjectsWerePreselected { get; }
Public ReadOnly Property ObjectsWerePreselected As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace