RhinoCommon API
PointCloudItem.X Property
 Gets or sets the X component of this point cloud item location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace