RhinoCommon API
SimpleArrayClippingPlaneObjectPointer.Count Property
 Gets the amount of clipping planes in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
SimpleArrayClippingPlaneObjectPointer Class
Rhino.Runtime.InteropWrappers Namespace