RhinoCommon API
CreatePreviewEventArgs.Objects Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.Objects"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<CreatePreviewEventArgs.SceneObject> Objects { get; }
Public ReadOnly Property Objects As List(Of CreatePreviewEventArgs.SceneObject)
	Get
Property Value
Type: List<CreatePreviewEventArgs.SceneObject>
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace