RhinoCommon SDK
Dimension.AltLengthFormat Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltLengthFormat"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LengthDisplayFormat AltLengthFormat { get; set; }
Public Property AltLengthFormat As DimensionStyle.LengthDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplayFormat
See Also
Reference
Dimension Class
Rhino.Geometry Namespace