RhinoCommon API
MeshVertexColorList.Count Property
 Gets or sets the number of mesh colors.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace