RhinoCommon API
StackedDialogPage.PageControl Property
 Return the control that represents this page. Rhino Windows supports classes that implement the IWin32Windows interface or are derived from some form of System.Windows.FrameworkElement or Eto.Forms.Control. Mac Rhino supports controls that are derived from NSview or Eto.Forms.Control.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Object PageControl { get; }
Public MustOverride ReadOnly Property PageControl As Object
	Get
Property Value
Type: Object
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace