RhinoCommon API
SimulatedTexture.HasTransparentColor Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.HasTransparentColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasTransparentColor { get; set; }
Public Property HasTransparentColor As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace