RhinoCommon API
FileReadOptions.ImportReferenceMode Property
 true means we are reading information for a work session reference model or a linked instance definition.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ImportReferenceMode { get; set; }
Public Property ImportReferenceMode As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace