RhinoCommon API
Cylinder.IsFinite Property
 true if the cylinder is finite (Height0 != Height1) false if the cylinder is infinite.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsFinite { get; }
Public ReadOnly Property IsFinite As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace