RhinoCommon API
Toolbar.Name Property
[Missing <summary> documentation for "P:Rhino.UI.Toolbar.Name"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
Toolbar Class
Rhino.UI Namespace