RhinoCommon API
HistoryRecord.Handle Property
 Wrapped native C++ pointer to CRhinoHistory instance
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace