RhinoCommon SDK
VisualAnalysisMode.RhinoCurvatureColorAnalyisModeId Property
 Id for Rhino's built-in curvature color analysis mode. Surface curvature is shown using false color mapping.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid RhinoCurvatureColorAnalyisModeId { get; }
Public Shared ReadOnly Property RhinoCurvatureColorAnalyisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace