RhinoCommon API
Hatch.BasePoint Property
 Gets or sets the hatchpattern basepoint
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d BasePoint { get; set; }
Public Property BasePoint As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Hatch Class
Rhino.Geometry Namespace