RhinoCommon API
GetCylinder.Cap Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCylinder.Cap"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Cap { get; set; }
Public Property Cap As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace