RhinoCommon API
ViewportInfo.FrustumNearPlane Property
 Gets near clipping plane if camera and frustum are valid. The plane's frame is the same as the camera's frame. The origin is located at the intersection of the camera direction ray and the near clipping plane. The plane's normal points out of the frustum towards the camera location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane FrustumNearPlane { get; }
Public ReadOnly Property FrustumNearPlane As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace