RhinoCommon API
BrepTrim.TrimCurve Property
 Gets the Brep.Curves2D 2d curve geometry used by this trim, or null.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve TrimCurve { get; }
Public ReadOnly Property TrimCurve As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace