RhinoCommon API
MeshThicknessMeasurement.MeshIndex Property
 Gets the index of the mesh associated with this thickness measurement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MeshIndex { get; }
Public ReadOnly Property MeshIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace