RhinoCommon API
RhinoViewport.Bounds Property
 Gets the size and location of the viewport, in pixels, relative to the parent view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle Bounds { get; }
Public ReadOnly Property Bounds As Rectangle
	Get
Property Value
Type: Rectangle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace