RhinoCommon API
Layer.ComponentStatus Property
 Gets or sets the status of the layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ComponentStatus ComponentStatus { get; set; }
Public Overrides Property ComponentStatus As ComponentStatus
	Get
	Set
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Layer Class
Rhino.DocObjects Namespace