RhinoCommon API
TransformField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Value { get; set; }
Public Property Value As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
TransformField Class
Rhino.Render.Fields Namespace