RhinoCommon SDK
ViewTable.ModelSpaceIsActive Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.ViewTable.ModelSpaceIsActive"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModelSpaceIsActive { get; }
Public ReadOnly Property ModelSpaceIsActive As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace