RhinoCommon API
ModelAidSettingsState.OsnapCursorMode Property
Gets or sets the OSnap cursor mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CursorMode OsnapCursorMode { get; set; }
Public Property OsnapCursorMode As CursorMode
	Get
	Set
Property Value
Type: CursorMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace