RhinoCommon API
File3dmHistoryRecordTable.Count Property
 Gets the number of history records in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
File3dmHistoryRecordTable Class
Rhino.FileIO Namespace