RhinoCommon API
RhinoApp.IsRunningHeadless Property
Is Rhino currently being executed in headless mode
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsRunningHeadless { get; }
Public Shared ReadOnly Property IsRunningHeadless As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoApp Class
Rhino Namespace