RhinoCommon API
RhinoDoc.CurrentEnvironment Property
 Access to the current environment for various uses
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ICurrentEnvironment CurrentEnvironment { get; }
Public ReadOnly Property CurrentEnvironment As ICurrentEnvironment
	Get
Property Value
Type: ICurrentEnvironment
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoDoc Class
Rhino Namespace