RhinoCommon API
BrepLoopList.Item Property
 Gets the BrepLoop at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepLoop this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As BrepLoop
	Get
Parameters
index
Type: System.Int32
Index of BrepLoop to access.
Return Value
Type: BrepLoop
The BrepLoop at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace