RhinoCommon API
GetPointMouseEventArgs.Source Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.Source"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetPoint Source { get; }
Public ReadOnly Property Source As GetPoint
	Get
Property Value
Type: GetPoint
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace