RhinoCommon API
Quaternion.K Property
 Returns the (0,0,0,1) quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion K { get; }
Public Shared ReadOnly Property K As Quaternion
	Get
Property Value
Type: Quaternion
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace