RhinoCommon SDK
SporphSpaceMorph.IsValid Property
 Returns true if the space morph definition is valid, false otherwise.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SporphSpaceMorph Class
Rhino.Geometry.Morphs Namespace