RhinoCommon API
DisplayPipelineAttributes.ShowTangentEdges Property
Show tangent edges.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowTangentEdges { get; set; }
Public Property ShowTangentEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace