RhinoCommon API
DisplayModeDescription.RenderedId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.RenderedId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RenderedId { get; }
Public Shared ReadOnly Property RenderedId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace