RhinoCommon API
AnnotationBase.DimensionStyleId Property
 Id of this annotation's parent dimstyle If this annotation has overrides to dimstyle properties, those overrides will be represented in the DimensionStyle returned by DimensionStyle(ParentStyle)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid DimensionStyleId { get; set; }
Public Property DimensionStyleId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace