RhinoCommon API
Utilities.DefaultRenderPlugInId Property
 Get the plug-in Id for the default render plug-in
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid DefaultRenderPlugInId { get; }
Public Shared ReadOnly Property DefaultRenderPlugInId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Utilities Class
Rhino.Render Namespace