RhinoCommon API
GetObject.SerialNumber Property
 Each instance of GetObject has a unique runtime serial number that is used to identify object selection events associated with that instance.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint SerialNumber { get; }
Public ReadOnly Property SerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace