RhinoCommon API
ContentUuids.PerlinMarbleTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PerlinMarbleTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PerlinMarbleTextureType { get; }
Public Shared ReadOnly Property PerlinMarbleTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ContentUuids Class
Rhino.Render Namespace