RhinoCommon API
RhinoView.EnableDrawing Property
 Gets or sets the 'drawing enabled' flag. By default, drawing is enabled.
There are some rare situations where scipts want to disable drawing for a while.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool EnableDrawing { get; set; }
Public Shared Property EnableDrawing As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoView Class
Rhino.Display Namespace