RhinoCommon API
PointObject.PointGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PointObject.PointGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point PointGeometry { get; }
Public ReadOnly Property PointGeometry As Point
	Get
Property Value
Type: Point
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace