RhinoCommon API
ViewInfo.WallpaperHidden Property
 True if wallpaper (if any) is to be hidden from this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WallpaperHidden { get; }
Public ReadOnly Property WallpaperHidden As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace