RhinoCommon API
Font.FamilyPlusFaceName Property
 Returns concatinated Family and Face names
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FamilyPlusFaceName { get; }
Public ReadOnly Property FamilyPlusFaceName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Font Class
Rhino.DocObjects Namespace