RhinoCommon SDK
GumballDisplayConduit.PreTransform Property
 The pre-transform is a transformation that needs to be applied before the gumball transformation.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform PreTransform { get; set; }
Public Property PreTransform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace