RhinoCommon SDK
ToolbarFileCollection.Item Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFileCollection.Item(System.Int32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ToolbarFile this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ToolbarFile
	Get
Parameters
index
Type: System.Int32
Property Value
Type: ToolbarFile
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace