RhinoCommon API
AppearanceSettings.LanguageIdentifier Property
Gets or sets the language identifier.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int LanguageIdentifier { get; set; }
Public Shared Property LanguageIdentifier As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace