RhinoCommon SDK
SubDFacePtr.Vertices Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDFacePtr.Vertices"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<SubDVertexPtr> Vertices { get; }
Public ReadOnly Property Vertices As IEnumerable(Of SubDVertexPtr)
	Get
Property Value
Type: IEnumerable<SubDVertexPtr>
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace