RhinoCommon SDK
Plane.Unset Property
 Gets a plane that contains Unset origin and axis vectors.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Plane Unset { get; }
Public Shared ReadOnly Property Unset As Plane
	Get
Property Value
Type: Plane
See Also
Reference
Plane Structure
Rhino.Geometry Namespace