RhinoCommon SDK
MeshFace.IsTriangle Property
 Gets a value indicating whether or not this mesh face is a triangle. A mesh face is considered to be a triangle when C equals D, thus it is possible for an Invalid mesh face to also be a triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsTriangle { get; }
Public ReadOnly Property IsTriangle As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace