RhinoCommon API
DimensionStyle.BaselineSpacing Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.BaselineSpacing"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double BaselineSpacing { get; set; }
Public Property BaselineSpacing As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace