RhinoCommon API
BlockEditCommand.Replacement Property
 The current replacement command
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static BlockEditCommand Replacement { get; }
Public Shared ReadOnly Property Replacement As BlockEditCommand
	Get
Property Value
Type: BlockEditCommand
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace