RhinoCommon SDK
RenderMaterial.PlasticMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PlasticMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PlasticMaterialGuid { get; }
Public Shared ReadOnly Property PlasticMaterialGuid As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace