RhinoCommon API
NamedValue.Name Property
[Missing <summary> documentation for "P:Rhino.Render.NamedValue.Name"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
NamedValue Class
Rhino.Render Namespace