RhinoCommon API
RefinementSettings.HasPull Property
 Gets a value indicating whether this subdivision should create a result on a specific surface.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasPull { get; }
Public ReadOnly Property HasPull As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace