RhinoCommon SDK
AngularDimension.Type Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.Type"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationType Type { get; }
Public ReadOnly Property Type As AnnotationType
	Get
Property Value
Type: AnnotationType
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace