RhinoCommon API
Leader.LeaderHasLanding Property
 Returns true if the leader has a landing line
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool LeaderHasLanding { get; set; }
Public Property LeaderHasLanding As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Leader Class
Rhino.Geometry Namespace