RhinoCommon SDK
ConstructionPlane.GridLineCount Property
 Gets or sets the total amount of grid lines in each direction.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int GridLineCount { get; set; }
Public Property GridLineCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace