RhinoCommon API
RenderContentSerializer.FileExtension Property
 File extension associated with this serialize object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FileExtension { get; }
Public ReadOnly Property FileExtension As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace