RhinoCommon API
CullObjectEventArgs.RhinoObject Property
[Missing <summary> documentation for "P:Rhino.Display.CullObjectEventArgs.RhinoObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace