RhinoCommon API
DimensionStyle.FixedExtensionLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FixedExtensionLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FixedExtensionLength { get; set; }
Public Property FixedExtensionLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace