RhinoCommon API
ViewCapture.DrawGrid Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.DrawGrid"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawGrid { get; set; }
Public Property DrawGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ViewCapture Class
Rhino.Display Namespace