RhinoCommon API
RenderContent.TypeDescription Property
 Description for your content type. ie. "Procedural checker pattern"
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string TypeDescription { get; }
Public MustOverride ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderContent Class
Rhino.Render Namespace