RhinoCommon SDK
PointCloudItem.Z Property
 Gets or sets the Z component of this point cloud item location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace