RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.AnisotropicRotation Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.AnisotropicRotation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string AnisotropicRotation { get; }
Public Shared ReadOnly Property AnisotropicRotation As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace