RhinoCommon API
ObjRef.ObjectId Property
Returns the id of the referenced Rhino object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace