RhinoCommon API
DimensionStyle.DrawTextMask Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DrawTextMask"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawTextMask { get; set; }
Public Property DrawTextMask As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace