RhinoCommon API
ObjectPropertiesPageEventArgs.View Property
 Active view
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace