RhinoCommon API
ViewInfo.FocalBlurJitter Property
 Gets or sets the Focal blur jitter of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FocalBlurJitter { get; set; }
Public Property FocalBlurJitter As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace