RhinoCommon API
ThumbData.InUseColor Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.InUseColor"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<Color4f> InUseColor { get; set; }
Public Property InUseColor As List(Of Color4f)
	Get
	Set
Property Value
Type: List<Color4f>
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace