RhinoCommon API
HiddenLineDrawingParameters.IncludeTangentEdges Property
 Include tangent edges in hidden line drawing (default is true)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeTangentEdges { get; set; }
Public Property IncludeTangentEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace