RhinoCommon API
AppearanceSettings.LockedObjectColor Property
color used to draw locked objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color LockedObjectColor { get; set; }
Public Shared Property LockedObjectColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace