RhinoCommon API
ComponentFunctionInfo.OutputNames Property
 Grasshopper returns several items in general. This property returns the output names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IReadOnlyList<string> OutputNames { get; }
Public ReadOnly Property OutputNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace