RhinoCommon API
ToolbarFile.ToolbarCount Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.ToolbarCount"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ToolbarCount { get; }
Public ReadOnly Property ToolbarCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace