RhinoCommon API
SmartTrackSettings.MaxSmartPoints Property
Gets or sets the maximum number of smart points.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int MaxSmartPoints { get; set; }
Public Shared Property MaxSmartPoints As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace