RhinoCommon API
RhinoDoc.ModelSpaceHatchScalingEnabled Property
 True if hatch scaling is enabled, false if not.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ModelSpaceHatchScalingEnabled { get; set; }
Public Property ModelSpaceHatchScalingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDoc Class
Rhino Namespace