RhinoCommon API
BrepTrim.EndVertex Property
 BrepVertex at end of trim
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertex EndVertex { get; }
Public ReadOnly Property EndVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace