RhinoCommon SDK
DetailViewObject.DetailGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DetailViewObject.DetailGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DetailView DetailGeometry { get; }
Public ReadOnly Property DetailGeometry As DetailView
	Get
Property Value
Type: DetailView
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace