RhinoCommon API
RuiUpdateUi.MenuHandle Property
Windows menu handle of menu that contains this item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr MenuHandle { get; }
Public ReadOnly Property MenuHandle As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace