RhinoCommon API
DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MeshWireThickness { get; set; }
Public Property MeshWireThickness As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace