RhinoCommon SDK
SubDEdgePtr.Tag Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.Tag"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubD.SubDEdgeTag Tag { get; set; }
Public Property Tag As SubD.SubDEdgeTag
	Get
	Set
Property Value
Type: SubD.SubDEdgeTag
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace