RhinoCommon API
File3dm.Manifest Property
 Retrieves the manifest with all object descriptions in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ManifestTable Manifest { get; }
Public ReadOnly Property Manifest As ManifestTable
	Get
Property Value
Type: ManifestTable
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dm Class
Rhino.FileIO Namespace