RhinoCommon SDK
RenderSettings.FocalBlurDistance Property
 Get or set the distance to the focal point to use for calculation of focal blur
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FocalBlurDistance { get; set; }
Public Property FocalBlurDistance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RenderSettings Class
Rhino.Render Namespace