RhinoCommon API
ICollapsibleSectionHolder.BackgroundColor Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.BackgroundColor"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Color BackgroundColor { set; }
WriteOnly Property BackgroundColor As Color
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace