RhinoCommon API
DisplayPipelineAttributes.ShadeVertexColors Property
Shade using vertex colors.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShadeVertexColors { get; set; }
Public Property ShadeVertexColors As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace