RhinoCommon API
ViewCapture.ScaleScreenItems Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.ScaleScreenItems"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ScaleScreenItems { get; set; }
Public Property ScaleScreenItems As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ViewCapture Class
Rhino.Display Namespace