RhinoCommon API
RhinoApp.IsPreRelease Property
 Returns true if Rhino is compiled a s Pre-release build (Beta, WIP) false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsPreRelease { get; }
Public Shared ReadOnly Property IsPreRelease As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoApp Class
Rhino Namespace