RhinoCommon API
ModelAidSettings.SnapToLocked Property
Gets or sets the locked state of the snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SnapToLocked { get; set; }
Public Shared Property SnapToLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace