RhinoCommon SDK
RealtimeDisplayModeClassInfo.DrawOpenGl Property
 Return true if the RealtimeDisplayMode draws its result using OpenGL. RenderWindow usage will then be skipped.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool DrawOpenGl { get; }
Public MustOverride ReadOnly Property DrawOpenGl As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace