RhinoCommon API
RhinoReplaceObjectEventArgs.OldRhinoObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoReplaceObjectEventArgs.OldRhinoObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject OldRhinoObject { get; }
Public ReadOnly Property OldRhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace