RhinoCommon API
Material.UseCount Property
 Number of objects and layers that use this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UseCount { get; }
Public ReadOnly Property UseCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Material Class
Rhino.DocObjects Namespace