RhinoCommon API
Rectangle3d.Area Property
 Gets the unsigned Area of the rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace