RhinoCommon API
SimulatedTexture.Filename Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Filename"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Filename { get; set; }
Public Property Filename As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace