RhinoCommon API
DimensionStyle.LeaderContentAngleType Property
 Style of leader content angle Horizontal Aligned Rotated
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LeaderContentAngleStyle LeaderContentAngleType { get; set; }
Public Property LeaderContentAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace