RhinoCommon API
DisplayModeChangedEventArgs.RhinoDoc Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeChangedEventArgs.RhinoDoc"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc RhinoDoc { get; }
Public ReadOnly Property RhinoDoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace