RhinoCommon API
GroundPlane.MaterialInstanceId Property
 Id of material in material table for this ground plane.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid MaterialInstanceId { get; set; }
Public Property MaterialInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GroundPlane Class
Rhino.Render Namespace