RhinoCommon API
SweepTwoRail.ClosedSweep Property
 If the input rails are closed, ClosedSweep determines if the swept breps will also be closed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ClosedSweep { get; set; }
Public Property ClosedSweep As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace