RhinoCommon API
RhinoViewport.CameraTarget Property
 Viewport target point.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d CameraTarget { get; }
Public ReadOnly Property CameraTarget As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace