RhinoCommon API
RhinoDoc.DistanceDisplayPrecision Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.DistanceDisplayPrecision"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DistanceDisplayPrecision { get; }
Public ReadOnly Property DistanceDisplayPrecision As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDoc Class
Rhino Namespace