RhinoCommon API
RhinoDoc.IsAvailable Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsAvailable"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsAvailable { get; }
Public ReadOnly Property IsAvailable As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace