RhinoCommon API
ProviderIds.RdkRenderingPostEffectGlow Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkRenderingPostEffectGlow"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RdkRenderingPostEffectGlow { get; }
Public Shared ReadOnly Property RdkRenderingPostEffectGlow As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace