RhinoCommon API
GetLine.GetLineMode Property
 Mode used
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetLineMode GetLineMode { get; set; }
Public Property GetLineMode As GetLineMode
	Get
	Set
Property Value
Type: GetLineMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace