RhinoCommon API
SmartTrackSettings.SmartOrtho Property
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
Orthogonal lines are then drawn automatically.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SmartOrtho { get; set; }
Public Shared Property SmartOrtho As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace