RhinoCommon API
City.Name Property
 Gets name of city.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
City Class
Rhino.Render Namespace