RhinoCommon API
MeshPoint.Triangle Property
 Face triangle where the intersection takes place:
0 is unset
A is 0,1,2
B is 0,2,3
C is 0,1,3
D is 1,2,3
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public char Triangle { get; }
Public ReadOnly Property Triangle As Char
	Get
Property Value
Type: Char
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace