RhinoCommon API
StackedDialogPage.HasChildren Property
 Will be true if this page contains sub pages.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasChildren { get; }
Public ReadOnly Property HasChildren As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace