RhinoCommon API
HatchPattern.FillType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.FillType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HatchPatternFillType FillType { get; set; }
Public Property FillType As HatchPatternFillType
	Get
	Set
Property Value
Type: HatchPatternFillType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace