RhinoCommon API
FontQuartet.QuartetName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.QuartetName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string QuartetName { get; }
Public ReadOnly Property QuartetName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace