RhinoCommon API
ManifestTable.Parent Property
 Returns the parent object. This is the RhinoDoc, or the File3md file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Object Parent { get; }
Public MustOverride ReadOnly Property Parent As Object
	Get
Property Value
Type: Object
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace