RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Displacement Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Displacement"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Displacement { get; }
Public Shared ReadOnly Property Displacement As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace