RhinoCommon API
SnapShotsClient.SerialNumber Property
[Missing <summary> documentation for "P:Rhino.DocObjects.SnapShots.SnapShotsClient.SerialNumber"]
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SerialNumber { get; set; }
Public Property SerialNumber As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace