RhinoCommon API
NamedViewTable.Item Property
 Conceptually, the named view table is an array of ViewInfo and their associated names. The indexing operator ([] in C#) can be used to get individual ViewInfo items.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewInfo this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ViewInfo
	Get
Parameters
index
Type: System.Int32
Zero based array index.
Return Value
Type: ViewInfo
The view that was found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace