RhinoCommon API
GroundPlane.TextureRotation Property
 Get texture rotation on the ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextureRotation { get; }
Public ReadOnly Property TextureRotation As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace