RhinoCommon SDK
Plane.Origin Property
 Gets or sets the origin point of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Origin { get; set; }
Public Property Origin As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Plane Structure
Rhino.Geometry Namespace