RhinoCommon API
LengthValue.LengthStringFormat Property
 Returns the StringFormat from this LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LengthValue.StringFormat LengthStringFormat { get; }
Public ReadOnly Property LengthStringFormat As LengthValue.StringFormat
	Get
Property Value
Type: LengthValue.StringFormat
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
LengthValue Class
Rhino Namespace