RhinoCommon SDK
SubDVertexSectorIterator.CurrentFaceCenterVertexIndex Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentFaceCenterVertexIndex"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int CurrentFaceCenterVertexIndex { get; }
Public ReadOnly Property CurrentFaceCenterVertexIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace