RhinoCommon API
PickContext.View Property
 This view can be a model view or a page view. When view is a page view, then you need to distingish between the viewports MainViewport() and ActiveViewport(). When m_view is a model view, both MainViewport() and ActiveViewport() return the world view's viewport.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoView View { get; set; }
Public Property View As RhinoView
	Get
	Set
Property Value
Type: RhinoView
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace