RhinoCommon SDK
ThumbData.Selected Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Selected"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Selected { get; set; }
Public Property Selected As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace