RhinoCommon SDK
SubDVertexSectorIterator.CurrentEdgeCcwPrev Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentEdgeCcwPrev"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr CurrentEdgeCcwPrev { get; }
Public ReadOnly Property CurrentEdgeCcwPrev As SubDEdgePtr
	Get
Property Value
Type: SubDEdgePtr
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace