RhinoCommon API
PersistentSettings.Service Property
[Missing <summary> documentation for "P:Rhino.PersistentSettings.Service"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ISettingsService Service { get; }
Public Shared ReadOnly Property Service As ISettingsService
	Get
Property Value
Type: ISettingsService
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
PersistentSettings Class
Rhino Namespace