RhinoCommon API
HiddenLineDrawing.Points Property
 Point objects calculated by the hidden line drawing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<HiddenLineDrawingPoint> Points { get; }
Public ReadOnly Property Points As IEnumerable(Of HiddenLineDrawingPoint)
	Get
Property Value
Type: IEnumerable<HiddenLineDrawingPoint>
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace