RhinoCommon SDK
ThumbData.Selected Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Selected"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Selected { get; set; }
Public Property Selected As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace