RhinoCommon API
Transform.ZeroTransformation Property
 ZeroTransformation diagonal = (0,0,0,1)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Transform ZeroTransformation { get; }
Public Shared ReadOnly Property ZeroTransformation As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Transform Structure
Rhino.Geometry Namespace