RhinoCommon API
ReplayHistoryData.RecordId Property
 Each history record has a unique id that Rhino assigns when it adds the history record to the history record table
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RecordId { get; }
Public ReadOnly Property RecordId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace