RhinoCommon SDK
SubDFacePtr.Edges Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDFacePtr.Edges"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<KeyValuePair<SubDEdgePtr, bool>> Edges { get; }
Public ReadOnly Property Edges As IEnumerable(Of KeyValuePair(Of SubDEdgePtr, Boolean))
	Get
Property Value
Type: IEnumerable<KeyValuePair<SubDEdgePtr, Boolean>>
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace