RhinoCommon API
MeshingParameters.QualityRenderMesh Property
 Gets mesh creation parameters to create the a render mesh when mesh quality is prefered over meshing speed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MeshingParameters QualityRenderMesh { get; }
Public Shared ReadOnly Property QualityRenderMesh As MeshingParameters
	Get
Property Value
Type: MeshingParameters
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace