RhinoCommon API
ObjectPropertiesPage.AllObjectsMustBeSupported Property
 Returns true when running on Mac which requires only objects of SupportedTypes. Returns false when running on Windows which only requires a single item of SupportedTypes to be selected. Override if you wish to change the above behavior.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool AllObjectsMustBeSupported { get; }
Public Overridable ReadOnly Property AllObjectsMustBeSupported As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace