RhinoCommon API
RenderContent.TypeId Property
 Type identifier for this content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid TypeId { get; }
Public ReadOnly Property TypeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContent Class
Rhino.Render Namespace