RhinoCommon SDK
ThumbData.Id Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Id"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace