RhinoCommon API
DimensionStyle.LeaderCurveType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderCurveType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LeaderCurveStyle LeaderCurveType { get; set; }
Public Property LeaderCurveType As DimensionStyle.LeaderCurveStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderCurveStyle
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace