RhinoCommon API
TwoColorRenderTexture.SwapColors Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.SwapColors"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SwapColors { get; set; }
Public Property SwapColors As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace