RhinoCommon API
SmartTrackSettingsState.UseSmartTrack Property
Gets or sets if the 'smart track' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseSmartTrack { get; set; }
Public Property UseSmartTrack As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace