RhinoCommon API
Brep.Vertices Property
 Gets the brep vertices list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertexList Vertices { get; }
Public ReadOnly Property Vertices As BrepVertexList
	Get
Property Value
Type: BrepVertexList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Brep Class
Rhino.Geometry Namespace