RhinoCommon API
AnimationProperties.CaptureType Property
 Gets or sets the capture type of the animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AnimationProperties.CaptureTypes CaptureType { get; set; }
Public Property CaptureType As AnimationProperties.CaptureTypes
	Get
	Set
Property Value
Type: AnimationProperties.CaptureTypes
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace