RhinoCommon SDK
Thumbnail.CppPointer Property
 Thumbnail c++ pointer
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace