RhinoCommon API
MeshDisplacementInfo.Black Property
 Value considered lowest point in the displacement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Black { get; set; }
Public Property Black As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace