RhinoCommon API
TimeZone.Hours Property
 Gets hours of a time zone.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Hours { get; }
Public ReadOnly Property Hours As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
TimeZone Class
Rhino.Render Namespace