RhinoCommon SDK
SubDVertexPtr.Id Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.Id"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace