RhinoCommon API
ICollapsibleSection.Hidden Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.Hidden"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool Hidden { get; }
ReadOnly Property Hidden As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace