RhinoCommon API
MeshNgonList.UnsignedCount Property
 Gets or sets the number of mesh ngons.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint UnsignedCount { get; set; }
Public Property UnsignedCount As UInteger
	Get
	Set
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace