RhinoCommon SDK
Arc.IsCircle Property
 Gets a value indicating whether or not this arc is a complete circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCircle { get; }
Public ReadOnly Property IsCircle As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Arc Structure
Rhino.Geometry Namespace