RhinoCommon API
RenderMaterial.GlassMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.GlassMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GlassMaterialGuid { get; }
Public Shared ReadOnly Property GlassMaterialGuid As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace