RhinoCommon SDK
RadialDimension.TextOrientation Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.TextOrientation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override TextOrientation TextOrientation { get; set; }
Public Overrides Property TextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace