RhinoCommon SDK
AngularDimension.CenterPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.CenterPoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d CenterPoint { get; set; }
Public Property CenterPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace