RhinoCommon API
MaterialRefCreateParams.FrontFaceMaterialIndex Property
 The index of the material used to render the front of an object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FrontFaceMaterialIndex { get; set; }
Public Property FrontFaceMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace