RhinoCommon API
RhinoObject.GripsSelected Property
 true if grips are turned on and at least one is selected.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GripsSelected { get; }
Public ReadOnly Property GripsSelected As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace