RhinoCommon API
DimensionStyle.LeaderTextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderTextVerticalAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextVerticalAlignment LeaderTextVerticalAlignment { get; set; }
Public Property LeaderTextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace