RhinoCommon API
CustomObjectGrips.GripsMoved Property
 If GripsMoved is true if some of the grips have ever been moved GripObject.NewLocation() sets GripsMoved=true.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GripsMoved { get; }
Public ReadOnly Property GripsMoved As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace