RhinoCommon API
ObjectAttributes.PlotWeight Property
 Plot weight in millimeters. =0.0 means use the default width <0.0 means don't plot (visible for screen display, but does not show on plot)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PlotWeight { get; set; }
Public Property PlotWeight As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace