RhinoCommon API
ColorLCH.L Property
 Gets or sets the Lightness channel.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double L { get; set; }
Public Property L As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace