RhinoCommon API
ViewportInfo.DefaultCameraDirection Property
 Default z=up perspective camera direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d DefaultCameraDirection { get; }
Public Shared ReadOnly Property DefaultCameraDirection As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace