RhinoCommon API
RenderMaterial.SmellsLikePaint Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikePaint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikePaint { get; }
Public ReadOnly Property SmellsLikePaint As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace