RhinoCommon API
RenderContentFieldChangedEventArgs.FieldName Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentFieldChangedEventArgs.FieldName"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FieldName { get; }
Public ReadOnly Property FieldName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderContentFieldChangedEventArgs Class
Rhino.Render Namespace