RhinoCommon API
UserData.Transform Property
 Updated if user data is attached to a piece of geometry that is transformed and the virtual OnTransform() is not overridden. If you override OnTransform() and want Transform to be updated, then call the base class OnTransform() in your override. The default constructor sets Transform to the identity.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Transform { get; protected set; }
Public Property Transform As Transform
	Get
	Protected Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace