RhinoCommon API
StringParserSettings.ParseArcDegreesMinutesSeconds Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseArcDegreesMinutesSeconds"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseArcDegreesMinutesSeconds { get; set; }
Public Property ParseArcDegreesMinutesSeconds As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace