RhinoCommon API
ComponentStatus.IsSelected Property
 Returns true if selected or selected persistent. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSelected { get; }
Public ReadOnly Property IsSelected As Boolean
	Get
Return Value
Type: Boolean
The component status for selected.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace