RhinoCommon API
File3dm.Materials Property
 Materials in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<Material> Materials { get; }
Public ReadOnly Property Materials As IList(Of Material)
	Get
Property Value
Type: IList<Material>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.25
See Also
Reference
File3dm Class
Rhino.FileIO Namespace