RhinoCommon API
RhinoDoc.RenderMaterials Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterials"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterialTable RenderMaterials { get; }
Public ReadOnly Property RenderMaterials As RenderMaterialTable
	Get
Property Value
Type: RenderMaterialTable
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace