RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Specular Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Specular"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Specular { get; }
Public Shared ReadOnly Property Specular As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace