RhinoCommon SDK
ThumbData.Intensity Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Intensity"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Intensity { get; set; }
Public Property Intensity As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace