RhinoCommon API
RenderSettings.AntialiasLevel Property
 Gets or sets antialias level, used for render quality
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AntialiasLevel { get; set; }
Public Property AntialiasLevel As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderSettings Class
Rhino.Render Namespace