RhinoCommon API
LineCurve.Line Property
 Gets or sets the Line value inside this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line Line { get; set; }
Public Property Line As Line
	Get
	Set
Property Value
Type: Line
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
LineCurve Class
Rhino.Geometry Namespace