RhinoCommon SDK
Mesh.DisjointMeshCount Property
 Gets the number of disjoint (topologically unconnected) pieces in this mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int DisjointMeshCount { get; }
Public ReadOnly Property DisjointMeshCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Mesh Class
Rhino.Geometry Namespace