RhinoCommon SDK
MeshingParameters.MaximumEdgeLength Property
 Gets or sets the maximum allowed mesh edge length.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MaximumEdgeLength { get; set; }
Public Property MaximumEdgeLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace