RhinoCommon SDK
RenderSettings.RenderCurves Property
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RenderCurves { get; set; }
Public Property RenderCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace