RhinoCommon SDK
ObjectPropertiesPage.Icon Property
[Missing <summary> documentation for "P:Rhino.UI.ObjectPropertiesPage.Icon"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract Icon Icon { get; }
Public MustOverride ReadOnly Property Icon As Icon
	Get
Property Value
Type: Icon
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace