RhinoCommon API
LinetypeTable.ContinuousLinetypeName Property
 Returns the text name of the continuous linetype.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ContinuousLinetypeName { get; }
Public ReadOnly Property ContinuousLinetypeName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace