RhinoCommon API
Sphere.BoundingBox Property
 Gets the world aligned boundingbox for this Sphere. If the Sphere is Invalid, an empty box is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace