RhinoCommon API
InstanceDefinitionGeometry.ComponentType Property
 Returns InstanceDefinition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace