RhinoCommon SDK
File3dm.Linetypes Property
 Linetypes in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IList<Linetype> Linetypes { get; }
Public ReadOnly Property Linetypes As IList(Of Linetype)
	Get
Property Value
Type: IList<Linetype>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace