RhinoCommon API
DisplayModeChangedEventArgs.Viewport Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeChangedEventArgs.Viewport"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace