RhinoCommon API
ContentUuids.HatchBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.HatchBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid HatchBumpTexture { get; }
Public Shared ReadOnly Property HatchBumpTexture As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ContentUuids Class
Rhino.Render Namespace