RhinoCommon API
AppearanceSettings.EchoPromptsToHistoryWindow Property
Gets or sets a value that determines if prompt messages are written to the history window.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool EchoPromptsToHistoryWindow { get; set; }
Public Shared Property EchoPromptsToHistoryWindow As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace