RhinoCommon API
SweepOneRail.ClosedSweep Property
 If the input rail is closed, ClosedSweep determines if the swept breps will also be closed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ClosedSweep { get; set; }
Public Property ClosedSweep As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace