RhinoCommon API
PreviewGeometry.CppPointer Property
 CppPointer for PreviewGeometry
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PreviewGeometry Class
Rhino.Render Namespace