RhinoCommon SDK
SubDVertexSectorIterator.CurrentEdgeCcwNextFlipped Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentEdgeCcwNextFlipped"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CurrentEdgeCcwNextFlipped { get; }
Public ReadOnly Property CurrentEdgeCcwNextFlipped As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace