RhinoCommon API
AppearanceSettings.CommandPromptTextColor Property
 Gets or sets the color of the command prompt text.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color CommandPromptTextColor { get; set; }
Public Shared Property CommandPromptTextColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace