RhinoCommon API
GroundPlane.TextureRotation Property
 Texture mapping rotation around world origin + offset in degrees.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextureRotation { get; set; }
Public Property TextureRotation As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
GroundPlane Class
Rhino.Render Namespace