RhinoCommon API
BrepFace.Brep Property
 Gets the Brep that owns this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace