RhinoCommon API
AnnotationBase.FontIndex Property
Note: This API is now obsolete.
 Obsolete; use Font property instead
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use Font property instead")]
public int FontIndex { get; set; }
<ObsoleteAttribute("Use Font property instead")>
Public Property FontIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace