RhinoCommon API
DisplayPipelineAttributes.ShowAnnotations Property
Show annotations.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowAnnotations { get; set; }
Public Property ShowAnnotations As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace