RhinoCommon API
Dimension.CentermarkSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.CentermarkSize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double CentermarkSize { get; set; }
Public Property CentermarkSize As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Dimension Class
Rhino.Geometry Namespace