RhinoCommon SDK
SerializationOptions.RhinoVersion Property
 Gets or sets a value indicating the Rhino version.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RhinoVersion { get; set; }
Public Property RhinoVersion As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace