RhinoCommon API
Decal.StartLatitude Property
 Gets the start angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double StartLatitude { get; }
Public ReadOnly Property StartLatitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Decal Class
Rhino.Render Namespace