RhinoCommon API
ModelAidSettings.GridSnap Property
Gets or sets the enabled state of Rhino's grid snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool GridSnap { get; set; }
Public Shared Property GridSnap As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace