RhinoCommon API
MaterialRefCreateParams.MaterialSource Property
 Determines if the simple material should come from the object or from it's layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectMaterialSource MaterialSource { get; set; }
Public Property MaterialSource As ObjectMaterialSource
	Get
	Set
Property Value
Type: ObjectMaterialSource
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace