RhinoCommon API
LinearDimension.ExtensionLine2End Property
 End of the second extension line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d ExtensionLine2End { get; }
Public ReadOnly Property ExtensionLine2End As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace