RhinoCommon API
PersistentSettingsEventArgs.Cancel Property
[Missing <summary> documentation for "P:Rhino.PersistentSettingsEventArgs.Cancel"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Cancel { get; set; }
Public Property Cancel As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
PersistentSettingsEventArgs Class
Rhino Namespace