RhinoCommon API
Point3dList.BoundingBox Property
 Even though this is a property, it is not a "fast" calculation. Every point is evaluated in order to get the bounding box of the list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Point3dList Class
Rhino.Collections Namespace