RhinoCommon API
ZooClientParameters.ProductBuildType Property
 Product build type. Must be one of LicenseBuildType values.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ProductBuildType { get; }
Public ReadOnly Property ProductBuildType As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace