RhinoCommon SDK
HatchPatternTable.Item Property
 Conceptually, the hatch pattern table is an array of hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by HatchPattern.IsDeleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public HatchPattern this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As HatchPattern
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: HatchPattern
 If index is out of range, the current hatch pattern is returned.
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace