RhinoCommon API
CreatePreviewEventArgs.SceneObject.Material Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.SceneObject.Material"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterial Material { get; }
Public ReadOnly Property Material As RenderMaterial
	Get
Property Value
Type: RenderMaterial
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CreatePreviewEventArgs.SceneObject Class
Rhino.Render Namespace