RhinoCommon API
ModelAidSettingsState.NudgeMode Property
0 = world, 1 = cplane, 2 = view, 3 = uvn, -1 = not set.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int NudgeMode { get; set; }
Public Property NudgeMode As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace