RhinoCommon API
RenderContent.FirstChild Property
 Return First child of this content or nullptr if none.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent FirstChild { get; }
Public ReadOnly Property FirstChild As RenderContent
	Get
Property Value
Type: RenderContent
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderContent Class
Rhino.Render Namespace