RhinoCommon API
TextEntity.FontIndex Property
 Gets or sets the index of font in document font table used by the text.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FontIndex { get; set; }
Public Property FontIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace