RhinoCommon API
Dimension.ForceDimensionLineBetweenExtensionLines Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ForceDimensionLineBetweenExtensionLines"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ForceDimensionLineBetweenExtensionLines { get; set; }
Public Property ForceDimensionLineBetweenExtensionLines As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Dimension Class
Rhino.Geometry Namespace