RhinoCommon API
Material.IsDocumentControlled Property
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool IsDocumentControlled { get; }
Public Overrides ReadOnly Property IsDocumentControlled As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Material Class
Rhino.DocObjects Namespace