RhinoCommon API
ViewCapture.Preview Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.Preview"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Preview { get; set; }
Public Property Preview As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewCapture Class
Rhino.Display Namespace