RhinoCommon API
MeshDisplacementInfo.MemoryLimit Property
 Specifies how much memory can be allocated for use by the displacement mesh. Value in megabytes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MemoryLimit { get; set; }
Public Property MemoryLimit As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace