RhinoCommon SDK
CustomUndoEventArgs.ActionDescription Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.ActionDescription"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ActionDescription { get; }
Public ReadOnly Property ActionDescription As String
	Get
Property Value
Type: String
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace