RhinoCommon API
Ray3d.Direction Property
 Gets the direction vector of this ray.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Direction { get; }
Public ReadOnly Property Direction As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace