RhinoCommon API
AnnotationBase.HasPropertyOverrides Property
[Missing <summary> documentation for "P:Rhino.Geometry.AnnotationBase.HasPropertyOverrides"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasPropertyOverrides { get; }
Public ReadOnly Property HasPropertyOverrides As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace