RhinoCommon API
StringParserSettings.ParseSpaceAsDigitSeparator Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSpaceAsDigitSeparator"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseSpaceAsDigitSeparator { get; set; }
Public Property ParseSpaceAsDigitSeparator As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace