RhinoCommon SDK
Plane.XAxis Property
 Gets or sets the X axis vector of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d XAxis { get; set; }
Public Property XAxis As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
Rhino.Geometry Namespace