RhinoCommon API
NamedPositionTable.Count Property
Number of Named Positions in the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace