RhinoCommon API
LicenseStatus.ProductId Property
The id of the product or plugin.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ProductId { get; set; }
Public Property ProductId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace