RhinoCommon API
EdgeAnalysisSettings.ShowEdges Property
 Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int ShowEdges { get; set; }
Public Shared Property ShowEdges As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace