RhinoCommon API
ColorCMYK.Y Property
 Gets or sets the Yellow channel value. Yellow channels are limited to the 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace