RhinoCommon SDK
ArcCurve.IsCompleteCircle Property
 Gets a value indicating whether or not this curve can be represented by a complete circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCompleteCircle { get; }
Public ReadOnly Property IsCompleteCircle As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace