RhinoCommon API
ViewInfo.Name Property
 Gets or sets the name of the NamedView.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace