RhinoCommon API
ContentUuids.GridTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GridTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GridTextureType { get; }
Public Shared ReadOnly Property GridTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentUuids Class
Rhino.Render Namespace