RhinoCommon API
AppearanceSettingsState.GridThickLineColor Property
Gets or sets the color of the thick line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GridThickLineColor { get; set; }
Public Property GridThickLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace