RhinoCommon API
AsyncRenderContext.RenderThread Property
 Holder for render thread, that gets set through StartRenderThread()
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Thread RenderThread { get; }
Public ReadOnly Property RenderThread As Thread
	Get
Property Value
Type: Thread
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace