RhinoCommon API
ViewSettings.RotateReverseKeyboard Property
 Gets or sets the rotation direction.
If true, then Rhino rotates the camera around the scene, otherwise, rotates the scene itself.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RotateReverseKeyboard { get; set; }
Public Shared Property RotateReverseKeyboard As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace