RhinoCommon API
FileObjWriteOptions.SignificantDigits Property
 Number of significant digits to write out for floating point numbers
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SignificantDigits { get; set; }
Public Property SignificantDigits As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace