RhinoCommon SDK
SubDVertexDirPair.Vertex Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexDirPair.Vertex"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr Vertex { get; }
Public ReadOnly Property Vertex As SubDVertexPtr
	Get
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDVertexDirPair Structure
Rhino.Geometry Namespace