RhinoCommon SDK
MaterialRef.BackFaceMaterialId Property
 The Id of the Material used to render the back of an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid BackFaceMaterialId { get; }
Public ReadOnly Property BackFaceMaterialId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace