RhinoCommon API
Dimension.TextOrientation Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextOrientation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual TextOrientation TextOrientation { get; set; }
Public Overridable Property TextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Dimension Class
Rhino.Geometry Namespace