RhinoCommon API
AnnotationBase.DimensionLengthDisplay Property
 Length display units and format
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LengthDisplay DimensionLengthDisplay { get; set; }
Public Property DimensionLengthDisplay As DimensionStyle.LengthDisplay
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplay
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace