RhinoCommon API
ContentUuids.PaintMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PaintMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PaintMaterialType { get; }
Public Shared ReadOnly Property PaintMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ContentUuids Class
Rhino.Render Namespace