RhinoCommon API
GroundPlane.TextureOffsetLocked Property
 Texture offset locked.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TextureOffsetLocked { get; set; }
Public Property TextureOffsetLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
GroundPlane Class
Rhino.Render Namespace