RhinoCommon API
DimensionStyle.StackFractionFormat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.StackFractionFormat"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.StackDisplayFormat StackFractionFormat { get; set; }
Public Property StackFractionFormat As DimensionStyle.StackDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.StackDisplayFormat
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace