RhinoCommon API
ConstructionPlane.SnapSpacing Property
 when "grid snap" is enabled, the distance between snap points. Typically this is the same distance as grid spacing.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SnapSpacing { get; set; }
Public Property SnapSpacing As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace