RhinoCommon API
ZooClientParameters.ParentWindow Property
 Parent window assigned to any licensing dialogs that appear. If null, the Rhino main window is used.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object ParentWindow { get; }
Public ReadOnly Property ParentWindow As Object
	Get
Property Value
Type: Object
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace