RhinoCommon API
RhinoApp.LicenseUserName Property
Gets the name of the user that owns the license or lease.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string LicenseUserName { get; }
Public Shared ReadOnly Property LicenseUserName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoApp Class
Rhino Namespace