RhinoCommon SDK
SubD.Faces Property
 Gets access to faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFaceAccess Faces { get; }
Public ReadOnly Property Faces As SubDFaceAccess
	Get
Property Value
Type: SubDFaceAccess
See Also
Reference
SubD Class
Rhino.Geometry Namespace