RhinoCommon API
ViewSettingsState.ZoomScale Property
 Gets or sets the step size for zooming with a wheeled mouse or the Page Up and Page Down keys.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ZoomScale { get; set; }
Public Property ZoomScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace