RhinoCommon API
RenderPipeline.ConfirmationSeconds Property
 Sets the number of seconds that need to elapse during rendering before the user is asked if the rendered image should be saved.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ConfirmationSeconds { set; }
Public WriteOnly Property ConfirmationSeconds As Integer
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace