RhinoCommon API
ScaleValue.RightToLeftScale Property
 RightLengthValue / LeftLengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double RightToLeftScale { get; }
Public ReadOnly Property RightToLeftScale As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ScaleValue Class
Rhino Namespace