RhinoCommon API
ConstructionPlane.GridXColor Property
 Gets or sets the color of the grid X-axis mark.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GridXColor { get; set; }
Public Property GridXColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace