RhinoCommon API
RhinoViewport.WallpaperGrayscale Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperGrayscale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WallpaperGrayscale { get; }
Public ReadOnly Property WallpaperGrayscale As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace