RhinoCommon API
CursorTooltipSettingsState.TooltipsEnabled Property
Turns on/off cursor tooltips.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TooltipsEnabled { get; set; }
Public Property TooltipsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace