RhinoCommon API
Layer.LayerIndex Property
 Gets or sets the index of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LayerIndex { get; set; }
Public Property LayerIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.4
See Also
Reference
Layer Class
Rhino.DocObjects Namespace