RhinoCommon API
PlugInDescriptionAttribute.DescriptionType Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugInDescriptionAttribute.DescriptionType"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DescriptionType DescriptionType { get; }
Public ReadOnly Property DescriptionType As DescriptionType
	Get
Property Value
Type: DescriptionType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PlugInDescriptionAttribute Class
Rhino.PlugIns Namespace