RhinoCommon API
RenderSettings.NamedView Property
 Get or set the given named view
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string NamedView { get; set; }
Public Property NamedView As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderSettings Class
Rhino.Render Namespace