RhinoCommon API
GumballFrame.ScaleMode Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballFrame.ScaleMode"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballScaleMode ScaleMode { get; set; }
Public Property ScaleMode As GumballScaleMode
	Get
	Set
Property Value
Type: GumballScaleMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace