RhinoCommon SDK
InstanceDefinition.Index Property
 Index of this instance definition in the index definition table.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace