RhinoCommon SDK
IWindow.Window Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Window"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IntPtr Window { get; }
ReadOnly Property Window As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace