RhinoCommon SDK
Linetype.Name Property
The name of this linetype.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace