RhinoCommon API
HiddenLineDrawingSegment.CurveGeometry Property
 The actual curve geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve CurveGeometry { get; }
Public ReadOnly Property CurveGeometry As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace