RhinoCommon SDK
Cone.BasePoint Property
Center of base circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d BasePoint { get; }
Public ReadOnly Property BasePoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Cone Structure
Rhino.Geometry Namespace