RhinoCommon API
NotificationButtonClickedArgs.Notification Property
 The notification whose button was clicked.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Notification Notification { get; }
Public ReadOnly Property Notification As Notification
	Get
Property Value
Type: Notification
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
NotificationButtonClickedArgs Class
Rhino.Runtime.Notifications Namespace