RhinoCommon API
IntersectionEvent.IsPoint Property
 All curve intersection events are either a single point or an overlap.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPoint { get; }
Public ReadOnly Property IsPoint As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace