RhinoCommon SDK
BrepVertex.Brep Property
 Gets the Brep that owns this vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace