RhinoCommon API
Line.FromZ Property
 Gets or sets the Z coordinate of the line From point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FromZ { get; set; }
Public Property FromZ As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Line Structure
Rhino.Geometry Namespace