RhinoCommon API
LinearDimensionObject.DimensionStyle Property
 Gets the DimensionStyle associated with this LinearDimensionObject.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LinearDimensionObject Class
Rhino.DocObjects Namespace