RhinoCommon SDK
PickContext.GetObjectUsed Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.GetObjectUsed"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetObject GetObjectUsed { get; }
Public ReadOnly Property GetObjectUsed As GetObject
	Get
Property Value
Type: GetObject
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace