RhinoCommon API
ModelAidSettingsState.HighlightControlPolygon Property
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HighlightControlPolygon { get; set; }
Public Property HighlightControlPolygon As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace