RhinoCommon API
VisualAnalysisMode.RhinoDraftAngleAnalysisModeId Property
 Id for Rhino's built-in draft angle analysis mode. Draft angle is displayed using false colors.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RhinoDraftAngleAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoDraftAngleAnalysisModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace