RhinoCommon API
CursorTooltipSettings.TextColor Property
Tooltip text color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color TextColor { get; set; }
Public Shared Property TextColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace