RhinoCommon SDK
AngularDimension.AngleZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.AngleZeroSuppression"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ZeroSuppression AngleZeroSuppression { get; set; }
Public Property AngleZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace