RhinoCommon API
DisplayPipelineAttributes.ShowTangentSeams Property
Show tangent seams.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowTangentSeams { get; set; }
Public Property ShowTangentSeams As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace