RhinoCommon SDK
Plane.WorldZX Property
 plane coincident with the World ZX plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Plane WorldZX { get; }
Public Shared ReadOnly Property WorldZX As Plane
	Get
Property Value
Type: Plane
See Also
Reference
Plane Structure
Rhino.Geometry Namespace