RhinoCommon SDK
RhinoObjectSelectionEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectSelectionEventArgs.Document"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace