RhinoCommon API
BoundingBox.Unset Property
 Gets a boundingbox that has Unset coordinates for Min and Max.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static BoundingBox Unset { get; }
Public Shared ReadOnly Property Unset As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace