RhinoCommon API
ContentUuids.CompositeMaterialCCI Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.CompositeMaterialCCI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CompositeMaterialCCI { get; }
Public Shared ReadOnly Property CompositeMaterialCCI As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ContentUuids Class
Rhino.Render Namespace