RhinoCommon SDK
LinearDimensionObject.LinearDimensionGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LinearDimension LinearDimensionGeometry { get; }
Public ReadOnly Property LinearDimensionGeometry As LinearDimension
	Get
Property Value
Type: LinearDimension
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LinearDimensionObject Class
Rhino.DocObjects Namespace