RhinoCommon SDK
Line.ToZ Property
 Gets or sets the Z coordinate of the line To point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ToZ { get; set; }
Public Property ToZ As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Line Structure
Rhino.Geometry Namespace