RhinoCommon API
SimulatedEnvironment.BackgroundColor Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedEnvironment.BackgroundColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace