RhinoCommon SDK
File3dm.Settings Property
 Settings include tolerance, and unit system, and defaults used for creating views and objects.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmSettings Settings { get; }
Public ReadOnly Property Settings As File3dmSettings
	Get
Property Value
Type: File3dmSettings
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace