RhinoCommon API
AngularDimension.DefPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.DefPoint1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d DefPoint1 { get; set; }
Public Property DefPoint1 As Point2d
	Get
	Set
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace