RhinoCommon API
AppearanceSettingsState.LockedObjectColor Property
Gets or sets the color used to draw locked objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color LockedObjectColor { get; set; }
Public Property LockedObjectColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace