RhinoCommon API
Torus.Unset Property
 Gets an invalid Torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Torus Unset { get; }
Public Shared ReadOnly Property Unset As Torus
	Get
Property Value
Type: Torus
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Torus Structure
Rhino.Geometry Namespace