RhinoCommon API
VisualAnalysisMode.RhinoCurvatureGraphAnalysisModeId Property
 Id for Rhino's built-in curvature graphs analysis mode. Curvature hair is shown on curves and surfaces.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RhinoCurvatureGraphAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoCurvatureGraphAnalysisModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace