RhinoCommon API
AnimationProperties.EndMinutes Property
 Gets or sets the end minutes for one day sun animation in the range 0 to 59.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EndMinutes { get; set; }
Public Property EndMinutes As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace