RhinoCommon SDK
IWindow.WindowPtr Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.WindowPtr"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IntPtr WindowPtr { get; }
ReadOnly Property WindowPtr As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace