RhinoCommon API
GumballDisplayConduit.PickResult Property
The inital mouse down event sets PickResult.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballPickResult PickResult { get; }
Public ReadOnly Property PickResult As GumballPickResult
	Get
Property Value
Type: GumballPickResult
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace