RhinoCommon API
File3dmNotes.IsHtml Property
 Gets or sets the text format. If the format is HTML, true; false otherwise.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsHtml { get; set; }
Public Property IsHtml As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace