RhinoCommon API
DocumentSaveEventArgs.ExportSelected Property
 true if only selected objects are being written to a file.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportSelected { get; }
Public ReadOnly Property ExportSelected As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DocumentSaveEventArgs Class
Rhino Namespace