RhinoCommon API
AppearanceSettings.CommandPromptBackgroundColor Property
 Gets or sets the color of the command prompt background.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color CommandPromptBackgroundColor { get; set; }
Public Shared Property CommandPromptBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace