RhinoCommon API
File3dmStringTable.Count Property
 Returns the number of document strings in the 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace