RhinoCommon API
Quaternion.J Property
 Returns the (0,0,1,0) quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion J { get; }
Public Shared ReadOnly Property J As Quaternion
	Get
Property Value
Type: Quaternion
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace