RhinoCommon API
ChangeQueue.ViewId Property
 Return view ID for a RhinoDoc based ChangeQueue. Returns Guid.Empty if no view was associated with the changequeue, i.e. preview rendering.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ViewId { get; }
Public ReadOnly Property ViewId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace