RhinoCommon API
MeshDisplacementInfo.InstanceTransform Property
 Instance transformation of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform InstanceTransform { get; set; }
Public Property InstanceTransform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace