RhinoCommon API
RhinoView.Bounds Property
 Gets the size and location of the view including its nonclient elements, in pixels, relative to the parent control.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle Bounds { get; }
Public ReadOnly Property Bounds As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
RhinoView Class
Rhino.Display Namespace