RhinoCommon SDK
InstanceObject.InstanceXform Property
 transformation applied to an instance definition for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform InstanceXform { get; }
Public ReadOnly Property InstanceXform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace