RhinoCommon API
GeneralSettingsState.NewObjectIsoparmCount Property
 Gets or sets the number of isoparm curves to show on new objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int NewObjectIsoparmCount { get; set; }
Public Property NewObjectIsoparmCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace