RhinoCommon SDK
ViewportInfo.FrustumNear Property
 Gets the frustum near-cutting value.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumNear { get; }
Public ReadOnly Property FrustumNear As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace