RhinoCommon SDK
LayerTableEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace