RhinoCommon API
CurvatureAnalysisSettings.GaussRange Property
 Gets or sets the Gaussian curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Interval GaussRange { get; set; }
Public Shared Property GaussRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace