RhinoCommon API
MeshingParameters.FastRenderMesh Property
 Gets mesh creation parameters to create the a render mesh when meshing speed is prefered over mesh quality.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MeshingParameters FastRenderMesh { get; }
Public Shared ReadOnly Property FastRenderMesh As MeshingParameters
	Get
Property Value
Type: MeshingParameters
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace