RhinoCommon API
RenderContentType.RenderEngineId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentType.RenderEngineId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RenderEngineId { get; }
Public ReadOnly Property RenderEngineId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderContentType Class
Rhino.Render Namespace