RhinoCommon API
GripObject.Moved Property
 true if the grip has moved from OriginalLocation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Moved { get; }
Public ReadOnly Property Moved As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace