RhinoCommon SDK
PickContext.SubObjectSelectionEnabled Property
 True if the user had activated subobject selection
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SubObjectSelectionEnabled { get; set; }
Public Property SubObjectSelectionEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace