RhinoCommon API
DisplayMaterial.Diffuse Property
 Gets or sets the Diffuse color of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Diffuse { get; set; }
Public Property Diffuse As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace