RhinoCommon API
ViewCaptureSettings.DrawMargins Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawMargins"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawMargins { get; set; }
Public Property DrawMargins As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace