RhinoCommon API
BrepFace.MaterialChannelIndex Property
 This face's rendering material channel index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MaterialChannelIndex { get; set; }
Public Property MaterialChannelIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace