RhinoCommon API
ToolbarFile.Name Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.Name"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace