RhinoCommon API
LinetypeTable.CurrentLinetypeSource Property
 Source used by an object to determine its current linetype to be used by new objects.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectLinetypeSource CurrentLinetypeSource { get; set; }
Public Property CurrentLinetypeSource As ObjectLinetypeSource
	Get
	Set
Property Value
Type: ObjectLinetypeSource
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace