RhinoCommon API
Polyline.Length Property
 Gets the total length of the polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Polyline Class
Rhino.Geometry Namespace