RhinoCommon SDK
RhinoDoc.PageDistanceDisplayPrecision Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.PageDistanceDisplayPrecision"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PageDistanceDisplayPrecision { get; set; }
Public Property PageDistanceDisplayPrecision As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoDoc Class
Rhino Namespace