RhinoCommon API
MeshingParameters.TextureRange Property
 Gets or sets how and if textures will be packed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameterTextureRange TextureRange { get; set; }
Public Property TextureRange As MeshingParameterTextureRange
	Get
	Set
Property Value
Type: MeshingParameterTextureRange
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace