RhinoCommon API
MeshVertexList.Item Property
 Gets or sets the vertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3f this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Point3f
	Get
	Set
Parameters
index
Type: System.Int32
Index of control vertex to access.
Return Value
Type: Point3f
The control vertex at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace