RhinoCommon SDK
Sphere.Diameter Property
 Gets or sets the diameter for this sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace