RhinoCommon API
DocumentOpenEventArgs.Merge Property
 true if file is being merged into the current document. This occurs during the "Import" command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Merge { get; }
Public ReadOnly Property Merge As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DocumentOpenEventArgs Class
Rhino Namespace