RhinoCommon SDK
SubDVertexPtr.EdgesOrdered Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.EdgesOrdered"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<SubDEdgePtr> EdgesOrdered { get; }
Public ReadOnly Property EdgesOrdered As IEnumerable(Of SubDEdgePtr)
	Get
Property Value
Type: IEnumerable<SubDEdgePtr>
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace