RhinoCommon API
RenderMaterial.SmellsLikeTexturedPlastic Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedPlastic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeTexturedPlastic { get; }
Public ReadOnly Property SmellsLikeTexturedPlastic As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace