RhinoCommon API
ProviderIds.NamedItem Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.NamedItem"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid NamedItem { get; }
Public Shared ReadOnly Property NamedItem As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace