RhinoCommon API
BrepRegion.IsFinite Property
 Gets a value indicating whether this region is finite.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsFinite { get; }
Public ReadOnly Property IsFinite As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace