RhinoCommon API
ModelComponent.IsComponentStatusLocked Property
 The component status itself can be locked. This returns an indication.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsComponentStatusLocked { get; }
Public ReadOnly Property IsComponentStatusLocked As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace