RhinoCommon API
AnimationProperties.StartMinutes Property
 Gets or sets the start minutes for seasonal/one day sun animation in the range 0 to 59.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int StartMinutes { get; set; }
Public Property StartMinutes As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace