RhinoCommon API
FontQuartet.HasItalicFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasItalicFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasItalicFont { get; }
Public ReadOnly Property HasItalicFont As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace