RhinoCommon API
MaterialRefCreateParams.BackFaceMaterialId Property
 The Id of the Material used to render the back of an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid BackFaceMaterialId { get; set; }
Public Property BackFaceMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace