RhinoCommon SDK
ThumbData.InUseColor Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.InUseColor"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public List<Color4f> InUseColor { get; set; }
Public Property InUseColor As List(Of Color4f)
	Get
	Set
Property Value
Type: List<Color4f>
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace