RhinoCommon API
AppearanceSettings.DefaultLayerColor Property
 Gets or sets the default layer color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color DefaultLayerColor { get; set; }
Public Shared Property DefaultLayerColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace