RhinoCommon API
RenderContent.Hidden Property
 Determines if the content has the hidden flag set.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContent Class
Rhino.Render Namespace