RhinoCommon API
RTreeEventArgs.IdBPtr Property
 If search is using two r-trees, IdB is the element b pointer in the search.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr IdBPtr { get; }
Public ReadOnly Property IdBPtr As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace