RhinoCommon API
PlugInInfo.WebSite Property
 Returns the web site, or url, of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string WebSite { get; }
Public ReadOnly Property WebSite As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace