RhinoCommon API
GripObject.OriginalLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.OriginalLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d OriginalLocation { get; }
Public ReadOnly Property OriginalLocation As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace