RhinoCommon API
Material.AlphaTransparency Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.AlphaTransparency"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AlphaTransparency { get; set; }
Public Property AlphaTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Material Class
Rhino.DocObjects Namespace