RhinoCommon API
MeshPart.StartVertexIndex Property
Start of subinterval of parent mesh vertex array
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int StartVertexIndex { get; }
Public ReadOnly Property StartVertexIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace