RhinoCommon API
StringParserSettings.ParseUnaryPlus Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseUnaryPlus"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseUnaryPlus { get; set; }
Public Property ParseUnaryPlus As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace