RhinoCommon API
FileSettings.InstallFolder Property
Returns Rhino's installation folder.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static DirectoryInfo InstallFolder { get; }
Public Shared ReadOnly Property InstallFolder As DirectoryInfo
	Get
Property Value
Type: DirectoryInfo
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace