RhinoCommon API
ColorLAB.A Property
 Gets or sets the Base channel. The channel is limited to 0~1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace