RhinoCommon API
RuiUpdateUi.Checked Property
Set to true to enable menu item or false to check menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Checked { get; set; }
Public Property Checked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace