RhinoCommon API
HostUtils.OperatingSystemEdition Property
 Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string OperatingSystemEdition { get; }
Public Shared ReadOnly Property OperatingSystemEdition As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace