RhinoCommon API
GumballDisplayConduit.Gumball Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballDisplayConduit.Gumball"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballObject Gumball { get; }
Public ReadOnly Property Gumball As GumballObject
	Get
Property Value
Type: GumballObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace