RhinoCommon API
RenderMaterial.SmellsLikeTexturedMetal Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedMetal"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeTexturedMetal { get; }
Public ReadOnly Property SmellsLikeTexturedMetal As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace