RhinoCommon API
MeshVertexStatusList.HiddenCount Property
 Gets a value indicating how many vertices have been set to hidden.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int HiddenCount { get; }
Public ReadOnly Property HiddenCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace