RhinoCommon API
Quaternion.IsValid Property
 Determines if the four coefficients are valid numbers within RhinoCommon.
See IsValidDouble(Double).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace