RhinoCommon SDK
RenderMaterial.PictureMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PictureMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PictureMaterialGuid { get; }
Public Shared ReadOnly Property PictureMaterialGuid As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace