RhinoCommon API
RhinoView.Maximized Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoView.Maximized"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Maximized { get; set; }
Public Property Maximized As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoView Class
Rhino.Display Namespace