RhinoCommon API
SmartTrackSettingsState.ActivePointColor Property
Gets or sets the active point color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ActivePointColor { get; set; }
Public Property ActivePointColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace