RhinoCommon API
PlugIn.SettingsDirectoryAllUsers Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.SettingsDirectoryAllUsers"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SettingsDirectoryAllUsers { get; }
Public ReadOnly Property SettingsDirectoryAllUsers As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace