RhinoCommon API
ShutLiningCurveInfo.Enabled Property
 If true, this curve is active.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; }
Public ReadOnly Property Enabled As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace