RhinoCommon API
Layer.IgesLevel Property
 Gets or sets the IGES level for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IgesLevel { get; set; }
Public Property IgesLevel As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Layer Class
Rhino.DocObjects Namespace