RhinoCommon API
PythonScript.Output Property
 Gets or sets the Python script "print()" target.
By default string output goes to the Rhino.RhinoApp.Write function. Set Output if you want to redirect the output from python to a different function while this script executes.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Action<string> Output { get; set; }
Public Property Output As Action(Of String)
	Get
	Set
Property Value
Type: Action<String>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace