RhinoCommon API
Worksession.Document Property
 Gets the document that owns this worksession.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace