RhinoCommon API
ContentUuids.ProjectionChangerTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.ProjectionChangerTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ProjectionChangerTextureType { get; }
Public Shared ReadOnly Property ProjectionChangerTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ContentUuids Class
Rhino.Render Namespace