RhinoCommon API
ModelAidSettings.ExtendTrimLines Property
Gets or sets the enabled state of Rhino's extend trim lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ExtendTrimLines { get; set; }
Public Shared Property ExtendTrimLines As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace