RhinoCommon SDK
FileObjWriteOptions.TrimCurveType Property
 trimming curve option
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileObjWriteOptions.CurveType TrimCurveType { get; set; }
Public Property TrimCurveType As FileObjWriteOptions.CurveType
	Get
	Set
Property Value
Type: FileObjWriteOptions.CurveType
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace