RhinoCommon API
GetCircle.AllowDeformable Property
 Allow for deformable options
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AllowDeformable { get; set; }
Public Property AllowDeformable As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace