RhinoCommon API
Linetype.ComponentType Property
 Returns LinePattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace