RhinoCommon API
GripStatus.Culled Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripStatus.Culled"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Culled { get; set; }
Public Property Culled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GripStatus Class
Rhino.DocObjects.Custom Namespace