RhinoCommon API
LicenseStatus.ProductIcon Property
The product's icon. Note, this can be null.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Icon ProductIcon { get; set; }
Public Property ProductIcon As Icon
	Get
	Set
Property Value
Type: Icon
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace