RhinoCommon API
ModelAidSettings.AltPlusArrow Property
true means Alt+arrow is used for nudging.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AltPlusArrow { get; set; }
Public Shared Property AltPlusArrow As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace