RhinoCommon API
PanelIds.Libraries Property
 Rhino render properties panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Libraries { get; }
Public Shared ReadOnly Property Libraries As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PanelIds Class
Rhino.UI Namespace