RhinoCommon API
ViewCaptureWriter.PathPoint.Location Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.PathPoint.Location"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointF Location { get; set; }
Public Property Location As PointF
	Get
	Set
Property Value
Type: PointF
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureWriter.PathPoint Structure
Rhino.Runtime Namespace