RhinoCommon API
DisplayPipelineAttributes.DisableTransparency Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.DisableTransparency"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DisableTransparency { get; set; }
Public Property DisableTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace