RhinoCommon API
Material.Id Property
 Get the material ID (crc)
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint Id { get; }
Public ReadOnly Property Id As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace