RhinoCommon API
AnnotationBase.PlainText Property
 Text stripped of RTF formatting information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string PlainText { get; set; }
Public Property PlainText As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace