RhinoCommon API
ComponentFunctionInfo.InputsOptional Property
 Indications for each function input parameter whether it is optional.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IReadOnlyList<bool> InputsOptional { get; }
Public ReadOnly Property InputsOptional As IReadOnlyList(Of Boolean)
	Get
Property Value
Type: IReadOnlyList<Boolean>
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace