RhinoCommon API
ViewportInfo.FrustumBottom Property
 Gets the frustum bottom value. This is -top if the frustum has a horizontal symmetry axis.
This number is usually negative.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumBottom { get; }
Public ReadOnly Property FrustumBottom As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace