RhinoCommon API
LengthValue.ParseSettings Property
 Parse settings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StringParserSettings ParseSettings { get; }
Public ReadOnly Property ParseSettings As StringParserSettings
	Get
Property Value
Type: StringParserSettings
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
LengthValue Class
Rhino Namespace