RhinoCommon API
RhinoView.DisplayPipeline Property
 Gets the display pipeline used for this view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipeline DisplayPipeline { get; }
Public ReadOnly Property DisplayPipeline As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoView Class
Rhino.Display Namespace