RhinoCommon API
MeshClash.MeshA Property
 Gets the first mesh.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh MeshA { get; }
Public ReadOnly Property MeshA As Mesh
	Get
Property Value
Type: Mesh
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace