RhinoCommon API
Circle.IsValid Property
 A valid circle has radius larger than 0.0 and a base plane which is must also be valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Circle Structure
Rhino.Geometry Namespace