RhinoCommon API
MeshFaceNormalList.Capacity Property
 Gets or sets the total number of face normals the internal data structure can hold without resizing.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace