RhinoCommon API
GroupTable.Count Property
Number of groups in the group table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace