RhinoCommon API
ObjectTable.HistoryRecordCount Property
 Returns the amount of history records in this document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int HistoryRecordCount { get; }
Public ReadOnly Property HistoryRecordCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace