RhinoCommon API
GumballDisplayConduit.BaseGumball Property
Starting location.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballObject BaseGumball { get; }
Public ReadOnly Property BaseGumball As GumballObject
	Get
Property Value
Type: GumballObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace