RhinoCommon API
LinearWorkflow.PreProcessColors Property
 Linear workflow active state
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PreProcessColors { get; set; }
Public Property PreProcessColors As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace