RhinoCommon API
Sun.DaylightSaving Property
Daylight savings time
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DaylightSaving { get; set; }
Public Property DaylightSaving As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Sun Class
Rhino.Render Namespace