RhinoCommon API
HostUtils.SendDebugToCommandLine Property
 Gets or sets whether debug messages are printed to the command line.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SendDebugToCommandLine { get; set; }
Public Shared Property SendDebugToCommandLine As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace