RhinoCommon SDK
Unroller.AbsoluteTolerance Property
 Gets or sets the absolute tolerance for the unrolling operation.
Absolute tolerance is used in the evaluation of new entities, such as intersections, reprojections and splits.
In the current implementation, absolute tolerance is used in tessellating rails, fitting curves and pulling back trims.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AbsoluteTolerance { get; set; }
Public Property AbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Unroller Class
Rhino.Geometry Namespace