RhinoCommon API
ContentUuids.SingleColorTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.SingleColorTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid SingleColorTextureType { get; }
Public Shared ReadOnly Property SingleColorTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentUuids Class
Rhino.Render Namespace