RhinoCommon API
Material.ComponentType Property
 Returns RenderMaterial.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Material Class
Rhino.DocObjects Namespace