RhinoCommon API
HiddenLineDrawingPoint.Location Property
 Returns the location of this object in HiddenLineDrawing coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Location { get; }
Public ReadOnly Property Location As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace