RhinoCommon API
MaterialTable.CurrentMaterialSource Property
 Gets or sets the current material source.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectMaterialSource CurrentMaterialSource { get; set; }
Public Property CurrentMaterialSource As ObjectMaterialSource
	Get
	Set
Property Value
Type: ObjectMaterialSource
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace