RhinoCommon API
GeneralSettings.MiddleMouseMode Property
 Gets or sets what happens when the user clicks the middle mouse.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MiddleMouseMode MiddleMouseMode { get; set; }
Public Shared Property MiddleMouseMode As MiddleMouseMode
	Get
	Set
Property Value
Type: MiddleMouseMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace