RhinoCommon SDK
Skylight.ShadowIntensity Property
[Missing <summary> documentation for "P:Rhino.Render.Skylight.ShadowIntensity"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ShadowIntensity { get; set; }
Public Property ShadowIntensity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Skylight Class
Rhino.Render Namespace