RhinoCommon API
CursorTooltipSettings.CommandPromptPane Property
 Displays the current command prompt.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool CommandPromptPane { get; set; }
Public Shared Property CommandPromptPane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace