RhinoCommon API
SmartTrackSettings.ActivationDelayMilliseconds Property
Gets or sets the activation delay in milliseconds.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int ActivationDelayMilliseconds { get; set; }
Public Shared Property ActivationDelayMilliseconds As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace