RhinoCommon SDK
MeshPoint.ComponentIndex Property
 Gets the component index of the intersecting element in the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ComponentIndex ComponentIndex { get; }
Public ReadOnly Property ComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace