RhinoCommon API
CommonObject.Disposed Property
 Indicates if this object has been disposed or the document it originally belonged to has been disposed.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Disposed { get; }
Public ReadOnly Property Disposed As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace