RhinoCommon SDK
MeshNgonList.Count Property
 Gets or sets the number of mesh ngons.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Implements
IResizableList<T>.Count
ICollection<T>.Count
ICollection.Count
IReadOnlyCollection<T>.Count
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace