RhinoCommon API
GetPointDrawEventArgs.CurrentPoint Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointDrawEventArgs.CurrentPoint"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d CurrentPoint { get; }
Public ReadOnly Property CurrentPoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetPointDrawEventArgs Class
Rhino.Input.Custom Namespace