RhinoCommon API
PanelEventArgs.DocumentSerialNumber Property
[Missing <summary> documentation for "P:Rhino.UI.PanelEventArgs.DocumentSerialNumber"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace