RhinoCommon API
DisplayPipeline.ActiveObject Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ActiveObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject ActiveObject { get; }
Public ReadOnly Property ActiveObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace