RhinoCommon API
ZooClientParameters.ProductTitle Property
 Title of the product, "Rhinoceros 6" for example.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ProductTitle { get; }
Public ReadOnly Property ProductTitle As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace