RhinoCommon API
FileObjWriteOptions.ExportVcs Property
 Enable/disable export of vertex colors, if they exist.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportVcs { get; set; }
Public Property ExportVcs As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace