RhinoCommon API
ViewSettings.DefinedViewSetCPlane Property
 Gets or sets the 'named views set CPlane' value.
When true, restoring a named view causes the construction plane saved with that view to also restore.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool DefinedViewSetCPlane { get; set; }
Public Shared Property DefinedViewSetCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace