RhinoCommon API
FileSettings.DefaultRuiFile Property
 Gets the path to the default RUI file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string DefaultRuiFile { get; }
Public Shared ReadOnly Property DefaultRuiFile As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace