RhinoCommon API
RealtimeDisplayMode.MaxPasses Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.MaxPasses"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MaxPasses { get; set; }
Public Property MaxPasses As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace