RhinoCommon SDK
CentermarkObject.CentermarkGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Centermark CentermarkGeometry { get; }
Public ReadOnly Property CentermarkGeometry As Centermark
	Get
Property Value
Type: Centermark
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CentermarkObject Class
Rhino.DocObjects Namespace