RhinoCommon API
TwistSpaceMorph.TwistAngleRadians Property
 Twist angle in radians.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TwistAngleRadians { get; set; }
Public Property TwistAngleRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace