RhinoCommon API
CursorTooltipSettings.Offset Property
 The x and y distances in pixels from the cursor location to the tooltip.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point Offset { get; set; }
Public Shared Property Offset As Point
	Get
	Set
Property Value
Type: Point
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace