RhinoCommon SDK
ProviderIds.RhinoView Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RhinoView"]
Namespace: Rhino.UI.Controls.DataSource
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid RhinoView { get; }
Public Shared ReadOnly Property RhinoView As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace