RhinoCommon SDK
SubDEdgePtr.SubD Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.SubD"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubD SubD { get; }
Public ReadOnly Property SubD As SubD
	Get
Property Value
Type: SubD
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace