RhinoCommon API
SelCommand.BeQuiet Property
[Missing <summary> documentation for "P:Rhino.Commands.SelCommand.BeQuiet"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool BeQuiet { get; set; }
Public Property BeQuiet As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
SelCommand Class
Rhino.Commands Namespace