RhinoCommon API
AnimationProperties.EndDay Property
 Gets or sets the end day for seasonal day sun animation in the range 1 to 31.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EndDay { get; set; }
Public Property EndDay As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace