RhinoCommon API
ObjectPropertiesPageEventArgs.DocRuntimeSerialNumber Property
 Document containing the objects and views
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint DocRuntimeSerialNumber { get; }
Public ReadOnly Property DocRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace