RhinoCommon SDK
RenderSettings.FocalBlurMode Property
 Get or set the focal blur mode
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderSettings.FocalBlurModes FocalBlurMode { get; set; }
Public Property FocalBlurMode As RenderSettings.FocalBlurModes
	Get
	Set
Property Value
Type: RenderSettings.FocalBlurModes
See Also
Reference
RenderSettings Class
Rhino.Render Namespace