RhinoCommon API
FileType.Extension Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileType.Extension"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Extension { get; }
Public ReadOnly Property Extension As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileType Class
Rhino.FileIO Namespace