RhinoCommon API
Font.IsSymbolFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsSymbolFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSymbolFont { get; }
Public ReadOnly Property IsSymbolFont As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Font Class
Rhino.DocObjects Namespace