RhinoCommon API
FileSettings.WorkingFolder Property
 Returns or sets Rhino's working directory, or folder. The working folder is the default folder for all file operations.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string WorkingFolder { get; set; }
Public Shared Property WorkingFolder As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace