RhinoCommon API
GroundPlane.TextureScale Property
 Get texture scale on the ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2d TextureScale { get; }
Public ReadOnly Property TextureScale As Vector2d
	Get
Property Value
Type: Vector2d
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace