RhinoCommon API
AppearanceSettings.PreviousLanguageIdentifier Property
 Gets or sets the previous language identifier.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int PreviousLanguageIdentifier { get; set; }
Public Shared Property PreviousLanguageIdentifier As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace