RhinoCommon API
LicenseLeaseChangedEventArgs.Lease Property
 The lease returned by Rhino Accounts server
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseLease Lease { get; }
Public ReadOnly Property Lease As LicenseLease
	Get
Property Value
Type: LicenseLease
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
LicenseLeaseChangedEventArgs Class
Rhino.PlugIns Namespace