RhinoCommon SDK
ThumbData.Name Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Name"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace