RhinoCommon SDK
Curve.Domain Property
 Gets or sets the domain of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval Domain { get; set; }
Public Property Domain As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
Curve Class
Rhino.Geometry Namespace