RhinoCommon API
IntersectionEvent.PointA Property
 Gets the point on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointA { get; }
Public ReadOnly Property PointA As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace