RhinoCommon API
RhinoView.RealtimeDisplayMode Property
 Gets the RealtimeDisplayMode active for this view. null if the view doesn't have a RealtimeDisplayMode set.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RealtimeDisplayMode RealtimeDisplayMode { get; }
Public ReadOnly Property RealtimeDisplayMode As RealtimeDisplayMode
	Get
Property Value
Type: RealtimeDisplayMode
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoView Class
Rhino.Display Namespace