RhinoCommon API
Text3d.VerticalAlignment Property
 Vertical alignment that this Text3d is drawn with
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextVerticalAlignment VerticalAlignment { get; set; }
Public Property VerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Text3d Class
Rhino.Display Namespace