RhinoCommon API
ConstructionPlane.ThickLineFrequency Property
 Gets or sets the recurrence of a wider line on the grid.
0: No lines are thick, all are drawn thin.
1: All lines are thick.
2: Every other line is thick.
3: One line in three lines is thick (and two are thin).
4: ...
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ThickLineFrequency { get; set; }
Public Property ThickLineFrequency As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace