RhinoCommon API
Hatch.PatternScale Property
 Gets or sets the scaling factor of the pattern.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PatternScale { get; set; }
Public Property PatternScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Hatch Class
Rhino.Geometry Namespace