RhinoCommon SDK
CreatePreviewEventArgs.SceneObject.Mesh Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.SceneObject.Mesh"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh Mesh { get; }
Public ReadOnly Property Mesh As Mesh
	Get
Property Value
Type: Mesh
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CreatePreviewEventArgs.SceneObject Class
Rhino.Render Namespace