RhinoCommon SDK
RhinoModifyObjectAttributesEventArgs.OldAttributes Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.OldAttributes"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes OldAttributes { get; }
Public ReadOnly Property OldAttributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace