RhinoCommon API
EdgeAnalysisSettingsState.ShowEdges Property
 Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ShowEdges { get; set; }
Public Property ShowEdges As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
EdgeAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace