RhinoCommon API
ContentUuids.MetalMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.MetalMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid MetalMaterialType { get; }
Public Shared ReadOnly Property MetalMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentUuids Class
Rhino.Render Namespace