RhinoCommon API
VisualAnalysisMode.RhinoEdgeAnalysisModeId Property
 Id for Rhino's built-in edge analysis mode. Brep and mesh edges are shown in a selected color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RhinoEdgeAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoEdgeAnalysisModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace