RhinoCommon API
RadialDimension.LeaderArrowSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.LeaderArrowSize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace