RhinoCommon SDK
MeshPart.VertexCount Property
EndVertexIndex - StartVertexIndex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int VertexCount { get; }
Public ReadOnly Property VertexCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace