RhinoCommon API
SimulatedTexture.TransparentColorSensitivity Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.TransparentColorSensitivity"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TransparentColorSensitivity { get; set; }
Public Property TransparentColorSensitivity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace