RhinoCommon API
RhinoTransformObjectsEventArgs.ObjectCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.ObjectCount"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace