RhinoCommon API
Symbols.DegreeSymbol Property
 Degree symbol used for angles
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static char DegreeSymbol { get; }
Public Shared ReadOnly Property DegreeSymbol As Char
	Get
Property Value
Type: Char
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Symbols Class
Rhino Namespace