RhinoCommon API
Font.EnglishFaceName Property
 Returns English Facename
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishFaceName { get; }
Public ReadOnly Property EnglishFaceName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Font Class
Rhino.DocObjects Namespace