RhinoCommon API
GeometryBase.HasBrepForm Property
 Returns true if the Brep.TryConvertBrep function will be successful for this object
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasBrepForm { get; }
Public ReadOnly Property HasBrepForm As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace