RhinoCommon API
OpenFileDialog.FileNames Property
 Gets the names of all of the selected files in the dialog box
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] FileNames { get; }
Public ReadOnly Property FileNames As String()
	Get
Property Value
Type: String[]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace