RhinoCommon API
MeshInstance.CastShadows Property
 Return true if mesh instance should cast shadows
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CastShadows { get; }
Public ReadOnly Property CastShadows As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace