RhinoCommon API
CursorTooltipSettingsState.CommandPromptPane Property
 Displays the current command prompt.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CommandPromptPane { get; set; }
Public Property CommandPromptPane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace