RhinoCommon SDK
LightTable.Item Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTable.Item(System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LightObject this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As LightObject
	Get
Parameters
index
Type: System.Int32
Property Value
Type: LightObject
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace