RhinoCommon API
GeneralSettings.MouseSelectMode Property
 Gets or sets the current selection mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MouseSelectMode MouseSelectMode { get; set; }
Public Shared Property MouseSelectMode As MouseSelectMode
	Get
	Set
Property Value
Type: MouseSelectMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace