RhinoCommon API
ByteArrayField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public byte[] Value { get; set; }
Public Property Value As Byte()
	Get
	Set
Property Value
Type: Byte[]
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ByteArrayField Class
Rhino.Render.Fields Namespace