RhinoCommon API
Point3dList.X Property
 Returns an indexer with all X coordinates in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList.XAccess X { get; }
Public ReadOnly Property X As Point3dList.XAccess
	Get
Property Value
Type: Point3dList.XAccess
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Point3dList Class
Rhino.Collections Namespace