RhinoCommon API
DetailViewObject.Viewport Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DetailViewObject.Viewport"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace