RhinoCommon SDK
ViewportInfo.FrustumMaximumDiameter Property
 Gets the frustum maximum diameter, or the maximum between FrustumWidth and FrustumHeight.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumMaximumDiameter { get; }
Public ReadOnly Property FrustumMaximumDiameter As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace