RhinoCommon API
VisualAnalysisMode.RhinoThicknessAnalysisModeId Property
 Id for Rhino's built-in thickness analysis mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RhinoThicknessAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoThicknessAnalysisModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace