RhinoCommon API
BrepTrim.TrimCurveIndex Property
 Gets the Brep.Curves2D 2d curve index of the 2d curve geometry used by this trim, or -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TrimCurveIndex { get; }
Public ReadOnly Property TrimCurveIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace