RhinoCommon SDK
TwoColorRenderTexture.SuperSample Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.SuperSample"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuperSample { get; set; }
Public Property SuperSample As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace