RhinoCommon SDK
Point2f.X Property
 Gets or sets the X (first) component of the vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float X { get; set; }
Public Property X As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace