RhinoCommon API
MostRecentCommandDescription.DisplayString Property
[Missing <summary> documentation for "P:Rhino.Commands.MostRecentCommandDescription.DisplayString"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DisplayString { get; set; }
Public Property DisplayString As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace