RhinoCommon API
BrepVertexList.Item Property
 Gets the BrepVertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertex this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As BrepVertex
	Get
Parameters
index
Type: System.Int32
Index of BrepVertex to access.
Return Value
Type: BrepVertex
The BrepVertex at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace