RhinoCommon API
ObjectAttributes.IsInstanceDefinitionObject Property
 Use this query to determine if an object is part of an instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsInstanceDefinitionObject { get; }
Public ReadOnly Property IsInstanceDefinitionObject As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace