RhinoCommon API
ViewportInfo.CameraX Property
 Gets the unit "to the right" vector.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CameraX { get; }
Public ReadOnly Property CameraX As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace