RhinoCommon SDK
ThumbData.Content Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Content"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContent Content { get; set; }
Public Property Content As RenderContent
	Get
	Set
Property Value
Type: RenderContent
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace