RhinoCommon API
SimpleArrayPoint3d.Count Property
 Gets the amount of points in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SimpleArrayPoint3d Class
Rhino.Runtime.InteropWrappers Namespace