RhinoCommon API
Material.PreviewColor Property
 Very simple preview color function for GUIs.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color PreviewColor { get; }
Public ReadOnly Property PreviewColor As Color
	Get
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Material Class
Rhino.DocObjects Namespace