RhinoCommon SDK
ChangeQueue.DisplayPipelineAttributes Property
 Get the DisplayPipelineAttributes if available, null otherwise
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes DisplayPipelineAttributes { get; }
Public ReadOnly Property DisplayPipelineAttributes As DisplayPipelineAttributes
	Get
Property Value
Type: DisplayPipelineAttributes
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace