RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Roughness Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Roughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Roughness { get; }
Public Shared ReadOnly Property Roughness As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace