RhinoCommon SDK
Material.RenderMaterial Property
 Get the RenderMaterial related to this Material. Will create a new RenderMaterial if none exists. This can happen for older documents.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterial RenderMaterial { get; }
Public ReadOnly Property RenderMaterial As RenderMaterial
	Get
Property Value
Type: RenderMaterial
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace