RhinoCommon API
File3dm.AllInstanceDefinitions Property
 Instance definitions in this file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmInstanceDefinitionTable AllInstanceDefinitions { get; }
Public ReadOnly Property AllInstanceDefinitions As File3dmInstanceDefinitionTable
	Get
Property Value
Type: File3dmInstanceDefinitionTable
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dm Class
Rhino.FileIO Namespace