RhinoCommon API
File3dmObject.ComponentType Property
 Returns ModelGeometry.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace