RhinoCommon API
FontQuartet.HasBoldFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasBoldFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasBoldFont { get; }
Public ReadOnly Property HasBoldFont As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace