RhinoCommon API
ContentUuids.GemMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GemMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GemMaterialType { get; }
Public Shared ReadOnly Property GemMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ContentUuids Class
Rhino.Render Namespace