RhinoCommon API
DimensionStyle.ArrowBlockId2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowBlockId2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ArrowBlockId2 { get; set; }
Public Property ArrowBlockId2 As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace