RhinoCommon API
PanelIds.Environment Property
 Rhino environment panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Environment { get; }
Public Shared ReadOnly Property Environment As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PanelIds Class
Rhino.UI Namespace