RhinoCommon API
SimulatedTexture.OriginalFilename Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.OriginalFilename"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string OriginalFilename { get; }
Public ReadOnly Property OriginalFilename As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace