RhinoCommon API
Rectangle3d.Width Property
 Gets the signed width of the rectangle. If the X dimension is decreasing, the width will be negative.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Width { get; }
Public ReadOnly Property Width As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace