RhinoCommon SDK
AnnotationBase.NumericValue Property
 Gets the numeric value, depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diamater depending on type
AngularDimension: angle in degrees
Leader or Text: UnsetValue
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double NumericValue { get; }
Public ReadOnly Property NumericValue As Double
	Get
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace