RhinoCommon SDK
Quaternion.Conjugate Property
 Gets a new quaternion that is the conjugate of this quaternion.
This is (a,-b,-c,-d)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Quaternion Conjugate { get; }
Public ReadOnly Property Conjugate As Quaternion
	Get
Property Value
Type: Quaternion
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace