RhinoCommon API
RhinoDoc.DocumentId Property
Note: This API is now obsolete.
 Gets the Document Id.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use RuntimeSerialNumber instead")]
public int DocumentId { get; }
<ObsoleteAttribute("Use RuntimeSerialNumber instead")>
Public ReadOnly Property DocumentId As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Obsolete (compiler warning) in 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace