RhinoCommon API
Layer.Id Property
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Layer Class
Rhino.DocObjects Namespace