RhinoCommon API
DisplayConduit.Enabled Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayConduit.Enabled"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace