RhinoCommon API
PlugIn.Description Property
 Returns the description of the plug-in, as found in the plug-in's assembly attributes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace