RhinoCommon SDK
AngularDimension.ArrowPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.ArrowPoint1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d ArrowPoint1 { get; }
Public ReadOnly Property ArrowPoint1 As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace