RhinoCommon API
RenderMaterial.SmellsLikeTexturedPlaster Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedPlaster"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeTexturedPlaster { get; }
Public ReadOnly Property SmellsLikeTexturedPlaster As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace