RhinoCommon API
ContentUuids.GradientTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GradientTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GradientTextureType { get; }
Public Shared ReadOnly Property GradientTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ContentUuids Class
Rhino.Render Namespace