RhinoCommon API
CommandEventArgs.CommandPluginName Property
 Gets the name of the plug-in that this command belongs to. If the command is internal to Rhino, then this propert is an empty string.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string CommandPluginName { get; }
Public ReadOnly Property CommandPluginName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace