RhinoCommon SDK
SubD.ActiveLevel Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubD.ActiveLevel"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ActiveLevel { get; }
Public ReadOnly Property ActiveLevel As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubD Class
Rhino.Geometry Namespace