RhinoCommon API
EarthAnchorPoint.EarthBasepointLongitude Property
 Gets or sets the point longitude on earth, in decimal degrees.
0 = prime meridian (Greenwich meridian)
Values increase towards West
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EarthBasepointLongitude { get; set; }
Public Property EarthBasepointLongitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace