RhinoCommon API
RhinoApp.SerialNumber Property
Gets the product serial number, as seen in Rhino's ABOUT dialog box.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string SerialNumber { get; }
Public Shared ReadOnly Property SerialNumber As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoApp Class
Rhino Namespace