RhinoCommon API
StackedDialogPage.Children Property
 List of child (sub) pages of this page
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<StackedDialogPage> Children { get; }
Public ReadOnly Property Children As List(Of StackedDialogPage)
	Get
Property Value
Type: List<StackedDialogPage>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace