RhinoCommon API
RhinoDoc.Manifest Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Manifest"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ManifestTable Manifest { get; }
Public ReadOnly Property Manifest As ManifestTable
	Get
Property Value
Type: ManifestTable
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoDoc Class
Rhino Namespace