RhinoCommon SDK
DimensionStyle.DimRadialTextLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimRadialTextLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.TextLocation DimRadialTextLocation { get; set; }
Public Property DimRadialTextLocation As DimensionStyle.TextLocation
	Get
	Set
Property Value
Type: DimensionStyle.TextLocation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace