RhinoCommon SDK
Field.IsTextured Property
[Missing <summary> documentation for "P:Rhino.Render.Fields.Field.IsTextured"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsTextured { get; }
Public ReadOnly Property IsTextured As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Field Class
Rhino.Render.Fields Namespace