RhinoCommon SDK
SubDVertexPtr.Tag Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.Tag"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubD.SubDVertexTag Tag { get; set; }
Public Property Tag As SubD.SubDVertexTag
	Get
	Set
Property Value
Type: SubD.SubDVertexTag
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace