RhinoCommon SDK
ContentUuids.RealtimeDisplayMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.RealtimeDisplayMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RealtimeDisplayMaterialType { get; }
Public Shared ReadOnly Property RealtimeDisplayMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ContentUuids Class
Rhino.Render Namespace