RhinoCommon API
GetLine.FixedLength Property
 If FixedLength > 0, the line must have the specified length
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FixedLength { get; set; }
Public Property FixedLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace