RhinoCommon API
CommandLineOption.StringOptionValue Property
 Assigned by RhinoGet.Get if an option value is specified in a script or by a command window control.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string StringOptionValue { get; }
Public ReadOnly Property StringOptionValue As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace