RhinoCommon API
ViewCapture.DrawGridAxes Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.DrawGridAxes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawGridAxes { get; set; }
Public Property DrawGridAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ViewCapture Class
Rhino.Display Namespace