RhinoCommon API
DisplayPipeline.IsOpenGL Property
 Gets a value indicating whether or not this pipeline is drawing into an OpenGL context.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsOpenGL { get; }
Public ReadOnly Property IsOpenGL As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace