RhinoCommon API
MeshDisplacementInfo.Mapping Property
 The texture mapping of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureMapping Mapping { get; }
Public ReadOnly Property Mapping As TextureMapping
	Get
Property Value
Type: TextureMapping
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace