RhinoCommon API
File3dmHatchPatternTable.ComponentType Property
 Returns HatchPattern.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace