RhinoCommon API
FileObjReadOptions.DisplayColorFromObjMaterial Property
 Determines whether textures are read from the .mtl file, if it exists.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DisplayColorFromObjMaterial { get; set; }
Public Property DisplayColorFromObjMaterial As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace