RhinoCommon API
ComponentFunctionInfo.FullScriptingName Property
 Shows the full name of the component, including optional periods. Removes spaces and common operator signs.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FullScriptingName { get; }
Public ReadOnly Property FullScriptingName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace