RhinoCommon API
ObjectAttributes.Visible Property
Gets or sets an object's visiblity.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace