RhinoCommon SDK
SubDVertexPtr.FacesOrdered Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.FacesOrdered"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<SubDFacePtr> FacesOrdered { get; }
Public ReadOnly Property FacesOrdered As IEnumerable(Of SubDFacePtr)
	Get
Property Value
Type: IEnumerable<SubDFacePtr>
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace