RhinoCommon API
ModelAidSettings.OrthoAngle Property
Gets or sets the base orthogonal angle.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double OrthoAngle { get; set; }
Public Shared Property OrthoAngle As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace