RhinoCommon SDK
DisplayPipeline.ModelTransform Property
 Gets or sets the current model transformation that is applied to vertices when drawing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform ModelTransform { get; set; }
Public Property ModelTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace