RhinoCommon API
BrepTrim.Face Property
 Brep face this trim belongs to
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepFace Face { get; }
Public ReadOnly Property Face As BrepFace
	Get
Property Value
Type: BrepFace
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace