RhinoCommon API
ViewportInfo.IsFrustumTopBottomSymmetric Property
 Gets or sets a value that indicates whether the camera frustum has a horizontal symmetry axis.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsFrustumTopBottomSymmetric { get; set; }
Public Property IsFrustumTopBottomSymmetric As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace