RhinoCommon API
LinearDimension.TextPosition Property
 Gets and sets the position of text on the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d TextPosition { get; set; }
Public Property TextPosition As Point2d
	Get
	Set
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace