RhinoCommon API
Line.BoundingBox Property
 Gets the line's 3d axis aligned bounding box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Return Value
Type: BoundingBox
3d bounding box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Line Structure
Rhino.Geometry Namespace