RhinoCommon API
Color4f.B Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.B"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float B { get; }
Public ReadOnly Property B As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Color4f Structure
Rhino.Display Namespace