RhinoCommon API
GroundPlane.IsShadowOnly Property
 Get true if ground plane should be shadow-only
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsShadowOnly { get; }
Public ReadOnly Property IsShadowOnly As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace