RhinoCommon API
ViewCaptureSettings.DrawLights Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawLights"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawLights { get; set; }
Public Property DrawLights As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace