RhinoCommon API
PlugInInfo.Address Property
 Returns the address of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Address { get; }
Public ReadOnly Property Address As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace