RhinoCommon API
ViewportInfo.FrustumFar Property
 Gets the frustum far-cutting value.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumFar { get; }
Public ReadOnly Property FrustumFar As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace