RhinoCommon API
HiddenLineDrawingObjectCurve.SourceObjectComponentIndex Property
 Component of source object part that generated this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex SourceObjectComponentIndex { get; }
Public ReadOnly Property SourceObjectComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace