RhinoCommon SDK
InstanceDefinition.LayerStyle Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.LayerStyle"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinitionLayerStyle LayerStyle { get; }
Public ReadOnly Property LayerStyle As InstanceDefinitionLayerStyle
	Get
Property Value
Type: InstanceDefinitionLayerStyle
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace