RhinoCommon API
PlugIn.SettingsDirectory Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.SettingsDirectory"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SettingsDirectory { get; }
Public ReadOnly Property SettingsDirectory As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace