RhinoCommon API
InstanceDefinitionTableEventArgs.InstanceDefinitionIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.InstanceDefinitionIndex"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int InstanceDefinitionIndex { get; }
Public ReadOnly Property InstanceDefinitionIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace