RhinoCommon API
StringWrapper.NonConstPointer Property
 Gets the non-const pointer (ON_wString*).
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr NonConstPointer { get; }
Public ReadOnly Property NonConstPointer As IntPtr
	Get
Return Value
Type: IntPtr
The non-const pointer.
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace