RhinoCommon API
RadialDimension.IsDiameterDimension Property
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDiameterDimension { get; }
Public ReadOnly Property IsDiameterDimension As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace