RhinoCommon SDK
Vector3d.Zero Property
 Gets the value of the vector with components 0,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d Zero { get; }
Public Shared ReadOnly Property Zero As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace