RhinoCommon API
Light.Specular Property
 Gets or sets the specular color.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Specular { get; set; }
Public Property Specular As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Light Class
Rhino.Geometry Namespace