RhinoCommon API
File3dmSettings.ModelAngleToleranceDegrees Property
Gets or sets the model space angle tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ModelAngleToleranceDegrees { get; set; }
Public Property ModelAngleToleranceDegrees As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace