RhinoCommon API
MouseCallbackEventArgs.ViewportPoint Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.ViewportPoint"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point ViewportPoint { get; }
Public ReadOnly Property ViewportPoint As Point
	Get
Property Value
Type: Point
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace