RhinoCommon API
PlugIn.InstalledPlugInCount Property
 Returns the number of installed Rhino plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int InstalledPlugInCount { get; }
Public Shared ReadOnly Property InstalledPlugInCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace