RhinoCommon API
MouseCallbackEventArgs.MouseButton Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.MouseButton"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MouseButton MouseButton { get; }
Public ReadOnly Property MouseButton As MouseButton
	Get
Property Value
Type: MouseButton
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace