RhinoCommon SDK
BinaryArchiveReader.CurrentPosition Property
current offset (in bytes) into archive ( like ftell() )
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ulong CurrentPosition { get; }
Public ReadOnly Property CurrentPosition As ULong
	Get
Property Value
Type: UInt64
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace