RhinoCommon API
DimStyleTable.CurrentId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTable.CurrentId"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid CurrentId { get; }
Public ReadOnly Property CurrentId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace