RhinoCommon API
Linetype.IsModified Property
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsModified { get; }
Public ReadOnly Property IsModified As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace