RhinoCommon API
DimensionStyle.MaskOffset Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.MaskOffset"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MaskOffset { get; set; }
Public Property MaskOffset As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace