RhinoCommon API
RenderSettings.BackgroundColorTop Property
 Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackgroundColorTop { get; set; }
Public Property BackgroundColorTop As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderSettings Class
Rhino.Render Namespace