RhinoCommon API
StringParserSettings.ParsePi Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParsePi"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParsePi { get; set; }
Public Property ParsePi As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace