RhinoCommon API
DimStyleTable.Current Property
 Returns an instance of the current DimensionStyle.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle Current { get; }
Public ReadOnly Property Current As DimensionStyle
	Get
Property Value
Type: DimensionStyle
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace