RhinoCommon API
FileObjWriteOptions.WrapLongLines Property
 Setting to enable/disable line wrapping with "\"s
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WrapLongLines { get; set; }
Public Property WrapLongLines As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace