RhinoCommon API
FileObjWriteOptions.MinNgonFaceCount Property
 Minimum number of faces to consider creation of ngon
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MinNgonFaceCount { get; set; }
Public Property MinNgonFaceCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace