RhinoCommon API
Curve.IsPeriodic Property
 Gets a value indicating whether or not this curve is considered to be Periodic.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPeriodic { get; }
Public ReadOnly Property IsPeriodic As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Curve Class
Rhino.Geometry Namespace