RhinoCommon API
DisplayPipelineAttributes.ShowIsoCurves Property
Draw surface ISO curves.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowIsoCurves { get; set; }
Public Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace