RhinoCommon SDK
MeshClash.ClashPoint Property
 If valid, then the sphere centered at ClashPoint of ClashRadius distance interesects the clashing meshes.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClashPoint { get; }
Public ReadOnly Property ClashPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace