RhinoCommon API
ViewportInfo.FrustumRight Property
 Gets the frustum right value. This is -left if the frustum has a vertical symmetry axis.
This number is usually positive.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumRight { get; }
Public ReadOnly Property FrustumRight As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace