RhinoCommon API
RenderPipeline.PlugIn Property
[Missing <summary> documentation for "P:Rhino.Render.RenderPipeline.PlugIn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PlugIn PlugIn { get; }
Public ReadOnly Property PlugIn As PlugIn
	Get
Property Value
Type: PlugIn
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace