RhinoCommon API
Polyline.IsClosed Property
 Gets a value that indicates whether this polyline is closed.
The polyline is considered to be closed if its start is identical to its endpoint.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsClosed { get; }
Public ReadOnly Property IsClosed As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Polyline Class
Rhino.Geometry Namespace
Polyline.IsClosedWithinTolerance(Double)