RhinoCommon API
AppearanceSettings.CommandPromptPosition Property
 Gets or sets the command prompt position.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CommandPromptPosition CommandPromptPosition { get; set; }
Public Shared Property CommandPromptPosition As CommandPromptPosition
	Get
	Set
Property Value
Type: CommandPromptPosition
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace