RhinoCommon API
Light.IsDirectionalLight Property
 Gets a value indicating whether the light style is LightStyle CameraDirectional or WorldDirectional.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDirectionalLight { get; }
Public ReadOnly Property IsDirectionalLight As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Light Class
Rhino.Geometry Namespace