RhinoCommon API
ThumbData.Type Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Type"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Type { get; set; }
Public Property Type As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace