RhinoCommon API
ICollapsibleSection.InitiallyExpanded Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.InitiallyExpanded"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool InitiallyExpanded { get; }
ReadOnly Property InitiallyExpanded As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace