RhinoCommon API
BrepTrim.IsoStatus Property
[Missing <summary> documentation for "P:Rhino.Geometry.BrepTrim.IsoStatus"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IsoStatus IsoStatus { get; set; }
Public Property IsoStatus As IsoStatus
	Get
	Set
Property Value
Type: IsoStatus
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace