RhinoCommon SDK
SubDEdgePtr.Previous Property
 Links to previous edge on this level.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr Previous { get; }
Public ReadOnly Property Previous As SubDEdgePtr
	Get
Property Value
Type: SubDEdgePtr
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace