RhinoCommon API
LinearWorkflow.Hash Property
 Linear workflow CRC
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint Hash { get; }
Public ReadOnly Property Hash As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace