RhinoCommon API
NamedConstructionPlaneTable.Count Property
Number of construction planes in the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace