RhinoCommon SDK
SubDVertexPtr.EdgeCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.EdgeCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int EdgeCount { get; }
Public ReadOnly Property EdgeCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace