RhinoCommon API
DimensionStyle.LeaderTextRotationRadians Property
 Angle of leader text for Rotated style
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LeaderTextRotationRadians { get; set; }
Public Property LeaderTextRotationRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace