RhinoCommon API
ContentUuids.WavesTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.WavesTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid WavesTextureType { get; }
Public Shared ReadOnly Property WavesTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ContentUuids Class
Rhino.Render Namespace