RhinoCommon API
GripObject.OwnerId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.OwnerId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid OwnerId { get; }
Public ReadOnly Property OwnerId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace