RhinoCommon API
ViewCaptureSettings.MediaSize Property
 Total size of the image or page in dots
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Size MediaSize { get; }
Public ReadOnly Property MediaSize As Size
	Get
Property Value
Type: Size
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace