RhinoCommon API
DecalCreateParams.MaxU Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MaxU"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MaxU { get; set; }
Public Property MaxU As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace