RhinoCommon API
ViewportInfo.IsCameraDirectionLocked Property
 Gets or sets a value that indicates whether the direction that the camera faces is unmodifiable.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCameraDirectionLocked { get; set; }
Public Property IsCameraDirectionLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace