RhinoCommon API
RhinoObjectEventArgs.ObjectId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectEventArgs.ObjectId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoObjectEventArgs Class
Rhino.DocObjects Namespace