RhinoCommon API
MeshDisplacementInfo.SweepPitch Property
 Specifies how densely the object is initially subdivided. The lower the value, the higher the resolution of the displaced mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SweepPitch { get; set; }
Public Property SweepPitch As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace