RhinoCommon API
RenderSettings.BackgroundColorBottom Property
 Gets or sets the background bottom color used in rendering.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackgroundColorBottom { get; set; }
Public Property BackgroundColorBottom As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderSettings Class
Rhino.Render Namespace