RhinoCommon API
Circle.Normal Property
 Gets the normal vector for this circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Normal { get; }
Public ReadOnly Property Normal As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Circle Structure
Rhino.Geometry Namespace