RhinoCommon API
Rectangle3d.Unset Property
 Gets a rectangle with Unset components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Rectangle3d Unset { get; }
Public Shared ReadOnly Property Unset As Rectangle3d
	Get
Property Value
Type: Rectangle3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace