RhinoCommon API
MeshTopologyVertexList.Count Property
 Gets or sets the number of mesh topology vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace