RhinoCommon API
ObjectEnumeratorSettings.DeletedObjects Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.DeletedObjects"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DeletedObjects { get; set; }
Public Property DeletedObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace