RhinoCommon API
RenderPrimitive.InstanceTransform Property
 Instance reference transform or Identity if not an instance reference.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform InstanceTransform { get; }
Public ReadOnly Property InstanceTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace