RhinoCommon API
AppearanceSettingsState.GridZAxisLineColor Property
Gets or sets the color of Z axis line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GridZAxisLineColor { get; set; }
Public Property GridZAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace