RhinoCommon API
Dimension.Prefix Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.Prefix"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Dimension Class
Rhino.Geometry Namespace