RhinoCommon API
PolylineCurve.PointCount Property
 Gets the number of points in this polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PointCount { get; }
Public ReadOnly Property PointCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace