RhinoCommon API
CursorTooltipSettingsState.BackgroundColor Property
Tooltip background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace