RhinoCommon API
Localization.CurrentLanguageId Property
[Missing <summary> documentation for "P:Rhino.UI.Localization.CurrentLanguageId"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int CurrentLanguageId { get; }
Public Shared ReadOnly Property CurrentLanguageId As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Localization Class
Rhino.UI Namespace