RhinoCommon API
AppearanceSettingsState.DefaultFontFaceName Property
 Gets or sets the name of the default font face.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DefaultFontFaceName { get; set; }
Public Property DefaultFontFaceName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace