RhinoCommon API
Font.QuartetName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.QuartetName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string QuartetName { get; }
Public ReadOnly Property QuartetName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Font Class
Rhino.DocObjects Namespace