RhinoCommon API
HiddenLineDrawing.Viewport Property
 Returns the ViewportInfo used by the hidden line drawing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Return Value
Type: ViewportInfo
The ViewportInfo
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace