RhinoCommon API
Layer.SortIndex Property
 Runtime index used to sort layers in layer dialog.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SortIndex { get; }
Public ReadOnly Property SortIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Layer Class
Rhino.DocObjects Namespace