RhinoCommon API
ProviderIds.Sun Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.Sun"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Sun { get; }
Public Shared ReadOnly Property Sun As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace