RhinoCommon API
AppearanceSettingsState.FeedbackColor Property
Gets or sets the feedback color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color FeedbackColor { get; set; }
Public Property FeedbackColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace