RhinoCommon API
Vector3d.Z Property
 Gets or sets the Z (third) component of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace