RhinoCommon API
DecalCreateParams.Height Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.Height"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace