RhinoCommon API
RenderContent.Fields Property
 Rhino.Render.Fields FieldDictionary which provides access to setting and retrieving field values.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FieldDictionary Fields { get; }
Public ReadOnly Property Fields As FieldDictionary
	Get
Property Value
Type: FieldDictionary
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContent Class
Rhino.Render Namespace