RhinoCommon API
DimensionStyle.Font Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Font"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Font Font { get; set; }
Public Property Font As Font
	Get
	Set
Property Value
Type: Font
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace