RhinoCommon API
DimensionStyle.Name Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Name"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace