RhinoCommon API
ObjectPropertiesPage.SelectedObjects Property
 Return a list of Rhino objects to be processed by this object properties page
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] SelectedObjects { get; }
Public ReadOnly Property SelectedObjects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace