RhinoCommon API
LightManagerSupportClient.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.LightManagerSupportClient.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace