RhinoCommon API
PageViewSpaceChangeEventArgs.PageView Property
 The page view on which a different detail object was set active.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoPageView PageView { get; }
Public ReadOnly Property PageView As RhinoPageView
	Get
Property Value
Type: RhinoPageView
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PageViewSpaceChangeEventArgs Class
Rhino.Display Namespace