RhinoCommon API
Material.IsDefaultMaterial Property
 By default Rhino layers and objects are assigned the default rendering material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDefaultMaterial { get; }
Public ReadOnly Property IsDefaultMaterial As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Material Class
Rhino.DocObjects Namespace