RhinoCommon API
GroupTableEventArgs.EventType Property
 The event type.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GroupTableEventType EventType { get; }
Public ReadOnly Property EventType As GroupTableEventType
	Get
Property Value
Type: GroupTableEventType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace