RhinoCommon API
Sun.North Property
 Angle in degrees on world X-Y plane that should be considered north in the model. Angle is measured starting at X-Axis and travels counterclockwise. Y-Axis would be a north angle of 90 degrees.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double North { get; set; }
Public Property North As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Sun Class
Rhino.Render Namespace