RhinoCommon API
Mesh.PartitionCount Property
 Number of partition information chunks stored on this mesh based on the last call to CreatePartitions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PartitionCount { get; }
Public ReadOnly Property PartitionCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Mesh Class
Rhino.Geometry Namespace