RhinoCommon API
ViewSettings.ZoomScale Property
 Gets or sets the step size for zooming with a wheeled mouse or the Page Up and Page Down keys.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double ZoomScale { get; set; }
Public Shared Property ZoomScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace