RhinoCommon API
BrepLoop.Trims Property
 List of trims for this loop
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace