RhinoCommon API
ContentUuids.DefaultEnvironmentInstance Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DefaultEnvironmentInstance"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid DefaultEnvironmentInstance { get; }
Public Shared ReadOnly Property DefaultEnvironmentInstance As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentUuids Class
Rhino.Render Namespace