RhinoCommon SDK
Dimension.PlainUserText Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.PlainUserText"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string PlainUserText { get; }
Public ReadOnly Property PlainUserText As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Dimension Class
Rhino.Geometry Namespace