RhinoCommon API
ViewportInfo.IsFrustumLeftRightSymmetric Property
 Gets or sets a value that indicates whether the camera frustum has a vertical symmetry axis.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsFrustumLeftRightSymmetric { get; set; }
Public Property IsFrustumLeftRightSymmetric As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace