RhinoCommon API
ObjectAttributes.PlotColor Property
 If plot_color_from_object == PlotColorSource, then PlotColor is the object's plotting color.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color PlotColor { get; set; }
Public Property PlotColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace