RhinoCommon API
GripObject.Weight Property
 The weight of a NURBS control point grip or RhinoMath.UnsetValue if the grip is not a NURBS control point grip.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual double Weight { get; set; }
Public Overridable Property Weight As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace