RhinoCommon SDK
RenderSettings.FocalBlurAperture Property
 Get or set the aperture to be used for focal blur calculation
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FocalBlurAperture { get; set; }
Public Property FocalBlurAperture As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RenderSettings Class
Rhino.Render Namespace