RhinoCommon API
ViewSettings.ZoomExtentsPerspectiveViewBorder Property
 Border amount to apply to perspective viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double ZoomExtentsPerspectiveViewBorder { get; set; }
Public Shared Property ZoomExtentsPerspectiveViewBorder As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace