RhinoCommon API
AreaMassProperties.CentroidCoordinatesProductMomentsError Property
 Uncertainty in product moments with respect to centroid coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CentroidCoordinatesProductMomentsError { get; }
Public ReadOnly Property CentroidCoordinatesProductMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace