RhinoCommon API
HatchPattern.Defaults.Squares Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Squares"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static HatchPattern Squares { get; }
Public Shared ReadOnly Property Squares As HatchPattern
	Get
Property Value
Type: HatchPattern
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace