RhinoCommon API
SimulatedEnvironment.BackgroundImage Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedEnvironment.BackgroundImage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimulatedTexture BackgroundImage { get; set; }
Public Property BackgroundImage As SimulatedTexture
	Get
	Set
Property Value
Type: SimulatedTexture
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace