RhinoCommon API
GeneralSettings.MiddleMouseMacro Property
 Gets or sets the toolbar to popup when the middle mouse is clicked on a view, this value is only used when MiddleMouseMode is set to PopupToolbar.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string MiddleMouseMacro { get; set; }
Public Shared Property MiddleMouseMacro As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace