RhinoCommon SDK
MaterialRefCreateParams.PlugInId Property
 Identifies a rendering plug-in
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid PlugInId { get; set; }
Public Property PlugInId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace