RhinoCommon API
MorphControl.PreserveStructure Property
 true if the morph should be done in a way that preserves the structure of the geometry. In particular, for NURBS objects, true eans that only the control points are moved. The PreserveStructure value does not affect the way meshes and points are morphed. The default is false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PreserveStructure { get; set; }
Public Property PreserveStructure As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace