RhinoCommon API
LicenseLease.GroupId Property
 ID of Rhino Accounts group that this lease came from
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GroupId { get; }
Public ReadOnly Property GroupId As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace