RhinoCommon API
GroundPlane.TextureSize Property
 Texture mapping single UV span size in world units.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2d TextureSize { get; set; }
Public Property TextureSize As Vector2d
	Get
	Set
Property Value
Type: Vector2d
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
GroundPlane Class
Rhino.Render Namespace