RhinoCommon API
LightTableEventArgs.LightIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.LightIndex"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LightIndex { get; }
Public ReadOnly Property LightIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace