RhinoCommon API
RhinoDoc.IsCreating Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsCreating"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCreating { get; }
Public ReadOnly Property IsCreating As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDoc Class
Rhino Namespace