RhinoCommon API
DocumentEventArgs.DocumentId Property
 Gets the document Id of the document for this event.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DocumentId { get; }
Public ReadOnly Property DocumentId As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
DocumentEventArgs Class
Rhino Namespace