RhinoCommon API
ViewSettings.PanScreenFraction Property
Gets or sets the faction used as multiplier to pan the screen.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double PanScreenFraction { get; set; }
Public Shared Property PanScreenFraction As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace