RhinoCommon API
DisplayPipeline.FrameSize Property
 Gets the size of the framebuffer that this pipeline is drawing to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Size FrameSize { get; }
Public ReadOnly Property FrameSize As Size
	Get
Property Value
Type: Size
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace