RhinoCommon API
GroundPlane.TextureOffset Property
 Get texture offset on the ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2d TextureOffset { get; }
Public ReadOnly Property TextureOffset As Vector2d
	Get
Property Value
Type: Vector2d
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace