RhinoCommon API
HostUtils.OperatingSystemInstallationType Property
 Returns Operating System Installation Type: "Client" | "Server" | "Unknown"
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string OperatingSystemInstallationType { get; }
Public Shared ReadOnly Property OperatingSystemInstallationType As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace