RhinoCommon API
FileObjReadOptions.ReverseGroupOrder Property
 Determines how groups/layers are nested when reading an obj file. Left to Right (default = false) or Right to Left (true)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReverseGroupOrder { get; set; }
Public Property ReverseGroupOrder As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace