RhinoCommon API
ContentUuids.CubeMapTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.CubeMapTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CubeMapTextureType { get; }
Public Shared ReadOnly Property CubeMapTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ContentUuids Class
Rhino.Render Namespace