RhinoCommon API
SimulatedTexture.MappingChannel Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.MappingChannel"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MappingChannel { get; set; }
Public Property MappingChannel As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace