RhinoCommon API
ArcCurve.AngleRadians Property
 Gets the angles of this arc in radians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AngleRadians { get; }
Public ReadOnly Property AngleRadians As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace