RhinoCommon API
DecalCreateParams.TextureInstanceId Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.TextureInstanceId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid TextureInstanceId { get; set; }
Public Property TextureInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace