RhinoCommon SDK
RenderSettings.FocalBlurJitter Property
 Get or set the jitter amount for focal blur
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FocalBlurJitter { get; set; }
Public Property FocalBlurJitter As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RenderSettings Class
Rhino.Render Namespace