RhinoCommon API
File3dm.AllMaterials Property
 Materials in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmMaterialTable AllMaterials { get; }
Public ReadOnly Property AllMaterials As File3dmMaterialTable
	Get
Property Value
Type: File3dmMaterialTable
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dm Class
Rhino.FileIO Namespace