RhinoCommon API
RhinoViewport.ConstructionAxesVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.ConstructionAxesVisible"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ConstructionAxesVisible { get; set; }
Public Property ConstructionAxesVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace