RhinoCommon API
Texture.WrapU Property
 Texture wrapping mode in the U direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureUvwWrapping WrapU { get; set; }
Public Property WrapU As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Texture Class
Rhino.DocObjects Namespace