RhinoCommon API
GeneralSettings.AutoUpdateCommandHelp Property
 Command help dialog auto-update feature.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AutoUpdateCommandHelp { get; set; }
Public Shared Property AutoUpdateCommandHelp As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace