RhinoCommon SDK
DimStyleTableEventArgs.NewState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.NewState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle NewState { get; }
Public ReadOnly Property NewState As DimensionStyle
	Get
Property Value
Type: DimensionStyle
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace