RhinoCommon API
SmartTrackSettings.UseDottedLines Property
Gets or sets a value indicating if lines are drawn dotted.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UseDottedLines { get; set; }
Public Shared Property UseDottedLines As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace