RhinoCommon API
Color4f.White Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.White"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color4f White { get; }
Public Shared ReadOnly Property White As Color4f
	Get
Property Value
Type: Color4f
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Color4f Structure
Rhino.Display Namespace