RhinoCommon API
ViewCaptureWriter.Pen.Width Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Width"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Width { get; }
Public ReadOnly Property Width As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace