RhinoCommon API
RenderContentSerializer.CanRead Property
 If true then the file type can be imported and will be included in the file open box when importing the specified render content type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CanRead { get; }
Public ReadOnly Property CanRead As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace