RhinoCommon API
Light.ChangeType Property
 Get what type of light change this represents
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light.Event ChangeType { get; }
Public ReadOnly Property ChangeType As Light.Event
	Get
Property Value
Type: Light.Event
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Light Class
Rhino.Render.ChangeQueue Namespace