RhinoCommon API
RhinoApp.MainApplicationWindow Property
Note: This API is now obsolete.
 Same as MainWindow function, but provides the concrete class instead of an interface
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use MainWindowHandle or RhinoEtoApp.MainWindow in Rhino.UI")]
public static RhinoWindow MainApplicationWindow { get; }
<ObsoleteAttribute("Use MainWindowHandle or RhinoEtoApp.MainWindow in Rhino.UI")>
Public Shared ReadOnly Property MainApplicationWindow As RhinoWindow
	Get
Property Value
Type: RhinoWindow
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
RhinoApp Class
Rhino Namespace