RhinoCommon SDK
StackedDialogPage.LocalPageTitle Property
[Missing <summary> documentation for "P:Rhino.UI.StackedDialogPage.LocalPageTitle"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual string LocalPageTitle { get; }
Public Overridable ReadOnly Property LocalPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace