RhinoCommon API
ProviderIds.Dithering Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.Dithering"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Dithering { get; }
Public Shared ReadOnly Property Dithering As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace