RhinoCommon API
CustomGripObject.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.Index"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace