RhinoCommon SDK
MaterialRef.FrontFaceMaterialId Property
 The Id of the Material used to render the front of an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid FrontFaceMaterialId { get; }
Public ReadOnly Property FrontFaceMaterialId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace