RhinoCommon API
SmartTrackSettingsState.LineColor Property
Gets or sets the smart track line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color LineColor { get; set; }
Public Property LineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace