RhinoCommon API
CommonObject.UserDictionary Property
 Dictionary of custom information attached to this class. The dictionary is actually user data provided as an easy to use sharable set of information.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArchivableDictionary UserDictionary { get; }
Public ReadOnly Property UserDictionary As ArchivableDictionary
	Get
Property Value
Type: ArchivableDictionary
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace