RhinoCommon API
ICollapsibleSection.BackgroundColor Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.BackgroundColor"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Color BackgroundColor { get; set; }
Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace