RhinoCommon SDK
DimensionStyle.DimTextLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimTextLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.TextLocation DimTextLocation { get; set; }
Public Property DimTextLocation As DimensionStyle.TextLocation
	Get
	Set
Property Value
Type: DimensionStyle.TextLocation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace