RhinoCommon API
ClippingPlane.Plane Property
 Get the plane that represents this clipping plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane Plane { get; }
Public ReadOnly Property Plane As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace