RhinoCommon API
MappingChannel.Mapping Property
 Return TexturMapping for this MappingChannel
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureMapping Mapping { get; }
Public ReadOnly Property Mapping As TextureMapping
	Get
Property Value
Type: TextureMapping
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MappingChannel Class
Rhino.Render.ChangeQueue Namespace