RhinoCommon API
Leader.Points2D Property
 Get or set the 2d points defining the curve used by this leader
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d[] Points2D { get; set; }
Public Property Points2D As Point2d()
	Get
	Set
Property Value
Type: Point2d[]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Leader Class
Rhino.Geometry Namespace