RhinoCommon API
Material.SpecularColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.SpecularColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color SpecularColor { get; set; }
Public Property SpecularColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Material Class
Rhino.DocObjects Namespace