RhinoCommon API
Texture.ApplyUvwTransform Property
 If true then the UVW transform is applied to the texture otherwise the UVW transform is ignored.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ApplyUvwTransform { get; set; }
Public Property ApplyUvwTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Texture Class
Rhino.DocObjects Namespace