RhinoCommon API
RhinoObject.IsDeletable Property
 Some objects cannot be deleted, like grips on lights and annotation objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDeletable { get; protected set; }
Public Property IsDeletable As Boolean
	Get
	Protected Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace