RhinoCommon API
File3dmNotes.WindowRectangle Property
 Gets or sets the position of the Notes when they were saved.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle WindowRectangle { get; set; }
Public Property WindowRectangle As Rectangle
	Get
	Set
Property Value
Type: Rectangle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace