RhinoCommon API
FileWriteOptions.WriteUserData Property
 If true, the file written should include User Data if your File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WriteUserData { get; set; }
Public Property WriteUserData As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace