RhinoCommon API
ContentUuids.WoodTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.WoodTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid WoodTextureType { get; }
Public Shared ReadOnly Property WoodTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ContentUuids Class
Rhino.Render Namespace