RhinoCommon API
Arc.MidPoint Property
 Gets the mid-point of the arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d MidPoint { get; }
Public ReadOnly Property MidPoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Arc Structure
Rhino.Geometry Namespace