RhinoCommon API
ContentUuids.PlasticMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PlasticMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PlasticMaterialType { get; }
Public Shared ReadOnly Property PlasticMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ContentUuids Class
Rhino.Render Namespace