RhinoCommon API
RenderContentCollection.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentCollection.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace