RhinoCommon API
Point3dList.Y Property
 Returns an indexer with all Y coordinates in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList.YAccess Y { get; }
Public ReadOnly Property Y As Point3dList.YAccess
	Get
Property Value
Type: Point3dList.YAccess
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Point3dList Class
Rhino.Collections Namespace