RhinoCommon API
ViewCaptureSettings.DrawWallpaper Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawWallpaper"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawWallpaper { get; set; }
Public Property DrawWallpaper As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace