RhinoCommon SDK
MaterialTable.Count Property
 Returns number of materials in the material table, including deleted materials.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace