RhinoCommon API
ContentUuids.AdvancedDotTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.AdvancedDotTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid AdvancedDotTextureType { get; }
Public Shared ReadOnly Property AdvancedDotTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ContentUuids Class
Rhino.Render Namespace