RhinoCommon API
ArcCurve.Arc Property
 Gets the arc that is contained within this ArcCurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Arc Arc { get; }
Public ReadOnly Property Arc As Arc
	Get
Property Value
Type: Arc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace