RhinoCommon API
Vector3f.Zero Property
 Gets the value of the vector with components 0,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f Zero { get; }
Public Shared ReadOnly Property Zero As Vector3f
	Get
Property Value
Type: Vector3f
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace