RhinoCommon API
LicenseLease.UserId Property
 ID of Rhino Accounts user that was logged in when this lease was obtained
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string UserId { get; }
Public ReadOnly Property UserId As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace