RhinoCommon API
TextEntity.MaskOffset Property
 distance around text to display mask
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MaskOffset { get; set; }
Public Property MaskOffset As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace