RhinoCommon SDK
SubDEdgePtr.VertexTo Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.VertexTo"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr VertexTo { get; set; }
Public Property VertexTo As SubDVertexPtr
	Get
	Set
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace