RhinoCommon API
PolyCurve.SegmentCount Property
 Gets the number of segments that make up this Polycurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SegmentCount { get; }
Public ReadOnly Property SegmentCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace