RhinoCommon API
ModelAidSettingsState.CtrlNudgeKeyStep Property
Gets or sets the Ctrl-key based nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double CtrlNudgeKeyStep { get; set; }
Public Property CtrlNudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace