RhinoCommon API
Interval.IsIncreasing Property
 Returns true if T0 < T1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsIncreasing { get; }
Public ReadOnly Property IsIncreasing As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Interval Structure
Rhino.Geometry Namespace