RhinoCommon SDK
SubDEdgePtr.VertexFrom Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.VertexFrom"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr VertexFrom { get; set; }
Public Property VertexFrom As SubDVertexPtr
	Get
	Set
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace