RhinoCommon API
Material.RenderMaterialInstanceId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.RenderMaterialInstanceId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RenderMaterialInstanceId { get; set; }
Public Property RenderMaterialInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Material Class
Rhino.DocObjects Namespace