RhinoCommon API
Quaternion.Length Property
 Returns the length or norm of the quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
Math.Sqrt(a*a + b*b + c*c + d*d)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace