RhinoCommon SDK
SubDObject.IsCustomObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.SubDObject.IsCustomObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsCustomObject { get; }
Public ReadOnly Property IsCustomObject As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDObject Class
Rhino.DocObjects Namespace