RhinoCommon API
DisplayModeDescription.Id Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.Id"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace