RhinoCommon API
AreaMassProperties.AreaError Property
 Gets the uncertainty in the area calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AreaError { get; }
Public ReadOnly Property AreaError As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace