RhinoCommon API
RhinoApp.Rhino3Id Property
Gets the ID of Rhino 3.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Rhino3Id { get; }
Public Shared ReadOnly Property Rhino3Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoApp Class
Rhino Namespace