RhinoCommon API
CursorTooltipSettingsState.DistancePane Property
 Displays the distance from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DistancePane { get; set; }
Public Property DistancePane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace