RhinoCommon API
DecalCreateParams.EndLongitude Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.EndLongitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EndLongitude { get; set; }
Public Property EndLongitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace