RhinoCommon API
ModelAidSettingsState.OsnapModes Property
 Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OsnapModes OsnapModes { get; set; }
Public Property OsnapModes As OsnapModes
	Get
	Set
Property Value
Type: OsnapModes
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace