RhinoCommon SDK
GumballAppearanceSettings.ColorX Property
Default is Red.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ColorX { get; set; }
Public Property ColorX As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace