RhinoCommon API
Linetype.PatternLength Property
Total length of one repeat of the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PatternLength { get; }
Public ReadOnly Property PatternLength As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace