RhinoCommon API
CursorTooltipSettingsState.RelativePointPane Property
 Displays the relative construction plane coordinates and angle from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RelativePointPane { get; set; }
Public Property RelativePointPane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace