RhinoCommon SDK
ViewportInfo.IsValidCamera Property
 Gets a value that indicates whether the camera is valid.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValidCamera { get; }
Public ReadOnly Property IsValidCamera As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace