RhinoCommon API
ICollapsibleSection.CommandOptionName Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.CommandOptionName"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
LocalizeStringPair CommandOptionName { get; }
ReadOnly Property CommandOptionName As LocalizeStringPair
	Get
Property Value
Type: LocalizeStringPair
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace