RhinoCommon API
MeshClash.MeshB Property
 Gets the second mesh.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh MeshB { get; }
Public ReadOnly Property MeshB As Mesh
	Get
Property Value
Type: Mesh
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace