RhinoCommon API
AppearanceSettings.WorldCoordIconZAxisColor Property
 Gets or sets the color of the world coordinate Z axis.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color WorldCoordIconZAxisColor { get; set; }
Public Shared Property WorldCoordIconZAxisColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace