RhinoCommon API
RenderContent.TopLevel Property
 Returns true if this content has no parent, false if it is the child of another content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TopLevel { get; }
Public ReadOnly Property TopLevel As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderContent Class
Rhino.Render Namespace