RhinoCommon API
StringParserSettings.ParseLeadingWhiteSpace Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseLeadingWhiteSpace"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseLeadingWhiteSpace { get; set; }
Public Property ParseLeadingWhiteSpace As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace