RhinoCommon API
Cone.Plane Property
 Gets or sets the base plane of the cone. The apex of the cone is at the plane's origin.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Cone Structure
Rhino.Geometry Namespace