RhinoCommon API
Dimension.AltLengthFactor Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltLengthFactor"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AltLengthFactor { get; set; }
Public Property AltLengthFactor As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Dimension Class
Rhino.Geometry Namespace