RhinoCommon API
MeshFace.B Property
 Gets or sets the second corner index of the mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int B { get; set; }
Public Property B As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace