RhinoCommon API
Transform.M03 Property
Gets or sets this[0,3].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M03 { get; set; }
Public Property M03 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Transform Structure
Rhino.Geometry Namespace