RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.ClearcoatBump Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.ClearcoatBump"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ClearcoatBump { get; }
Public Shared ReadOnly Property ClearcoatBump As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace