RhinoCommon SDK
SubDFacePtr.Previous Property
 Links to previous face on this level.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacePtr Previous { get; }
Public ReadOnly Property Previous As SubDFacePtr
	Get
Property Value
Type: SubDFacePtr
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace