RhinoCommon SDK
File3dmPlugInDataTable.Count Property
 Gets the number of File3dmPlugInData in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace