RhinoCommon API
DisplayModeDescription.ShadedPipelineRequired Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.ShadedPipelineRequired"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShadedPipelineRequired { get; set; }
Public Property ShadedPipelineRequired As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace