RhinoCommon API
RhinoDoc.TextureMappingEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.TextureMappingEventArgs.EventType"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc.TextureMappingEventType EventType { get; }
Public ReadOnly Property EventType As RhinoDoc.TextureMappingEventType
	Get
Property Value
Type: RhinoDoc.TextureMappingEventType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace