RhinoCommon SDK
SubDVertexSectorIterator.CurrentRingIndex Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentRingIndex"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int CurrentRingIndex { get; }
Public ReadOnly Property CurrentRingIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace