RhinoCommon API
CurvatureAnalysisSettings.MeanRange Property
 Gets or sets the Mean curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Interval MeanRange { get; set; }
Public Shared Property MeanRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace