RhinoCommon API
MeshDisplacementInfo.White Property
 Value considered highest point of the displacement texture.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double White { get; set; }
Public Property White As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace