RhinoCommon API
ViewCaptureSettings.ArrowheadSizeMillimeters Property
 arrowhead size in millimeters
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ArrowheadSizeMillimeters { get; set; }
Public Property ArrowheadSizeMillimeters As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace