RhinoCommon API
CurvatureAnalysisSettingsState.MaxRadiusRange Property
 Gets or sets the Maximum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval MaxRadiusRange { get; set; }
Public Property MaxRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace