RhinoCommon SDK
MeshFaceList.QuadCount Property
 Gets the number of faces that are quads (4 corners).
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int QuadCount { get; }
Public ReadOnly Property QuadCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace