RhinoCommon API
GroundPlane.ShowUnderside Property
 If this is off, the ground plane will not be visible when seen from below.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowUnderside { get; set; }
Public Property ShowUnderside As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
GroundPlane Class
Rhino.Render Namespace