RhinoCommon SDK
Vector3d.SquareLength Property
 Computes the squared length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem. While the Length property checks for input validity, this property does not. You should check validity in advance, if this vector can be invalid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SquareLength { get; }
Public ReadOnly Property SquareLength As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace