RhinoCommon API
ToolbarGroup.Visible Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarGroup.Visible"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace