RhinoCommon API
CreatePreviewEventArgs.Environment Property
 The environment that the previewed object is rendered in.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderEnvironment Environment { get; }
Public ReadOnly Property Environment As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace