RhinoCommon API
MeshingParameters.SimplePlanes Property
 Gets or sets a value indicating whether or not planar areas are allowed to be meshed in a simplified manner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SimplePlanes { get; set; }
Public Property SimplePlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace