RhinoCommon API
CustomRenderMeshProvider.Name Property
 The name of the provider for UI display.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace