RhinoCommon API
Light.PerpendicularDirection Property
 Gets a perpendicular vector to the camera direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d PerpendicularDirection { get; }
Public ReadOnly Property PerpendicularDirection As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Light Class
Rhino.Geometry Namespace