RhinoCommon SDK
Point3d.Origin Property
 Gets the value of a point at location 0,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d Origin { get; }
Public Shared ReadOnly Property Origin As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace