RhinoCommon API
GetPolyline.ThirdPointPrompt Property
Prompt when getting third point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ThirdPointPrompt { get; set; }
Public Property ThirdPointPrompt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace