RhinoCommon API
CustomUndoEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.Document"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace