RhinoCommon API
Decal.Radius Property
 Gets the radius of the decal. Only used when mapping is cylindrical or spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Decal Class
Rhino.Render Namespace