RhinoCommon API
ViewportInfo.IsPerspectiveProjection Property
 Get or set whether this projection is perspective.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPerspectiveProjection { get; set; }
Public Property IsPerspectiveProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace