RhinoCommon SDK
Brep.Faces Property
 Gets the brep faces list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepFaceList Faces { get; }
Public ReadOnly Property Faces As BrepFaceList
	Get
Property Value
Type: BrepFaceList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace