RhinoCommon API
Leader.LeaderTextHorizontalAlignment Property
 Gets or sets the horizontal alignment of the leader's text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextHorizontalAlignment LeaderTextHorizontalAlignment { get; set; }
Public Property LeaderTextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Leader Class
Rhino.Geometry Namespace