RhinoCommon SDK
PointCloudObject.PointCloudGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PointCloudObject.PointCloudGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloud PointCloudGeometry { get; }
Public ReadOnly Property PointCloudGeometry As PointCloud
	Get
Property Value
Type: PointCloud
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace