RhinoCommon API
DisplayModeDescription.RaytracedId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.RaytracedId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RaytracedId { get; }
Public Shared ReadOnly Property RaytracedId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace