RhinoCommon API
ObjectEnumeratorSettings.IdefObjects Property
 When true, ONLY Instance Definitions will be returned
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IdefObjects { get; set; }
Public Property IdefObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace