RhinoCommon SDK
Box.Z Property
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Z-Axis. Otherwise known as the Height of the Box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval Z { get; set; }
Public Property Z As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
Box Structure
Rhino.Geometry Namespace