RhinoCommon API
ModelAidSettingsState.ExtendTrimLines Property
Gets or sets the enabled state of Rhino's extend trim lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExtendTrimLines { get; set; }
Public Property ExtendTrimLines As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace