RhinoCommon API
ContentHash.HashTime Property
 Gets the hash time, rounded to seconds.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DateTime HashTime { get; }
Public ReadOnly Property HashTime As DateTime
	Get
Property Value
Type: DateTime
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace