RhinoCommon API
Transform.IsZeroTransformation Property
 True if all values are 0 and M33 is 1
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsZeroTransformation { get; }
Public ReadOnly Property IsZeroTransformation As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Transform Structure
Rhino.Geometry Namespace