RhinoCommon SDK
HiddenLineDrawingObjectCurve.Parameters Property
 Increasing, partition of curve.Domain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double[] Parameters { get; }
Public ReadOnly Property Parameters As Double()
	Get
Property Value
Type: Double[]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace