RhinoCommon API
FileObjWriteOptions.ExportOpenMeshes Property
 Enable/Disable bailing when an open mesh is encountered.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportOpenMeshes { get; set; }
Public Property ExportOpenMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace