RhinoCommon API
FileSettings.AutoSaveInterval Property
how often the document will be saved when Rhino's automatic file saving mechanism is enabled.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static TimeSpan AutoSaveInterval { get; set; }
Public Shared Property AutoSaveInterval As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace