RhinoCommon API
ComponentStatus.Damaged Property
 The damaged flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus Damaged { get; }
Public Shared ReadOnly Property Damaged As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace