RhinoCommon SDK
StackedDialogPage.EnglishPageTitle Property
 English string used when scripting this page and a user prefixes a command option with "_"
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishPageTitle { get; }
Public ReadOnly Property EnglishPageTitle As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace