RhinoCommon API
MeshExtruder.UVN Property
 Whether or not to perform extrude in UVN basis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UVN { get; set; }
Public Property UVN As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace