RhinoCommon API
GumballAppearanceSettings.TranslateXYEnabled Property
 When TranslateXY is true, the XY plane translation control is available in appropriate views. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TranslateXYEnabled { get; set; }
Public Property TranslateXYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace