RhinoCommon SDK
Point2d.Unset Property
 Gets a point at RhinoMath.UnsetValue,RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d Unset { get; }
Public Shared ReadOnly Property Unset As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace