RhinoCommon API
Transform.IsIdentity Property
Return true if this Transform is the identity transform
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsIdentity { get; }
Public ReadOnly Property IsIdentity As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Transform Structure
Rhino.Geometry Namespace