RhinoCommon API
RenderContentSerializer.ContentType Property
 Type of content created when importing or exporting this file type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentKind ContentType { get; }
Public ReadOnly Property ContentType As RenderContentKind
	Get
Property Value
Type: RenderContentKind
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace