RhinoCommon API
CustomRenderContentAttribute.IsPrivate Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsPrivate"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPrivate { get; set; }
Public Property IsPrivate As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace