RhinoCommon API
RhinoApp.IsExiting Property
 Returns true if Rhino is in the process of exiting, false otherwise. This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsExiting { get; }
Public Shared ReadOnly Property IsExiting As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoApp Class
Rhino Namespace