RhinoCommon API
RenderContent.Tags Property
 Tags for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Tags { get; set; }
Public Property Tags As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContent Class
Rhino.Render Namespace