RhinoCommon API
ICurrentEnvironment.ForReflectionAndRefraction Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForReflectionAndRefraction"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RenderEnvironment ForReflectionAndRefraction { get; set; }
Property ForReflectionAndRefraction As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForReflectionAndRefraction
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace