RhinoCommon API
DisplayPipelineAttributes.CurveThickness Property
Pixel thickness for curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CurveThickness { get; set; }
Public Property CurveThickness As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace