RhinoCommon SDK
IntersectionEvent.ParameterB Property
 Gets the parameter on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ParameterB { get; }
Public ReadOnly Property ParameterB As Double
	Get
Property Value
Type: Double
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace