RhinoCommon API
DecalCreateParams.MapToInside Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MapToInside"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MapToInside { get; set; }
Public Property MapToInside As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace