RhinoCommon API
SmartTrackSettings.UseSmartTrack Property
Gets or sets if the Smart Track feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UseSmartTrack { get; set; }
Public Shared Property UseSmartTrack As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace