RhinoCommon API
AnimationProperties.LightIndex Property
 Internal value used while previewing animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LightIndex { get; set; }
Public Property LightIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace