RhinoCommon API
RhinoModifyObjectAttributesEventArgs.RhinoObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.RhinoObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace