RhinoCommon API
RuiUpdateUi.WindowsMenuItemId Property
Windows menu item ID
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint WindowsMenuItemId { get; }
Public ReadOnly Property WindowsMenuItemId As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace