RhinoCommon API
File3dm.NamedConstructionPlanes Property
 Named construction planes in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<ConstructionPlane> NamedConstructionPlanes { get; }
Public ReadOnly Property NamedConstructionPlanes As IList(Of ConstructionPlane)
	Get
Property Value
Type: IList<ConstructionPlane>
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dm Class
Rhino.FileIO Namespace