RhinoCommon API
Sun.SkylightOn Property
Note: This API is now obsolete.
Turn skylight on or off.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use Rhino.Render.Skylight instead")]
public bool SkylightOn { get; set; }
<ObsoleteAttribute("Use Rhino.Render.Skylight instead")>
Public Property SkylightOn As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.3
See Also
Reference
Sun Class
Rhino.Render Namespace