RhinoCommon API
MeshFaceNormalList.Count Property
 Gets or sets the number of mesh face normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace