RhinoCommon API
HiddenLineDrawingPoint.SourceObject Property
 Return the source object that this point came from.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingObject SourceObject { get; }
Public ReadOnly Property SourceObject As HiddenLineDrawingObject
	Get
Property Value
Type: HiddenLineDrawingObject
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace