RhinoCommon API
EdgeAnalysisSettings.ShowEdgeColor Property
Gets or sets a color used to enhance display edges in commands like _ShowEdges and _ShowNakedEdges.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color ShowEdgeColor { get; set; }
Public Shared Property ShowEdgeColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace