RhinoCommon API
RhinoObject.WorksessionReferenceSerialNumber Property
 Obsolete - use ReferenceModelSerialNumber
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint WorksessionReferenceSerialNumber { get; }
Public ReadOnly Property WorksessionReferenceSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace