RhinoCommon API
RhinoDoc.PageRelativeTolerance Property
Page space relative tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PageRelativeTolerance { get; set; }
Public Property PageRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoDoc Class
Rhino Namespace