RhinoCommon API
DimensionStyle.LengthFormat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LengthFormat"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DistanceDisplayMode LengthFormat { get; set; }
Public Property LengthFormat As DistanceDisplayMode
	Get
	Set
Property Value
Type: DistanceDisplayMode
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace