RhinoCommon API
Utilities.ShowIncompatibleEnvironments Property
 Specifies whether incompatible content should be shown in the corresponding editor.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowIncompatibleEnvironments { get; set; }
Public Shared Property ShowIncompatibleEnvironments As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Utilities Class
Rhino.Render Namespace