RhinoCommon API
Material.MeshInstanceId Property
 Get the material InstanceAncestry
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint MeshInstanceId { get; }
Public ReadOnly Property MeshInstanceId As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace