RhinoCommon API
DisplayMaterial.IsTwoSided Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayMaterial.IsTwoSided"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsTwoSided { get; set; }
Public Property IsTwoSided As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace