RhinoCommon API
Texture.WrapV Property
 Texture wrapping mode in the V direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureUvwWrapping WrapV { get; set; }
Public Property WrapV As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Texture Class
Rhino.DocObjects Namespace