RhinoCommon API
DimensionStyle.AlternateDimensionLengthDisplay Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateDimensionLengthDisplay"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LengthDisplay AlternateDimensionLengthDisplay { get; set; }
Public Property AlternateDimensionLengthDisplay As DimensionStyle.LengthDisplay
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplay
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace