RhinoCommon SDK
Mesh.FaceNormals Property
 Gets access to the face normal collection in this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshFaceNormalList FaceNormals { get; }
Public ReadOnly Property FaceNormals As MeshFaceNormalList
	Get
Property Value
Type: MeshFaceNormalList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace