RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Clearcoat Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Clearcoat"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Clearcoat { get; }
Public Shared ReadOnly Property Clearcoat As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace