RhinoCommon API
BitmapTable.Count Property
Gets the number of bitmaps in the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace