RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.SpecularTint Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SpecularTint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string SpecularTint { get; }
Public Shared ReadOnly Property SpecularTint As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace