RhinoCommon API
ViewCapture.TransparentBackground Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.TransparentBackground"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TransparentBackground { get; set; }
Public Property TransparentBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewCapture Class
Rhino.Display Namespace