RhinoCommon API
RenderMaterial.SmellsLikeGlass Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeGlass"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeGlass { get; }
Public ReadOnly Property SmellsLikeGlass As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace