RhinoCommon API
DetailViewObject.IsActive Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DetailViewObject.IsActive"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsActive { get; set; }
Public Property IsActive As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace