RhinoCommon API
ComponentStatus.Highlighted Property
 The highlight selection flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus Highlighted { get; }
Public Shared ReadOnly Property Highlighted As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace