RhinoCommon API
HostUtils.DeviceName Property
 Name of the computer running Rhino. If the computer is part of a Windows Domain, the computer name has "@[DOMAIN]" appended.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string DeviceName { get; }
Public Shared ReadOnly Property DeviceName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace