RhinoCommon API
VisualAnalysisMode.RhinoZebraStripeAnalysisModeId Property
 Id for Rhino's built-in zebra stripe analysis mode. Zebra stripes are shown on surfaces and meshes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RhinoZebraStripeAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoZebraStripeAnalysisModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace