RhinoCommon API
AngularDimension.AngleFormat Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.AngleFormat"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.AngleDisplayFormat AngleFormat { get; set; }
Public Property AngleFormat As DimensionStyle.AngleDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.AngleDisplayFormat
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace