RhinoCommon API
Dimension.AltPrefix Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltPrefix"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string AltPrefix { get; set; }
Public Property AltPrefix As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Dimension Class
Rhino.Geometry Namespace