RhinoCommon API
CurvatureAnalysisSettings.Style Property
 Gets or sets the curvature analysis style.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CurvatureAnalysisSettings.CurvatureStyle Style { get; set; }
Public Shared Property Style As CurvatureAnalysisSettings.CurvatureStyle
	Get
	Set
Property Value
Type: CurvatureAnalysisSettings.CurvatureStyle
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace