RhinoCommon API
Material.MeshIndex Property
 Get mesh index
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MeshIndex { get; }
Public ReadOnly Property MeshIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace