RhinoCommon API
UndoRedoEventArgs.IsEndRedo Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsEndRedo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsEndRedo { get; }
Public ReadOnly Property IsEndRedo As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace