RhinoCommon SDK
Layer.IsExpanded Property
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsExpanded { get; set; }
Public Property IsExpanded As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
If you are modifying a layer inside a Rhino document, you must call CommitChanges for the modifications to take effect.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace