RhinoCommon API
DimensionStyle.DimRadialTextAngleType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimRadialTextAngleType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LeaderContentAngleStyle DimRadialTextAngleType { get; set; }
Public Property DimRadialTextAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace