RhinoCommon API
LightTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light OldState { get; }
Public ReadOnly Property OldState As Light
	Get
Property Value
Type: Light
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace