RhinoCommon API
ComponentStatus.IsHidden Property
 Returns true if hidden. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsHidden { get; }
Public ReadOnly Property IsHidden As Boolean
	Get
Return Value
Type: Boolean
The component status for hidden.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace