RhinoCommon API
ShutLiningCurveInfo.Curve Property
 The profile curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace