RhinoCommon API
Light.IdCrc Property
 Get CRC computed from Id
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint IdCrc { get; }
Public ReadOnly Property IdCrc As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Light Class
Rhino.Render.ChangeQueue Namespace