RhinoCommon API
Transform.Identity Property
 Gets a new identity transform matrix. An identity matrix defines no transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Transform Identity { get; }
Public Shared ReadOnly Property Identity As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Transform Structure
Rhino.Geometry Namespace