RhinoCommon API
PlugInInfo.Email Property
 Returns the email address of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Email { get; }
Public ReadOnly Property Email As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace