RhinoCommon SDK
RhinoView.ActiveViewportID Property
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual Guid ActiveViewportID { get; }
Public Overridable ReadOnly Property ActiveViewportID As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoView Class
Rhino.Display Namespace