RhinoCommon SDK
File3dm.Created Property
 Get the DateTime that this file was originally created. If the value is not set in the 3dm file, then DateTime.MinValue is returned
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DateTime Created { get; }
Public ReadOnly Property Created As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
File3dm Class
Rhino.FileIO Namespace