RhinoCommon API
ArchivableDictionary.Keys Property
Gets all entry names or keys.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] Keys { get; }
Public ReadOnly Property Keys As String()
	Get
Property Value
Type: String[]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace