RhinoCommon API
Point2f.Y Property
 Gets or sets the Y (second) component of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Y { get; set; }
Public Property Y As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace