RhinoCommon SDK
ToolbarGroup.IsDocked Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarGroup.IsDocked"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDocked { get; }
Public ReadOnly Property IsDocked As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace