RhinoCommon SDK
InstanceDefinition.IsTenuous Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.IsTenuous"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsTenuous { get; }
Public ReadOnly Property IsTenuous As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace