RhinoCommon API
MeshInstance.ReceiveShadows Property
 Return true if mesh instance should receive shadows
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReceiveShadows { get; }
Public ReadOnly Property ReceiveShadows As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace