RhinoCommon SDK
ThumbData.Parent Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Parent"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ThumbData Parent { get; set; }
Public Property Parent As ThumbData
	Get
	Set
Property Value
Type: ThumbData
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace