RhinoCommon API
RhinoApp.LicenseSavesLeft Property
 Returns number of saves left in save-limited Evaluation. Zero when evaluation is expired. Raises InvalidLicenseTypeException if LicenseType != EvaluationSaveLimited
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int LicenseSavesLeft { get; }
Public Shared ReadOnly Property LicenseSavesLeft As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
RhinoApp Class
Rhino Namespace