RhinoCommon API
ColorHSL.S Property
 Gets or sets the saturation channel value. Saturation channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double S { get; set; }
Public Property S As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace