RhinoCommon API
GroundPlane.TextureSizeLocked Property
 Texture size locked.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TextureSizeLocked { get; set; }
Public Property TextureSizeLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GroundPlane Class
Rhino.Render Namespace