RhinoCommon API
MaterialRef.MaterialSource Property
 Determines if the simple material should come from the object or from it's layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectMaterialSource MaterialSource { get; }
Public ReadOnly Property MaterialSource As ObjectMaterialSource
	Get
Property Value
Type: ObjectMaterialSource
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace