RhinoCommon API
MappingChannel.Local Property
 Local transform for the mapping
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Local { get; }
Public ReadOnly Property Local As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
MappingChannel Class
Rhino.Render.ChangeQueue Namespace