RhinoCommon API
RadialDimension.KneePoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.KneePoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d KneePoint { get; }
Public ReadOnly Property KneePoint As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace