RhinoCommon API
GripsDrawEventArgs.GripColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripColor"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GripColor { get; set; }
Public Property GripColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace