RhinoCommon API
File3dm.ApplicationUrl Property
 Gets or sets a URL for the application that wrote this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ApplicationUrl { get; set; }
Public Property ApplicationUrl As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dm Class
Rhino.FileIO Namespace