RhinoCommon API
RhinoObject.SubobjectMaterialComponents Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObject.SubobjectMaterialComponents"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex[] SubobjectMaterialComponents { get; }
Public ReadOnly Property SubobjectMaterialComponents As ComponentIndex()
	Get
Property Value
Type: ComponentIndex[]
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace