RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Bump Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Bump"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Bump { get; }
Public Shared ReadOnly Property Bump As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace