RhinoCommon API
MeshDisplacementInfo.WhiteMove Property
 The amount of displacement for the white color in the texture.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double WhiteMove { get; set; }
Public Property WhiteMove As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace