RhinoCommon API
CachedTextureCoordinates.MappingId Property
 The texture mapping Id.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid MappingId { get; }
Public ReadOnly Property MappingId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace