RhinoCommon API
ModelAidSettings.OsnapPickboxRadius Property
Enables or disables Rhino's planar modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int OsnapPickboxRadius { get; set; }
Public Shared Property OsnapPickboxRadius As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace