RhinoCommon API
NurbsCurvePointList.ControlPolygonLength Property
 Gets the length of the polyline connecting all control points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ControlPolygonLength { get; }
Public ReadOnly Property ControlPolygonLength As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace