RhinoCommon API
ModelAidSettingsState.OsnapPickboxRadius Property
Enables or disables Rhino's planar modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int OsnapPickboxRadius { get; set; }
Public Property OsnapPickboxRadius As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace