RhinoCommon API
ManifestTable.ComponentType Property
 Returns Mixed.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ModelComponentType ComponentType { get; }
Public ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace