RhinoCommon API
MeshPoint.EdgeIndex Property
 When set, EdgeIndex is an index of an edge in the mesh's edge list.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EdgeIndex { get; }
Public ReadOnly Property EdgeIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace