RhinoCommon API
ArchivableDictionary.ParentUserData Property
 If this dictionary is part of userdata (or is a UserDictionary), then this is the parent user data. null if this dictionary is not part of userdata
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserData ParentUserData { get; }
Public ReadOnly Property ParentUserData As UserData
	Get
Property Value
Type: UserData
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace