RhinoCommon API
RealtimeDisplayMode.LinearWorkflow Property
 Returns the LinearWorkflow data for this realitime display mode.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LinearWorkflow LinearWorkflow { get; }
Public ReadOnly Property LinearWorkflow As LinearWorkflow
	Get
Property Value
Type: LinearWorkflow
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace