RhinoCommon API
Vector3f.IsValid Property
 Returns an indication regarding the validity of this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace