RhinoCommon API
Utilities.ShowIncompatibleMaterials Property
 Specifies whether incompatible content should be shown in the corresponding editor.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowIncompatibleMaterials { get; set; }
Public Shared Property ShowIncompatibleMaterials As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Utilities Class
Rhino.Render Namespace