RhinoCommon API
CullObjectEventArgs.RhinoObjectSerialNumber Property
 Gets the rhino object runtime serial number.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RhinoObjectSerialNumber { get; }
Public ReadOnly Property RhinoObjectSerialNumber As UInteger
	Get
Property Value
Type: UInt32
The rhino object serial number.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace