RhinoCommon API
AnnotationObjectBase.AnnotationGeometry Property
 Get the annotation base geometry for this object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AnnotationBase AnnotationGeometry { get; }
Public ReadOnly Property AnnotationGeometry As AnnotationBase
	Get
Property Value
Type: AnnotationBase
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
AnnotationObjectBase Class
Rhino.DocObjects Namespace