RhinoCommon SDK
RhinoViewport.DisplayMode Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.DisplayMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayModeDescription DisplayMode { get; set; }
Public Property DisplayMode As DisplayModeDescription
	Get
	Set
Property Value
Type: DisplayModeDescription
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace