RhinoCommon SDK
RenderWindowClonedEventArgs.OldRenderWindow Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.OldRenderWindow"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow OldRenderWindow { get; }
Public ReadOnly Property OldRenderWindow As RenderWindow
	Get
Property Value
Type: RenderWindow
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace