RhinoCommon API
ClassArrayObjRef.Count Property
 Gets the number of CRhinoObjRef instances in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ClassArrayObjRef Class
Rhino.Runtime.InteropWrappers Namespace