RhinoCommon API
Dimension.AlternateBelowLine Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AlternateBelowLine"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AlternateBelowLine { get; set; }
Public Property AlternateBelowLine As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Dimension Class
Rhino.Geometry Namespace