RhinoCommon API
CurvatureAnalysisSettingsState.MinRadiusRange Property
 Gets or sets the Minimum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval MinRadiusRange { get; set; }
Public Property MinRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace