RhinoCommon API
GumballAppearanceSettings.TranslateZEnabled Property
 TranslateZEnabled is true, the Z axis translation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TranslateZEnabled { get; set; }
Public Property TranslateZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace