RhinoCommon API
Font.FaceName Property
 Returns Facename
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FaceName { get; }
Public ReadOnly Property FaceName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Font Class
Rhino.DocObjects Namespace