RhinoCommon API
AngularDimensionObject.AngularDimensionGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AngularDimension AngularDimensionGeometry { get; }
Public ReadOnly Property AngularDimensionGeometry As AngularDimension
	Get
Property Value
Type: AngularDimension
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
AngularDimensionObject Class
Rhino.DocObjects Namespace