RhinoCommon SDK
File3dm.AllDimStyles Property
 Dimension Styles in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmDimStyleTable AllDimStyles { get; }
Public ReadOnly Property AllDimStyles As File3dmDimStyleTable
	Get
Property Value
Type: File3dmDimStyleTable
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace