RhinoCommon API
ICurrentEnvironment_Get.ForLighting Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment_Get.ForLighting"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RenderEnvironment ForLighting { get; }
ReadOnly Property ForLighting As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace