RhinoCommon SDK
RenderContentEventArgs.Content Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentEventArgs.Content"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent Content { get; }
Public ReadOnly Property Content As RenderContent
	Get
Property Value
Type: RenderContent
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace