RhinoCommon API
StringParserSettings.ParseSurveyorsNotation Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSurveyorsNotation"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseSurveyorsNotation { get; set; }
Public Property ParseSurveyorsNotation As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace