RhinoCommon SDK
GetLine.FirstPointPrompt Property
Prompt when getting first point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string FirstPointPrompt { get; set; }
Public Property FirstPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace