RhinoCommon API
FileReference.FullPathStatus Property
 Gets the file reference status.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileReferenceStatus FullPathStatus { get; }
Public ReadOnly Property FullPathStatus As FileReferenceStatus
	Get
Property Value
Type: FileReferenceStatus
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileReference Class
Rhino.FileIO Namespace