RhinoCommon API
RhinoDoc.IsClosing Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsClosing"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsClosing { get; }
Public ReadOnly Property IsClosing As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoDoc Class
Rhino Namespace