RhinoCommon API
Point3dList.Z Property
 Returns an indexer with all Z coordinates in this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList.ZAccess Z { get; }
Public ReadOnly Property Z As Point3dList.ZAccess
	Get
Property Value
Type: Point3dList.ZAccess
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Point3dList Class
Rhino.Collections Namespace