RhinoCommon API
GeometryBase.ObjectType Property
 Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectType ObjectType { get; }
Public ReadOnly Property ObjectType As ObjectType
	Get
Property Value
Type: ObjectType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace