RhinoCommon SDK
Interval.Min Property
 Gets the smaller of T0 and T1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Min { get; }
Public ReadOnly Property Min As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interval Structure
Rhino.Geometry Namespace