RhinoCommon API
ContentUuids.BlendTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BlendTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid BlendTextureType { get; }
Public Shared ReadOnly Property BlendTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ContentUuids Class
Rhino.Render Namespace