RhinoCommon API
Dimension.CentermarkStyle Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.CentermarkStyle"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.CenterMarkStyle CentermarkStyle { get; set; }
Public Property CentermarkStyle As DimensionStyle.CenterMarkStyle
	Get
	Set
Property Value
Type: DimensionStyle.CenterMarkStyle
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Dimension Class
Rhino.Geometry Namespace