RhinoCommon API
ObjectAttributes.UserStringCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.UserStringCount"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace