RhinoCommon SDK
SubDEdgePtr.Next Property
 Links to next edge on this level.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr Next { get; }
Public ReadOnly Property Next As SubDEdgePtr
	Get
Property Value
Type: SubDEdgePtr
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace