RhinoCommon API
CustomRenderContentAttribute.IsHdrCapable Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsHdrCapable"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsHdrCapable { get; set; }
Public Property IsHdrCapable As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace