RhinoCommon API
Particle.Size Property
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.Size"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Size { get; set; }
Public Property Size As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Particle Class
Rhino.Geometry Namespace