RhinoCommon SDK
Leader.LeaderContentAngleStyle Property
 Angle for text of leader text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LeaderContentAngleStyle LeaderContentAngleStyle { get; set; }
Public Property LeaderContentAngleStyle As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Leader Class
Rhino.Geometry Namespace