RhinoCommon API
FileObjWriteOptions.MeshParameters Property
 Mesh parameters to use when meshing geometry that is not already a mesh.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters MeshParameters { get; set; }
Public Property MeshParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace