RhinoCommon API
Light.Direction Property
 Gets or sets the vector direction of the camera.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Direction { get; set; }
Public Property Direction As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Light Class
Rhino.Geometry Namespace