RhinoCommon API
NurbsSurfacePointList.CountU Property
 Gets the number of control points in the U direction of this surface.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CountU { get; }
Public ReadOnly Property CountU As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace