RhinoCommon API
Texture.TextureType Property
 Controls how the pixels in the bitmap are interpreted
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureType TextureType { get; set; }
Public Property TextureType As TextureType
	Get
	Set
Property Value
Type: TextureType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Texture Class
Rhino.DocObjects Namespace