RhinoCommon SDK
ICollapsibleSection.SettingsTag Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.SettingsTag"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
string SettingsTag { get; }
ReadOnly Property SettingsTag As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace