RhinoCommon API
DimensionStyle.DimTextAngleType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimTextAngleType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LeaderContentAngleStyle DimTextAngleType { get; set; }
Public Property DimTextAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace