RhinoCommon API
DocumentOpenEventArgs.FileName Property
 Name of file being opened.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
DocumentOpenEventArgs Class
Rhino Namespace