RhinoCommon API
ComponentFunctionInfo.InputNames Property
 The function input parameter names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IReadOnlyList<string> InputNames { get; }
Public ReadOnly Property InputNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace