RhinoCommon SDK
CreatePreviewEventArgs.Cancel Property
 Get set by Rhino if the preview generation should be canceled for this
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Cancel { get; }
Public ReadOnly Property Cancel As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace