RhinoCommon API
DimensionStyle.ArrowLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ArrowLength { get; set; }
Public Property ArrowLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace