RhinoCommon API
VisualAnalysisMode.ShowIsoCurves Property
 Gets true if this visual analysis mode will show isocuves on shaded surface objects. Often a mode's user interface will provide a way to change this setting.
The default is false.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ShowIsoCurves { get; }
Public Overridable ReadOnly Property ShowIsoCurves As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace