RhinoCommon API
RhinoApp.ToolbarFiles Property
 Collection of currently open toolbar files in the application
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ToolbarFileCollection ToolbarFiles { get; }
Public Shared ReadOnly Property ToolbarFiles As ToolbarFileCollection
	Get
Property Value
Type: ToolbarFileCollection
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoApp Class
Rhino Namespace