RhinoCommon API
RenderSettings.UseViewportSize Property
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseViewportSize { get; set; }
Public Property UseViewportSize As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderSettings Class
Rhino.Render Namespace