RhinoCommon API
LinearWorkflow.PreProcessGamma Property
 Linear workflow gamma
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float PreProcessGamma { get; set; }
Public Property PreProcessGamma As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace