RhinoCommon API
DimensionStyle.TextVerticalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextVerticalAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextVerticalAlignment TextVerticalAlignment { get; set; }
Public Property TextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace