RhinoCommon API
ContentUuids.SimpleBitmapTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.SimpleBitmapTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid SimpleBitmapTextureType { get; }
Public Shared ReadOnly Property SimpleBitmapTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ContentUuids Class
Rhino.Render Namespace