RhinoCommon API
StringParserSettings.ParseCommaAsDigitSeparator Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseCommaAsDigitSeparator"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseCommaAsDigitSeparator { get; set; }
Public Property ParseCommaAsDigitSeparator As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace