RhinoCommon API
File3dmMaterialTable.ComponentType Property
 Returns RenderMaterial.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmMaterialTable Class
Rhino.FileIO Namespace