RhinoCommon SDK
DimensionStyle.AlternateLengthFactor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateLengthFactor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double AlternateLengthFactor { get; set; }
Public Property AlternateLengthFactor As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace