RhinoCommon API
StringParserSettings.ParseCommaAsDecimalPoint Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseCommaAsDecimalPoint"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseCommaAsDecimalPoint { get; set; }
Public Property ParseCommaAsDecimalPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace