RhinoCommon API
MeshObject.IsCustomObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.MeshObject.IsCustomObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCustomObject { get; }
Public ReadOnly Property IsCustomObject As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace