RhinoCommon API
MeshingParameters.RefineAngle Property
 Gets or sets the mesh parameter refine angle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double RefineAngle { get; set; }
Public Property RefineAngle As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace