RhinoCommon API
ComponentStatus.Locked Property
 The locked flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus Locked { get; }
Public Shared ReadOnly Property Locked As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace