RhinoCommon API
RhinoDoc.ModelRelativeTolerance Property
Model space relative tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ModelRelativeTolerance { get; set; }
Public Property ModelRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc Class
Rhino Namespace