RhinoCommon SDK
SubDVertexPtr.Faces Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.Faces"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<SubDFacePtr> Faces { get; }
Public ReadOnly Property Faces As IEnumerable(Of SubDFacePtr)
	Get
Property Value
Type: IEnumerable<SubDFacePtr>
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace