RhinoCommon API
AppearanceSettings.GridXAxisLineColor Property
 Gets or sets the color of the X axis of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color GridXAxisLineColor { get; set; }
Public Shared Property GridXAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace