RhinoCommon SDK
RadialDimension.Type Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.Type"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationType Type { get; set; }
Public Property Type As AnnotationType
	Get
	Set
Property Value
Type: AnnotationType
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace