RhinoCommon SDK
MaterialRef.PlugInId Property
 Identifies a rendering plug-in
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace