RhinoCommon API
TimeZone.Name Property
 Gets name of a time zone.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
TimeZone Class
Rhino.Render Namespace