RhinoCommon SDK
SubDVertexSectorIterator.CurrentEdgeCcwNext Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentEdgeCcwNext"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr CurrentEdgeCcwNext { get; }
Public ReadOnly Property CurrentEdgeCcwNext As SubDEdgePtr
	Get
Property Value
Type: SubDEdgePtr
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace