RhinoCommon API
RhinoApp.CommandHistoryWindowText Property
 Text in Rhino's command history window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string CommandHistoryWindowText { get; }
Public Shared ReadOnly Property CommandHistoryWindowText As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoApp Class
Rhino Namespace