RhinoCommon API
BrepLoop.Brep Property
 Gets the Brep that owns this loop.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace