RhinoCommon API
DynamicObjectTransform.Transform Property
 Transform for the DynamicObject
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DynamicObjectTransform Class
Rhino.Render.ChangeQueue Namespace