RhinoCommon API
MappingChannelCollection.Channels Property
 Enumerate all available channels in this mapping
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<MappingChannel> Channels { get; }
Public ReadOnly Property Channels As IEnumerable(Of MappingChannel)
	Get
Property Value
Type: IEnumerable<MappingChannel>
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
MappingChannelCollection Class
Rhino.Render.ChangeQueue Namespace