RhinoCommon API
ConstructionPlane.ShowZAxis Property
 Gets or sets whether the Z axis of the grid shuld be visible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowZAxis { get; set; }
Public Property ShowZAxis As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace