RhinoCommon SDK
SubDVertexSectorIterator.CurrentFaceFlipped Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentFaceFlipped"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CurrentFaceFlipped { get; }
Public ReadOnly Property CurrentFaceFlipped As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace