RhinoCommon API
Decal.DecalMapping Property
 Gets the mapping of the decal.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DecalMapping DecalMapping { get; }
Public ReadOnly Property DecalMapping As DecalMapping
	Get
Property Value
Type: DecalMapping
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Decal Class
Rhino.Render Namespace