RhinoCommon API
ObjectPropertiesPageEventArgs.ObjectTypes Property
[Missing <summary> documentation for "P:Rhino.UI.ObjectPropertiesPageEventArgs.ObjectTypes"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint ObjectTypes { get; }
Public ReadOnly Property ObjectTypes As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace