RhinoCommon API
DrawObjectEventArgs.DrawObject Property
[Missing <summary> documentation for "P:Rhino.Display.DrawObjectEventArgs.DrawObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawObject { get; set; }
Public Property DrawObject As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace