RhinoCommon SDK
LinetypeTable.ActiveCount Property
 Returns number of linetypes in the linetypes table, excluding deleted linetypes.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace