RhinoCommon API
StringParserSettings.ParseScientificENotation Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseScientificENotation"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseScientificENotation { get; set; }
Public Property ParseScientificENotation As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace