RhinoCommon API
ToolbarFileCollection.Count Property
 Number of open toolbar files
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace