RhinoCommon API
Font.IsSingleStrokeFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsSingleStrokeFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSingleStrokeFont { get; }
Public ReadOnly Property IsSingleStrokeFont As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Font Class
Rhino.DocObjects Namespace