RhinoCommon SDK
ReduceMeshParameters.NormalizeMeshSize Property
If true mesh is fitted to an axis aligned unit cube until reduction is complete
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool NormalizeMeshSize { get; set; }
Public Property NormalizeMeshSize As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace