RhinoCommon API
ContentUuids.CompositeMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.CompositeMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CompositeMaterialType { get; }
Public Shared ReadOnly Property CompositeMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ContentUuids Class
Rhino.Render Namespace