RhinoCommon API
Arc.StartAngleDegrees Property
 Gets or sets the start angle (in Radians) for this arc segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double StartAngleDegrees { get; set; }
Public Property StartAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Arc Structure
Rhino.Geometry Namespace