RhinoCommon SDK
Layer.IsDeleted Property
 Gets a value indicating whether this layer has been deleted and is currently in the Undo buffer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDeleted { get; }
Public ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace