RhinoCommon API
HatchPattern.Description Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Description"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace