RhinoCommon API
SimpleArrayUint.Count Property
 Gets the number of elements in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SimpleArrayUint Class
Rhino.Runtime.InteropWrappers Namespace