RhinoCommon API
DisplayPipelineAttributes.ShowClippingPlanes Property
Show clipping planes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowClippingPlanes { get; set; }
Public Property ShowClippingPlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace