RhinoCommon SDK
DisplayPipelineAttributes.UseCustomObjectColor Property
 Gets whether objects ought to be drawn using a custom color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseCustomObjectColor { get; }
Public ReadOnly Property UseCustomObjectColor As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace