RhinoCommon API
OpenFileDialog.InitialDirectory Property
 Gets or sets the initial directory displayed by the file dialog box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string InitialDirectory { get; set; }
Public Property InitialDirectory As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace