RhinoCommon API
RuiUpdateUi.RadioChecked Property
Set to true to enable menu item or false to check menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RadioChecked { get; set; }
Public Property RadioChecked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace