RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Sheen Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Sheen"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Sheen { get; }
Public Shared ReadOnly Property Sheen As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace