RhinoCommon API
ImageFileEventArgs.EllapsedTime Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.EllapsedTime"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EllapsedTime { get; }
Public ReadOnly Property EllapsedTime As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace