RhinoCommon API
ThumbData.Id Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Id"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace