RhinoCommon API
Font.FamilyName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.FamilyName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FamilyName { get; }
Public ReadOnly Property FamilyName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Font Class
Rhino.DocObjects Namespace