RhinoCommon API
AppearanceSettingsState.ViewportBackgroundColor Property
Gets or sets the viewport background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ViewportBackgroundColor { get; set; }
Public Property ViewportBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace