RhinoCommon API
RenderContent.ChildSlotName Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContent.ChildSlotName"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ChildSlotName { get; set; }
Public Property ChildSlotName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContent Class
Rhino.Render Namespace