RhinoCommon API
CustomGripObject.OriginalLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.OriginalLocation"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d OriginalLocation { get; set; }
Public Property OriginalLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace