RhinoCommon API
Layer.ComponentType Property
 Returns Layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Layer Class
Rhino.DocObjects Namespace