RhinoCommon API
DisplayMaterial.BackSpecular Property
 Gets or sets the Specular color of the back side of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackSpecular { get; set; }
Public Property BackSpecular As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace