RhinoCommon API
ComponentFunctionInfo.IsDefault Property
 Determines if the component is a default one.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDefault { get; }
Public ReadOnly Property IsDefault As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace