RhinoCommon API
DimensionStyle.MaskColorSource Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.MaskColorSource"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.MaskType MaskColorSource { get; set; }
Public Property MaskColorSource As DimensionStyle.MaskType
	Get
	Set
Property Value
Type: DimensionStyle.MaskType
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace