RhinoCommon SDK
ToolbarFile.Path Property
Full path to this file on disk
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace