RhinoCommon API
Fonts.HeadingFont Property
 Returns a font used for dialog headings. 1.2x the size of NormalFont.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Font HeadingFont { get; }
Public Shared ReadOnly Property HeadingFont As Font
	Get
Property Value
Type: Font
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Fonts Class
Rhino.UI Namespace