RhinoCommon API
RhinoGet.AllBitmapFileTypes Property
[Missing <summary> documentation for "P:Rhino.Input.RhinoGet.AllBitmapFileTypes"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RhinoGet.BitmapFileTypes AllBitmapFileTypes { get; }
Public Shared ReadOnly Property AllBitmapFileTypes As RhinoGet.BitmapFileTypes
	Get
Property Value
Type: RhinoGet.BitmapFileTypes
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoGet Class
Rhino.Input Namespace