RhinoCommon API
DoubleField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DoubleField Class
Rhino.Render.Fields Namespace