RhinoCommon API
Leader.LeaderCurveStyle Property
 The style of the leader curve: polyline or spline
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LeaderCurveStyle LeaderCurveStyle { get; set; }
Public Property LeaderCurveStyle As DimensionStyle.LeaderCurveStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderCurveStyle
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Leader Class
Rhino.Geometry Namespace