RhinoCommon API
GroundPlane.Altitude Property
 Height above world XY plane in model units.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Altitude { get; set; }
Public Property Altitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
GroundPlane Class
Rhino.Render Namespace