RhinoCommon SDK
HatchPattern.Defaults.Hatch1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Hatch1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static HatchPattern Hatch1 { get; }
Public Shared ReadOnly Property Hatch1 As HatchPattern
	Get
Property Value
Type: HatchPattern
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace