RhinoCommon API
Hatch.Plane Property
 Gets or sets the hatch plane
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Hatch Class
Rhino.Geometry Namespace