RhinoCommon API
RhinoObject.Attributes Property
 Gets or sets the object attributes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes Attributes { get; set; }
Public Property Attributes As ObjectAttributes
	Get
	Set
Property Value
Type: ObjectAttributes
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace