RhinoCommon API
RTreeEventArgs.SearchSphere Property
 Sphere bounds used during a search. You can modify the sphere in a search callback to help reduce the bounds to search.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Sphere SearchSphere { get; set; }
Public Property SearchSphere As Sphere
	Get
	Set
Property Value
Type: Sphere
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace