RhinoCommon API
RenderContentChangedEventArgs.OldContent Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentChangedEventArgs.OldContent"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent OldContent { get; }
Public ReadOnly Property OldContent As RenderContent
	Get
Property Value
Type: RenderContent
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContentChangedEventArgs Class
Rhino.Render Namespace