RhinoCommon API
AppearanceSettings.MenuVisible Property
Gets or sets a value that determines if the File menu is visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool MenuVisible { get; set; }
Public Shared Property MenuVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace