RhinoCommon API
ContentUuids.BitmapTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BitmapTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid BitmapTextureType { get; }
Public Shared ReadOnly Property BitmapTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentUuids Class
Rhino.Render Namespace