RhinoCommon SDK
DisplayPipeline.ModelTransformIsIdentity Property
 Gets a value that indicates whether the Model Transform is an Identity transformation.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModelTransformIsIdentity { get; }
Public ReadOnly Property ModelTransformIsIdentity As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace