RhinoCommon SDK
GetPointMouseEventArgs.Viewport Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.Viewport"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace