RhinoCommon API
TextDot.SecondaryText Property
 Gets or sets the secondary text of the textdot.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SecondaryText { get; set; }
Public Property SecondaryText As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
TextDot Class
Rhino.Geometry Namespace