RhinoCommon API
CustomUndoEventArgs.CommandId Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.CommandId"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace