RhinoCommon API
RenderTexture.RenderHashWithoutLocalMapping Property
 Render hash for texture excluding local mapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RenderHashWithoutLocalMapping { get; }
Public ReadOnly Property RenderHashWithoutLocalMapping As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderTexture Class
Rhino.Render Namespace