RhinoCommon API
EventArgs.DataType Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.EventArgs.DataType"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid DataType { get; }
Public ReadOnly Property DataType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
EventArgs Class
Rhino.UI.Controls.DataSource Namespace