RhinoCommon API
LicenseData.ErrorMessage Property
 Error message set by calls to callback functions
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ErrorMessage { get; set; }
Public Property ErrorMessage As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace