RhinoCommon API
RhinoObject.HasSubobjectMaterials Property
 Will be true if the object contains sub object meshes with materials that are different than the top level object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasSubobjectMaterials { get; }
Public ReadOnly Property HasSubobjectMaterials As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace