RhinoCommon API
File3dmNotes.IsVisible Property
 Gets or sets the notes visibility. If the notes are visible, true; false otherwise.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsVisible { get; set; }
Public Property IsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace