RhinoCommon API
GetLine.MidPointPrompt Property
Prompt when getting midpoint
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string MidPointPrompt { get; set; }
Public Property MidPointPrompt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace