RhinoCommon API
PlugInInfo.Phone Property
 Returns the phone number of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Phone { get; }
Public ReadOnly Property Phone As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace