RhinoCommon API
DecalCreateParams.MinV Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MinV"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MinV { get; set; }
Public Property MinV As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace