RhinoCommon API
ISettingsService.SupportsAllUsers Property
 Return true if the settings system supports reading from the AllUsers location prior to the current user section. If this is true any settings read from AllUsers will be marked as read-only at runtime
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool SupportsAllUsers { get; }
ReadOnly Property SupportsAllUsers As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace