RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.NewRenderMaterial Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.NewRenderMaterial"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid NewRenderMaterial { get; }
Public ReadOnly Property NewRenderMaterial As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace