RhinoCommon API
File3dmObjectTable.Count Property
 Returns the total amount of items in the object table, including lights.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace