RhinoCommon API
OptionDouble.InitialValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionDouble.InitialValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double InitialValue { get; }
Public ReadOnly Property InitialValue As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace