RhinoCommon API
TextEntity.MaskEnabled Property
 Determines whether or not to draw a Text Mask
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MaskEnabled { get; set; }
Public Property MaskEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace