RhinoCommon API
ViewportInfo.FrustumMinimumDiameter Property
 Gets the frustum minimum diameter, or the minimum between FrustumWidth and FrustumHeight.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumMinimumDiameter { get; }
Public ReadOnly Property FrustumMinimumDiameter As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace