RhinoCommon API
ViewCaptureSettings.DrawBackgroundBitmap Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawBackgroundBitmap"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawBackgroundBitmap { get; set; }
Public Property DrawBackgroundBitmap As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace