RhinoCommon API
AnimationProperties.RenderPreview Property
 Gets or sets a value indicating whether to capture a frame in preview rendered mode.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RenderPreview { get; set; }
Public Property RenderPreview As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace