RhinoCommon API
Dimension.DimensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.DimensionLineExtension"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DimensionLineExtension { get; set; }
Public Property DimensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Dimension Class
Rhino.Geometry Namespace