RhinoCommon SDK
PageViewSpaceChangeEventArgs.OldActiveDetailId Property
 The id of the previously active detail object. Note, if this id is equal to Guid.Empty, then the active detail object was the page view itself.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid OldActiveDetailId { get; }
Public ReadOnly Property OldActiveDetailId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PageViewSpaceChangeEventArgs Class
Rhino.Display Namespace