RhinoCommon API
VolumeMassProperties.WorldCoordinatesSecondMomentsError Property
 Uncertainty in world coordinates second moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d WorldCoordinatesSecondMomentsError { get; }
Public ReadOnly Property WorldCoordinatesSecondMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace