RhinoCommon SDK
BitmapTable.Item Property
 Conceptually, the bitmap table is an array of bitmaps. The operator[] can be used to get individual bitmaps.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BitmapEntry this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As BitmapEntry
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: BitmapEntry
 Reference to the bitmap. If index is out of range, then null is returned. Note that this reference may become invalid after AddBitmap() is called.
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace