RhinoCommon API
AnimationProperties.ViewportName Property
 Gets or sets the viewport that will be captured.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ViewportName { get; set; }
Public Property ViewportName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace