RhinoCommon SDK
SubD.Level Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubD.Level"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Level { get; }
Public ReadOnly Property Level As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubD Class
Rhino.Geometry Namespace