RhinoCommon API
HiddenLineDrawingObjectCurve.IsValid Property
 Verifies the object is valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace