RhinoCommon API
ICurrentEnvironment.ForBackground Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForBackground"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RenderEnvironment ForBackground { get; set; }
Property ForBackground As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForBackground
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace