RhinoCommon SDK
ObjectAttributes.Name Property
 Gets or sets an object optional text name.
More than one object in a model can have the same name and some objects may have no name.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace