RhinoCommon SDK
TextEntity.MaskUsesViewportColor Property
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MaskUsesViewportColor { get; set; }
Public Property MaskUsesViewportColor As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace