RhinoCommon API
RenderContentEventArgs.EnvironmentUsage Property
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, ReflectionAndRefraction or Skylighting. Since 6.11
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderEnvironment.Usage EnvironmentUsage { get; }
Public ReadOnly Property EnvironmentUsage As RenderEnvironment.Usage
	Get
Property Value
Type: RenderEnvironment.Usage
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace