RhinoCommon SDK
AnnotationBase.GetModelUnits Property
 A delegate that returns the model units.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Func<uint, UnitSystem> GetModelUnits { get; set; }
Public Property GetModelUnits As Func(Of UInteger, UnitSystem)
	Get
	Set
Property Value
Type: Func<UInt32, UnitSystem>
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace