RhinoCommon SDK
SubDEdgeAccess.Count Property
 Gets or sets the number of SubD edges.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
SubDEdgeAccess Class
Rhino.Geometry.Collections Namespace