RhinoCommon API
ContentUuids.BasicEnvironmentCCI Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicEnvironmentCCI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid BasicEnvironmentCCI { get; }
Public Shared ReadOnly Property BasicEnvironmentCCI As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ContentUuids Class
Rhino.Render Namespace