RhinoCommon SDK
GetObject.AlreadySelectedObjectSelect Property
 Allow selecting objects that are already selected. By default, GetObjects() disallows selection of objects that are already selected to avoid putting the same object in the selection set more than once. Calling EnableAlreadySelectedObjectSelect = true overrides that restriction and allows selected objects to be selected and returned by GetObjects. This is useful because, coupled with the return immediately mode of GetObjects(1, -1), it is possible to select a selected object to deselect when the selected objects are being managed outside GetObjects() as in the case of CRhinoPolyEdge::GetEdge().
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AlreadySelectedObjectSelect { get; set; }
Public Property AlreadySelectedObjectSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace