RhinoCommon API
Panels.IconSize Property
 Gets the panel icon size in logical units.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Size IconSize { get; }
Public Shared ReadOnly Property IconSize As Size
	Get
Property Value
Type: Size
The size of the panel icon in logical units.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Panels Class
Rhino.UI Namespace