RhinoCommon API
RhinoViewport.CameraY Property
Gets the "unit up" vector.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CameraY { get; }
Public ReadOnly Property CameraY As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace