RhinoCommon API
ImageFileEventArgs.SessionId Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.SessionId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid SessionId { get; }
Public ReadOnly Property SessionId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace