RhinoCommon API
MeshingParameters.GridMaxCount Property
 Gets or sets the maximum number of grid quads in the initial sampling grid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GridMaxCount { get; set; }
Public Property GridMaxCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace