RhinoCommon SDK
RhinoReplaceObjectEventArgs.NewRhinoObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoReplaceObjectEventArgs.NewRhinoObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject NewRhinoObject { get; }
Public ReadOnly Property NewRhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace