RhinoCommon API
Font.EnglishFamilyName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.EnglishFamilyName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishFamilyName { get; }
Public ReadOnly Property EnglishFamilyName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Font Class
Rhino.DocObjects Namespace