RhinoCommon API
RhinoView.TitleVisible Property
 Visibility of the viewport title window.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TitleVisible { get; set; }
Public Property TitleVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoView Class
Rhino.Display Namespace