RhinoCommon API
GripsDrawEventArgs.GripStatusCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatusCount"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GripStatusCount { get; }
Public ReadOnly Property GripStatusCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace