RhinoCommon API
DimensionStyle.LeaderTextOrientation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderTextOrientation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextOrientation LeaderTextOrientation { get; set; }
Public Property LeaderTextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace