RhinoCommon API
RealtimeDisplayMode.DrawMiddlegroundEventArgs.Pipeline Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.DrawMiddlegroundEventArgs.Pipeline"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipeline Pipeline { get; }
Public ReadOnly Property Pipeline As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RealtimeDisplayMode.DrawMiddlegroundEventArgs Class
Rhino.Render Namespace