RhinoCommon SDK
ViewportInfo.FrustumLeft Property
 Gets the frustum left value. This is -right if the frustum has a vertical symmetry axis.
This number is usually negative.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumLeft { get; }
Public ReadOnly Property FrustumLeft As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace