RhinoCommon API
Dimension.SuppressExtension1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.SuppressExtension1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuppressExtension1 { get; set; }
Public Property SuppressExtension1 As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Dimension Class
Rhino.Geometry Namespace