RhinoCommon API
AnimationProperties.DaysBetweenFrames Property
 Gets or sets the days between captured frames for seasonal sun animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DaysBetweenFrames { get; set; }
Public Property DaysBetweenFrames As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace