RhinoCommon SDK
RealtimeDisplayMode.HudMaxPassesChangedEventArgs.MaxPasses Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.HudMaxPassesChangedEventArgs.MaxPasses"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MaxPasses { get; }
Public ReadOnly Property MaxPasses As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode.HudMaxPassesChangedEventArgs Class
Rhino.Render Namespace