RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Smudge Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Smudge"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Smudge { get; }
Public Shared ReadOnly Property Smudge As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace