RhinoCommon API
IZooClientUtilities.LoggedInUserAvatar Property
 Returns the logged in user's avatar picture. Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Image LoggedInUserAvatar { get; }
ReadOnly Property LoggedInUserAvatar As Image
	Get
Property Value
Type: Image
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
IZooClientUtilities Interface
Rhino.Runtime Namespace