RhinoCommon API
GetTransform.ObjectList Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.ObjectList"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TransformObjectList ObjectList { get; }
Public ReadOnly Property ObjectList As TransformObjectList
	Get
Property Value
Type: TransformObjectList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace