RhinoCommon API
DimensionStyle.FontIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FontIndex"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FontIndex { get; set; }
Public Property FontIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace