RhinoCommon API
GetCylinder.BothSidesOption Property
 Determine if the "both sides" option is enabled
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool BothSidesOption { get; set; }
Public Property BothSidesOption As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace