RhinoCommon API
DisplayBitmapDrawList.BoundingBox Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayBitmapDrawList.BoundingBox"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace