RhinoCommon SDK
MeshDisplacementInfo.ChannelNumber Property
 Mapping channel number for the displacement mapping.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ChannelNumber { get; set; }
Public Property ChannelNumber As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace