RhinoCommon API
DimensionStyle.DrawForward Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DrawForward"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawForward { get; set; }
Public Property DrawForward As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace