RhinoCommon API
RenderMaterial.SmellsLikeTexturedGlass Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedGlass"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeTexturedGlass { get; }
Public ReadOnly Property SmellsLikeTexturedGlass As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace