RhinoCommon API
AnimationProperties.TargetPathId Property
 Gets or sets the object ID of the target path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid TargetPathId { get; set; }
Public Property TargetPathId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace