RhinoCommon SDK
PatchGetter.SCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.PatchGetter.SCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int SCount { get; }
Public ReadOnly Property SCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PatchGetter Class
Rhino.Geometry Namespace