RhinoCommon API
ArchivableDictionary.Values Property
Gets all values in this dictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object[] Values { get; }
Public ReadOnly Property Values As Object()
	Get
Property Value
Type: Object[]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace