RhinoCommon API
RenderContent.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContent.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContent Class
Rhino.Render Namespace