RhinoCommon API
DisplayModeDescription.WireframePipelineRequired Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.WireframePipelineRequired"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WireframePipelineRequired { get; set; }
Public Property WireframePipelineRequired As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace