RhinoCommon API
LinetypeTable.ByParentLinetypeName Property
 Returns the text name of the byparent linetype.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ByParentLinetypeName { get; }
Public ReadOnly Property ByParentLinetypeName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace