RhinoCommon API
ZooClientParameters.ProductPath Property
 Path to the application calling ZooClient
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ProductPath { get; }
Public ReadOnly Property ProductPath As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace