RhinoCommon API
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs.Attributes Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs.Attributes"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes Attributes { get; }
Public ReadOnly Property Attributes As DisplayPipelineAttributes
	Get
Property Value
Type: DisplayPipelineAttributes
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs Class
Rhino.Render Namespace