RhinoCommon API
Rectangle3d.Y Property
 Gets or sets the dimensions of the rectangle along the base plane Y-Axis (i.e. the height).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval Y { get; set; }
Public Property Y As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace