RhinoCommon API
VisualAnalysisMode.Style Property
 Gets the visual analysis mode style.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract VisualAnalysisMode.AnalysisStyle Style { get; }
Public MustOverride ReadOnly Property Style As VisualAnalysisMode.AnalysisStyle
	Get
Property Value
Type: VisualAnalysisMode.AnalysisStyle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace