RhinoCommon API
RhinoDoc.TextureMappingEventArgs.NewMapping Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.TextureMappingEventArgs.NewMapping"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureMapping NewMapping { get; }
Public ReadOnly Property NewMapping As TextureMapping
	Get
Property Value
Type: TextureMapping
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace