RhinoCommon API
Texture.TextureCombineMode Property
 Determines how this texture is combined with others in a material's texture list.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureCombineMode TextureCombineMode { get; set; }
Public Property TextureCombineMode As TextureCombineMode
	Get
	Set
Property Value
Type: TextureCombineMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Texture Class
Rhino.DocObjects Namespace