RhinoCommon API
AnnotationBase.FormatWidth Property
 Text format width (Wrapping rectangle)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FormatWidth { get; set; }
Public Property FormatWidth As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace