RhinoCommon API
RenderWindow.SessionId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindow.SessionId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid SessionId { get; }
Public ReadOnly Property SessionId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderWindow Class
Rhino.Render Namespace