RhinoCommon API
ViewSettings.RotateCircleIncrement Property
 Gets or sets the rotation increment.
When the user rotates a view with the keyboard, Rhino rotates the view in steps. The usual step is 1/60th of a circle, which equals six degrees.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int RotateCircleIncrement { get; set; }
Public Shared Property RotateCircleIncrement As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace