RhinoCommon SDK
SubDVertexDirPair.Flipped Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexDirPair.Flipped"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Flipped { get; }
Public ReadOnly Property Flipped As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDVertexDirPair Structure
Rhino.Geometry Namespace