RhinoCommon SDK
Brep.Curves2D Property
 Parameter space trimming curves (used by trims)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepCurveList Curves2D { get; }
Public ReadOnly Property Curves2D As BrepCurveList
	Get
Property Value
Type: BrepCurveList
See Also
Reference
Brep Class
Rhino.Geometry Namespace