RhinoCommon API
Skin.Settings Property
 Gets access to the skin persistent settings.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PersistentSettings Settings { get; }
Public ReadOnly Property Settings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Skin Class
Rhino.Runtime Namespace