RhinoCommon API
GumballAppearanceSettings.RotateXEnabled Property
 When RotateX is true, the X rotation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RotateXEnabled { get; set; }
Public Property RotateXEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace