RhinoCommon API
RenderContentSerializer.CanWrite Property
 If true then the file type can be exported and will be included in the file save box when exporting the specified render content type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CanWrite { get; }
Public ReadOnly Property CanWrite As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace