RhinoCommon SDK
Surface.IsSolid Property
 Gets a values indicating whether a surface is solid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool IsSolid { get; }
Public Overridable ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Surface Class
Rhino.Geometry Namespace