RhinoCommon API
InstanceDefinition.UpdateType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.UpdateType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinitionUpdateType UpdateType { get; }
Public ReadOnly Property UpdateType As InstanceDefinitionUpdateType
	Get
Property Value
Type: InstanceDefinitionUpdateType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace