RhinoCommon API
Sun.Vector Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Vector"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Vector { get; }
Public ReadOnly Property Vector As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Sun Class
Rhino.Render Namespace