RhinoCommon API
Circle.Radius Property
 Gets or sets the radius of this circle. Radii should be positive values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Circle Structure
Rhino.Geometry Namespace