RhinoCommon API
SweepOneRail.SweepTolerance Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.SweepTolerance"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SweepTolerance { get; set; }
Public Property SweepTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace