RhinoCommon API
DisplayModeDescription.LocalName Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.LocalName"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace