RhinoCommon API
DisplayRenderSettings.ForceFlatShading Property
 True if flat shading is forced
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ForceFlatShading { get; }
Public ReadOnly Property ForceFlatShading As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace