RhinoCommon API
InstanceDefinition.Description Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.Description"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace