RhinoCommon API
PersistentSettings.ChildKeys Property
 Gets a collection containing the keys in the settings dictionary.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ICollection<string> ChildKeys { get; }
Public ReadOnly Property ChildKeys As ICollection(Of String)
	Get
Property Value
Type: ICollection<String>
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
PersistentSettings Class
Rhino Namespace