RhinoCommon API
RhinoDoc.Layers Property
 Layers in the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LayerTable Layers { get; }
Public ReadOnly Property Layers As LayerTable
	Get
Property Value
Type: LayerTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc Class
Rhino Namespace