RhinoCommon API
Layer.LinetypeIndex Property
 Gets or sets the line-type index for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LinetypeIndex { get; set; }
Public Property LinetypeIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Layer Class
Rhino.DocObjects Namespace