RhinoCommon API
BrepSurfaceList.Count Property
 Gets the number of surfaces in a brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BrepSurfaceList Class
Rhino.Geometry.Collections Namespace