RhinoCommon API
RhinoApp.LicenseExpires Property
 Returns true if the license will expire false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool LicenseExpires { get; }
Public Shared ReadOnly Property LicenseExpires As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoApp Class
Rhino Namespace