RhinoCommon API
LinetypeTable.CurrentLinetypeIndex Property
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. If the current linetype source is LinetypeFromLayer the object's layer's linetype is used instead.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CurrentLinetypeIndex { get; }
Public ReadOnly Property CurrentLinetypeIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace