RhinoCommon API
RhinoDoc.ModelBasepoint Property
 The base point in the model that is used when inserting the model into another as a block definition. By default the base point in any model is 0,0,0.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ModelBasepoint { get; set; }
Public Property ModelBasepoint As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoDoc Class
Rhino Namespace