RhinoCommon API
MeshExtruder.Transform Property
 Transform of extrusion
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace