RhinoCommon API
RenderPrimitive.RenderMaterial Property
 The RenderMaterial associated with this mesh or null if there is not one.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterial RenderMaterial { get; }
Public ReadOnly Property RenderMaterial As RenderMaterial
	Get
Property Value
Type: RenderMaterial
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace