RhinoCommon SDK
SubD.Edges Property
 Gets access to edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgeAccess Edges { get; }
Public ReadOnly Property Edges As SubDEdgeAccess
	Get
Property Value
Type: SubDEdgeAccess
See Also
Reference
SubD Class
Rhino.Geometry Namespace