RhinoCommon API
RhinoApp.CommandLineTextWriter.Encoding Property
 Returns Encoding Unicode.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Encoding Encoding { get; }
Public Overrides ReadOnly Property Encoding As Encoding
	Get
Property Value
Type: Encoding
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Rhino Namespace