RhinoCommon SDK
SubDEdgeAccess.First Property
[Missing <summary> documentation for "P:Rhino.Geometry.Collections.SubDEdgeAccess.First"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr First { get; }
Public ReadOnly Property First As SubDEdgePtr
	Get
Property Value
Type: SubDEdgePtr
See Also
Reference
SubDEdgeAccess Class
Rhino.Geometry.Collections Namespace