RhinoCommon API
ViewCaptureSettings.IsValid Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.IsValid"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace