RhinoCommon API
GetPointMouseEventArgs.MiddleButtonDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.MiddleButtonDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MiddleButtonDown { get; }
Public ReadOnly Property MiddleButtonDown As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace