RhinoCommon API
File3dm.HistoryRecords Property
 History records stored in this file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmHistoryRecordTable HistoryRecords { get; }
Public ReadOnly Property HistoryRecords As File3dmHistoryRecordTable
	Get
Property Value
Type: File3dmHistoryRecordTable
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
File3dm Class
Rhino.FileIO Namespace