RhinoCommon API
RhinoObject.NextRuntimeSerialNumber Property
 Gets the runtime serial number that will be assigned to the next Rhino Object that is created.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static uint NextRuntimeSerialNumber { get; }
Public Shared ReadOnly Property NextRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace