RhinoCommon SDK
Light.IsSunLight Property
 Gets a value indicating whether this object is a Sun light.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSunLight { get; }
Public ReadOnly Property IsSunLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace