RhinoCommon API
RhinoView.RuntimeSerialNumber Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoView.RuntimeSerialNumber"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoView Class
Rhino.Display Namespace