RhinoCommon API
AppearanceSettings.ShowCrosshairs Property
Gets or sets a value that determines if cross hairs are visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowCrosshairs { get; set; }
Public Shared Property ShowCrosshairs As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace