RhinoCommon API
DisplayMaterial.BackEmission Property
 Gets or sets the Emissive color of the back side of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackEmission { get; set; }
Public Property BackEmission As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace