RhinoCommon API
ICurrentEnvironment.ForAnyUsage Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForAnyUsage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RenderEnvironment ForAnyUsage { set; }
WriteOnly Property ForAnyUsage As RenderEnvironment
	Set
Property Value
Type: RenderEnvironment
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace