RhinoCommon API
PythonScript.ScriptContextCommand Property
 Command associated with this script. Used for localiation
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Command ScriptContextCommand { get; set; }
Public Property ScriptContextCommand As Command
	Get
	Set
Property Value
Type: Command
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace