RhinoCommon API
DisplayMaterial.BackAmbient Property
 Gets or sets the Ambient color of the back side of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackAmbient { get; set; }
Public Property BackAmbient As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace