RhinoCommon API
SimulatedTexture.Repeating Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Repeating"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Repeating { get; set; }
Public Property Repeating As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace