RhinoCommon SDK
StackedDialogPage.Modified Property
[Missing <summary> documentation for "P:Rhino.UI.StackedDialogPage.Modified"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Modified { get; set; }
Public Property Modified As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace