RhinoCommon API
ObjectPropertiesPageEventArgs.Objects Property
 Return a list of Rhino objects to be processed by this object properties page
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] Objects { get; }
Public ReadOnly Property Objects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace