RhinoCommon API
NurbsCurvePointList.Count Property
 Gets the number of control points in this curve.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace