RhinoCommon API
FileObjWriteOptions.CreateNgons Property
 Setting to enable/diable the creation of ngons for the output
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CreateNgons { get; set; }
Public Property CreateNgons As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace