RhinoCommon API
CommandLineOption.LocalName Property
 The localized command option name
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace