RhinoCommon API
FileWriteOptions.WriteGeometryOnly Property
 If true, the file written should include only geometry File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WriteGeometryOnly { get; set; }
Public Property WriteGeometryOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace