RhinoCommon API
PlugInInfo.Country Property
 Returns the country of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Country { get; }
Public ReadOnly Property Country As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace