RhinoCommon API
ICollapsibleSection.ViewModel Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.ViewModel"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IRdkViewModel ViewModel { get; }
ReadOnly Property ViewModel As IRdkViewModel
	Get
Property Value
Type: IRdkViewModel
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace