RhinoCommon API
RadialDimension.TextLocation Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.TextLocation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override DimensionStyle.TextLocation TextLocation { get; set; }
Public Overrides Property TextLocation As DimensionStyle.TextLocation
	Get
	Set
Property Value
Type: DimensionStyle.TextLocation
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace