RhinoCommon API
MeshInstance.RenderMaterial Property
 RenderMaterial associated with mesh instance
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterial RenderMaterial { get; }
Public ReadOnly Property RenderMaterial As RenderMaterial
	Get
Property Value
Type: RenderMaterial
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace