RhinoCommon API
Point3f.Origin Property
 Gets the value of a point at location 0,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3f Origin { get; }
Public Shared ReadOnly Property Origin As Point3f
	Get
Property Value
Type: Point3f
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace