RhinoCommon SDK
BinaryArchiveFile.Writer Property
[Missing <summary> documentation for "P:Rhino.FileIO.BinaryArchiveFile.Writer"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BinaryArchiveWriter Writer { get; }
Public ReadOnly Property Writer As BinaryArchiveWriter
	Get
Property Value
Type: BinaryArchiveWriter
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace