RhinoCommon API
NurbsSurface.OrderU Property
 Gets the order in the U direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int OrderU { get; }
Public ReadOnly Property OrderU As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace