RhinoCommon API
SelCommand.TestGrips Property
[Missing <summary> documentation for "P:Rhino.Commands.SelCommand.TestGrips"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TestGrips { get; set; }
Public Property TestGrips As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
SelCommand Class
Rhino.Commands Namespace