RhinoCommon API
Sun.Altitude Property
 Get the altitude for the sun. To set use SetPosition(azimuth, altitude)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Altitude { get; }
Public ReadOnly Property Altitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Sun Class
Rhino.Render Namespace