RhinoCommon API
RhinoViewport.ViewportType Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.ViewportType"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportType ViewportType { get; }
Public ReadOnly Property ViewportType As ViewportType
	Get
Property Value
Type: ViewportType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace