RhinoCommon API
HiddenLineDrawingObjectCurve.IsProjecting Property
 Returns true if all the non clipped portions of this curve are projecting.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsProjecting { get; }
Public ReadOnly Property IsProjecting As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace