RhinoCommon API
Decal.EndLatitude Property
 Gets the end angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EndLatitude { get; }
Public ReadOnly Property EndLatitude As Double
	Get
Property Value
Type: Double
See Also
Reference
Decal Class
Rhino.Render Namespace