RhinoCommon API
Dimension.BaselineSpacing Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.BaselineSpacing"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double BaselineSpacing { get; set; }
Public Property BaselineSpacing As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Dimension Class
Rhino.Geometry Namespace