RhinoCommon API
AreaMassProperties.WorldCoordinatesProductMoments Property
 Returns the world coordinate product moments if they were able to be calculated. X is integral of "xy dm" over the area Y is integral of "yz dm" over the area Z is integral of "zx dm" over the area.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d WorldCoordinatesProductMoments { get; }
Public ReadOnly Property WorldCoordinatesProductMoments As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace