RhinoCommon API
BoundingBox.Volume Property
 Gets the volume of this BoundingBox.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace