RhinoCommon API
DisplayModeDescription.InMenu Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.InMenu"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InMenu { get; set; }
Public Property InMenu As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace