RhinoCommon API
AppearanceSettingsState.FrameBackgroundColor Property
Gets or sets the frame background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color FrameBackgroundColor { get; set; }
Public Property FrameBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace