RhinoCommon API
EarthAnchorPoint.ModelNorth Property
Earth directions in model coordinates.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d ModelNorth { get; set; }
Public Property ModelNorth As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace