RhinoCommon API
ModelComponent.HasIndex Property
 Returns a value indicating whether the component has an Index.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasIndex { get; }
Public ReadOnly Property HasIndex As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace