RhinoCommon SDK
SubDEdgePtr.SectorCoefficientFrom Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.SectorCoefficientFrom"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double SectorCoefficientFrom { get; set; }
Public Property SectorCoefficientFrom As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace