RhinoCommon API
AnimationProperties.StartYear Property
 Gets or sets the start year for seasonal/one day sun animation in the range 1800 to 2199.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int StartYear { get; set; }
Public Property StartYear As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace