RhinoCommon API
DisplayModeChangedEventArgs.OldDisplayModeId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeChangedEventArgs.OldDisplayModeId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid OldDisplayModeId { get; }
Public ReadOnly Property OldDisplayModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace