RhinoCommon API
ICollapsibleSectionHolder.BottomMargin Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.BottomMargin"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
int BottomMargin { get; set; }
Property BottomMargin As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace