RhinoCommon API
Light.Data Property
 Get the actual light data
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light Data { get; }
Public ReadOnly Property Data As Light
	Get
Property Value
Type: Light
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Light Class
Rhino.Render.ChangeQueue Namespace