RhinoCommon API
Sun.DaylightSavingMinutes Property
Daylight saving minutes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DaylightSavingMinutes { get; set; }
Public Property DaylightSavingMinutes As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Sun Class
Rhino.Render Namespace