RhinoCommon API
AnimationProperties.Latitude Property
 Gets or sets the latitude for sun animations in the range of -90 to +90.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Latitude { get; set; }
Public Property Latitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace