RhinoCommon SDK
Vector3d.IsValid Property
 Gets a value indicating whether this vector is valid. A valid vector must be formed of valid component values for x, y and z.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace