RhinoCommon API
LayerTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer OldState { get; }
Public ReadOnly Property OldState As Layer
	Get
Property Value
Type: Layer
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace