RhinoCommon SDK
Thumbnail.CppPointer Property
 Thumbnail c++ pointer
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
Thumbnail Class
Rhino.UI.Controls Namespace