RhinoCommon API
ViewSettingsState.RotateToView Property
 Gets or sets the rotation reference.
If true, then the views rotates relative to the view axes; false, than relative to the world x, y, and z axes.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RotateToView { get; set; }
Public Property RotateToView As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace