RhinoCommon API
DimensionStyle.DimensionLengthDisplay Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimensionLengthDisplay"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LengthDisplay DimensionLengthDisplay { get; set; }
Public Property DimensionLengthDisplay As DimensionStyle.LengthDisplay
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplay
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace