RhinoCommon API
BitmapTable.Document Property
Gets the document that owns this bitmap table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace