RhinoCommon API
ConstructionPlane.ThinLineColor Property
 Gets or sets the color of the thinner, less prominent line.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ThinLineColor { get; set; }
Public Property ThinLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace