RhinoCommon API
FileSettings.HelpFilePath Property
 Gets the Rhino help file path.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string HelpFilePath { get; }
Public Shared ReadOnly Property HelpFilePath As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace