RhinoCommon API
RhinoApp.Rhino2Id Property
Gets the ID of Rhino 2.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Rhino2Id { get; }
Public Shared ReadOnly Property Rhino2Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoApp Class
Rhino Namespace