RhinoCommon SDK
DetailView.PageToModelRatio Property
 Gets the page units/model units quotient.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PageToModelRatio { get; }
Public ReadOnly Property PageToModelRatio As Double
	Get
Property Value
Type: Double
See Also
Reference
DetailView Class
Rhino.Geometry Namespace