RhinoCommon API
RenderEnvironment.TextureChildSlotName Property
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironment.TextureChildSlotName"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string TextureChildSlotName { get; }
Public ReadOnly Property TextureChildSlotName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace