RhinoCommon API
Box.Empty Property
 Empty Box. Empty boxes are considered to be invalid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Box Empty { get; }
Public Shared ReadOnly Property Empty As Box
	Get
Property Value
Type: Box
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Box Structure
Rhino.Geometry Namespace