RhinoCommon API
StringParserSettings.ParseDivision Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseDivision"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseDivision { get; set; }
Public Property ParseDivision As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace