RhinoCommon SDK
Mesh.SingleMapping Property
 Get texture mapping info as single mapping
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MappingChannel SingleMapping { get; }
Public ReadOnly Property SingleMapping As MappingChannel
	Get
Property Value
Type: MappingChannel
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace