RhinoCommon API
SelCommand.TestLights Property
[Missing <summary> documentation for "P:Rhino.Commands.SelCommand.TestLights"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TestLights { get; set; }
Public Property TestLights As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
SelCommand Class
Rhino.Commands Namespace