RhinoCommon API
RenderContentSerializer.LocalDescription Property
 Localized plug-in description
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string LocalDescription { get; }
Public Overridable ReadOnly Property LocalDescription As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace