RhinoCommon API
CommandEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.Commands.CommandEventArgs.Document"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace