RhinoCommon API
Quaternion.B Property
 Gets or sets the first imaginary coefficient of the quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double B { get; set; }
Public Property B As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace