RhinoCommon API
DisplayPipelineAttributes.RealtimeDisplayId Property
 Get the ID of the realtime display engine attached to the view. This will be Guid.Empty if no realtime display engine is in use. This can be the case for instance when starting a _Render session for a realtime viewport integration. That still would cause this ID to be Guid.Empty.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RealtimeDisplayId { get; }
Public ReadOnly Property RealtimeDisplayId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace