RhinoCommon SDK
ImageFileEventArgs.Event Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.Event"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ImageFileEvent Event { get; }
Public ReadOnly Property Event As ImageFileEvent
	Get
Property Value
Type: ImageFileEvent
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace