RhinoCommon API
MeshPoint.Point Property
 Gets the location (position) of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace