RhinoCommon API
GetArc.DefaultRadius Property
 Default radius used for start and end radius
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DefaultRadius { get; set; }
Public Property DefaultRadius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace