RhinoCommon API
SmartTrackSettingsState.ActivationDelayMilliseconds Property
Gets or sets the activation delay in milliseconds.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ActivationDelayMilliseconds { get; set; }
Public Property ActivationDelayMilliseconds As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace