RhinoCommon API
IWindow.Caption Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Caption"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
LocalizeStringPair Caption { get; }
ReadOnly Property Caption As LocalizeStringPair
	Get
Property Value
Type: LocalizeStringPair
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace