RhinoCommon API
Sun.ManualControl Property
Set angles directly or use place/date/time
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ManualControl { get; set; }
Public Property ManualControl As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Sun Class
Rhino.Render Namespace