RhinoCommon API
DimensionStyle.TextUnderlined Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextUnderlined"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TextUnderlined { get; set; }
Public Property TextUnderlined As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace