RhinoCommon API
CollapsibleSectionViewModel.CppPointer Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.CollapsibleSectionViewModel.CppPointer"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Implements
IHasCppImplementation.CppPointer
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace