RhinoCommon API
Dimension.ArrowBlockId2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowBlockId2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ArrowBlockId2 { get; set; }
Public Property ArrowBlockId2 As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Dimension Class
Rhino.Geometry Namespace