RhinoCommon SDK
ThumbData.Type Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Type"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Type { get; set; }
Public Property Type As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace