RhinoCommon SDK
CreatePreviewEventArgs.Quality Property
 Quality of the preview image that is being requested for the preview scene
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewSceneQuality Quality { get; }
Public ReadOnly Property Quality As PreviewSceneQuality
	Get
Property Value
Type: PreviewSceneQuality
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace