RhinoCommon API
RhinoViewport.IsValidCamera Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsValidCamera"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValidCamera { get; }
Public ReadOnly Property IsValidCamera As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace