RhinoCommon API
ModelAidSettings.ControlPolygonDisplayDensity Property
Gets or sets the control polygon display density.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int ControlPolygonDisplayDensity { get; set; }
Public Shared Property ControlPolygonDisplayDensity As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace