RhinoCommon SDK
ProviderIds.CustomRenderSizes Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.CustomRenderSizes"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid CustomRenderSizes { get; }
Public Shared ReadOnly Property CustomRenderSizes As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace