RhinoCommon API
DimensionStyle.ZeroSuppress Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ZeroSuppress"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ZeroSuppression ZeroSuppress { get; set; }
Public Property ZeroSuppress As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace