RhinoCommon API
DisplayPipelineAttributes.RealtimeRenderPasses Property
 Get or set the realtime passes amount
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RealtimeRenderPasses { get; set; }
Public Property RealtimeRenderPasses As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace