RhinoCommon API
ComponentFunctionInfo.OutputDescriptions Property
 Grasshopper returns several items in general. This property returns the output descriptions.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IReadOnlyList<string> OutputDescriptions { get; }
Public ReadOnly Property OutputDescriptions As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace