RhinoCommon API
ContentUuids.MarbleTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.MarbleTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid MarbleTextureType { get; }
Public Shared ReadOnly Property MarbleTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ContentUuids Class
Rhino.Render Namespace