RhinoCommon API
VisualAnalysisMode.Id Property
 Gets the visual analysis mode GUID. The Guid is specified with the GuidAttribute applied to the class.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace