RhinoCommon API
ThumbData.Name Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Name"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace