RhinoCommon API
AnimationProperties.FolderName Property
 Gets or sets the location for the saved frames.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FolderName { get; set; }
Public Property FolderName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace