RhinoCommon SDK
MappingTag.Id Property
 Gets or sets a map globally unique identifier.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
MappingTag Class
Rhino.Render Namespace