RhinoCommon API
ClippingPlane.Attributes Property
 Get the ClippingPlaneObject for this clipping plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes Attributes { get; }
Public ReadOnly Property Attributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace