RhinoCommon API
CreatePreviewEventArgs.PreviewContent Property
Note: This API is now obsolete.
 Obsolete, will return always null
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("No one should really know what they are rendering for, just that they should render.")]
public RenderContent PreviewContent { get; }
<ObsoleteAttribute("No one should really know what they are rendering for, just that they should render.")>
Public ReadOnly Property PreviewContent As RenderContent
	Get
Property Value
Type: RenderContent
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.23
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace