RhinoCommon API
Dimension.ToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ToleranceResolution"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ToleranceResolution { get; set; }
Public Property ToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Dimension Class
Rhino.Geometry Namespace