RhinoCommon API
ObjectAttributes.IsDocumentControlled Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.IsDocumentControlled"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool IsDocumentControlled { get; }
Public Overrides ReadOnly Property IsDocumentControlled As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace