RhinoCommon API
Transform.IsAffine Property
 Tests for an affine transformation. An affine transformation can be broken into a linear transformation and a translation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsAffine { get; }
Public ReadOnly Property IsAffine As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform Structure
Rhino.Geometry Namespace