RhinoCommon API
ArchivableDictionary.Version Property
 Gets or sets the version of this ArchivableDictionary.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Version { get; set; }
Public Property Version As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace