RhinoCommon SDK
FileReadOptions.SuppressDialogBoxes Property
 If this parameter is true, it means the command has been run with a '-', meaning you should not ask questions during reading. (no dialogs, no "getters", etc.)
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SuppressDialogBoxes { get; set; }
Public Property SuppressDialogBoxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace