RhinoCommon API
DisplayPipelineAttributes.LocalName Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.LocalName"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace