RhinoCommon API
StringParserSettings.DefaultLengthUnitSystem Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.DefaultLengthUnitSystem"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnitSystem DefaultLengthUnitSystem { get; set; }
Public Property DefaultLengthUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace