RhinoCommon API
ViewCaptureSettings.DrawLockedObjects Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawLockedObjects"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawLockedObjects { get; set; }
Public Property DrawLockedObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace