RhinoCommon API
HiddenLineDrawingObjectCurve.SilhouetteType Property
 The silhouette event type
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SilhouetteType SilhouetteType { get; }
Public ReadOnly Property SilhouetteType As SilhouetteType
	Get
Property Value
Type: SilhouetteType
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace