RhinoCommon SDK
Vector3f.SquareLength Property
 Returns the square length of the vector. This property does not check for the validity of the inputs.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float SquareLength { get; }
Public ReadOnly Property SquareLength As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace