RhinoCommon API
GroupTableEventArgs.GroupIndex Property
 The index of the Group that has changed.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GroupIndex { get; }
Public ReadOnly Property GroupIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace