RhinoCommon API
ViewCaptureSettings.DefaultPrintWidthMillimeters Property
 Line thickness used to print objects with no defined thickness (in mm)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DefaultPrintWidthMillimeters { get; set; }
Public Property DefaultPrintWidthMillimeters As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace