RhinoCommon API
NameHash.MappedCodePoints Property
 Gets the NameHash flags. In some cases = number of mapped code points.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint MappedCodePoints { get; }
Public ReadOnly Property MappedCodePoints As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
NameHash Class
Rhino.FileIO Namespace