RhinoCommon API
GetCircle.InDiameterMode Property
 Determines if the "size" value is reperesenting a radius or diameter
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InDiameterMode { get; set; }
Public Property InDiameterMode As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace