RhinoCommon API
BrepEdge.StartVertex Property
 BrepVertex at start of edge
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertex StartVertex { get; }
Public ReadOnly Property StartVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace