RhinoCommon SDK
RhinoViewport.WallpaperFilename Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperFilename"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string WallpaperFilename { get; }
Public ReadOnly Property WallpaperFilename As String
	Get
Property Value
Type: String
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace