RhinoCommon API
ControlPoint.X Property
 Gets or sets the X coordinate of the control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace