RhinoCommon API
Matrix.IsColumnOrthogonal Property
 Gets a value indicating whether the matrix is column orthogonal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsColumnOrthogonal { get; }
Public ReadOnly Property IsColumnOrthogonal As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Matrix Class
Rhino.Geometry Namespace