RhinoCommon API
InstanceDefinitionGeometry.Url Property
 Gets or sets the URL or hyperlink of the definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Url { get; set; }
Public Property Url As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace