RhinoCommon SDK
ThumbData.TopLevel Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.TopLevel"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TopLevel { get; }
Public ReadOnly Property TopLevel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace