RhinoCommon SDK
SubDVertexSectorIterator.FirstFace Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.FirstFace"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacePtr FirstFace { get; }
Public ReadOnly Property FirstFace As SubDFacePtr
	Get
Property Value
Type: SubDFacePtr
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace