RhinoCommon API
AppearanceSettingsState.GridYAxisLineColor Property
Gets or sets the color of Y axis line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GridYAxisLineColor { get; set; }
Public Property GridYAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace