RhinoCommon API
Material.RefractionGlossiness Property
 Gets or sets the refraction glossiness.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double RefractionGlossiness { get; set; }
Public Property RefractionGlossiness As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Material Class
Rhino.DocObjects Namespace