RhinoCommon API
File3dmSettings.ModelUrl Property
 Gets or sets a Uniform Resource Locator (URL) direction for the model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ModelUrl { get; set; }
Public Property ModelUrl As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace