RhinoCommon API
PreviewAppearance.MetaData Property
 Previewappearance MetaData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MetaData MetaData { get; }
Public ReadOnly Property MetaData As MetaData
	Get
Property Value
Type: MetaData
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace