RhinoCommon API
RenderMaterial.PaintMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PaintMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PaintMaterialGuid { get; }
Public Shared ReadOnly Property PaintMaterialGuid As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace