RhinoCommon SDK
Light.SpotLightShadowIntensity Property
 Gets or sets the spot light shadow intensity.
(ignored for non-spot lights.)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SpotLightShadowIntensity { get; set; }
Public Property SpotLightShadowIntensity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
Light Class
Rhino.Geometry Namespace