RhinoCommon API
PreviewAppearance.CppPointer Property
 Previewappearances c++ pointer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace