RhinoCommon SDK
MeshingParameters.GridAspectRatio Property
 Gets or sets the maximum allowed aspect ratio of sampling quads.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GridAspectRatio { get; set; }
Public Property GridAspectRatio As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace