RhinoCommon SDK
Arc.IsValid Property
 Gets a value indicating whether or not this arc is valid. Detail: Radius>0 and 0<AngleRadians()<=2*Math.Pi.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Return Value
Type: Boolean
true if the arc is valid.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace