RhinoCommon API
Light.Id Property
Gets the ID of this light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Light Class
Rhino.Geometry Namespace