RhinoCommon API
Layer.IsVisible Property
 Gets or sets the visibility of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsVisible { get; set; }
Public Property IsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Layer Class
Rhino.DocObjects Namespace