RhinoCommon API
ObjectPropertiesPage.SupportsSubObjects Property
 If your object properties page supports sub-object selection, you should override this method and return true. This is ignored for view pages. The default implementation returns false.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool SupportsSubObjects { get; }
Public Overridable ReadOnly Property SupportsSubObjects As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace