RhinoCommon SDK
Dimension.ArrowheadType2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowheadType2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ArrowType ArrowheadType2 { get; set; }
Public Property ArrowheadType2 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Dimension Class
Rhino.Geometry Namespace