RhinoCommon SDK
MaterialRefs.IsReadOnly Property
 IDictionary required property, always returns false for this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection<T>.IsReadOnly
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace