RhinoCommon API
DecalCreateParams.Radius Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.Radius"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace