RhinoCommon API
ModelAidSettings.PointDisplay Property
Gets or sets the point display mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static PointDisplayMode PointDisplay { get; set; }
Public Shared Property PointDisplay As PointDisplayMode
	Get
	Set
Property Value
Type: PointDisplayMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace