RhinoCommon API
RhinoApp.InstallationTypeString Property
Gets the type of installation (product edition) of the license or lease.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string InstallationTypeString { get; }
Public Shared ReadOnly Property InstallationTypeString As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoApp Class
Rhino Namespace