RhinoCommon API
ProviderIds.Skylight Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.Skylight"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Skylight { get; }
Public Shared ReadOnly Property Skylight As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace