RhinoCommon API
ViewportInfo.CameraUp Property
 Gets the camera up vector.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CameraUp { get; }
Public ReadOnly Property CameraUp As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace