RhinoCommon API
Vector2d.SquareLength Property
 Returns the square of the length of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SquareLength { get; }
Public ReadOnly Property SquareLength As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace