RhinoCommon API
AppearanceSettings.WorldCoordIconXAxisColor Property
 Gets or sets the color of the world coordinate X axis.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color WorldCoordIconXAxisColor { get; set; }
Public Shared Property WorldCoordIconXAxisColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace