RhinoCommon API
HatchPattern.Defaults.Grid60 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Grid60"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static HatchPattern Grid60 { get; }
Public Shared ReadOnly Property Grid60 As HatchPattern
	Get
Property Value
Type: HatchPattern
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace