RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Anisotropic Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Anisotropic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Anisotropic { get; }
Public Shared ReadOnly Property Anisotropic As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace