RhinoCommon API
Mesh.Mapping Property
 Get the mapping for this mesh.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MappingChannelCollection Mapping { get; }
Public ReadOnly Property Mapping As MappingChannelCollection
	Get
Property Value
Type: MappingChannelCollection
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace