RhinoCommon API
CursorTooltipSettingsState.OsnapPane Property
 Displays the current object snap selection.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool OsnapPane { get; set; }
Public Property OsnapPane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace