RhinoCommon API
File3dmLayerTable.ComponentType Property
 Returns Layer.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace