RhinoCommon API
BrepRegionFaceSide.SurfaceNormalPointsIntoRegion Property
 Gets true if BrepFace's surface normal points into region; false otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SurfaceNormalPointsIntoRegion { get; }
Public ReadOnly Property SurfaceNormalPointsIntoRegion As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace