RhinoCommon SDK
SnapShotsClient.CppPointer Property
[Missing <summary> documentation for "P:Rhino.DocObjects.SnapShots.SnapShotsClient.CppPointer"]
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace