RhinoCommon API
StringParserSettings.ParseHyphenMinusAsNumberDash Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseHyphenMinusAsNumberDash"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseHyphenMinusAsNumberDash { get; set; }
Public Property ParseHyphenMinusAsNumberDash As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace