RhinoCommon SDK
SubDVertexPtr.Edges Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.Edges"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<SubDEdgeDirPair> Edges { get; }
Public ReadOnly Property Edges As IEnumerable(Of SubDEdgeDirPair)
	Get
Property Value
Type: IEnumerable<SubDEdgeDirPair>
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace