RhinoCommon API
ComponentStatus.Hidden Property
 The hidden flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus Hidden { get; }
Public Shared ReadOnly Property Hidden As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace