RhinoCommon API
GroupTableEventArgs.NewState Property
 The Group that has changed.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Group NewState { get; }
Public ReadOnly Property NewState As Group
	Get
Property Value
Type: Group
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace