RhinoCommon API
InstanceDefinitionTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinitionTableEventType EventType { get; }
Public ReadOnly Property EventType As InstanceDefinitionTableEventType
	Get
Property Value
Type: InstanceDefinitionTableEventType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace