RhinoCommon SDK
BrepTrim.TrimIndex Property
 Gets the index of this trim in the Brep.Trims collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TrimIndex { get; }
Public ReadOnly Property TrimIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace