RhinoCommon API
File3dmDimStyleTable.ComponentType Property
 Returns DimStyle.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
File3dmDimStyleTable Class
Rhino.FileIO Namespace