RhinoCommon API
ContentUuids.GraniteTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GraniteTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GraniteTextureType { get; }
Public Shared ReadOnly Property GraniteTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ContentUuids Class
Rhino.Render Namespace