RhinoCommon API
CustomRenderContentAttribute.RenderEngineId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.RenderEngineId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RenderEngineId { get; }
Public ReadOnly Property RenderEngineId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace