RhinoCommon API
AppearanceSettingsState.GridXAxisLineColor Property
Gets or sets the color of X axis line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GridXAxisLineColor { get; set; }
Public Property GridXAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace