RhinoCommon API
Hatch.PatternRotation Property
 Gets or sets the relative rotation of the pattern.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PatternRotation { get; set; }
Public Property PatternRotation As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Hatch Class
Rhino.Geometry Namespace