RhinoCommon API
HatchPattern.Index Property
 Index in the hatch pattern table for this pattern. -1 if not in the table.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace