RhinoCommon API
ToolbarFileCollection.MruSidebarIsVisible Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFileCollection.MruSidebarIsVisible"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool MruSidebarIsVisible { get; set; }
Public Shared Property MruSidebarIsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace