RhinoCommon API
ContentUuids.BasicMaterialCCI Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicMaterialCCI"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid BasicMaterialCCI { get; }
Public Shared ReadOnly Property BasicMaterialCCI As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentUuids Class
Rhino.Render Namespace