RhinoCommon API
DimensionStyle.AlternateLengthResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateLengthResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AlternateLengthResolution { get; set; }
Public Property AlternateLengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace