RhinoCommon SDK
GumballAppearanceSettings.TranslateYEnabled Property
 TranslateYEnabled is true, the Y axis translation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TranslateYEnabled { get; set; }
Public Property TranslateYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace