RhinoCommon API
ToolbarFile.Id Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.Id"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace