RhinoCommon API
SimulatedEnvironment.BackgroundProjection Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedEnvironment.BackgroundProjection"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimulatedEnvironment.BackgroundProjections BackgroundProjection { get; set; }
Public Property BackgroundProjection As SimulatedEnvironment.BackgroundProjections
	Get
	Set
Property Value
Type: SimulatedEnvironment.BackgroundProjections
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace