RhinoCommon SDK
Quaternion.Identity Property
 Returns the (1,0,0,0) quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion Identity { get; }
Public Shared ReadOnly Property Identity As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace