RhinoCommon SDK
ICollapsibleSectionHolder.EmptyText Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.EmptyText"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
string EmptyText { set; }
WriteOnly Property EmptyText As String
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace