RhinoCommon API
ComponentStatus.IsClear Property
 True if every setting is 0 or false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsClear { get; }
Public ReadOnly Property IsClear As Boolean
	Get
Return Value
Type: Boolean
True if the component status is undefined or clear.
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace