RhinoCommon API
GetCone.InDiameterMode Property
 Determines if the "size" value is reperesenting a radius or diameter
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InDiameterMode { get; set; }
Public Property InDiameterMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace