RhinoCommon SDK
AnnotationBase.TextFormula Property
 See RichText
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string TextFormula { get; set; }
Public Property TextFormula As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace