RhinoCommon API
DisplayMaterial.Ambient Property
 Gets or sets the Ambient color of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Ambient { get; set; }
Public Property Ambient As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.3
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace