RhinoCommon SDK
MeshTextureCoordinateList.Item Property
 Gets or sets the texture coordinate at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2f this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Point2f
	Get
	Set
Parameters
index
Type: System.Int32
Index of texture coordinates to access.
Return Value
Type: Point2f
The texture coordinate at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace