RhinoCommon API
RenderPlugInInfo.PlugInId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderPlugInInfo.PlugInId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid PlugInId { get; set; }
Public Property PlugInId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderPlugInInfo Class
Rhino.Render Namespace