RhinoCommon API
AnnotationBase.Text Property
 Text including additional RTF formatting information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace