RhinoCommon API
GumballAppearanceSettings.MenuEnabled Property
 When MenuEnabled is true, the menu "button" is drawn on the gumball. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MenuEnabled { get; set; }
Public Property MenuEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace