RhinoCommon SDK
SubDFacePtr.IsDefault Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDFacePtr.IsDefault"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsDefault { get; }
Public ReadOnly Property IsDefault As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace