RhinoCommon API
CreatePreviewEventArgs.Viewport Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.Viewport"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Property Value
Type: ViewportInfo
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace