RhinoCommon API
ControlPoint.Y Property
 Gets or sets the Y coordinate of the control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace