RhinoCommon API
RhinoObject.IsValid Property
 Tests an object to see if its data members are correctly initialized.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace