RhinoCommon API
GumballAppearanceSettings.RotateYEnabled Property
 When RotateY is true, the Y rotation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RotateYEnabled { get; set; }
Public Property RotateYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace