RhinoCommon API
File3dm.Layers Property
 Layers in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<Layer> Layers { get; }
Public ReadOnly Property Layers As IList(Of Layer)
	Get
Property Value
Type: IList<Layer>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.23
See Also
Reference
File3dm Class
Rhino.FileIO Namespace