RhinoCommon API
AppearanceSettings.GridThinLineColor Property
 Gets or sets the color of the thin line of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color GridThinLineColor { get; set; }
Public Shared Property GridThinLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace