RhinoCommon API
DimStyleTable.CurrentDimensionStyle Property
 Do not use. Use the Current property.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle CurrentDimensionStyle { get; }
Public ReadOnly Property CurrentDimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.27
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace