RhinoCommon API
Arc.StartAngle Property
 Gets or sets the start angle (in Radians) for this arc segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double StartAngle { get; set; }
Public Property StartAngle As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Arc Structure
Rhino.Geometry Namespace