RhinoCommon API
Circle.Unset Property
 Gets a circle with Unset components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Circle Unset { get; }
Public Shared ReadOnly Property Unset As Circle
	Get
Property Value
Type: Circle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Circle Structure
Rhino.Geometry Namespace