RhinoCommon SDK
SubDVertexSectorIterator.CenterVertex Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CenterVertex"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr CenterVertex { get; }
Public ReadOnly Property CenterVertex As SubDVertexPtr
	Get
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace