RhinoCommon API
DisplayPipeline.IsInViewCapture Property
 Gets a value that indicates whether this pipeline is currently drawing for ViewCaptureToFile or ViewCaptureToClipboard
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsInViewCapture { get; }
Public ReadOnly Property IsInViewCapture As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace