RhinoCommon API
HiddenLineDrawingObject.Geometry Property
 Returns the geometry in world coordinates if UseXform is false. Otherwise, the geometry in object space coordinates is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GeometryBase Geometry { get; }
Public ReadOnly Property Geometry As GeometryBase
	Get
Property Value
Type: GeometryBase
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
HiddenLineDrawingObject Class
Rhino.Geometry Namespace