RhinoCommon API
PersistentSettingsEventArgs<T>.NewValue Property
[Missing <summary> documentation for "P:Rhino.PersistentSettingsEventArgs`1.NewValue"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T NewValue { get; }
Public ReadOnly Property NewValue As T
	Get
Property Value
Type: T
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PersistentSettingsEventArgs<T> Class
Rhino Namespace