RhinoCommon API
GumballAppearanceSettings.ColorY Property
Default is Green.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ColorY { get; set; }
Public Property ColorY As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace