RhinoCommon API
Light.Width Property
 Gets or sets the width in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Width { get; set; }
Public Property Width As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Light Class
Rhino.Geometry Namespace