RhinoCommon API
RenderMaterial.SmellsLikeMetal Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeMetal"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeMetal { get; }
Public ReadOnly Property SmellsLikeMetal As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace