RhinoCommon API
RhinoDoc.RuntimeSerialNumber Property
 Unique serialNumber for the document while the application is running. This is not a persistent value.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc Class
Rhino Namespace