RhinoCommon SDK
SubD.ActiveLevelSubDType Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubD.ActiveLevelSubDType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubD.SubDType ActiveLevelSubDType { get; set; }
Public Property ActiveLevelSubDType As SubD.SubDType
	Get
	Set
Property Value
Type: SubD.SubDType
See Also
Reference
SubD Class
Rhino.Geometry Namespace