RhinoCommon API
Dimension.DetailMeasured Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.DetailMeasured"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid DetailMeasured { get; set; }
Public Property DetailMeasured As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Dimension Class
Rhino.Geometry Namespace