RhinoCommon API
GetObject.InactiveDetailPickEnabled Property
 By default, objects in inactive details are not permitted to be picked. In a few rare cases this is used (ex. picking circles during DimRadius)
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InactiveDetailPickEnabled { get; set; }
Public Property InactiveDetailPickEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace