RhinoCommon API
FileWriteOptions.IncludePreviewImage Property
 The file written should include a preview image if your File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludePreviewImage { get; set; }
Public Property IncludePreviewImage As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace