RhinoCommon API
CurvatureAnalysisSettings.MinRadiusRange Property
 Gets or sets the Minimum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Interval MinRadiusRange { get; set; }
Public Shared Property MinRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace