RhinoCommon API
RhinoApp.VersionControlRevision Property
 McNeel version control revision identifier at the time this version of Rhino was built.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string VersionControlRevision { get; }
Public Shared ReadOnly Property VersionControlRevision As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoApp Class
Rhino Namespace