RhinoCommon API
File3dmNamedConstructionPlanes.Count Property
 Number of named construction planes in the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace