RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsObject Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsObject"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsObject { get; }
Public ReadOnly Property IsObject As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace