RhinoCommon API
HostUtils.RunningInDarkMode Property
 Returns true if the host operating system is in dark mode and Rhino supports dark mode.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RunningInDarkMode { get; }
Public Shared ReadOnly Property RunningInDarkMode As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace