RhinoCommon API
RhinoPageView.ActiveViewportID Property
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Guid ActiveViewportID { get; }
Public Overrides ReadOnly Property ActiveViewportID As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace