RhinoCommon API
CreatePreviewEventArgs.Id Property
Unique Id for this scene.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace