RhinoCommon API
ReduceMeshParameters.Error Property
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.Error"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Error { get; }
Public ReadOnly Property Error As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace