RhinoCommon API
Point4dField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point4d Value { get; set; }
Public Property Value As Point4d
	Get
	Set
Property Value
Type: Point4d
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Point4dField Class
Rhino.Render.Fields Namespace