RhinoCommon API
AnnotationBase.AnnotationType Property
 Type of annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual AnnotationType AnnotationType { get; }
Public Overridable ReadOnly Property AnnotationType As AnnotationType
	Get
Property Value
Type: AnnotationType
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace