RhinoCommon API
DimensionStyle.CenterMarkType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.CenterMarkType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.CenterMarkStyle CenterMarkType { get; set; }
Public Property CenterMarkType As DimensionStyle.CenterMarkStyle
	Get
	Set
Property Value
Type: DimensionStyle.CenterMarkStyle
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace