RhinoCommon API
RenderSettings.TransparentBackground Property
 Gets or sets whether rendering should be done with transparent background.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TransparentBackground { get; set; }
Public Property TransparentBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderSettings Class
Rhino.Render Namespace