RhinoCommon API
Light.IsLinearLight Property
 Gets a value indicating whether the light style is LightStyle WorldLinear.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsLinearLight { get; }
Public ReadOnly Property IsLinearLight As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Light Class
Rhino.Geometry Namespace