RhinoCommon API
LengthValue.LengthString Property
 Return length as a string
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LengthString { get; }
Public ReadOnly Property LengthString As String
	Get
Return Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
LengthValue Class
Rhino Namespace