RhinoCommon API
DisplayPipelineAttributes.BoundingBoxMode Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.BoundingBoxMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes.BoundingBoxDisplayMode BoundingBoxMode { get; set; }
Public Property BoundingBoxMode As DisplayPipelineAttributes.BoundingBoxDisplayMode
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.BoundingBoxDisplayMode
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace