RhinoCommon API
CursorTooltipSettingsState.AutoSuppress Property
 Attempts to display only the most useful tooltip.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AutoSuppress { get; set; }
Public Property AutoSuppress As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace