RhinoCommon API
AppearanceSettings.CurrentLayerBackgroundColor Property
 Gets or sets the color used by the layer manager dialog as the background color for the current layer.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color CurrentLayerBackgroundColor { get; set; }
Public Shared Property CurrentLayerBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace