RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.OpacityIor Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.OpacityIor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string OpacityIor { get; }
Public Shared ReadOnly Property OpacityIor As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace