RhinoCommon API
HatchPattern.Defaults.Grid Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Grid"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static HatchPattern Grid { get; }
Public Shared ReadOnly Property Grid As HatchPattern
	Get
Property Value
Type: HatchPattern
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace