RhinoCommon API
GetCylinder.CylinderConstraint Property
 State of the cone/cyl constraint option. When the cone/cyl option is selected, the circle is being made as a base for a cone/cyl. By default the vertical cone/cyl option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CylinderConstraint CylinderConstraint { get; set; }
Public Property CylinderConstraint As CylinderConstraint
	Get
	Set
Property Value
Type: CylinderConstraint
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace