RhinoCommon API
GetCancel.Token Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCancel.Token"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CancellationToken Token { get; }
Public ReadOnly Property Token As CancellationToken
	Get
Property Value
Type: CancellationToken
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace