RhinoCommon SDK
SubDFaceAccess.First Property
[Missing <summary> documentation for "P:Rhino.Geometry.Collections.SubDFaceAccess.First"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacePtr First { get; }
Public ReadOnly Property First As SubDFacePtr
	Get
Property Value
Type: SubDFacePtr
See Also
Reference
SubDFaceAccess Class
Rhino.Geometry.Collections Namespace