RhinoCommon API
DisplayModeDescription.GhostedId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.GhostedId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GhostedId { get; }
Public Shared ReadOnly Property GhostedId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace