RhinoCommon SDK
AreaMassProperties.CentroidError Property
 Gets the uncertainty in the centroid calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d CentroidError { get; }
Public ReadOnly Property CentroidError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace