RhinoCommon SDK
Line.FromY Property
 Gets or sets the Y coordinate of the line From point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FromY { get; set; }
Public Property FromY As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Line Structure
Rhino.Geometry Namespace