RhinoCommon API
Transform.M01 Property
Gets or sets this[0,1].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M01 { get; set; }
Public Property M01 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Transform Structure
Rhino.Geometry Namespace