RhinoCommon API
Material.UserStringCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.UserStringCount"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Material Class
Rhino.DocObjects Namespace