RhinoCommon SDK
Dimension.LengthFormat Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.LengthFormat"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LengthDisplayFormat LengthFormat { get; set; }
Public Property LengthFormat As DimensionStyle.LengthDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplayFormat
See Also
Reference
Dimension Class
Rhino.Geometry Namespace