RhinoCommon API
AnnotationBase.MaskEnabled Property
 Determines whether or not to draw a Text Mask
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MaskEnabled { get; set; }
Public Property MaskEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace