RhinoCommon API
Color4fField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color4f Value { get; set; }
Public Property Value As Color4f
	Get
	Set
Property Value
Type: Color4f
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace