RhinoCommon API
SmartTrackSettingsState.SmartTangents Property
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmartTangents { get; set; }
Public Property SmartTangents As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace