RhinoCommon SDK
ThumbData.Children Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Children"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public List<ThumbData> Children { get; set; }
Public Property Children As List(Of ThumbData)
	Get
	Set
Property Value
Type: List<ThumbData>
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace