RhinoCommon API
DimensionStyle.AlternateBelowLine Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateBelowLine"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AlternateBelowLine { get; set; }
Public Property AlternateBelowLine As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace