RhinoCommon SDK
PickContext.PickLine Property
 pick chord starts on near clipping plane and ends on far clipping plane.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line PickLine { get; set; }
Public Property PickLine As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace