RhinoCommon API
Transform.M23 Property
Gets or sets this[2,3].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M23 { get; set; }
Public Property M23 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Transform Structure
Rhino.Geometry Namespace