RhinoCommon SDK
RhinoViewport.CameraLocation Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.CameraLocation"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d CameraLocation { get; }
Public ReadOnly Property CameraLocation As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace