RhinoCommon API
LightTable.Count Property
Number of lights in the light table. Does not include Sun or Skylight.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace