RhinoCommon API
HiddenLineDrawingSegment.IsSceneSilhouette Property
 Returns true if this curve is a scene silhoutte.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSceneSilhouette { get; }
Public ReadOnly Property IsSceneSilhouette As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace