RhinoCommon SDK
GroundPlane.Enabled Property
 Determines whether the document ground plane is enabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render Namespace