RhinoCommon SDK
Quaternion.I Property
 Returns the (0,1,0,0) quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion I { get; }
Public Shared ReadOnly Property I As Quaternion
	Get
Property Value
Type: Quaternion
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace