RhinoCommon API
File3dm.LastEditedBy Property
 Gets a string that names the user who last edited the file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LastEditedBy { get; }
Public ReadOnly Property LastEditedBy As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dm Class
Rhino.FileIO Namespace