RhinoCommon API
AnimationProperties.RenderFull Property
 Gets or sets a value indicating whether to capture a frame in rendered mode.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RenderFull { get; set; }
Public Property RenderFull As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace