RhinoCommon API
PlugInInfo.PlugInType Property
 Returns the plug-in type.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PlugInType PlugInType { get; }
Public ReadOnly Property PlugInType As PlugInType
	Get
Property Value
Type: PlugInType
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace