RhinoCommon API
DecalCreateParams.Transparency Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.Transparency"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Transparency { get; set; }
Public Property Transparency As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace