RhinoCommon API
GeneralSettings.UseExtrusions Property
 Should extrusion objects be created for things like cylinders
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UseExtrusions { get; }
Public Shared ReadOnly Property UseExtrusions As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace