RhinoCommon API
RhinoDoc.CustomRenderSizes Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.CustomRenderSizes"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<Size> CustomRenderSizes { get; }
Public ReadOnly Property CustomRenderSizes As List(Of Size)
	Get
Property Value
Type: List<Size>
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoDoc Class
Rhino Namespace