RhinoCommon SDK
SubDVertexPtr.Location Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.Location"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace