RhinoCommon SDK
RenderContent.TypeName Property
 Name for your content type. ie. "My .net Texture"
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract string TypeName { get; }
Public MustOverride ReadOnly Property TypeName As String
	Get
Property Value
Type: String
See Also
Reference
RenderContent Class
Rhino.Render Namespace