RhinoCommon API
ProviderIds.RdkRenderingPostEffectGlare Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkRenderingPostEffectGlare"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RdkRenderingPostEffectGlare { get; }
Public Shared ReadOnly Property RdkRenderingPostEffectGlare As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace