RhinoCommon API
File3dmObject.Attributes Property
 Gets the attributes that are linked with this document object.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes Attributes { get; }
Public ReadOnly Property Attributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace