RhinoCommon API
PanelEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.UI.PanelEventArgs.Document"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace