RhinoCommon API
File3dm.LastEdited Property
 Get the DateTime that this file was last edited. If the value is not set in the 3dm file, then DateTime.MinValue is returned
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DateTime LastEdited { get; }
Public ReadOnly Property LastEdited As DateTime
	Get
Property Value
Type: DateTime
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dm Class
Rhino.FileIO Namespace