RhinoCommon API
StringParserSettings.ParseExplicitFormulaExpression Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseExplicitFormulaExpression"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseExplicitFormulaExpression { get; set; }
Public Property ParseExplicitFormulaExpression As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace