RhinoCommon SDK
File3dm.Revision Property
 Gets or sets the revision number.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Revision { get; set; }
Public Property Revision As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace