RhinoCommon API
LengthValue.ContextLocaleId Property
 returns the context LocaleId from this LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint ContextLocaleId { get; }
Public ReadOnly Property ContextLocaleId As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
LengthValue Class
Rhino Namespace