RhinoCommon API
Analytics.AppName Property
 Name of Application. For example, "Ocelot". Do not include version numbers. Maps to Google Analytics parameter 'an'
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string AppName { get; set; }
Public Property AppName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Analytics Class
Rhino.Runtime Namespace