RhinoCommon API
LinearDimension.DistanceBetweenArrowTips Property
 Gets the distance between arrow tips.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DistanceBetweenArrowTips { get; }
Public ReadOnly Property DistanceBetweenArrowTips As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace