RhinoCommon API
LightObject.LightGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.LightObject.LightGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light LightGeometry { get; }
Public ReadOnly Property LightGeometry As Light
	Get
Property Value
Type: Light
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace