RhinoCommon API
LinearDimension.Aligned Property
 Gets or sets a value indicating whether this annotation is aligned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Aligned { get; set; }
Public Property Aligned As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace