RhinoCommon API
MeshPart.EndFaceIndex Property
End of subinterval of parent mesh face array
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EndFaceIndex { get; }
Public ReadOnly Property EndFaceIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace