RhinoCommon API
Arrowhead.ArrowType Property
 Type of arrowhead used by annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ArrowType ArrowType { get; }
Public ReadOnly Property ArrowType As DimensionStyle.ArrowType
	Get
Property Value
Type: DimensionStyle.ArrowType
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Arrowhead Class
Rhino.Geometry Namespace