RhinoCommon API
RenderMaterial.SmellsLikePlaster Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikePlaster"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikePlaster { get; }
Public ReadOnly Property SmellsLikePlaster As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace