RhinoCommon SDK
NamedConstructionPlaneTable.Document Property
Gets the document that owns this table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace