RhinoCommon API
ReplayHistoryData.HistoryVersion Property
 ReplayHistory overrides check the version number to ensure the information saved in the history record is compatible with the current implementation of ReplayHistory
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int HistoryVersion { get; }
Public ReadOnly Property HistoryVersion As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace