RhinoCommon API
City.TimeZone Property
 Gets time zone of city.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TimeZone { get; }
Public ReadOnly Property TimeZone As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
City Class
Rhino.Render Namespace