RhinoCommon API
PointCloudItem.Y Property
 Gets or sets the Y component of this point cloud item location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace