RhinoCommon API
Transform.M32 Property
Gets or sets this[3,2].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M32 { get; set; }
Public Property M32 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Transform Structure
Rhino.Geometry Namespace