RhinoCommon API
PointCloudItem.Color Property
 Gets or sets the color of this point cloud item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace