RhinoCommon SDK
PatchGetter.XCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.PatchGetter.XCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int XCount { get; }
Public ReadOnly Property XCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PatchGetter Class
Rhino.Geometry Namespace