RhinoCommon API
AppearanceSettings.FrameBackgroundColor Property
 Gets or sets the background color of the frame.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color FrameBackgroundColor { get; set; }
Public Shared Property FrameBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace