RhinoCommon SDK
Skylight.CustomEnvironment Property
[Missing <summary> documentation for "P:Rhino.Render.Skylight.CustomEnvironment"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid CustomEnvironment { get; set; }
Public Property CustomEnvironment As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Skylight Class
Rhino.Render Namespace