RhinoCommon API
Particle.Color Property
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.Color"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Particle Class
Rhino.Geometry Namespace