RhinoCommon API
RadialDimension.LeaderArrowType Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.LeaderArrowType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ArrowType LeaderArrowType { get; set; }
Public Property LeaderArrowType As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace