RhinoCommon API
MeshInstance.MaterialId Property
 The Material CRC / RenderHash
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint MaterialId { get; }
Public ReadOnly Property MaterialId As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace