RhinoCommon SDK
Curve.Degree Property
 Gets the maximum algebraic degree of any span or a good estimate if curve spans are not algebraic.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Degree { get; }
Public ReadOnly Property Degree As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Curve Class
Rhino.Geometry Namespace