RhinoCommon API
Color4f.Black Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.Black"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color4f Black { get; }
Public Shared ReadOnly Property Black As Color4f
	Get
Property Value
Type: Color4f
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Color4f Structure
Rhino.Display Namespace