RhinoCommon API
MeshDisplacementInfo.PostWeldAngle Property
 Specifies the maximum angle between face normals of adjacent faces that will get welded together.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PostWeldAngle { get; set; }
Public Property PostWeldAngle As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace