RhinoCommon API
FileReference.ContentHash Property
 Gets the content hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ContentHash ContentHash { get; }
Public ReadOnly Property ContentHash As ContentHash
	Get
Property Value
Type: ContentHash
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileReference Class
Rhino.FileIO Namespace