RhinoCommon API
Interpolator.Cyclical Property
 Gets or sets a value indicating whether or not the values inside this Interpolator are to be treated as cyclical (i.e. circular).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Cyclical { get; set; }
Public Property Cyclical As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace