RhinoCommon API
ZooClientParameters.SelectedLicenseType Property
 License type selected by default when user is prompted to enter a license key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseTypes SelectedLicenseType { get; set; }
Public Property SelectedLicenseType As LicenseTypes
	Get
	Set
Property Value
Type: LicenseTypes
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace