RhinoCommon API
GripsDrawEventArgs.ControlPolygonStyle Property
 What kind of line is used to display things like control polygons. 0 = no control polygon, 1 = solid control polygon, 2 = dotted control polygon.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ControlPolygonStyle { get; set; }
Public Property ControlPolygonStyle As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace