RhinoCommon API
HiddenLineDrawingSegment.SegmentVisibility Property
 Returns the segment's visibility
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingSegment.Visibility SegmentVisibility { get; }
Public ReadOnly Property SegmentVisibility As HiddenLineDrawingSegment.Visibility
	Get
Property Value
Type: HiddenLineDrawingSegment.Visibility
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace