RhinoCommon API
Cone.ApexPoint Property
Point at tip of the cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ApexPoint { get; }
Public ReadOnly Property ApexPoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Cone Structure
Rhino.Geometry Namespace