RhinoCommon API
RhinoDoc.IsSendingMail Property
 true if Rhino is in the process of sending this document as an email attachment.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSendingMail { get; }
Public ReadOnly Property IsSendingMail As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoDoc Class
Rhino Namespace