RhinoCommon API
ColorCMYK.C Property
 Gets or sets the Cyan channel value. Cyan channels are limited to the 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double C { get; set; }
Public Property C As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace