RhinoCommon API
Notification.Title Property
 The title of the notification. The title is displayed when the notification is displayed modally in Rhino.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
Property Value
Type: String
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace