RhinoCommon API
GripObject.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.Index"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace