RhinoCommon API
Light.LightStyle Property
 Gets or sets a light style on this camera.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LightStyle LightStyle { get; set; }
Public Property LightStyle As LightStyle
	Get
	Set
Property Value
Type: LightStyle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Light Class
Rhino.Geometry Namespace