RhinoCommon API
SmartTrackSettingsState.TanPerpLineColor Property
Gets or sets the tangent and perpendicular line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color TanPerpLineColor { get; set; }
Public Property TanPerpLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace