RhinoCommon API
File3dm.DimStyles Property
 Dimension Styles in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<DimensionStyle> DimStyles { get; }
Public ReadOnly Property DimStyles As IList(Of DimensionStyle)
	Get
Property Value
Type: IList<DimensionStyle>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.23
See Also
Reference
File3dm Class
Rhino.FileIO Namespace