RhinoCommon API
RenderSettings.RenderPoints Property
 Gets or sets a value indicating whether to instruct the rendering engine to show points.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RenderPoints { get; set; }
Public Property RenderPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderSettings Class
Rhino.Render Namespace