RhinoCommon API
GroundPlane.MaterialId Property
 The CRC / RenderHash of the material on this ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint MaterialId { get; }
Public ReadOnly Property MaterialId As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace