RhinoCommon API
Skylight.ShadowIntensity Property
 Get shadow intensity for skylight
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ShadowIntensity { get; }
Public ReadOnly Property ShadowIntensity As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace