RhinoCommon SDK
Color4f.A Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.A"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float A { get; }
Public ReadOnly Property A As Single
	Get
Property Value
Type: Single
See Also
Reference
Color4f Structure
Rhino.Display Namespace