RhinoCommon API
Transform.M31 Property
Gets or sets this[3,1].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M31 { get; set; }
Public Property M31 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Transform Structure
Rhino.Geometry Namespace