RhinoCommon SDK
MeshVertexColorList.Item Property
 Gets or sets the vertex color at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Color
	Get
	Set
Parameters
index
Type: System.Int32
Index of vertex control to access.
Return Value
Type: Color
The vertex color at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace