RhinoCommon API
CustomRenderContentAttribute.ImageBased Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.ImageBased"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ImageBased { get; set; }
Public Property ImageBased As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace