RhinoCommon API
ModelAidSettingsState.ExtendToApparentIntersection Property
Gets or sets the enabled state of Rhino's extend to apparent intersections.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExtendToApparentIntersection { get; set; }
Public Property ExtendToApparentIntersection As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace