RhinoCommon API
RhinoWindow.InvokeRequired Property
 See Control.InvokeRequired
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InvokeRequired { get; }
Public ReadOnly Property InvokeRequired As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoWindow Class
Rhino Namespace