RhinoCommon API
Dimension.TextFormula Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextFormula"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string TextFormula { get; set; }
Public Property TextFormula As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Dimension Class
Rhino.Geometry Namespace