RhinoCommon API
Sun.Azimuth Property
 Get the azimuth for the sun. To set use SetPosition(azimuth, altitude)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Azimuth { get; }
Public ReadOnly Property Azimuth As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Sun Class
Rhino.Render Namespace