RhinoCommon API
ComponentFunctionInfo.DelegateNoWarnings Property
 Returns a delegate that can be directly invoked using a list of arguments. This flattens trees.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Delegate DelegateNoWarnings { get; }
Public ReadOnly Property DelegateNoWarnings As Delegate
	Get
Property Value
Type: Delegate
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace