RhinoCommon SDK
ThumbData.InUse Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.InUse"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool InUse { get; set; }
Public Property InUse As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace