RhinoCommon API
FileSettingsState.AutoSaveEnabled Property
Enables or disables Rhino's automatic file saving mechanism.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AutoSaveEnabled { get; set; }
Public Property AutoSaveEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace