RhinoCommon API
Decal.DecalProjection Property
 Gets the decal's projection. Used only when mapping is planar.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DecalProjection DecalProjection { get; }
Public ReadOnly Property DecalProjection As DecalProjection
	Get
Property Value
Type: DecalProjection
See Also
Reference
Decal Class
Rhino.Render Namespace