RhinoCommon API
ComponentFunctionInfo.InputTypeNames Property
 The function input type names.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IReadOnlyList<string> InputTypeNames { get; }
Public ReadOnly Property InputTypeNames As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace