RhinoCommon API
AnnotationBase.MaskUsesViewportColor Property
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MaskUsesViewportColor { get; set; }
Public Property MaskUsesViewportColor As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace