RhinoCommon API
ImageFileEventArgs.RenderEngine Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.RenderEngine"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string RenderEngine { get; }
Public ReadOnly Property RenderEngine As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace