RhinoCommon API
RhinoView.MainViewport Property
 A RhinoView contains a "main viewport" that fills the entire view client window. RhinoPageViews may also contain nested child RhinoViewports for implementing detail viewports. The MainViewport will always return this RhinoView's m_vp.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport MainViewport { get; }
Public ReadOnly Property MainViewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoView Class
Rhino.Display Namespace