RhinoCommon API
ModelAidSettings.SnappyGumballEnabled Property
 When SnappyGumball is on, a dragging a gumball moves the center point. When snappy gumball is off, dragging a gumball moves the mouse down point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SnappyGumballEnabled { get; set; }
Public Shared Property SnappyGumballEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace