RhinoCommon API
Interval.IsSingleton Property
 Returns true if T0 == T1 != ON.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSingleton { get; }
Public ReadOnly Property IsSingleton As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Interval Structure
Rhino.Geometry Namespace