RhinoCommon API
Quaternion.Scalar Property
 The real (scalar) part of the quaternion
This is A.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Scalar { get; }
Public ReadOnly Property Scalar As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace