RhinoCommon SDK
RenderPlugInInfo.Name Property
[Missing <summary> documentation for "P:Rhino.Render.RenderPlugInInfo.Name"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPlugInInfo Class
Rhino.Render Namespace