RhinoCommon SDK
InstanceDefinition.Id Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.Id"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace