RhinoCommon API
InstanceDefinitionTableEventArgs.NewState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.NewState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinition NewState { get; }
Public ReadOnly Property NewState As InstanceDefinition
	Get
Property Value
Type: InstanceDefinition
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace