RhinoCommon SDK
BitmapEntry.FileName Property
The name of this bitmap.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace