RhinoCommon API
AppearanceSettings.FeedbackColor Property
 Gets or sets the feedback color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color FeedbackColor { get; set; }
Public Shared Property FeedbackColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace