RhinoCommon API
ZooClientParameters.LicenseEntryTextMask Property
 Text mask in the form @"RH4A-AAAA-AAAA-AAAA-AAAA-AAAA" that informs the user what numbers they are looking for
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LicenseEntryTextMask { get; }
Public ReadOnly Property LicenseEntryTextMask As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace