RhinoCommon API
ObjectPropertiesPageEventArgs.Document Property
 Document containing the objects and views
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace