RhinoCommon API
Toolbar.TabSize Property
[Missing <summary> documentation for "P:Rhino.UI.Toolbar.TabSize"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Size TabSize { get; set; }
Public Shared Property TabSize As Size
	Get
	Set
Property Value
Type: Size
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Toolbar Class
Rhino.UI Namespace