RhinoCommon API
Rectangle3d.Circumference Property
 Gets the circumference of the rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Circumference { get; }
Public ReadOnly Property Circumference As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace