RhinoCommon API
RefinementSettings.NakedEdgeMode Property
 Set this property to define how naked edges should be treated.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CreaseEdges NakedEdgeMode { get; set; }
Public Property NakedEdgeMode As CreaseEdges
	Get
	Set
Property Value
Type: CreaseEdges
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace