RhinoCommon SDK
RenderSettings.UseHiddenLights Property
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UseHiddenLights { get; set; }
Public Property UseHiddenLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace