RhinoCommon API
DisplayModeDescription.XRayId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.XRayId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid XRayId { get; }
Public Shared ReadOnly Property XRayId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace