RhinoCommon API
RhinoApp.IsCloudZooNode Property
 Returns true if rhino is currently using the Cloud Zoo false otherwise
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsCloudZooNode { get; }
Public Shared ReadOnly Property IsCloudZooNode As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoApp Class
Rhino Namespace