RhinoCommon API
File3dmViewTable.Count Property
 Gets the amount of items in the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace