RhinoCommon API
File3dmObject.Geometry Property
 Gets the geometry that is linked with this document object.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GeometryBase Geometry { get; }
Public ReadOnly Property Geometry As GeometryBase
	Get
Property Value
Type: GeometryBase
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace