RhinoCommon API
ContentUuids.DotBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DotBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid DotBumpTexture { get; }
Public Shared ReadOnly Property DotBumpTexture As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentUuids Class
Rhino.Render Namespace