RhinoCommon API
RenderContentSerializer.EnglishDescription Property
 English string describing this plug-in
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string EnglishDescription { get; }
Public MustOverride ReadOnly Property EnglishDescription As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace