RhinoCommon API
ObjectEnumeratorSettings.ObjectTypeFilter Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ObjectTypeFilter"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectType ObjectTypeFilter { get; set; }
Public Property ObjectTypeFilter As ObjectType
	Get
	Set
Property Value
Type: ObjectType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace