RhinoCommon SDK
BendSpaceMorph.IsValid Property
 Returns true if the space morph definition is valid, false otherwise.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BendSpaceMorph Class
Rhino.Geometry.Morphs Namespace