RhinoCommon API
Skin.MainRhinoIcon Property
If you want to provide a custom icon for your skin.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual Bitmap MainRhinoIcon { get; }
Protected Overridable ReadOnly Property MainRhinoIcon As Bitmap
	Get
Property Value
Type: Bitmap
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Skin Class
Rhino.Runtime Namespace