RhinoCommon API
FileReadOptions.UseScaleGeometry Property
 If this parameter is true, then no questions are asked when unit conversion scaling is optional and the setting specified by ScaleGeometry is used.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseScaleGeometry { get; set; }
Public Property UseScaleGeometry As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace