RhinoCommon API
OpenFileDialog.MultiSelect Property
 Gets or sets a value indicating whether the dialog box allows multiple files to be selected
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MultiSelect { get; set; }
Public Property MultiSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace