RhinoCommon SDK
Material.DefaultMaterial Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.DefaultMaterial"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Material DefaultMaterial { get; }
Public Shared ReadOnly Property DefaultMaterial As Material
	Get
Property Value
Type: Material
See Also
Reference
Material Class
Rhino.DocObjects Namespace