RhinoCommon API
Cone.Unset Property
 Gets an invalid Cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Cone Unset { get; }
Public Shared ReadOnly Property Unset As Cone
	Get
Property Value
Type: Cone
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Cone Structure
Rhino.Geometry Namespace