RhinoCommon API
Dimension.FixedExtensionLength Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.FixedExtensionLength"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FixedExtensionLength { get; set; }
Public Property FixedExtensionLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Dimension Class
Rhino.Geometry Namespace