RhinoCommon API
GetPolyline.FirstPointPrompt Property
Prompt when getting first point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FirstPointPrompt { get; set; }
Public Property FirstPointPrompt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace