RhinoCommon API
LinearDimension.DimensionStyleIndex Property
 Index of DimensionStyle in document DimStyle table used by the dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DimensionStyleIndex { get; set; }
Public Property DimensionStyleIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace