RhinoCommon API
AreaMassProperties.Centroid Property
 Gets the area centroid in the world coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Centroid { get; }
Public ReadOnly Property Centroid As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace