RhinoCommon API
DisplayConduit.SpaceFilter Property
 If you want this conduit to only work in a specific space (model or page), then set this filter to that specific space. The default is None meaning no filter is applied
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ActiveSpace SpaceFilter { get; set; }
Public Property SpaceFilter As ActiveSpace
	Get
	Set
Property Value
Type: ActiveSpace
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace