RhinoCommon SDK
Text3d.Height Property
 Gets or sets the height (in units) of this Text3d object. The height should be a positive number larger than zero.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Text3d Class
Rhino.Display Namespace