RhinoCommon API
LocalizeStringPair.English Property
[Missing <summary> documentation for "P:Rhino.UI.LocalizeStringPair.English"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string English { get; }
Public ReadOnly Property English As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace