RhinoCommon API
DimensionStyle.Id Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Id"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace