RhinoCommon SDK
ViewportInfo.IsCameraLocationLocked Property
 Gets or sets a value that indicates whether the camera location is unmodifiable.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCameraLocationLocked { get; set; }
Public Property IsCameraLocationLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace