RhinoCommon API
RhinoDoc.NamedLayerStates Property
 Collection of named layer states.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NamedLayerStateTable NamedLayerStates { get; }
Public ReadOnly Property NamedLayerStates As NamedLayerStateTable
	Get
Property Value
Type: NamedLayerStateTable
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoDoc Class
Rhino Namespace