RhinoCommon API
ContentUuids.LeatherBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.LeatherBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid LeatherBumpTexture { get; }
Public Shared ReadOnly Property LeatherBumpTexture As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ContentUuids Class
Rhino.Render Namespace