RhinoCommon API
PickContext.PickMode Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.PickMode"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PickMode PickMode { get; set; }
Public Property PickMode As PickMode
	Get
	Set
Property Value
Type: PickMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace