RhinoCommon API
ProviderIds.RdkEdit Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkEdit"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RdkEdit { get; }
Public Shared ReadOnly Property RdkEdit As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace