RhinoCommon API
OpenGLSettingsState.AntialiasLevel Property
 AA level used in OpenGL viewports
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AntialiasLevel AntialiasLevel { get; set; }
Public Property AntialiasLevel As AntialiasLevel
	Get
	Set
Property Value
Type: AntialiasLevel
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
OpenGLSettingsState Class
Rhino.ApplicationSettings Namespace