RhinoCommon API
Sun.Light Property
 Get a Light which represents the sun. If manual control is in effect, no sun calculation is performed; the function uses the values last used in calls to Azimuth, Altitude or Vector. If manual control is not in effect, the observer's position, date, time, time zone and daylight saving values are used to calculate the position of the sun.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light Light { get; }
Public ReadOnly Property Light As Light
	Get
Property Value
Type: Light
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Sun Class
Rhino.Render Namespace