RhinoCommon API
HatchPattern.Defaults.Solid Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Solid"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static HatchPattern Solid { get; }
Public Shared ReadOnly Property Solid As HatchPattern
	Get
Property Value
Type: HatchPattern
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace