RhinoCommon API
Dimension.NumericValue Property
 Gets the numeric value (or measurement), depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diamater depending on type
AngularDimension: angle in degrees
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double NumericValue { get; }
Public ReadOnly Property NumericValue As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Dimension Class
Rhino.Geometry Namespace