RhinoCommon API
LayerTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LayerTableEventType EventType { get; }
Public ReadOnly Property EventType As LayerTableEventType
	Get
Property Value
Type: LayerTableEventType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace