RhinoCommon API
AnimationProperties.CameraPoints Property
 Gets or sets points of the camera path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] CameraPoints { get; set; }
Public Property CameraPoints As Point3d()
	Get
	Set
Property Value
Type: Point3d[]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace