RhinoCommon API
GetObject.ObjectCount Property
 Gets the number of objects that were selected.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace