RhinoCommon API
GumballDisplayConduit.GumballTransform Property
 The gumball transformation is the transformation calculated by comparing the current gumball to the starting BaseGumball.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GumballTransform { get; }
Public ReadOnly Property GumballTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace