RhinoCommon SDK
FileWriteOptions.IncludeBitmapTable Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.IncludeBitmapTable"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IncludeBitmapTable { get; set; }
Public Property IncludeBitmapTable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace