RhinoCommon API
DisplayPipelineAttributes.SurfaceEdgeThickness Property
 Thickness for surface edges
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SurfaceEdgeThickness { get; set; }
Public Property SurfaceEdgeThickness As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace