RhinoCommon API
ViewportInfo.ScreenPort Property
 Get or set the screen port. SetScreenPort(Rectangle) and
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle ScreenPort { get; set; }
Public Property ScreenPort As Rectangle
	Get
	Set
Property Value
Type: Rectangle
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace
ViewportInfo.GetScreenPort()