RhinoCommon SDK
StringParserSettings.ParseUnaryMinus Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseUnaryMinus"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseUnaryMinus { get; set; }
Public Property ParseUnaryMinus As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace