RhinoCommon API
LicenseData.DateToExpire Property
 The date and time the license is set to expire. This is provided by the plugin that validated the license. This time value should be in Coordinated Universal Time (UTC).
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Nullable<DateTime> DateToExpire { get; set; }
Public Property DateToExpire As Nullable(Of DateTime)
	Get
	Set
Property Value
Type: Nullable<DateTime>
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace