RhinoCommon API
GumballAppearanceSettings.ScaleXEnabled Property
 When ScaleXEnabled is true, the X scale control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ScaleXEnabled { get; set; }
Public Property ScaleXEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace