RhinoCommon API
RhinoDoc.RedoActive Property
 Returns true if Redo is currently active.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RedoActive { get; }
Public ReadOnly Property RedoActive As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoDoc Class
Rhino Namespace