RhinoCommon API
DimensionStyle.DimensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimensionLineExtension"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DimensionLineExtension { get; set; }
Public Property DimensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace