RhinoCommon API
RhinoApp.DefaultUiFont Property
 Default font used to render user interface
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Font DefaultUiFont { get; }
Public Shared ReadOnly Property DefaultUiFont As Font
	Get
Property Value
Type: Font
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoApp Class
Rhino Namespace