RhinoCommon API
ToolbarFileCollection.SidebarIsVisible Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFileCollection.SidebarIsVisible"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SidebarIsVisible { get; set; }
Public Shared Property SidebarIsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace