RhinoCommon API
RhinoApp.NodeType Property
Gets license the node type.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static LicenseNode NodeType { get; }
Public Shared ReadOnly Property NodeType As LicenseNode
	Get
Property Value
Type: LicenseNode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoApp Class
Rhino Namespace