RhinoCommon API
RenderMaterial.DefaultPreviewSize Property
 The default preview geometry size
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DefaultPreviewSize { get; set; }
Public Property DefaultPreviewSize As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace