RhinoCommon API
MeshExtruder.KeepOriginalFaces Property
 Whether or not to keep original faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool KeepOriginalFaces { get; set; }
Public Property KeepOriginalFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace