RhinoCommon API
AppearanceSettingsState.DefaultObjectColor Property
Gets or sets the default object color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color DefaultObjectColor { get; set; }
Public Property DefaultObjectColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace