RhinoCommon API
Layer.PlotColor Property
 Gets or sets the plot color for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color PlotColor { get; set; }
Public Property PlotColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Layer Class
Rhino.DocObjects Namespace