RhinoCommon SDK
Material.DisableLighting Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.DisableLighting"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DisableLighting { get; set; }
Public Property DisableLighting As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace