RhinoCommon API
Dimension.ExtensionLineOffset Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ExtensionLineOffset"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ExtensionLineOffset { get; set; }
Public Property ExtensionLineOffset As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Dimension Class
Rhino.Geometry Namespace