RhinoCommon API
Plane.OriginY Property
 Gets or sets the Y coordinate of the origin of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double OriginY { get; set; }
Public Property OriginY As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Plane Structure
Rhino.Geometry Namespace