RhinoCommon API
Material.TransparentColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.TransparentColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color TransparentColor { get; set; }
Public Property TransparentColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Material Class
Rhino.DocObjects Namespace