RhinoCommon API
MeshThicknessMeasurement.Thickness Property
 Gets the local thickness of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Thickness { get; }
Public ReadOnly Property Thickness As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace