RhinoCommon SDK
DisplayPipeline.DrawingWires Property
 Gets a value that indicates whether the pipeline is currently in a curve drawing operation. This is useful when inside of a draw event or display conduit to check and see if the geometry is about to be drawn is going to be drawing the wire representation of the geometry (mesh, extrusion, or brep). See DrawingSurfaces to check and see if the shaded mesh representation of the geometry is going to be drawn.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DrawingWires { get; }
Public ReadOnly Property DrawingWires As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace