RhinoCommon API
Material.Name Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.Name"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Material Class
Rhino.DocObjects Namespace