RhinoCommon SDK
FileWriteOptions.WriteSelectedObjectsOnly Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.WriteSelectedObjectsOnly"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WriteSelectedObjectsOnly { get; set; }
Public Property WriteSelectedObjectsOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace