RhinoCommon API
ViewportInfo.ViewScale Property
 Applies scaling factors to parallel projection clipping coordinates by setting the m_clip_mod transformation. If you want to compress the view projection across the viewing plane, then set x = 0.5, y = 1.0, and z = 1.0.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SizeF ViewScale { get; set; }
Public Property ViewScale As SizeF
	Get
	Set
Property Value
Type: SizeF
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace