RhinoCommon API
SimulatedTexture.LocalMappingTransform Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.LocalMappingTransform"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform LocalMappingTransform { get; }
Public ReadOnly Property LocalMappingTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace