RhinoCommon API
Plane.YAxis Property
 Gets or sets the Y axis vector of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d YAxis { get; set; }
Public Property YAxis As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Plane Structure
Rhino.Geometry Namespace