RhinoCommon API
ModelAidSettingsState.NudgeKeyStep Property
Gets or sets the nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double NudgeKeyStep { get; set; }
Public Property NudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace