RhinoCommon SDK
ContentUuids.WoodBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.WoodBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid WoodBumpTexture { get; }
Public Shared ReadOnly Property WoodBumpTexture As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ContentUuids Class
Rhino.Render Namespace