RhinoCommon API
FileWriteOptions.SuppressDialogBoxes Property
 If true, it means the command has been run with a '-', meaning you should not ask questions during writing. (no dialogs, no "getters", etc.)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuppressDialogBoxes { get; set; }
Public Property SuppressDialogBoxes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace