RhinoCommon SDK
InstanceDefinition.ArchiveFileStatus Property
 Returns the archive file status of a linked instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinitionArchiveFileStatus ArchiveFileStatus { get; }
Public ReadOnly Property ArchiveFileStatus As InstanceDefinitionArchiveFileStatus
	Get
Property Value
Type: InstanceDefinitionArchiveFileStatus
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace