RhinoCommon API
Font.Strikeout Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Strikeout"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Strikeout { get; }
Public ReadOnly Property Strikeout As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Font Class
Rhino.DocObjects Namespace