RhinoCommon API
AnnotationBase.Index Property
 Index of DimensionStyle in document DimStyle table used by the dimension.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace