RhinoCommon API
ParticleSystem.DrawRequiresDepthSorting Property
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.DrawRequiresDepthSorting"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawRequiresDepthSorting { get; set; }
Public Property DrawRequiresDepthSorting As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace