RhinoCommon API
ProviderIds.CurrentEnvironment Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.CurrentEnvironment"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CurrentEnvironment { get; }
Public Shared ReadOnly Property CurrentEnvironment As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace