RhinoCommon API
GetCylinder.Height Property
 Height of cylinder
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace