RhinoCommon API
Plane.OriginZ Property
 Gets or sets the Z coordinate of the origin of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double OriginZ { get; set; }
Public Property OriginZ As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Plane Structure
Rhino.Geometry Namespace