RhinoCommon SDK
GumballAppearanceSettings.TranslateXEnabled Property
 TranslateXEnabled is true, the X axis translation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TranslateXEnabled { get; set; }
Public Property TranslateXEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace