RhinoCommon SDK
Vector2d.Length Property
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace