RhinoCommon SDK
SubDVertexSectorIterator.IsValid Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.IsValid"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace