RhinoCommon API
RenderContentType.Id Property
 Returns the type identifier associated with this type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderContentType Class
Rhino.Render Namespace