RhinoCommon SDK
InstanceDefinitionGeometry.Id Property
 unique id for this instance definition
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override Guid Id { get; set; }
Public Overrides Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace