RhinoCommon API
LayerTableEventArgs.LayerIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.LayerIndex"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LayerIndex { get; }
Public ReadOnly Property LayerIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace