RhinoCommon API
BrepVertex.VertexIndex Property
 Gets the index of this vertex in the Brep.Vertices collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int VertexIndex { get; }
Public ReadOnly Property VertexIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace