RhinoCommon API
Dimension.LengthRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.LengthRoundoff"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LengthRoundoff { get; set; }
Public Property LengthRoundoff As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Dimension Class
Rhino.Geometry Namespace