RhinoCommon API
GeneralSettingsState.MaximumPopupMenuLines Property
 Gets or sets the maximum number of popup menu lines.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MaximumPopupMenuLines { get; set; }
Public Property MaximumPopupMenuLines As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace