RhinoCommon API
RenderSettings.ImageUnitSystem Property
 unit system to use when converting image pixel size and dpi information into a print size. Default = inches
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnitSystem ImageUnitSystem { get; set; }
Public Property ImageUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderSettings Class
Rhino.Render Namespace