RhinoCommon API
RhinoDoc.NamedConstructionPlanes Property
 Collection of named construction planes.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NamedConstructionPlaneTable NamedConstructionPlanes { get; }
Public ReadOnly Property NamedConstructionPlanes As NamedConstructionPlaneTable
	Get
Property Value
Type: NamedConstructionPlaneTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoDoc Class
Rhino Namespace