RhinoCommon API
RhinoViewport.IsParallelProjection Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsParallelProjection"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsParallelProjection { get; }
Public ReadOnly Property IsParallelProjection As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace