RhinoCommon API
Mesh.HasCachedTextureCoordinates Property
 Will return true if SetCachedTextureCoordinates has been called; otherwise will return false.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasCachedTextureCoordinates { get; }
Public ReadOnly Property HasCachedTextureCoordinates As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Mesh Class
Rhino.Geometry Namespace