RhinoCommon API
AppearanceSettingsState.PageviewPaperColor Property
 CRhinoPageView paper background. A rectangle is drawn into the background of page views to represent the printed area. The alpha portion of the color is used to draw the paper blended into the background
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color PageviewPaperColor { get; set; }
Public Property PageviewPaperColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace