RhinoCommon API
PlugIn.LicenseId Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.LicenseId"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid LicenseId { get; }
Public ReadOnly Property LicenseId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace