RhinoCommon API
HostUtils.OperatingSystemProductName Property
 Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string OperatingSystemProductName { get; }
Public Shared ReadOnly Property OperatingSystemProductName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace