RhinoCommon API
Worksession.RuntimeSerialNumber Property
 Unique serialNumber for the wrksession while the application is running. This is not a persistent value.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace