RhinoCommon API
RTreeEventArgs.Cancel Property
 Gets or sets a value that determines if the search should be conducted farther.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Cancel { get; set; }
Public Property Cancel As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace