RhinoCommon API
LightTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LightTableEventType EventType { get; }
Public ReadOnly Property EventType As LightTableEventType
	Get
Property Value
Type: LightTableEventType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace