RhinoCommon API
Light.IsPointLight Property
 Gets a value indicating whether the light style is LightStyle CameraPoint or WorldPoint.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPointLight { get; }
Public ReadOnly Property IsPointLight As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Light Class
Rhino.Geometry Namespace