RhinoCommon SDK
Sun.Longitude Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Longitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Sun Class
Rhino.Render Namespace