RhinoCommon API
Arc.Circumference Property
 Gets the circumference of the circle that is coincident with this arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Circumference { get; }
Public ReadOnly Property Circumference As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Arc Structure
Rhino.Geometry Namespace