RhinoCommon API
AppearanceSettings.ViewportBackgroundColor Property
 Gets or sets the viewport background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color ViewportBackgroundColor { get; set; }
Public Shared Property ViewportBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace