RhinoCommon API
DimStyleTable.ComponentType Property
 Returns DimStyle.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace