RhinoCommon SDK
BrepTrim.StartVertex Property
 BrepVertex at start of trim
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertex StartVertex { get; }
Public ReadOnly Property StartVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace