RhinoCommon API
GumballAppearanceSettings.ScaleYEnabled Property
 When ScaleYEnabled is true, the Y scale control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ScaleYEnabled { get; set; }
Public Property ScaleYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace