RhinoCommon API
CurvatureAnalysisSettingsState.MeanRange Property
 Gets or sets the Mean curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval MeanRange { get; set; }
Public Property MeanRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace