RhinoCommon SDK
Linetype.Id Property
 Gets the ID of this linetype object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace