RhinoCommon API
EarthAnchorPoint.EarthBasepointElevationZero Property
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BasepointZero EarthBasepointElevationZero { get; set; }
Public Property EarthBasepointElevationZero As BasepointZero
	Get
	Set
Property Value
Type: BasepointZero
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace