RhinoCommon SDK
ProviderIds.UndoRecord Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.UndoRecord"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid UndoRecord { get; }
Public Shared ReadOnly Property UndoRecord As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace