RhinoCommon SDK
ProviderIds.RhinoDoc Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RhinoDoc"]
Namespace: Rhino.UI.Controls.DataSource
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid RhinoDoc { get; }
Public Shared ReadOnly Property RhinoDoc As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace