RhinoCommon SDK
Interval.IsValid Property
 Gets a value indicating whether or not this Interval is valid. Valid intervals must contain valid numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace