RhinoCommon SDK
SubDVertexPtr.Below Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.Below"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr Below { get; set; }
Public Property Below As SubDVertexPtr
	Get
	Set
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace