RhinoCommon API
DisplayPipelineAttributes.ShowPoints Property
Show points.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowPoints { get; set; }
Public Property ShowPoints As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace