RhinoCommon API
BoundingBox.IsValid Property
 Gets a value that indicates whether or not this boundingbox is valid. Empty boxes are not valid, and neither are boxes with unset points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace