RhinoCommon API
ProviderIds.RdkRenderingPostEffects Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.RdkRenderingPostEffects"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RdkRenderingPostEffects { get; }
Public Shared ReadOnly Property RdkRenderingPostEffects As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace