RhinoCommon API
RhinoDoc.LayoutSpaceAnnotationScalingEnabled Property
 If LayoutSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimscale when the annotation is displayed in a detail viewport not in a detail
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool LayoutSpaceAnnotationScalingEnabled { get; set; }
Public Property LayoutSpaceAnnotationScalingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDoc Class
Rhino Namespace