RhinoCommon API
AreaMassProperties.CentroidCoordinatesSecondMoments Property
 Second moments with respect to centroid coordinate system. X = integral of (x-x0)^2 dm Y = integral of (y-y0)^2 dm Z = integral of (z-z0)^2 dm where (x0,y0,z0) = centroid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CentroidCoordinatesSecondMoments { get; }
Public ReadOnly Property CentroidCoordinatesSecondMoments As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace