RhinoCommon API
ModelComponent.ComponentStatus Property
 Gets or sets the component status of the model component.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual ComponentStatus ComponentStatus { get; set; }
Public Overridable Property ComponentStatus As ComponentStatus
	Get
	Set
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace