RhinoCommon API
RenderSettings.SpecificViewport Property
 Set or get the given specific viewport
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SpecificViewport { get; set; }
Public Property SpecificViewport As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderSettings Class
Rhino.Render Namespace