RhinoCommon API
PlugInInfo.Version Property
 Returns the plug-in's version.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Version { get; }
Public ReadOnly Property Version As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace