RhinoCommon SDK
Cylinder.Unset Property
 Gets an invalid Cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Cylinder Unset { get; }
Public Shared ReadOnly Property Unset As Cylinder
	Get
Property Value
Type: Cylinder
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace