RhinoCommon API
MeshExtruder.TextureCoordinateMode Property
 Mode for creating texture coordinates for extruded areas
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshExtruderParameterMode TextureCoordinateMode { get; set; }
Public Property TextureCoordinateMode As MeshExtruderParameterMode
	Get
	Set
Property Value
Type: MeshExtruderParameterMode
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace