RhinoCommon API
RhinoDoc.Path Property
Returns the path of the currently loaded Rhino document (3DM file).
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace