RhinoCommon API
GetPointMouseEventArgs.RightButtonDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.RightButtonDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RightButtonDown { get; }
Public ReadOnly Property RightButtonDown As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace