RhinoCommon SDK
SubDVertexPtr.IsTwoManifold Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.IsTwoManifold"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsTwoManifold { get; }
Public ReadOnly Property IsTwoManifold As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace