RhinoCommon API
BinaryArchiveFile.Reader Property
[Missing <summary> documentation for "P:Rhino.FileIO.BinaryArchiveFile.Reader"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BinaryArchiveReader Reader { get; }
Public ReadOnly Property Reader As BinaryArchiveReader
	Get
Property Value
Type: BinaryArchiveReader
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace