RhinoCommon API
ModelAidSettingsState.ControlPolygonDisplayDensity Property
Gets or sets the control polygon display density.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ControlPolygonDisplayDensity { get; set; }
Public Property ControlPolygonDisplayDensity As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace