RhinoCommon API
File3dmSettings.PageUnitSystem Property
 Gets or sets the page unit system, using UnitSystem enumeration.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnitSystem PageUnitSystem { get; set; }
Public Property PageUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace