RhinoCommon API
ModelAidSettings.OsnapCursorMode Property
Gets or sets the OSnap cursor mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CursorMode OsnapCursorMode { get; set; }
Public Shared Property OsnapCursorMode As CursorMode
	Get
	Set
Property Value
Type: CursorMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace