RhinoCommon SDK
GeometryBase.UserStringCount Property
 Gets the amount of user strings.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace