RhinoCommon API
Dimension.ForceDimLine Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ForceDimLine"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ForceDimLine { get; set; }
Public Property ForceDimLine As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Dimension Class
Rhino.Geometry Namespace