RhinoCommon API
MaterialRef.FrontFaceMaterialIndex Property
 The index of the material used to render the front of an object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FrontFaceMaterialIndex { get; }
Public ReadOnly Property FrontFaceMaterialIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace