RhinoCommon API
HostUtils.ComputerSerialNumber Property
 Gets the serial number of the computer running Rhino.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ComputerSerialNumber { get; }
Public Shared ReadOnly Property ComputerSerialNumber As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace