RhinoCommon API
RhinoDoc.RenderMaterialAssignmentChangedEventArgs.OldRenderMaterial Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.OldRenderMaterial"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid OldRenderMaterial { get; }
Public ReadOnly Property OldRenderMaterial As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoDoc.RenderMaterialAssignmentChangedEventArgs Class
Rhino Namespace