RhinoCommon API
ModelAidSettings.ShiftNudgeKeyStep Property
Gets or sets the Shift-key based nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double ShiftNudgeKeyStep { get; set; }
Public Shared Property ShiftNudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace