RhinoCommon API
RenderMaterial.SmellsLikeTexturedGem Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedGem"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeTexturedGem { get; }
Public ReadOnly Property SmellsLikeTexturedGem As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace