RhinoCommon API
Light.SpotAngleRadians Property
 Gets or sets the spot angle in radians.
Ignored for non-spot lights.
angle = 0 to pi/2 (0 to 90 degrees).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SpotAngleRadians { get; set; }
Public Property SpotAngleRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Light Class
Rhino.Geometry Namespace