RhinoCommon API
Transform.IsLinear Property
 Tests for a linear transformation. An affine transformation can be broken into a linear transformation and a translation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsLinear { get; }
Public ReadOnly Property IsLinear As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Transform Structure
Rhino.Geometry Namespace