RhinoCommon API
ToolbarFile.GroupCount Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.GroupCount"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace