RhinoCommon API
RenderPrimitive.RhinoObject Property
 The Rhino object associated with this render primitive.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace