RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringColor Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string SubsurfaceScatteringColor { get; }
Public Shared ReadOnly Property SubsurfaceScatteringColor As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace