RhinoCommon API
SimpleArrayMeshPointer.Count Property
 Gets the amount of meshes in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace