RhinoCommon API
OptionColor.CurrentValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionColor.CurrentValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color CurrentValue { get; set; }
Public Property CurrentValue As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace