RhinoCommon API
RenderContent.Name Property
 Instance name for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
RenderContent Class
Rhino.Render Namespace