RhinoCommon API
ObjectAttributes.HasMapping Property
 A mapping from any plugin source is associated with these attributes Need to do this here to respond correctly to ModifyObjectAttributes event
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasMapping { get; }
Public ReadOnly Property HasMapping As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace