RhinoCommon API
NurbsSurfacePointList.PointSize Property
 Returns the control point size, or the number of doubles per control point. For rational curves, PointSize = Surface.Dimension + 1. For non-rational curves, PointSize = Surface.Dimension.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PointSize { get; }
Public ReadOnly Property PointSize As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace