RhinoCommon API
ModelComponent.ComponentType Property
 Gets the ModelComponentType for this object. Useful in switch statements.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract ModelComponentType ComponentType { get; }
Public MustOverride ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace