RhinoCommon API
PlugIn.Assembly Property
Source assembly for this plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Assembly Assembly { get; }
Public ReadOnly Property Assembly As Assembly
	Get
Property Value
Type: Assembly
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace