RhinoCommon API
FileSettings.SearchPathCount Property
 Gets the amount of search paths that are currently defined.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int SearchPathCount { get; }
Public Shared ReadOnly Property SearchPathCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace