RhinoCommon API
ICurrentEnvironment_Get.ForBackground_CheckMode Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment_Get.ForBackground_CheckMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RenderEnvironment ForBackground_CheckMode { get; }
ReadOnly Property ForBackground_CheckMode As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace