RhinoCommon API
Line.IsValid Property
 Gets a value indicating whether or not this line is valid. Valid lines must have valid start and end points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Line Structure
Rhino.Geometry Namespace