RhinoCommon API
ClippingPlane.Id Property
 Get Guid for this clipping plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace