RhinoCommon API
Transform.IsZero4x4 Property
 True if all values are 0
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsZero4x4 { get; }
Public ReadOnly Property IsZero4x4 As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Transform Structure
Rhino.Geometry Namespace