RhinoCommon API
DocumentEventArgs.DocumentSerialNumber Property
 Gets the uniques document serial number for this event
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint DocumentSerialNumber { get; }
Public ReadOnly Property DocumentSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
DocumentEventArgs Class
Rhino Namespace