RhinoCommon API
File3dmStringTable.DocumentUserTextCount Property
 Returns the number of Section/Entry-style key values.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DocumentUserTextCount { get; }
Public ReadOnly Property DocumentUserTextCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
File3dmStringTable Class
Rhino.FileIO Namespace