RhinoCommon API
DisplayPipeline.DrawingGrips Property
 Gets a value that indicates whether the pipeline is currently in a grip drawing operation.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawingGrips { get; }
Public ReadOnly Property DrawingGrips As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace