RhinoCommon API
Brep.SolidOrientation Property
 Gets the solid orientation state of this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepSolidOrientation SolidOrientation { get; }
Public ReadOnly Property SolidOrientation As BrepSolidOrientation
	Get
Property Value
Type: BrepSolidOrientation
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Brep Class
Rhino.Geometry Namespace