RhinoCommon SDK
BoundingBox.Diagonal Property
 Gets the diagonal vector of this BoundingBox. The diagonal connects the Min and Max points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Diagonal { get; }
Public ReadOnly Property Diagonal As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace