RhinoCommon SDK
Extrusion.IsSolid Property
 Gets a value indicating whether there is no gap among all surfaces constructing this object.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool IsSolid { get; }
Public Overrides ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace