RhinoCommon API
RhinoObject.IsInstanceDefinitionGeometry Property
 true if the object is used as part of an instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsInstanceDefinitionGeometry { get; }
Public ReadOnly Property IsInstanceDefinitionGeometry As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace