RhinoCommon API
ICollapsibleSection.Id Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.Id"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid Id { get; }
ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace