RhinoCommon API
CursorTooltipSettings.TooltipsEnabled Property
 Turns on/off cursor tooltips.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool TooltipsEnabled { get; set; }
Public Shared Property TooltipsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace