RhinoCommon SDK
UndoRedoEventArgs.CommandId Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.CommandId"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace