RhinoCommon SDK
Light.Name Property
 Gets or sets the spot light name.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Light Class
Rhino.Geometry Namespace