RhinoCommon API
Transform.M30 Property
Gets or sets this[3,0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M30 { get; set; }
Public Property M30 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Transform Structure
Rhino.Geometry Namespace