RhinoCommon API
CustomGripObject.Weight Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.Weight"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override double Weight { get; set; }
Public Overrides Property Weight As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace