RhinoCommon API
MeshNgon.FaceCount Property
 Get the number of faces in this ngon.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FaceCount { get; }
Public ReadOnly Property FaceCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace