RhinoCommon API
FileSettings.CreateBackupFiles Property
Gets or sets a value that controls the creation of backup files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool CreateBackupFiles { get; set; }
Public Shared Property CreateBackupFiles As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace