RhinoCommon SDK
MaterialRefs.Item Property
 Gets or sets the element with the specified plug-in Id.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MaterialRef this[
	Guid key
] { get; set; }
Public Default Property Item (
	key As Guid
) As MaterialRef
	Get
	Set
Parameters
key
Type: System.Guid
 The plug-in Id of the MaterialRef to get or set.
Return Value
Type: MaterialRef
 The MaterialRef with the specified key.
Implements
IDictionary<TKey, TValue>.Item[TKey]
Exceptions
Exception | Condition
ArgumentNullException |  value is null.
ArgumentException |  key is empty.
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace