RhinoCommon API
RhinoView.Size Property
 Gets or sets the size of the view
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Size Size { get; set; }
Public Property Size As Size
	Get
	Set
Property Value
Type: Size
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoView Class
Rhino.Display Namespace