RhinoCommon API
HiddenLineDrawingSegment.ParentCurve Property
 This curve is a subcurve of the returned HiddenLineDrawingFullCurve object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingObjectCurve ParentCurve { get; }
Public ReadOnly Property ParentCurve As HiddenLineDrawingObjectCurve
	Get
Property Value
Type: HiddenLineDrawingObjectCurve
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace