RhinoCommon API
Cone.Axis Property
Unit vector axis of cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Axis { get; }
Public ReadOnly Property Axis As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Cone Structure
Rhino.Geometry Namespace