RhinoCommon API
DimensionStyle.ToleranceUpperValue Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceUpperValue"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ToleranceUpperValue { get; set; }
Public Property ToleranceUpperValue As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace