RhinoCommon API
RealtimeDisplayModeClassInfo.RealtimeDisplayModeType Property
 Get the type being registered.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Type RealtimeDisplayModeType { get; }
Public MustOverride ReadOnly Property RealtimeDisplayModeType As Type
	Get
Property Value
Type: Type
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace