RhinoCommon API
GetCone.ConeConstraint Property
 State of the cone/cyl constraint option. When the cone/cyl option is selected, the circle is being made as a base for a cone/cyl. By default the vertical cone/cyl option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ConeConstraint ConeConstraint { get; set; }
Public Property ConeConstraint As ConeConstraint
	Get
	Set
Property Value
Type: ConeConstraint
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace