RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.ClearcoatRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.ClearcoatRoughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ClearcoatRoughness { get; }
Public Shared ReadOnly Property ClearcoatRoughness As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace