RhinoCommon API
RhinoApp.IsSkinned Property
 Is Rhino currently using custom, user-interface Skin.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsSkinned { get; }
Public Shared ReadOnly Property IsSkinned As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RhinoApp Class
Rhino Namespace