RhinoCommon API
RenderContent.IsDefaultInstance Property
 Checks if render content is default instance.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDefaultInstance { get; }
Public ReadOnly Property IsDefaultInstance As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderContent Class
Rhino.Render Namespace