RhinoCommon SDK
RhinoView.ScreenRectangle Property
 Gets the rectangle that represents the client area of the view in screen coordinates.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle ScreenRectangle { get; }
Public ReadOnly Property ScreenRectangle As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
RhinoView Class
Rhino.Display Namespace