RhinoCommon API
ModelComponent.IdIsLocked Property
 Returns a value indicating whether the component ID is already locked.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IdIsLocked { get; }
Public ReadOnly Property IdIsLocked As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace