RhinoCommon SDK
TextObject.TextGeometry Property
 Gets the text entity geometry of this text object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextEntity TextGeometry { get; }
Public ReadOnly Property TextGeometry As TextEntity
	Get
Property Value
Type: TextEntity
See Also
Reference
TextObject Class
Rhino.DocObjects Namespace