RhinoCommon API
Point3f.Unset Property
 Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3f Unset { get; }
Public Shared ReadOnly Property Unset As Point3f
	Get
Property Value
Type: Point3f
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace