RhinoCommon SDK
InstanceDefinitionTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinitionGeometry OldState { get; }
Public ReadOnly Property OldState As InstanceDefinitionGeometry
	Get
Property Value
Type: InstanceDefinitionGeometry
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace