RhinoCommon API
PlugInInfo.ShipsWithRhino Property
 Returns true if the plug-in ships with Rhino, false otherwise.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShipsWithRhino { get; }
Public ReadOnly Property ShipsWithRhino As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace