RhinoCommon SDK
VolumeMassProperties.WorldCoordinatesProductMomentsError Property
 Uncertainty in world coordinates second moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d WorldCoordinatesProductMomentsError { get; }
Public ReadOnly Property WorldCoordinatesProductMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace