RhinoCommon API
IntersectionEvent.ParameterA Property
 Gets the parameter on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ParameterA { get; }
Public ReadOnly Property ParameterA As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace