RhinoCommon API
Field.Tag Property
 Gets or sets an object that contains data to associate with the field.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object Tag { get; set; }
Public Property Tag As Object
	Get
	Set
Return Value
Type: Object
 An object that contains information that is associated with the field.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Field Class
Rhino.Render.Fields Namespace