RhinoCommon API
Ellipse.IsValid Property
 Returns an indication of the validity of this ellipse.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace