RhinoCommon API
LicenseLease.LeaseId Property
 The ID of this lease.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LeaseId { get; }
Public ReadOnly Property LeaseId As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace