RhinoCommon API
Rectangle3d.X Property
 Gets or sets the dimensions of the rectangle along the base plane X-Axis (i.e. the width).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval X { get; set; }
Public Property X As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace