RhinoCommon API
Linetype.IsReference Property
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace