RhinoCommon API
RhinoApp.Rhino4Id Property
Gets the ID of Rhino 4.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Rhino4Id { get; }
Public Shared ReadOnly Property Rhino4Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoApp Class
Rhino Namespace