RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringRadius Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringRadius"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string SubsurfaceScatteringRadius { get; }
Public Shared ReadOnly Property SubsurfaceScatteringRadius As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace