RhinoCommon API
Light.PowerWatts Property
 Gets or sets the light power in watts (W).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PowerWatts { get; set; }
Public Property PowerWatts As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Light Class
Rhino.Geometry Namespace