RhinoCommon API
InstanceDefinitionTable.ActiveCount Property
 Number of items in the instance definitions table, excluding deleted definitions.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace