RhinoCommon API
ModelAidSettings.Osnap Property
Enables or disables Rhino's object snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool Osnap { get; set; }
Public Shared Property Osnap As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace