RhinoCommon API
RdkModalEditContentBucket.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.RdkModalEditContentBucket.CppPointer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RdkModalEditContentBucket Class
Rhino.Render.DataSources Namespace