RhinoCommon API
PlugInInfo.CommandNames Property
 Returns a plug-in's English command names.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] CommandNames { get; }
Public ReadOnly Property CommandNames As String()
	Get
Property Value
Type: String[]
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace