RhinoCommon API
PixelBuffer.Buffer Property
[Missing <summary> documentation for "P:Rhino.Render.PixelBuffer.Buffer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr Buffer { get; }
Public ReadOnly Property Buffer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
PixelBuffer Class
Rhino.Render Namespace