RhinoCommon API
File3dm.StartSectionComments Property
 Gets or sets the start section comments, which are the comments with which the 3dm file begins.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string StartSectionComments { get; set; }
Public Property StartSectionComments As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dm Class
Rhino.FileIO Namespace