RhinoCommon API
Light.CoordinateSystem Property
 Gets a value, determined by LightStyle, that explains whether the camera directions are relative to World or Camera spaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CoordinateSystem CoordinateSystem { get; }
Public ReadOnly Property CoordinateSystem As CoordinateSystem
	Get
Property Value
Type: CoordinateSystem
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Light Class
Rhino.Geometry Namespace