RhinoCommon API
GumballPickResult.Mode Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballPickResult.Mode"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballMode Mode { get; }
Public ReadOnly Property Mode As GumballMode
	Get
Property Value
Type: GumballMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace