RhinoCommon SDK
StringTable.Count Property
 The number of user data strings in the current document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace