RhinoCommon API
Color4f.Empty Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.Empty"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color4f Empty { get; }
Public Shared ReadOnly Property Empty As Color4f
	Get
Property Value
Type: Color4f
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Color4f Structure
Rhino.Display Namespace