RhinoCommon API
StringParserSettings.ParseFullStopAsDigitSeparator Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseFullStopAsDigitSeparator"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseFullStopAsDigitSeparator { get; set; }
Public Property ParseFullStopAsDigitSeparator As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace