RhinoCommon API
RhinoViewport.UserStringCount Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.UserStringCount"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace