RhinoCommon API
CreatePreviewEventArgs.PreviewNotifier Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.PreviewNotifier"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewNotification PreviewNotifier { get; }
Public ReadOnly Property PreviewNotifier As PreviewNotification
	Get
Property Value
Type: PreviewNotification
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace