RhinoCommon API
ContentUuids.BasicEnvironmentType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicEnvironmentType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid BasicEnvironmentType { get; }
Public Shared ReadOnly Property BasicEnvironmentType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
ContentUuids Class
Rhino.Render Namespace