RhinoCommon API
ObjectAttributes.ObjectDecoration Property
 Used to indicate an object has a decoration (like an arrowhead on a curve)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectDecoration ObjectDecoration { get; set; }
Public Property ObjectDecoration As ObjectDecoration
	Get
	Set
Property Value
Type: ObjectDecoration
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace