RhinoCommon API
FileWriteOptions.ApplyTransform Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.ApplyTransform"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ApplyTransform { get; set; }
Public Property ApplyTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace