RhinoCommon API
Mesh.TopologyEdges Property
 Gets the MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshTopologyEdgeList TopologyEdges { get; }
Public ReadOnly Property TopologyEdges As MeshTopologyEdgeList
	Get
Property Value
Type: MeshTopologyEdgeList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Mesh Class
Rhino.Geometry Namespace