RhinoCommon SDK
BoundingBox.Min Property
 Gets or sets the point in the minimal corner.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Min { get; set; }
Public Property Min As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace