RhinoCommon API
DisplayPipelineAttributes.ShadowColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShadowColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ShadowColor { get; set; }
Public Property ShadowColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace