RhinoCommon API
ViewSettings.DefinedViewSetProjection Property
 Gets or sets the 'named views set projection' value.
When true, restoring a named view causes the viewport projection saved with the view to also restore.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool DefinedViewSetProjection { get; set; }
Public Shared Property DefinedViewSetProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace