RhinoCommon API
LinearWorkflow.PostProcessGamma Property
 Linear workflow gamma
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float PostProcessGamma { get; set; }
Public Property PostProcessGamma As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace