RhinoCommon API
DimensionStyle.ExtensionLineOffset Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ExtensionLineOffset"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ExtensionLineOffset { get; set; }
Public Property ExtensionLineOffset As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace