RhinoCommon SDK
DrawForegroundEventArgs.WorldAxesDrawn Property
[Missing <summary> documentation for "P:Rhino.Display.DrawForegroundEventArgs.WorldAxesDrawn"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WorldAxesDrawn { get; set; }
Public Property WorldAxesDrawn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DrawForegroundEventArgs Class
Rhino.Display Namespace