RhinoCommon API
CommonObject.UserData Property
 List of custom information that is attached to this class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserDataList UserData { get; }
Public ReadOnly Property UserData As UserDataList
	Get
Property Value
Type: UserDataList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace