RhinoCommon SDK
DimensionStyle.LeaderArrowType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderArrowType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DimensionStyleArrowType LeaderArrowType { get; set; }
Public Property LeaderArrowType As DimensionStyleArrowType
	Get
	Set
Property Value
Type: DimensionStyleArrowType
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace