RhinoCommon SDK
SubDEdgePtr.Line Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.Line"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line Line { get; set; }
Public Property Line As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace