RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.AmbientOcclusion Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.AmbientOcclusion"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string AmbientOcclusion { get; }
Public Shared ReadOnly Property AmbientOcclusion As String
	Get
Property Value
Type: String
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace