RhinoCommon API
Decal.Transparency Property
 Gets the decal's transparency in the range 0 to 1.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Transparency { get; }
Public ReadOnly Property Transparency As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Decal Class
Rhino.Render Namespace