RhinoCommon API
StringParserSettings.PreferedLocaleId Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.PreferedLocaleId"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint PreferedLocaleId { get; set; }
Public Property PreferedLocaleId As UInteger
	Get
	Set
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace