RhinoCommon API
GumballAppearanceSettings.Radius Property
in pixels.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Radius { get; set; }
Public Property Radius As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace