RhinoCommon API
Toolbar.Id Property
[Missing <summary> documentation for "P:Rhino.UI.Toolbar.Id"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Toolbar Class
Rhino.UI Namespace