RhinoCommon API
GroundPlane.AutoAltitude Property
 Determines whether the ground plane is fixed by the Altitude property, or whether it is automatically placed at the lowest point in the model.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AutoAltitude { get; set; }
Public Property AutoAltitude As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
GroundPlane Class
Rhino.Render Namespace