RhinoCommon API
Text3d.Italic Property
 Gets or sets whether this Text3d object will be drawn in Italics.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Italic { get; set; }
Public Property Italic As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Text3d Class
Rhino.Display Namespace