RhinoCommon API
Extrusion.PathEnd Property
 Gets the end point of the path.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PathEnd { get; }
Public ReadOnly Property PathEnd As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace