RhinoCommon API
MaterialTableEventArgs.OldSettings Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.OldSettings"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Material OldSettings { get; }
Public ReadOnly Property OldSettings As Material
	Get
Property Value
Type: Material
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace