RhinoCommon API
RhinoDoc.UndoRecordingEnabled Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.UndoRecordingEnabled"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UndoRecordingEnabled { get; set; }
Public Property UndoRecordingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoDoc Class
Rhino Namespace