RhinoCommon API
Light.Length Property
 Gets or sets the height in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Length { get; set; }
Public Property Length As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Light Class
Rhino.Geometry Namespace