RhinoCommon API
Transform.IsRotation Property
 Returns true if this is a proper rotation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRotation { get; }
Public ReadOnly Property IsRotation As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Transform Structure
Rhino.Geometry Namespace