RhinoCommon API
StringWrapper.ConstPointer Property
 Gets the const pointer (const ON_wString*).
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer { get; }
Public ReadOnly Property ConstPointer As IntPtr
	Get
Return Value
Type: IntPtr
The const pointer.
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace