RhinoCommon API
ViewCapture.DrawAxes Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.DrawAxes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawAxes { get; set; }
Public Property DrawAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCapture Class
Rhino.Display Namespace