RhinoCommon SDK
Matrix.IsColumnOrthoNormal Property
 Gets a value indicating whether the matrix is column orthonormal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsColumnOrthoNormal { get; }
Public ReadOnly Property IsColumnOrthoNormal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace