RhinoCommon API
AnnotationBase.MaskColorSource Property
 Gets or sets whether the mask background color is from the background or from a color
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.MaskType MaskColorSource { get; set; }
Public Property MaskColorSource As DimensionStyle.MaskType
	Get
	Set
Property Value
Type: DimensionStyle.MaskType
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace