RhinoCommon API
ViewCaptureSettings.IsScaleToFit Property
 Returns true if the model has been scaled to fit.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsScaleToFit { get; }
Public ReadOnly Property IsScaleToFit As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace