RhinoCommon API
ContentHash.ByteCount Property
 Gets the length of the content, in bytes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ulong ByteCount { get; }
Public ReadOnly Property ByteCount As ULong
	Get
Property Value
Type: UInt64
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace