RhinoCommon API
AnnotationBase.AlternateDimensionLengthDisplay Property
 Alternate length display units and format
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.LengthDisplay AlternateDimensionLengthDisplay { get; set; }
Public Property AlternateDimensionLengthDisplay As DimensionStyle.LengthDisplay
	Get
	Set
Property Value
Type: DimensionStyle.LengthDisplay
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace