RhinoCommon API
Transform.M20 Property
Gets or sets this[2,0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M20 { get; set; }
Public Property M20 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Transform Structure
Rhino.Geometry Namespace