RhinoCommon API
DimensionStyle.TextAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextDisplayAlignment TextAlignment { get; set; }
Public Property TextAlignment As TextDisplayAlignment
	Get
	Set
Property Value
Type: TextDisplayAlignment
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace