RhinoCommon API
MeshExtruder.SurfaceParameterMode Property
 Mode for creating surface parameters for extruded areas
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshExtruderParameterMode SurfaceParameterMode { get; set; }
Public Property SurfaceParameterMode As MeshExtruderParameterMode
	Get
	Set
Property Value
Type: MeshExtruderParameterMode
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace