RhinoCommon API
MeshingParameters.DefaultAnalysisMesh Property
 Gets mesh creation parameters to create the default analysis mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MeshingParameters DefaultAnalysisMesh { get; }
Public Shared ReadOnly Property DefaultAnalysisMesh As MeshingParameters
	Get
Property Value
Type: MeshingParameters
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace