RhinoCommon API
Extrusion.IsMiteredAtStart Property
 Returns a value indicating whether a miter plane at start is defined.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsMiteredAtStart { get; }
Public ReadOnly Property IsMiteredAtStart As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace