RhinoCommon SDK
ColorCMYK.A Property
 Gets or sets the Alpha channel value. Alpha channels are limited to the 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace