RhinoCommon API
AppearanceSettingsState.TrackingColor Property
Gets or sets the tracking color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color TrackingColor { get; set; }
Public Property TrackingColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace