RhinoCommon API
MouseCallbackEventArgs.Button Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.Button"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MouseButtons Button { get; }
Public ReadOnly Property Button As MouseButtons
	Get
Property Value
Type: MouseButtons
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace