RhinoCommon SDK
RhinoViewport.IsTwoPointPerspectiveProjection Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsTwoPointPerspectiveProjection"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTwoPointPerspectiveProjection { get; }
Public ReadOnly Property IsTwoPointPerspectiveProjection As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace