RhinoCommon API
ModelAidSettingsState.GridSnap Property
Gets or sets the enabled state of Rhino's grid snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GridSnap { get; set; }
Public Property GridSnap As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace