RhinoCommon API
MeshFace.Unset Property
 Gets an Unset MeshFace. Unset faces have Int32.MinValue for all corner indices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MeshFace Unset { get; }
Public Shared ReadOnly Property Unset As MeshFace
	Get
Property Value
Type: MeshFace
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace