RhinoCommon SDK
TextEntity.AnnotativeScalingEnabled Property
 Scale annotation according to detail scale factor in paperspace or by 1.0 in paperspace and not in a detail Otherwise, dimscale or text scale is used
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AnnotativeScalingEnabled { get; set; }
Public Property AnnotativeScalingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace