RhinoCommon SDK
File3dmSettings.ModelUnitSystem Property
 Gets or sets the model unit system, using UnitSystem enumeration.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnitSystem ModelUnitSystem { get; set; }
Public Property ModelUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace