RhinoCommon SDK
Field.Prompt Property
 Optional UI prompt string set by constructor
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Prompt { get; }
Public ReadOnly Property Prompt As String
	Get
Property Value
Type: String
See Also
Reference
Field Class
Rhino.Render.Fields Namespace