RhinoCommon SDK
SubDDisplayParameters.DisplayDensity Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDDisplayParameters.DisplayDensity"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int DisplayDensity { get; set; }
Public Property DisplayDensity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SubDDisplayParameters Class
Rhino.Geometry Namespace