RhinoCommon API
ColorLCH.H Property
 Gets or sets the Hue channel. The hue channel is limited to the 0~360 degree range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double H { get; set; }
Public Property H As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace