RhinoCommon API
RenderWindowClonedEventArgs.OldSessionId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.OldSessionId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid OldSessionId { get; }
Public ReadOnly Property OldSessionId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace