RhinoCommon API
ViewportInfo.FrustumHeight Property
 Gets the frustum height. This is FrustumTop - FrustumBottom.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumHeight { get; }
Public ReadOnly Property FrustumHeight As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace