RhinoCommon SDK
SubDObject.SubDGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.SubDObject.SubDGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubD SubDGeometry { get; }
Public ReadOnly Property SubDGeometry As SubD
	Get
Property Value
Type: SubD
See Also
Reference
SubDObject Class
Rhino.DocObjects Namespace