RhinoCommon API
NamedLayerStateTable.Names Property
 Returns the names of named layer states in the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] Names { get; }
Public ReadOnly Property Names As String()
	Get
Property Value
Type: String[]
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace