RhinoCommon API
NameHash.ParentId Property
 Only useful if this participates in a tree structure, as with layers.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ParentId { get; }
Public ReadOnly Property ParentId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
NameHash Class
Rhino.FileIO Namespace