RhinoCommon API
LinearWorkflow.PostProcessGammaReciprocal Property
 Linear workflow gamma
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float PostProcessGammaReciprocal { get; }
Public ReadOnly Property PostProcessGammaReciprocal As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace