RhinoCommon API
RhinoObjectSelectionEventArgs.Selected Property
 Returns true if objects are being selected. Returns false if objects are being deseleced.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Selected { get; }
Public ReadOnly Property Selected As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace