RhinoCommon API
DimensionStyle.ScaleRightLengthMillimeters Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ScaleRightLengthMillimeters"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ScaleRightLengthMillimeters { get; set; }
Public Property ScaleRightLengthMillimeters As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace