RhinoCommon API
Font.Underlined Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Underlined"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Underlined { get; }
Public ReadOnly Property Underlined As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Font Class
Rhino.DocObjects Namespace