RhinoCommon API
StringParserSettings.ParseSettingsEmpty Property
 - ON_ParseSetting::FalseSettings has all parsing options set to false. - A common use of ON_ParseSettings FalseSettings is to intialize ON_ParseSettings classes that are used to report what happened during parsing.Any parsing results value set to true after parsing indicates that type of parsing occured.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static StringParserSettings ParseSettingsEmpty { get; }
Public Shared ReadOnly Property ParseSettingsEmpty As StringParserSettings
	Get
Property Value
Type: StringParserSettings
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace