RhinoCommon API
RhinoDoc.Linetypes Property
 Linetypes in the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LinetypeTable Linetypes { get; }
Public ReadOnly Property Linetypes As LinetypeTable
	Get
Property Value
Type: LinetypeTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoDoc Class
Rhino Namespace