RhinoCommon API
Interval.Length Property
 Gets the signed length of the numeric range. If the interval is decreasing, a negative length will be returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Interval Structure
Rhino.Geometry Namespace