RhinoCommon SDK
GetArc.DeformablePointCount Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetArc.DeformablePointCount"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DeformablePointCount { get; set; }
Public Property DeformablePointCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace