RhinoCommon API
ColorHSL.L Property
 Gets or sets the luminance channel value. Luminance channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double L { get; set; }
Public Property L As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace