RhinoCommon API
Rectangle3d.BoundingBox Property
 Gets the world aligned boundingbox for this rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace