RhinoCommon API
Color4fField.SystemColorValue Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color SystemColorValue { get; set; }
Public Property SystemColorValue As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace