RhinoCommon API
Localization.RunningAsEnglish Property
[Missing <summary> documentation for "P:Rhino.UI.Localization.RunningAsEnglish"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RunningAsEnglish { get; }
Public Shared ReadOnly Property RunningAsEnglish As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Localization Class
Rhino.UI Namespace