RhinoCommon API
PlugInInfo.PlugInLoadTime Property
 Returns the plug-in's load time.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PlugInLoadTime PlugInLoadTime { get; }
Public ReadOnly Property PlugInLoadTime As PlugInLoadTime
	Get
Property Value
Type: PlugInLoadTime
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace