RhinoCommon API
NamedLayerStateTable.Document Property
 Document that owns this table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
NamedLayerStateTable Class
Rhino.DocObjects.Tables Namespace