RhinoCommon SDK
SweepOneRail.MiterType Property
 0: don't miter, 1: intersect surfaces and trim sweeps, 2: rotate shapes at kinks and don't trim.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MiterType { get; set; }
Public Property MiterType As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace