RhinoCommon API
Skylight.UsesCustomEnvironment Property
 Return true if skylight uses custom environment
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UsesCustomEnvironment { get; }
Public ReadOnly Property UsesCustomEnvironment As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace