RhinoCommon API
DisplayPipelineAttributes.ShowRealtimeRenderProgressBar Property
 Get or set whether the display is used for preview rendering or not.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowRealtimeRenderProgressBar { get; set; }
Public Property ShowRealtimeRenderProgressBar As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace