RhinoCommon API
RTreeEventArgs.Tag Property
 Gets or sets an arbitrary object that can be attached to this event args. This object will "stick" through a single search and can represent user-defined state.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object Tag { get; set; }
Public Property Tag As Object
	Get
	Set
Property Value
Type: Object
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace