RhinoCommon SDK
Fonts.NormalFont Property
 Returns the normal font used for dialog boxes and buttons.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Font NormalFont { get; }
Public Shared ReadOnly Property NormalFont As Font
	Get
Property Value
Type: Font
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Fonts Class
Rhino.UI Namespace