RhinoCommon API
BitmapEntry.ComponentType Property
 Returns Image.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace