RhinoCommon API
LicenseLease.GroupName Property
 Name of Rhino Accounts group that this lease came from
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GroupName { get; }
Public ReadOnly Property GroupName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace