RhinoCommon SDK
Leader.LeaderTextVerticalAlignment Property
 Gets or sets the vertical alignment of the leader's text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextVerticalAlignment LeaderTextVerticalAlignment { get; set; }
Public Property LeaderTextVerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Leader Class
Rhino.Geometry Namespace