RhinoCommon API
ComponentFunctionInfo.Description Property
 The function description.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace