RhinoCommon API
AnimationProperties.AnimationName Property
 Gets or sets the name of the animation sequence.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string AnimationName { get; set; }
Public Property AnimationName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace