RhinoCommon API
DisplayPipelineAttributes.FillMode Property
 Get or set the frame buffer fill mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes.FrameBufferFillMode FillMode { get; set; }
Public Property FillMode As DisplayPipelineAttributes.FrameBufferFillMode
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.FrameBufferFillMode
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace