RhinoCommon API
OpenGLSettings.AntialiasLevel Property
Gets or sets the antialias level used by OpenGL viewports
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AntialiasLevel AntialiasLevel { get; set; }
Public Shared Property AntialiasLevel As AntialiasLevel
	Get
	Set
Property Value
Type: AntialiasLevel
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace