RhinoCommon API
GetCone.AllowInputAngle Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCone.AllowInputAngle"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AllowInputAngle { get; set; }
Public Property AllowInputAngle As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace