RhinoCommon API
LightTable.ComponentType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTable.ComponentType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace