RhinoCommon API
DisplayPipelineAttributes.CastShadows Property
Cast shadows.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CastShadows { get; set; }
Public Property CastShadows As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace