RhinoCommon API
MeshPart.EndVertexIndex Property
End of subinterval of parent mesh vertex array
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EndVertexIndex { get; }
Public ReadOnly Property EndVertexIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace