RhinoCommon API
LengthValue.ContextAngleUnitSystem Property
 Returns the context AngleUnitSystem from this LengthValue's ParseSettings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AngleUnitSystem ContextAngleUnitSystem { get; }
Public ReadOnly Property ContextAngleUnitSystem As AngleUnitSystem
	Get
Property Value
Type: AngleUnitSystem
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LengthValue Class
Rhino Namespace