RhinoCommon API
MeshVertexNormalList.Count Property
 Gets or sets the number of mesh vertex normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace