RhinoCommon SDK
SubDVertexPtr.Previous Property
 Links to previous vertex on this level.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr Previous { get; }
Public ReadOnly Property Previous As SubDVertexPtr
	Get
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace