RhinoCommon API
ModelComponent.IndexIsLocked Property
 Returns a value indicating whether the component Index is already locked.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IndexIsLocked { get; }
Public ReadOnly Property IndexIsLocked As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace