RhinoCommon API
RhinoDoc.DateCreated Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.DateCreated"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DateTime DateCreated { get; }
Public ReadOnly Property DateCreated As DateTime
	Get
Property Value
Type: DateTime
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
RhinoDoc Class
Rhino Namespace