RhinoCommon SDK
Decal.Height Property
 Gets the height of the decal. Only used when mapping is cylindrical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Decal Class
Rhino.Render Namespace