RhinoCommon API
RenderContentType.PlugInId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentType.PlugInId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RenderContentType Class
Rhino.Render Namespace