RhinoCommon API
AppearanceSettingsState.CurrentLayerBackgroundColor Property
 Gets or sets the color used by the layer manager dialog as the background color for the current layer.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color CurrentLayerBackgroundColor { get; set; }
Public Property CurrentLayerBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace