RhinoCommon SDK
ViewportInfo.FrustumBottomPlane Property
 Gets the frustum bottom plane that separates visibile from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane FrustumBottomPlane { get; }
Public ReadOnly Property FrustumBottomPlane As Plane
	Get
Property Value
Type: Plane
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace