RhinoCommon API
DimStyleTableEventArgs.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.Index"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace