RhinoCommon API
ObjectEnumeratorSettings.ViewportFilter Property
 Filter on value of object->IsActiveInViewport()
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport ViewportFilter { get; set; }
Public Property ViewportFilter As RhinoViewport
	Get
	Set
Property Value
Type: RhinoViewport
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace