RhinoCommon API
IHasCppImplementation.CppPointer Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IHasCppImplementation.CppPointer"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IntPtr CppPointer { get; }
ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
IHasCppImplementation Interface
Rhino.UI.Controls Namespace