RhinoCommon API
RenderContentEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentEventArgs.Document"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace