RhinoCommon API
MorphControl.Curve Property
 Returns the morph control's curve. While this should never be null, the calling function should check.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve Curve { get; }
Public ReadOnly Property Curve As NurbsCurve
	Get
Property Value
Type: NurbsCurve
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace