RhinoCommon API
BrepLoop.LoopType Property
 type of loop.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepLoopType LoopType { get; }
Public ReadOnly Property LoopType As BrepLoopType
	Get
Property Value
Type: BrepLoopType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace