RhinoCommon API
Leader.Curve Property
 Gets the curve used by this leader
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve Curve { get; }
Public ReadOnly Property Curve As NurbsCurve
	Get
Property Value
Type: NurbsCurve
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Leader Class
Rhino.Geometry Namespace