RhinoCommon API
RenderMaterial.SmellsLikeTexturedPaint Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeTexturedPaint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeTexturedPaint { get; }
Public ReadOnly Property SmellsLikeTexturedPaint As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace