RhinoCommon SDK
BoolField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Value { get; set; }
Public Property Value As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BoolField Class
Rhino.Render.Fields Namespace