RhinoCommon API
PointCloud.ContainsNormals Property
 Gets a value indicating whether or not the points in this pointcloud have normals assigned to them.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ContainsNormals { get; }
Public ReadOnly Property ContainsNormals As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace