RhinoCommon API
AnnotationBase.DimensionStyle Property
 If there are no overrides then the parent style is returned otherwise the dimension style saved with the annotation is returned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace