RhinoCommon API
CreatePreviewEventArgs.PreviewImageSize Property
 Pixel size of the image that is being requested for the preview scene
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Size PreviewImageSize { get; }
Public ReadOnly Property PreviewImageSize As Size
	Get
Property Value
Type: Size
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace