RhinoCommon SDK
NamedPositionTable.Names Property
Array of Named Position names.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] Names { get; }
Public ReadOnly Property Names As String()
	Get
Return Value
Type: String[]
 A string array with the names all Named Positions in the document.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace