RhinoCommon API
HiddenLineDrawing.Segments Property
 Subcurve objects calculated by the hidden line drawing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<HiddenLineDrawingSegment> Segments { get; }
Public ReadOnly Property Segments As IEnumerable(Of HiddenLineDrawingSegment)
	Get
Property Value
Type: IEnumerable<HiddenLineDrawingSegment>
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace