RhinoCommon SDK
SubDVertexAccess.First Property
[Missing <summary> documentation for "P:Rhino.Geometry.Collections.SubDVertexAccess.First"]
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr First { get; }
Public ReadOnly Property First As SubDVertexPtr
	Get
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace