RhinoCommon API
ConstructionPlane.Name Property
 Gets or sets the name of the construction plane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace