RhinoCommon API
Layer.UserStringCount Property
 Gets the amount of user strings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Layer Class
Rhino.DocObjects Namespace