RhinoCommon API
GetPointMouseEventArgs.ControlKeyDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.ControlKeyDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ControlKeyDown { get; }
Public ReadOnly Property ControlKeyDown As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace