RhinoCommon SDK
ThumbData.Tags Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Tags"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<string> Tags { get; set; }
Public Property Tags As List(Of String)
	Get
	Set
Property Value
Type: List<String>
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace