RhinoCommon API
AppearanceSettingsState.ShowFullPathInTitleBar Property
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowFullPathInTitleBar { get; set; }
Public Property ShowFullPathInTitleBar As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace