RhinoCommon API
LayerTableEventArgs.NewState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.NewState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer NewState { get; }
Public ReadOnly Property NewState As Layer
	Get
Property Value
Type: Layer
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace