RhinoCommon API
DimensionStyle.ArrowType1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowType1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ArrowType ArrowType1 { get; set; }
Public Property ArrowType1 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace