RhinoCommon SDK
GeometryBase.IsDocumentControlled Property
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override sealed bool IsDocumentControlled { get; }
Public Overrides NotOverridable ReadOnly Property IsDocumentControlled As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace