RhinoCommon SDK
SubDVertexPtr.Status Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexPtr.Status"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ComponentStatus Status { get; set; }
Public Property Status As ComponentStatus
	Get
	Set
Property Value
Type: ComponentStatus
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace