RhinoCommon API
DisplayBitmapDrawList.SortAngleTolerance Property
 Angle in radians used to determine if an index list is "parallel enough" to a viewports camera angle. Default is 0.0873 radians (5 degrees)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SortAngleTolerance { get; set; }
Public Property SortAngleTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace