RhinoCommon API
Dimension.ForceArrowPosition Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ForceArrowPosition"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public Dimension.ForceArrow ForceArrowPosition { get; set; }
<ObsoleteAttribute>
Public Property ForceArrowPosition As Dimension.ForceArrow
	Get
	Set
Property Value
Type: Dimension.ForceArrow
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.27
See Also
Reference
Dimension Class
Rhino.Geometry Namespace