RhinoCommon API
RhinoDoc.RenderContentTableEventArgs.EventType Property
 Event type
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc.RenderContentTableEventType EventType { get; }
Public ReadOnly Property EventType As RhinoDoc.RenderContentTableEventType
	Get
Property Value
Type: RhinoDoc.RenderContentTableEventType
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoDoc.RenderContentTableEventArgs Class
Rhino Namespace