RhinoCommon API
BrepTrim.Loop Property
 Loop that this trim belongs to
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepLoop Loop { get; }
Public ReadOnly Property Loop As BrepLoop
	Get
Property Value
Type: BrepLoop
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace