RhinoCommon API
ModelAidSettingsState.AltPlusArrow Property
true mean Alt+arrow is used for nudging.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AltPlusArrow { get; set; }
Public Property AltPlusArrow As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace