RhinoCommon API
GumballAppearanceSettings.ScaleZEnabled Property
 When ScaleZEnabled is true, the Z scale control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ScaleZEnabled { get; set; }
Public Property ScaleZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace