RhinoCommon SDK
HiddenLineDrawingObjectCurve.ClippingPlaneIndex Property
 Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ClippingPlaneIndex { get; }
Public ReadOnly Property ClippingPlaneIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace