RhinoCommon API
Dimension.ArrowSize Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ArrowSize"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ArrowSize { get; set; }
Public Property ArrowSize As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Dimension Class
Rhino.Geometry Namespace