RhinoCommon API
TextDot.FontFace Property
Font face used for displaying the dot
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FontFace { get; set; }
Public Property FontFace As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
TextDot Class
Rhino.Geometry Namespace