RhinoCommon API
RenderMaterial.MetalMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.MetalMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid MetalMaterialGuid { get; }
Public Shared ReadOnly Property MetalMaterialGuid As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace