RhinoCommon SDK
InstanceDefinitionGeometry.Name Property
 Gets or sets the name of the definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace