RhinoCommon API
InstanceDefinition.Name Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.Name"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace