RhinoCommon SDK
DisplayPipelineAttributes.XrayAllObjects Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.XrayAllObjects"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool XrayAllObjects { get; set; }
Public Property XrayAllObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace