RhinoCommon API
MeshingParameters.Tolerance Property
 Gets or sets the maximum allowed edge deviation. This tolerance is measured between the center of the mesh edge and the surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Tolerance { get; set; }
Public Property Tolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace