RhinoCommon SDK
SubDEdgePtr.SectorCoefficientTo Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgePtr.SectorCoefficientTo"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double SectorCoefficientTo { get; set; }
Public Property SectorCoefficientTo As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace