RhinoCommon SDK
MeshFaceList.TriangleCount Property
 Gets the number of faces that are triangles (3 corners).
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int TriangleCount { get; }
Public ReadOnly Property TriangleCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace