RhinoCommon API
DimensionObject.DimensionStyle Property
 Gets the DimensionStyle associated with this OrdinateDimensionObject.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DimensionObject Class
Rhino.DocObjects Namespace