RhinoCommon API
DrawEventArgs.Viewport Property
[Missing <summary> documentation for "P:Rhino.Display.DrawEventArgs.Viewport"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace