RhinoCommon API
SimulatedTexture.Offset Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Offset"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2d Offset { get; set; }
Public Property Offset As Vector2d
	Get
	Set
Property Value
Type: Vector2d
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace