RhinoCommon API
MeshFaceList.Count Property
 Gets or sets the number of mesh faces. When getting this can includes invalid faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace