RhinoCommon API
ISettingsService.RaiseChangedEventAfterWriting Property
 Return true if settings changed events should be raised immediately after writing the settings file.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool RaiseChangedEventAfterWriting { get; }
ReadOnly Property RaiseChangedEventAfterWriting As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace