RhinoCommon API
VolumeMassProperties.CentroidCoordinatesSecondMomentsError Property
 Uncertainty in centroid coordinates second moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CentroidCoordinatesSecondMomentsError { get; }
Public ReadOnly Property CentroidCoordinatesSecondMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace