RhinoCommon API
DisplayPipelineAttributes.ViewDisplayAttributes.HorizontalViewportScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.HorizontalViewportScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double HorizontalViewportScale { get; set; }
Public Property HorizontalViewportScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace