RhinoCommon API
StringParserSettings.ParsePairedParentheses Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParsePairedParentheses"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParsePairedParentheses { get; set; }
Public Property ParsePairedParentheses As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace