RhinoCommon API
Dimension.TextFit Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextFit"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.TextFit TextFit { get; set; }
Public Property TextFit As DimensionStyle.TextFit
	Get
	Set
Property Value
Type: DimensionStyle.TextFit
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Dimension Class
Rhino.Geometry Namespace