RhinoCommon API
Point2d.X Property
 Gets or sets the X (first) coordinate of the point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace