RhinoCommon API
Dimension.ToleranceFormat Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ToleranceFormat"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ToleranceDisplayFormat ToleranceFormat { get; set; }
Public Property ToleranceFormat As DimensionStyle.ToleranceDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.ToleranceDisplayFormat
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Dimension Class
Rhino.Geometry Namespace