RhinoCommon SDK
BrepFace.SurfaceIndex Property
 Surface index of the 3d surface geometry used by this face or -1
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SurfaceIndex { get; }
Public ReadOnly Property SurfaceIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace