RhinoCommon API
AnimationProperties.Dates Property
 Gets or sets the dates that are calculated for seasonal/one day sun animations.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] Dates { get; set; }
Public Property Dates As String()
	Get
	Set
Property Value
Type: String[]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace