RhinoCommon API
ViewCapture.Height Property
 Height of capture in Pixels
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Height { get; set; }
Public Property Height As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ViewCapture Class
Rhino.Display Namespace