RhinoCommon API
HiddenLineDrawingObjectCurve.SourceObject Property
 Return the source object that this curve came from
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingObject SourceObject { get; }
Public ReadOnly Property SourceObject As HiddenLineDrawingObject
	Get
Property Value
Type: HiddenLineDrawingObject
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace