RhinoCommon SDK
Circle.Circumference Property
 Gets or sets the circumference of this circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Circumference { get; set; }
Public Property Circumference As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Circle Structure
Rhino.Geometry Namespace