RhinoCommon API
ViewportInfo.IsValid Property
 Gets a value that indicates whether this complete object is valid.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace