RhinoCommon API
Dimension.UseDefaultTextPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.UseDefaultTextPoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseDefaultTextPoint { get; set; }
Public Property UseDefaultTextPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Dimension Class
Rhino.Geometry Namespace