RhinoCommon API
ComponentStatus.IsHighlighted Property
 Returns true if highlighted. False otherwise.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsHighlighted { get; }
Public ReadOnly Property IsHighlighted As Boolean
	Get
Return Value
Type: Boolean
The component status for highlighted.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace