RhinoCommon API
Layer.Color Property
 Gets or sets the display color for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Layer Class
Rhino.DocObjects Namespace