RhinoCommon API
FileWriteOptions.FileVersion Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.FileVersion"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FileVersion { get; set; }
Public Property FileVersion As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace