RhinoCommon API
ReduceMeshParameters.DesiredPolygonCount Property
Desired or target number of faces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DesiredPolygonCount { get; set; }
Public Property DesiredPolygonCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace