RhinoCommon SDK
Plane.WorldXY Property
 plane coincident with the World XY plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Plane WorldXY { get; }
Public Shared ReadOnly Property WorldXY As Plane
	Get
Property Value
Type: Plane
See Also
Reference
Plane Structure
Rhino.Geometry Namespace