RhinoCommon API
Quaternion.IsVector Property
 true if a = 0 and at least one of b, c, or d is not zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsVector { get; }
Public ReadOnly Property IsVector As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace