RhinoCommon API
AppearanceSettingsState.CrosshairColor Property
Gets or sets the crosshair color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color CrosshairColor { get; set; }
Public Property CrosshairColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace