RhinoCommon API
NurbsSurface.OrderV Property
 Gets the order in the V direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int OrderV { get; }
Public ReadOnly Property OrderV As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace