RhinoCommon API
Text3d.Bold Property
 Gets or sets whether this Text3d object will be drawn in Bold.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Bold { get; set; }
Public Property Bold As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Text3d Class
Rhino.Display Namespace