RhinoCommon API
FileObjWriteOptions.ExportTcs Property
 Enable/disable export of texture coordinates, if they exist.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportTcs { get; set; }
Public Property ExportTcs As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace