RhinoCommon API
Vector3d.IsZero Property
 Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace