RhinoCommon API
ColorLAB.Alpha Property
 Gets or sets the Alpha channel. The channel is limited to 0~1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Alpha { get; set; }
Public Property Alpha As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace