RhinoCommon API
Point3f.IsValid Property
 Each coordinate of the point must pass the IsValidSingle(Single) test.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace