RhinoCommon SDK
UndoRedoEventArgs.IsBeginUndo Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginUndo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsBeginUndo { get; }
Public ReadOnly Property IsBeginUndo As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace