RhinoCommon API
RefinementSettings.ContinueRequest Property
 A token to request computation termination.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CancellationToken ContinueRequest { get; set; }
Public Property ContinueRequest As CancellationToken
	Get
	Set
Property Value
Type: CancellationToken
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace