RhinoCommon API
RhinoObject.GroupCount Property
Number of groups object belongs to.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace