RhinoCommon API
FileReference.FullPath Property
 Gets the absolute path of this file reference.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FullPath { get; }
Public ReadOnly Property FullPath As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileReference Class
Rhino.FileIO Namespace