RhinoCommon API
FileSettingsState.AutoSaveInterval Property
How often the document will be saved when Rhino's automatic file saving mechanism is enabled.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TimeSpan AutoSaveInterval { get; set; }
Public Property AutoSaveInterval As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace