RhinoCommon API
Decal.VectorUp Property
 For cylindrical and spherical mapping, the vector is unitized.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d VectorUp { get; }
Public ReadOnly Property VectorUp As Vector3d
	Get
Return Value
Type: Vector3d
The 'up' vector of the decal. For planar mapping the length of the vector is relevant.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Decal Class
Rhino.Render Namespace