RhinoCommon API
RhinoDoc.DateLastEdited Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.DateLastEdited"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DateTime DateLastEdited { get; }
Public ReadOnly Property DateLastEdited As DateTime
	Get
Property Value
Type: DateTime
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace