RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.OpacityRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.OpacityRoughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string OpacityRoughness { get; }
Public Shared ReadOnly Property OpacityRoughness As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace