RhinoCommon API
RhinoDoc.ModelSpaceTextScale Property
 The scale factor for text in model space when Annotation Scaling is enabled
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ModelSpaceTextScale { get; set; }
Public Property ModelSpaceTextScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoDoc Class
Rhino Namespace