RhinoCommon API
PlugInInfo.Organization Property
 Returns the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Organization { get; }
Public ReadOnly Property Organization As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace