RhinoCommon API
ViewportInfo.FrustumLeftPlane Property
 Gets the frustum left plane that separates visibile from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane FrustumLeftPlane { get; }
Public ReadOnly Property FrustumLeftPlane As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace