RhinoCommon API
PanelIds.LightManager Property
 Rhino light manager panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid LightManager { get; }
Public Shared ReadOnly Property LightManager As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
PanelIds Class
Rhino.UI Namespace