RhinoCommon SDK
RhinoObject.Name Property
 Rhino objects have optional text names. More than one object in a model can have the same name and some objects may have no name.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace