RhinoCommon API
ViewCaptureSettings.DrawClippingPlanes Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawClippingPlanes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawClippingPlanes { get; set; }
Public Property DrawClippingPlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace