RhinoCommon API
ModelAidSettingsState.UseHorizontalDialog Property
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseHorizontalDialog { get; set; }
Public Property UseHorizontalDialog As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace