RhinoCommon API
CommandEventArgs.CommandResult Property
 Gets the result of the command that raised this event. This value is only meaningful during EndCommand events.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Result CommandResult { get; }
Public ReadOnly Property CommandResult As Result
	Get
Property Value
Type: Result
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace