RhinoCommon API
TwistSpaceMorph.TwistAxis Property
Axis to rotate about.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line TwistAxis { get; set; }
Public Property TwistAxis As Line
	Get
	Set
Property Value
Type: Line
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace