RhinoCommon API
RenderSettings.ImageSize Property
 Gets or sets a value indicating the size of the rendering result if UseViewportSize is set to false. If UseViewportSize is set to true, then this value is ignored.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Size ImageSize { get; set; }
Public Property ImageSize As Size
	Get
	Set
Property Value
Type: Size
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RenderSettings Class
Rhino.Render Namespace