RhinoCommon API
Light.HotSpot Property
 The hot spot setting runs from 0.0 to 1.0 and is used to provides a linear interface for controling the focus or concentration of a spotlight. A hot spot setting of 0.0 corresponds to a spot exponent of 128. A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double HotSpot { get; set; }
Public Property HotSpot As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Light Class
Rhino.Geometry Namespace