RhinoCommon API
ContentUuids.TileTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.TileTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid TileTextureType { get; }
Public Shared ReadOnly Property TileTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ContentUuids Class
Rhino.Render Namespace