RhinoCommon API
RTreeEventArgs.IdB Property
 If search is using two r-trees, IdB is element b in the search.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IdB { get; }
Public ReadOnly Property IdB As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace