RhinoCommon API
AppearanceSettingsState.ShowCrosshairs Property
Gets or sets a value that determines if cross hairs are visible.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowCrosshairs { get; set; }
Public Property ShowCrosshairs As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace