RhinoCommon API
FontQuartet.HasBoldItalicFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.HasBoldItalicFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasBoldItalicFont { get; }
Public ReadOnly Property HasBoldItalicFont As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace