RhinoCommon API
Light.PowerCandela Property
 Gets or sets the light power in candelas (cd).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PowerCandela { get; set; }
Public Property PowerCandela As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Light Class
Rhino.Geometry Namespace