RhinoCommon API
RhinoDoc.RenderContentTableEventArgs.Document Property
 Document the table belongs to
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RhinoDoc.RenderContentTableEventArgs Class
Rhino Namespace