RhinoCommon API
ViewCaptureSettings.CropRectangle Property
 Actual area of output rectangle that view capture is sent to.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle CropRectangle { get; }
Public ReadOnly Property CropRectangle As Rectangle
	Get
Property Value
Type: Rectangle
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace