RhinoCommon API
Panels.EtoPanelStyleName Property
 Style applied to Eto controls hosted by the Rhino.UI.Panels and Rhino.UI.ObjectProperties systems.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string EtoPanelStyleName { get; }
Public Shared ReadOnly Property EtoPanelStyleName As String
	Get
Property Value
Type: String
The name of the eto panel style.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Panels Class
Rhino.UI Namespace