RhinoCommon API
PythonScript.ContextId Property
 Gets or sets a context unique identified.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ContextId { get; set; }
Public Property ContextId As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace