RhinoCommon API
LicenseStatus.RegisteredOrganization Property
The registered organization of the product (e.g. "Robert McNeel and Associates")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string RegisteredOrganization { get; set; }
Public Property RegisteredOrganization As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace