RhinoCommon SDK
SubD.Vertices Property
 Gets access to vertices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexAccess Vertices { get; }
Public ReadOnly Property Vertices As SubDVertexAccess
	Get
Property Value
Type: SubDVertexAccess
See Also
Reference
SubD Class
Rhino.Geometry Namespace