RhinoCommon API
CustomRenderMeshProvider.DisplacementId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.DisplacementId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid DisplacementId { get; }
Public Shared ReadOnly Property DisplacementId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace