RhinoCommon API
RhinoDoc.GroundPlane Property
Gets the ground plane of this document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GroundPlane GroundPlane { get; }
Public ReadOnly Property GroundPlane As GroundPlane
	Get
Property Value
Type: GroundPlane
Exceptions
Exception | Condition
RdkNotLoadedException | If the RDK is not loaded.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace