RhinoCommon API
InstanceReferenceGeometry.ParentIdefId Property
 The unique id for the parent instance definition of this instance reference.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ParentIdefId { get; }
Public ReadOnly Property ParentIdefId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace