RhinoCommon API
RhinoViewport.IsPlanView Property
 true if construction plane z axis is parallel to camera direction.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPlanView { get; }
Public ReadOnly Property IsPlanView As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace