RhinoCommon API
IndexPair.J Property
 Gets or sets the second, J index.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int J { get; set; }
Public Property J As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
IndexPair Structure
Rhino Namespace