RhinoCommon API
GetColorEventArgs.Title Property
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.Title"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Title { get; }
Public ReadOnly Property Title As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace