RhinoCommon API
FileObjWriteOptions.MapZtoY Property
 Setting to transform Rhino's Z axis to OBJ's Y axis
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MapZtoY { get; set; }
Public Property MapZtoY As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace