RhinoCommon SDK
File3dmSettings.PageAbsoluteTolerance Property
Gets or sets the page space absolute tolerance.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PageAbsoluteTolerance { get; set; }
Public Property PageAbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace