RhinoCommon API
Material.MaterialIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.MaterialIndex"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MaterialIndex { get; }
Public ReadOnly Property MaterialIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Material Class
Rhino.DocObjects Namespace