RhinoCommon API
FileWriteOptions.DestinationFileName Property
 For use on Apple frameworks only. Retrns the final destination file name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DestinationFileName { get; }
Public ReadOnly Property DestinationFileName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace