RhinoCommon API
ViewInfo.ShowWallpaperInGrayScale Property
 True if wallpaper (if any) is to be shown in gray scale in this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowWallpaperInGrayScale { get; }
Public ReadOnly Property ShowWallpaperInGrayScale As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace