RhinoCommon API
CustomRenderContentAttribute.Category Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.Category"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Category { get; set; }
Public Property Category As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace