RhinoCommon API
File3dm.AllGroups Property
 Grpups in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmGroupTable AllGroups { get; }
Public ReadOnly Property AllGroups As File3dmGroupTable
	Get
Property Value
Type: File3dmGroupTable
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dm Class
Rhino.FileIO Namespace