RhinoCommon API
PlugInInfo.IsLoaded Property
 Returns true if the plug-in is loaded, false otherwise.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsLoaded { get; }
Public ReadOnly Property IsLoaded As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace