RhinoCommon API
GumballAppearanceSettings.ColorMenuButton Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballAppearanceSettings.ColorMenuButton"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ColorMenuButton { get; set; }
Public Property ColorMenuButton As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace