RhinoCommon API
CommonObject.IsValid Property
Tests an object to see if it is valid.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool IsValid { get; }
Public Overridable ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace