RhinoCommon SDK
MaterialRefCreateParams.BackFaceMaterialIndex Property
 The index of the material used to render the back of an object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int BackFaceMaterialIndex { get; set; }
Public Property BackFaceMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace