RhinoCommon API
File3dm.ApplicationDetails Property
 Gets or sets details for the application that wrote this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ApplicationDetails { get; set; }
Public Property ApplicationDetails As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
File3dm Class
Rhino.FileIO Namespace