RhinoCommon API
DisplayModeDescription.WireframeId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.WireframeId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid WireframeId { get; }
Public Shared ReadOnly Property WireframeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace