RhinoCommon API
RTreeEventArgs.IdPtr Property
 Gets the identifier pointer of the found item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr IdPtr { get; }
Public ReadOnly Property IdPtr As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace