RhinoCommon API
RhinoApp.SchemeName Property
 Gets the current Registry scheme name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string SchemeName { get; }
Public Shared ReadOnly Property SchemeName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoApp Class
Rhino Namespace