RhinoCommon API
ICollapsibleSection.PlugInId Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.PlugInId"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid PlugInId { get; }
ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace