RhinoCommon API
RuiUpdateUi.MenuItemId Property
Id of the menu item that owns this menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid MenuItemId { get; }
Public ReadOnly Property MenuItemId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace