RhinoCommon API
Toolbar.BitmapSize Property
[Missing <summary> documentation for "P:Rhino.UI.Toolbar.BitmapSize"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Size BitmapSize { get; set; }
Public Shared Property BitmapSize As Size
	Get
	Set
Property Value
Type: Size
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Toolbar Class
Rhino.UI Namespace