RhinoCommon SDK
DisplayPipelineAttributes.ShowCurves Property
Draw curves
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShowCurves { get; set; }
Public Property ShowCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace