RhinoCommon API
GeometryBase.IsDeformable Property
 true if object can be accurately modified with "squishy" transformations like projections, shears, and non-uniform scaling.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDeformable { get; }
Public ReadOnly Property IsDeformable As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace