RhinoCommon API
MeshVertexList.UseDoublePrecisionVertices Property
 Set to true if the vertices should be stored in double precision
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseDoublePrecisionVertices { get; set; }
Public Property UseDoublePrecisionVertices As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace