RhinoCommon API
PointCloudItem.Hidden Property
 Gets or sets the hidden flag of this point cloud item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace