RhinoCommon SDK
SubDVertexSectorIterator.CurrentFace Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDVertexSectorIterator.CurrentFace"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacePtr CurrentFace { get; }
Public ReadOnly Property CurrentFace As SubDFacePtr
	Get
Property Value
Type: SubDFacePtr
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace