RhinoCommon API
LayerTable.ActiveCount Property
 Returns number of layers in the layer table, excluding deleted layers.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace