RhinoCommon API
AppearanceSettings.GridYAxisLineColor Property
 Gets or sets the color of the Y axis of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color GridYAxisLineColor { get; set; }
Public Shared Property GridYAxisLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace