RhinoCommon API
AngularDimension.ArrowPoint2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.ArrowPoint2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d ArrowPoint2 { get; }
Public ReadOnly Property ArrowPoint2 As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace