RhinoCommon API
RhinoPageView.PageNumber Property
 Gets or sets the runtime page number and updates the page number for all of the other pages. The first page has a value of 0
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PageNumber { get; set; }
Public Property PageNumber As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace