RhinoCommon API
ISettingsService.UseFileWatchers Property
 Return true if the settings system should use file watchers when reading settings to determine when settings have changed so changed events can be raised.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool UseFileWatchers { get; }
ReadOnly Property UseFileWatchers As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace