RhinoCommon API
ObjectPropertiesPageEventArgs.Viewport Property
 Active viewport
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace