RhinoCommon API
MeshObject.MeshGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.MeshObject.MeshGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh MeshGeometry { get; }
Public ReadOnly Property MeshGeometry As Mesh
	Get
Property Value
Type: Mesh
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace