RhinoCommon API
MeshExtruder.EdgeBasedUVN Property
 Edge based UVN defines UVN directions according to boundary edge directions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EdgeBasedUVN { get; set; }
Public Property EdgeBasedUVN As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace