RhinoCommon API
ContentUuids.MaskTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.MaskTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid MaskTextureType { get; }
Public Shared ReadOnly Property MaskTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ContentUuids Class
Rhino.Render Namespace