RhinoCommon API
GripStatus.Visible Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripStatus.Visible"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Visible { get; }
Public ReadOnly Property Visible As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
GripStatus Class
Rhino.DocObjects.Custom Namespace