RhinoCommon API
DimensionStyle.DimTextOrientation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimTextOrientation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextOrientation DimTextOrientation { get; set; }
Public Property DimTextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace