RhinoCommon API
ViewportInfo.FrustumWidth Property
 Gets the frustum width. This is FrustumRight - FrustumLeft.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumWidth { get; }
Public ReadOnly Property FrustumWidth As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace