RhinoCommon API
PlugIn.Name Property
 Returns the name of the plug-in, as found in the plug-in's assembly attributes.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace