RhinoCommon API
AnimationProperties.EndYear Property
 Gets or sets the end year for seasonal day sun animation in the range 1800 to 2199.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EndYear { get; set; }
Public Property EndYear As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace