RhinoCommon API
ReplayHistoryResult.ExistingObject Property
 The previously existing object.
Do not attempt to edit this object. It might have been already deleted by, for example, dragging.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject ExistingObject { get; }
Public ReadOnly Property ExistingObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace