RhinoCommon API
File3dmSettings.ModelAngleToleranceRadians Property
Gets or sets the model space angle tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ModelAngleToleranceRadians { get; set; }
Public Property ModelAngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace