RhinoCommon API
AnimationProperties.MinutesBetweenFrames Property
 Gets or sets the minutes between captured frames for one day sun animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MinutesBetweenFrames { get; set; }
Public Property MinutesBetweenFrames As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace