RhinoCommon SDK
Command.CommandContextHelpUrl Property
 Gets the URL of the command contextual help. This is usually a location of a local CHM file.
The default implementation return an empty string.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual string CommandContextHelpUrl { get; }
Protected Overridable ReadOnly Property CommandContextHelpUrl As String
	Get
Property Value
Type: String
See Also
Reference
Command Class
Rhino.Commands Namespace