RhinoCommon API
ViewSettingsState.ZoomExtentsParallelViewBorder Property
 Border amount to apply to parallel viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ZoomExtentsParallelViewBorder { get; set; }
Public Property ZoomExtentsParallelViewBorder As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace