RhinoCommon API
AnnotationBase.TextModelWidth Property
 Width of text in the model
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextModelWidth { get; }
Public ReadOnly Property TextModelWidth As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace