RhinoCommon API
InstanceDefinition.SkipNestedLinkedDefinitions Property
 Controls how much geometry is read when a linked InstanceDefinition is updated.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SkipNestedLinkedDefinitions { get; }
Public ReadOnly Property SkipNestedLinkedDefinitions As Boolean
	Get
Return Value
Type: Boolean
If this returns true then nested linked InstanceDefinition objects will be skipped otherwise; read everything, included nested linked InstanceDefinition objects
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace