RhinoCommon SDK
Torus.MajorRadius Property
 Gets or sets the radius of the circle that lies at the heart of the torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MajorRadius { get; set; }
Public Property MajorRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Torus Structure
Rhino.Geometry Namespace