RhinoCommon API
DisplayModeDescription.SupportsShadeCommand Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.SupportsShadeCommand"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SupportsShadeCommand { get; set; }
Public Property SupportsShadeCommand As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace