RhinoCommon API
ObjRef.GeometryComponentIndex Property
 Gets the component index of the referenced (sub) geometry. Some objects have subobjects that are valid pieces of geometry. For example, breps have edges and faces that are valid curves and surfaces. Each subobject has a component index that is > 0. The parent geometry has a component index = -1.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex GeometryComponentIndex { get; }
Public ReadOnly Property GeometryComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace