RhinoCommon SDK
CommandLineOption.Index Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.CommandLineOption.Index"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace