RhinoCommon API
CreatePreviewEventArgs.Reason Property
 Reason the preview is getting generated
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CreatePreviewReason Reason { get; }
Public ReadOnly Property Reason As CreatePreviewReason
	Get
Property Value
Type: CreatePreviewReason
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace