RhinoCommon SDK
ObjectEnumeratorSettings.ReferenceObjects Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ReferenceObjects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ReferenceObjects { get; set; }
Public Property ReferenceObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace