RhinoCommon API
VolumeMassProperties.WorldCoordinatesSecondMoments Property
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "xx dm" over the area Y is integral of "yy dm" over the area Z is integral of "zz dm" over the area.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d WorldCoordinatesSecondMoments { get; }
Public ReadOnly Property WorldCoordinatesSecondMoments As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace