RhinoCommon API
ContentUuids.ExposureTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.ExposureTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ExposureTextureType { get; }
Public Shared ReadOnly Property ExposureTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
ContentUuids Class
Rhino.Render Namespace