RhinoCommon API
RhinoApp.ValidationGracePeriodDaysLeft Property
 Returns number of days within which validation must occur. Zero when validation grace period has expired. Raises InvalidLicenseTypeException if LicenseType is one of: EvaluationSaveLimited EvaluationTimeLimited Viewer Unknown
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int ValidationGracePeriodDaysLeft { get; }
Public Shared ReadOnly Property ValidationGracePeriodDaysLeft As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
RhinoApp Class
Rhino Namespace