RhinoCommon SDK
DisplayPipeline.ZBiasMode Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ZBiasMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ZBiasMode ZBiasMode { get; set; }
Public Property ZBiasMode As ZBiasMode
	Get
	Set
Property Value
Type: ZBiasMode
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace