RhinoCommon SDK
Transform.Determinant Property
 The determinant of this 4x4 matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Determinant { get; }
Public ReadOnly Property Determinant As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Transform Structure
Rhino.Geometry Namespace