RhinoCommon API
Decal.MapToInside Property
 Used only when mapping is cylindrical or spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MapToInside { get; }
Public ReadOnly Property MapToInside As Boolean
	Get
Property Value
Type: Boolean
true if texture is mapped to inside of sphere or cylinder, else \e false.
See Also
Reference
Decal Class
Rhino.Render Namespace