RhinoCommon API
DecalCreateParams.EndLatitude Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.EndLatitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EndLatitude { get; set; }
Public Property EndLatitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace