RhinoCommon API
PanelIds.Notes Property
 Rhino notes panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Notes { get; }
Public Shared ReadOnly Property Notes As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
PanelIds Class
Rhino.UI Namespace