RhinoCommon API
MaterialTable.Item Property
 Conceptually, the material table is an array of materials. The operator[] can be used to get individual materials. A material is either active or deleted and this state is reported by Material.IsDeleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Material this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Material
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: Material
 If index is out of range, the current material is returned.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace