RhinoCommon API
Box.Area Property
 Gets the total surface area of this box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Box Structure
Rhino.Geometry Namespace