RhinoCommon API
MeshingParameters.RefineGrid Property
 Gets or sets a value indicating whether or not the sampling grid can be refined when certain tolerances are not met.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RefineGrid { get; set; }
Public Property RefineGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace