RhinoCommon API
File3dm.AllLayers Property
 Layers in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmLayerTable AllLayers { get; }
Public ReadOnly Property AllLayers As File3dmLayerTable
	Get
Property Value
Type: File3dmLayerTable
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
File3dm Class
Rhino.FileIO Namespace