RhinoCommon API
DimensionStyle.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Index"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace