RhinoCommon API
Light.Intensity Property
 Gets or sets the light intensity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Intensity { get; set; }
Public Property Intensity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Light Class
Rhino.Geometry Namespace