RhinoCommon API
NamedPositionTable.Ids Property
Array of Named Position guids.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] Ids { get; }
Public ReadOnly Property Ids As Guid()
	Get
Return Value
Type: Guid[]
 Guid array of each Named Position in the document.
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace