RhinoCommon API
PlugInInfo.FileName Property
 Returns the plug-in's file name.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace