RhinoCommon API
RhinoDoc.Strings Property
 Collection of document user data strings in this document
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StringTable Strings { get; }
Public ReadOnly Property Strings As StringTable
	Get
Property Value
Type: StringTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoDoc Class
Rhino Namespace