RhinoCommon API
LightArray.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.LightArray.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
LightArray Class
Rhino.Render Namespace