RhinoCommon API
RhinoObjectSelectionEventArgs.RhinoObjects Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectSelectionEventArgs.RhinoObjects"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] RhinoObjects { get; }
Public ReadOnly Property RhinoObjects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace