RhinoCommon API
DimStyleTable.BuiltInStyles Property
 Creates an array of default AnnotationStyle objects
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle[] BuiltInStyles { get; }
Public ReadOnly Property BuiltInStyles As DimensionStyle()
	Get
Property Value
Type: DimensionStyle[]
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace