RhinoCommon API
FileSettingsState.ClipboardOnExit Property
 Gets or sets a value that determines what to do with clipboad data on exit.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClipboardState ClipboardOnExit { get; set; }
Public Property ClipboardOnExit As ClipboardState
	Get
	Set
Property Value
Type: ClipboardState
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace