RhinoCommon API
RhinoDoc.Views Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Views"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewTable Views { get; }
Public ReadOnly Property Views As ViewTable
	Get
Property Value
Type: ViewTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
RhinoDoc Class
Rhino Namespace