RhinoCommon API
MeshInstance.MeshId Property
 Get the mesh identifier for this mesh instance.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid MeshId { get; }
Public ReadOnly Property MeshId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace