RhinoCommon API
SimpleArray2dex.Count Property
 Gets the amount of elements in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
SimpleArray2dex Class
Rhino.Runtime.InteropWrappers Namespace