RhinoCommon API
Material.RenderPlugInId Property
 The Id of the RenderPlugIn that is associated with this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RenderPlugInId { get; set; }
Public Property RenderPlugInId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Material Class
Rhino.DocObjects Namespace