RhinoCommon API
RenderContent.Notes Property
 Notes for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Notes { get; set; }
Public Property Notes As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RenderContent Class
Rhino.Render Namespace