RhinoCommon SDK
VolumeMassProperties.WorldCoordinatesMomentsOfInertiaError Property
 Uncertainty in world coordinates moments of inertia calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d WorldCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property WorldCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace