RhinoCommon SDK
FileReadOptions.NewMode Property
 true means we are reading template information in something like a OnFileNew event.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool NewMode { get; set; }
Public Property NewMode As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace