RhinoCommon API
ModelAidSettings.Planar Property
Gets or sets the enabled state of Rhino's Planar modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool Planar { get; set; }
Public Shared Property Planar As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace