RhinoCommon API
Plane.OriginX Property
 Gets or sets the X coordinate of the origin of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double OriginX { get; set; }
Public Property OriginX As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Plane Structure
Rhino.Geometry Namespace