RhinoCommon API
AnimationProperties.TargetPoints Property
 Gets or sets points of the target path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] TargetPoints { get; set; }
Public Property TargetPoints As Point3d()
	Get
	Set
Property Value
Type: Point3d[]
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace