RhinoCommon API
RenderPrimitiveList.Count Property
 Number of meshes in this list
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace