RhinoCommon API
GumballAppearanceSettings.ArrowHeadLength Property
in pixels.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ArrowHeadLength { get; set; }
Public Property ArrowHeadLength As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace