RhinoCommon API
PanelIds.Sun Property
 Rhino sun panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Sun { get; }
Public Shared ReadOnly Property Sun As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
PanelIds Class
Rhino.UI Namespace