RhinoCommon API
DisplayPipelineAttributes.UseSingleCurveColor Property
 Use a single color for drawing curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseSingleCurveColor { get; set; }
Public Property UseSingleCurveColor As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace