RhinoCommon API
ContentUuids.TextureAdjustmentTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.TextureAdjustmentTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid TextureAdjustmentTextureType { get; }
Public Shared ReadOnly Property TextureAdjustmentTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ContentUuids Class
Rhino.Render Namespace