RhinoCommon API
GetPointMouseEventArgs.WindowPoint Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.WindowPoint"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point WindowPoint { get; }
Public ReadOnly Property WindowPoint As Point
	Get
Property Value
Type: Point
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace