RhinoCommon API
Matrix.RowCount Property
 Gets the amount of rows.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RowCount { get; }
Public ReadOnly Property RowCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Matrix Class
Rhino.Geometry Namespace