RhinoCommon API
LinearDimension.AnnotationType Property
[Missing <summary> documentation for "P:Rhino.Geometry.LinearDimension.AnnotationType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AnnotationType AnnotationType { get; set; }
Public Property AnnotationType As AnnotationType
	Get
	Set
Property Value
Type: AnnotationType
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace