RhinoCommon API
PlugInInfo.Fax Property
 Returns the fax number of the organization or company that created the plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Fax { get; }
Public ReadOnly Property Fax As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace