RhinoCommon API
Symbols.PlusMinusSymbol Property
 Plus-Minus tolerance symbol
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static char PlusMinusSymbol { get; }
Public Shared ReadOnly Property PlusMinusSymbol As Char
	Get
Property Value
Type: Char
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Symbols Class
Rhino Namespace