RhinoCommon API
Decal.Origin Property
 Gets the origin of the decal in world space.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Origin { get; }
Public ReadOnly Property Origin As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Decal Class
Rhino.Render Namespace