RhinoCommon API
GetPoint.DynamicDrawColor Property
 Color used by CRhinoGetPoint::DynamicDraw to draw the current point and the line from the base point to the current point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color DynamicDrawColor { get; set; }
Public Property DynamicDrawColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace