RhinoCommon API
RenderMaterial.DefaultPreviewGeometryType Property
 Set or get the default geometry that appears in preview panes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderMaterial.PreviewGeometryType DefaultPreviewGeometryType { get; set; }
Public Property DefaultPreviewGeometryType As RenderMaterial.PreviewGeometryType
	Get
	Set
Property Value
Type: RenderMaterial.PreviewGeometryType
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace