RhinoCommon API
ModelAidSettings.UniversalConstructionPlaneMode Property
Gets or sets the locked state of the snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UniversalConstructionPlaneMode { get; set; }
Public Shared Property UniversalConstructionPlaneMode As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace