RhinoCommon SDK
Curve.TangentAtEnd Property
Evaluate unit tangent vector at the end of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d TangentAtEnd { get; }
Public ReadOnly Property TangentAtEnd As Vector3d
	Get
Return Value
Type: Vector3d
Unit tangent vector of the curve at the end point.
Remarks
No error handling.
See Also
Reference
Curve Class
Rhino.Geometry Namespace