RhinoCommon API
BrepEdge.EdgeCurveIndex Property
 Get the brep.Curves3D[] index of the 3d curve geometry used by this edge or -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EdgeCurveIndex { get; }
Public ReadOnly Property EdgeCurveIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace