RhinoCommon API
ObjectEnumeratorSettings.VisibleFilter Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.VisibleFilter"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool VisibleFilter { get; set; }
Public Property VisibleFilter As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace