RhinoCommon API
RenderMaterial.PlasterMaterialGuid Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PlasterMaterialGuid"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PlasterMaterialGuid { get; }
Public Shared ReadOnly Property PlasterMaterialGuid As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace