RhinoCommon API
ShowPanelEventArgs.Show Property
 Will be true if showing or false if hiding
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Show { get; }
Public ReadOnly Property Show As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace