RhinoCommon API
MaterialTable.CurrentMaterialIndex Property
 At all times, there is a "current" material. Unless otherwise specified, new objects are assigned to the current material. The current material is never locked, hidden, or deleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CurrentMaterialIndex { get; set; }
Public Property CurrentMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace