RhinoCommon API
RadialDimensionObject.RadialDimensionGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RadialDimension RadialDimensionGeometry { get; }
Public ReadOnly Property RadialDimensionGeometry As RadialDimension
	Get
Property Value
Type: RadialDimension
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
RadialDimensionObject Class
Rhino.DocObjects Namespace