RhinoCommon API
Decal.TextureInstanceId Property
 Gets the texture ID for this decal.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid TextureInstanceId { get; }
Public ReadOnly Property TextureInstanceId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Decal Class
Rhino.Render Namespace