RhinoCommon API
ViewCaptureSettings.DrawAxis Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawAxis"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawAxis { get; set; }
Public Property DrawAxis As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace