RhinoCommon API
ShutLiningCurveInfo.CurveIntervals Property
 The parts of the curve to use as profiles.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ReadOnlyCollection<Interval> CurveIntervals { get; }
Public ReadOnly Property CurveIntervals As ReadOnlyCollection(Of Interval)
	Get
Property Value
Type: ReadOnlyCollection<Interval>
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace