RhinoCommon SDK
SubDEdgeDirPair.Edge Property
[Missing <summary> documentation for "P:Rhino.Geometry.SubDEdgeDirPair.Edge"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDEdgePtr Edge { get; }
Public ReadOnly Property Edge As SubDEdgePtr
	Get
Property Value
Type: SubDEdgePtr
See Also
Reference
SubDEdgeDirPair Structure
Rhino.Geometry Namespace