RhinoCommon SDK
Material.ReflectionColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.ReflectionColor"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color ReflectionColor { get; set; }
Public Property ReflectionColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace