RhinoCommon API
UndoRedoEventArgs.IsEndUndo Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsEndUndo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsEndUndo { get; }
Public ReadOnly Property IsEndUndo As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace