RhinoCommon API
ICollapsibleSectionHolder.ScrollPosition Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.ScrollPosition"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
int ScrollPosition { get; set; }
Property ScrollPosition As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace