RhinoCommon SDK
ConstructionPlane.DepthBuffered Property
 Gets or sets whether the grid is drawn on top of geometry.
false=grid is always drawn behind 3d geometry
true=grid is drawn at its depth as a 3d plane and grid lines obscure things behind the grid.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DepthBuffered { get; set; }
Public Property DepthBuffered As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace