RhinoCommon API
ComponentFunctionInfo.ComponentGuid Property
 The unique identifier of the Grasshopper component. It is the original developer's responsibility to ensure that this ID is unique.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ComponentGuid { get; }
Public ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace