RhinoCommon API
Extrusion.MiterPlaneNormalAtStart Property
 Gets or sets the normal of the miter plane at the start in profile coordinates. In profile coordinates, 0,0,1 always maps to the extrusion axis
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d MiterPlaneNormalAtStart { get; set; }
Public Property MiterPlaneNormalAtStart As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace