RhinoCommon API
RhinoPageView.PrinterName Property
 Returns the name of the layout's destination printer.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string PrinterName { get; }
Public ReadOnly Property PrinterName As String
	Get
Property Value
Type: String
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace