RhinoCommon API
ContentUuids.GritBumpTexture Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GritBumpTexture"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GritBumpTexture { get; }
Public Shared ReadOnly Property GritBumpTexture As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
ContentUuids Class
Rhino.Render Namespace