RhinoCommon API
RhinoObjectEventArgs.TheObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectEventArgs.TheObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject TheObject { get; }
Public ReadOnly Property TheObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
RhinoObjectEventArgs Class
Rhino.DocObjects Namespace