RhinoCommon API
DetailViewObject.PageToWorldTransform Property
 Returns the page coordinate to world coordinate transformation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform PageToWorldTransform { get; }
Public ReadOnly Property PageToWorldTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace