RhinoCommon API
MouseCallbackEventArgs.CtrlKeyDown Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.CtrlKeyDown"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CtrlKeyDown { get; }
Public ReadOnly Property CtrlKeyDown As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace