RhinoCommon API
ContentUuids.BasicMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.BasicMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid BasicMaterialType { get; }
Public Shared ReadOnly Property BasicMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
ContentUuids Class
Rhino.Render Namespace