RhinoCommon API
HostUtils.RunningInMono Property
 Tests if this process is currently executing under the Mono runtime.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RunningInMono { get; }
Public Shared ReadOnly Property RunningInMono As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace