RhinoCommon API
CorruptGeometryException.Pointer Property
 pointer to base geometry (ON_Object*)
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr Pointer { get; }
Public ReadOnly Property Pointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
CorruptGeometryException Class
Rhino.Runtime Namespace