RhinoCommon SDK
SubDVertexPtr.Next Property
 Links to next vertex on this level.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDVertexPtr Next { get; }
Public ReadOnly Property Next As SubDVertexPtr
	Get
Property Value
Type: SubDVertexPtr
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace