RhinoCommon API
BinaryArchiveReader.ReadErrorOccured Property
 Gets or sets whether en error occurred during reading.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReadErrorOccured { get; set; }
Public Property ReadErrorOccured As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace