RhinoCommon API
AnnotationBase.TextIsWrapped Property
 Is text wrapping on
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TextIsWrapped { get; set; }
Public Property TextIsWrapped As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace