RhinoCommon API
LicenseLease.IssuedAt Property
 The date this lease was issued
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DateTime IssuedAt { get; }
Public ReadOnly Property IssuedAt As DateTime
	Get
Property Value
Type: DateTime
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace