RhinoCommon SDK
SurfaceCurvature Properties
The SurfaceCurvature type exposes the following members.
Properties
Name | Description
Gaussian
 Gets the Gaussian curvature value at UV.
Mean
 Gets the Mean curvature value at UV.
Normal
 Gets the surface normal at UV.
Point
 Gets the surface point at UV.
UVPoint
 Gets the UV location where the curvature was computed.
Top
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace