RhinoCommon API
UndoRedoEventArgs Properties
The UndoRedoEventArgs type exposes the following members.
Properties
Name | Description
CommandId
IsBeginRecording
IsBeginRedo
IsBeginUndo
IsEndRecording
IsEndRedo
IsEndUndo
IsPurgeRecord
UndoSerialNumber
Top
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace