RhinoCommon API
DisplayPipelineAttributes Properties
The DisplayPipelineAttributes type exposes the following members.
Properties
Name | Description
AmbientLightingColor
BoundingBoxMode
CastShadows
Cast shadows.
ContextForDraw
CurveColor
Color used for drawing curves
CurveThickness
Pixel thickness for curves
DisableConduits
DisableTransparency
EnglishName
FillMode
 Get or set the frame buffer fill mode.
Id
IgnoreHighlights
LocalName
LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects
MeshSpecificAttributes
ObjectColor
PointRadius
PointStyle
RealtimeDisplayId
 Get the ID of the realtime display engine attached to the view. This will be Guid.Empty if no realtime display engine is in use. This can be the case for instance when starting a _Render session for a realtime viewport integration. That still would cause this ID to be Guid.Empty.
RealtimeRenderPasses
 Get or set the realtime passes amount
ShadeVertexColors
Shade using vertex colors.
ShadingEnabled
Draw shaded meshes and surfaces. Set to false to use Flat Shading.
ShadowColor
ShowAnnotations
Show annotations.
ShowClippingPlanes
Show clipping planes.
ShowCurves
Draw curves
ShowGrips
ShowIsoCurves
Draw surface ISO curves.
ShowLights
Show light widgets.
ShowPointClouds
Show point clouds.
ShowPoints
Show points.
ShowRealtimeRenderProgressBar
 Get or set whether the display is used for preview rendering or not.
ShowSurfaceEdges
Show surface edges.
ShowTangentEdges
Show tangent edges.
ShowTangentSeams
Show tangent seams.
ShowText
Show text.
SurfaceEdgeThickness
 Thickness for surface edges
UseAssignedObjectMaterial
 Gets whether objects ought to be drawn using their assigned rendering material.
UseCustomObjectColor
 Gets whether objects ought to be drawn using a custom color.
UseCustomObjectMaterial
 Gets whether objects ought to be drawn using a custom material.
UseSingleCurveColor
 Use a single color for drawing curves
ViewSpecificAttributes
XrayAllObjects
Top
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace