RhinoCommon API
DocumentEventArgs Properties
The DocumentEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document for this event. This field might be null.
DocumentId
 Gets the document Id of the document for this event.
DocumentSerialNumber
 Gets the uniques document serial number for this event
Top
See Also
Reference
DocumentEventArgs Class
Rhino Namespace