RhinoCommon API
ViewInfo Properties
The ViewInfo type exposes the following members.
Properties
Name | Description
FocalBlurAperture
 Gets or sets the Focal blur aperture of the active viewport
FocalBlurDistance
 Gets or sets the Focal blur distance of the active viewport
FocalBlurJitter
 Gets or sets the Focal blur jitter of the active viewport
FocalBlurMode
 Gets or sets the Focal blur mode of the active viewport
FocalBlurSampleCount
 Gets or sets the Focal blur sample count of the active viewport
Name
 Gets or sets the name of the NamedView.
ShowWallpaperInGrayScale
 True if wallpaper (if any) is to be shown in gray scale in this view.
Viewport
 Gets the viewport, or viewing frustum, associated with this view.
WallpaperFilename
 Get filename for wallpaper set to this view, if any.
WallpaperHidden
 True if wallpaper (if any) is to be hidden from this view.
Top
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace