RhinoCommon SDK
FileWriteOptions Properties
The FileWriteOptions type exposes the following members.
Properties
Name | Description
ApplyTransform
FileVersion
IncludeBitmapTable
IncludeHistory
IncludePreviewImage
IncludeRenderMeshes
SuppressDialogBoxes
WriteAsTemplate
WriteGeometryOnly
WriteSelectedObjectsOnly
WriteUserData
Xform
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace