RhinoCommon SDK
SubDEdgeDirPair Properties
The SubDEdgeDirPair type exposes the following members.
Properties
Name | Description
Edge
Flipped
Top
See Also
Reference
SubDEdgeDirPair Structure
Rhino.Geometry Namespace