RhinoCommon API
DetailView Properties
The DetailView type exposes the following members.
Properties
Name | Description
IsParallelProjection
 Gets or sets whether the view is parallel.
IsPerspectiveProjection
 Gets or sets whether the view is perspective.
IsProjectionLocked
 Gets or sets whether the view projection is locked.
PageToModelRatio
 Gets the page units/model units quotient.
Top
See Also
Reference
DetailView Class
Rhino.Geometry Namespace