RhinoCommon API
StringWrapper Properties
The StringWrapper type exposes the following members.
Properties
Name | Description
ConstPointer
 Gets the const pointer (const ON_wString*).
NonConstPointer
 Gets the non-const pointer (ON_wString*).
Top
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace