RhinoCommon SDK
SubDVertexAccess Properties
The SubDVertexAccess type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of SubD vertices.
First
Top
See Also
Reference
SubDVertexAccess Class
Rhino.Geometry.Collections Namespace