RhinoCommon API
Linetype Properties
The Linetype type exposes the following members.
Properties
Name | Description
ComponentType
 Returns LinePattern.
 (Overrides ModelComponent.ComponentType.)
Id
 Gets the ID of this linetype object.
In Rhino for Windows 6.25, this member is inherited from .ModelComponentId.
IsDeleted
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
IsModified
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
IsReference
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LinetypeIndex
The index of this linetype.
Name
The name of this linetype.
PatternLength
Total length of one repeat of the pattern.
SegmentCount
Number of segments in the pattern.
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace