RhinoCommon API
File3dmSettings Properties
The File3dmSettings type exposes the following members.
Properties
Name | Description
ModelAbsoluteTolerance
Gets or sets the model space absolute tolerance.
ModelAngleToleranceDegrees
Gets or sets the model space angle tolerance.
ModelAngleToleranceRadians
Gets or sets the model space angle tolerance.
ModelBasepoint
 Gets or sets the model basepoint that is used when the file is read as an instance definition.
This point is mapped to the origin in the instance definition.
ModelRelativeTolerance
Gets or sets the model space relative tolerance.
ModelUnitSystem
 Gets or sets the model unit system, using UnitSystem enumeration.
ModelUrl
 Gets or sets a Uniform Resource Locator (URL) direction for the model.
PageAbsoluteTolerance
Gets or sets the page space absolute tolerance.
PageAngleToleranceDegrees
Gets or sets the page space angle tolerance.
PageAngleToleranceRadians
Gets or sets the page space angle tolerance.
PageRelativeTolerance
Gets or sets the page space relative tolerance.
PageUnitSystem
 Gets or sets the page unit system, using UnitSystem enumeration.
Top
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace