RhinoCommon API
PreviewAppearance Properties
The PreviewAppearance type exposes the following members.
Properties
Name | Description
CppPointer
 Previewappearances c++ pointer
MetaData
 Previewappearance MetaData
Top
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace