RhinoCommon API
Font Properties
The Font type exposes the following members.
Properties
Name | Description
Bold
Description
 Returns a long description that includes family, face, weight, stretch and style information. Generally not useful for finding matching fonts.
EnglishFaceName
 Returns English Facename
EnglishFamilyName
EnglishQuartetName
FaceName
 Returns Facename
FamilyName
FamilyPlusFaceName
 Returns concatinated Family and Face names
IsEngravingFont
IsSimulated
IsSingleStrokeFont
IsSymbolFont
Italic
LogfontName
 Returns Windows Logfont Facename
PointSize
PostScriptName
 Returns the Font PostScriptName - "Apple font name"
QuartetName
RichTextFontName
 Returns the Font RichTextFontName used in RTF strings: {\\fonttbl...{\\fN RichTextFontName;}...}
Strikeout
Style
Underlined
Weight
Top
See Also
Reference
Font Class
Rhino.DocObjects Namespace