RhinoCommon API
BrepLoop Properties
The BrepLoop type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this loop.
Face
 BrepFace this loop belongs to.
LoopIndex
 Gets the index of this loop in the Brep.Loops collection.
LoopType
 type of loop.
Trims
 List of trims for this loop
Top
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace