RhinoCommon API
GetCircle Properties
The GetCircle type exposes the following members.
Properties
Name | Description
AllowDeformable
 Allow for deformable options
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Deformable
 Is the deformable option set
DeformableDegree
DeformablePointCount
InDiameterMode
 Determines if the "size" value is reperesenting a radius or diameter
Top
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace