RhinoCommon API
ViewCaptureWriter Properties
The ViewCaptureWriter type exposes the following members.
Properties
Name | Description
Dpi
Top
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace