RhinoCommon API
DetailViewObject Properties
The DetailViewObject type exposes the following members.
Properties
Name | Description
DetailGeometry
IsActive
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
In Rhino for Windows 6.5, this member is inherited from .CommonObjectIsValid.
PageToWorldTransform
 Returns the page coordinate to world coordinate transformation.
Viewport
WorldToPageTransform
 Gets the world coordinate to page coordinate transformation.
Top
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace