RhinoCommon API
ToolbarGroup Properties
The ToolbarGroup type exposes the following members.
Properties
Name | Description
Id
IsDocked
Name
Visible
Top
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace