RhinoCommon API
Light Properties
The Light type exposes the following members.
Properties
Name | Description
ChangeType
 Get what type of light change this represents
Data
 Get the actual light data
Id
 Get the light object id
IdCrc
 Get CRC computed from Id
Top
See Also
Reference
Light Class
Rhino.Render.ChangeQueue Namespace