RhinoCommon API
ICurrentEnvironment Properties
The ICurrentEnvironment type exposes the following members.
Properties
Name | Description
ForAnyUsage
ForBackground
ForBackground_CheckMode
ForLighting
ForReflectionAndRefraction
Top
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace