RhinoCommon API
GroupTable Properties
The GroupTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace