RhinoCommon API
SerializationOptions Properties
The SerializationOptions type exposes the following members.
Properties
Name | Description
RhinoVersion
 Gets or sets a value indicating the Rhino version.
WriteUserData
 Gets or sets a value indicating whether to write user data.
Top
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace