RhinoCommon SDK
ObjectEnumeratorSettings Properties
The ObjectEnumeratorSettings type exposes the following members.
Properties
Name | Description
ActiveObjects
ClassTypeFilter
DeletedObjects
HiddenObjects
IdefObjects
 When true, ONLY Instance Definitions will be returned
IncludeGrips
IncludeLights
IncludePhantoms
LayerIndexFilter
LockedObjects
NameFilter
NormalObjects
ObjectTypeFilter
ReferenceObjects
SelectedObjectsFilter
ViewportFilter
 Filter on value of object->IsActiveInViewport()
VisibleFilter
Top
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace