RhinoCommon API
BrepVertex Properties
The BrepVertex type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this vertex.
VertexIndex
 Gets the index of this vertex in the Brep.Vertices collection.
Top
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace