RhinoCommon SDK
DimensionStyle Properties
The DimensionStyle type exposes the following members.
Properties
Name | Description
AlternateBelowLine
AlternateLengthFactor
AlternateLengthFormat
AlternateLengthResolution
AlternatePrefix
AlternateRoundoff
AlternateSuffix
AlternateToleranceResolution
AlternateUnitsDisplay
AlternateZeroSuppress
AngleFormat
AngleResolution
AngleZeroSuppress
AngularRoundoff
ArcLengthSymbol
ArrowBlockId1
ArrowBlockId2
ArrowLength
ArrowType1
ArrowType2
BaselineSpacing
CentermarkSize
CenterMarkType
ComponentType
 Returns ModelGeometry.
 (Overrides ModelComponent.ComponentType.)
DimensionLineExtension
DimensionScale
DimensionScaleValue
DimRadialTextAngleType
DimRadialTextLocation
DimRadialTextOrientation
DimTextAngleType
DimTextLocation
DimTextOrientation
DrawForward
DrawTextMask
ExtensionLineExtension
ExtensionLineOffset
FixedExtensionLength
FixedExtensionOn
Font
HasFieldOverrides
 Checks if any fields in this DimensionStyle are overrides
IsChild
 Tests if this DimensionStyle is a child of any other DimensionStyle
IsDeleted
IsReference
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LeaderArrowBlockId
LeaderArrowLength
LeaderArrowType
LeaderContentAngleType
 Style of leader content angle Horizontal Aligned Rotated
LeaderCurveType
LeaderHasLanding
LeaderLandingLength
LeaderTextHorizontalAlignment
LeaderTextOrientation
LeaderTextRotationDegrees
LeaderTextRotationRadians
 Angle of leader text for Rotated style
LeaderTextVerticalAlignment
LengthFactor
LengthFormat
LengthResolution
MaskColor
MaskColorSource
MaskOffset
ParentId
 Get or Set the Id of this DimensionStyle's parent. If ParentId is Guid.Empty, this DimensionStyle has no parent
Prefix
Roundoff
ScaleLeftLengthMillimeters
ScaleRightLengthMillimeters
StackFractionFormat
StackHeightScale
Suffix
SuppressArrow1
SuppressArrow2
SuppressExtension1
SuppressExtension2
TextGap
TextHeight
TextHorizontalAlignment
TextMoveLeader
TextOrientation
TextRotation
TextUnderlined
TextVerticalAlignment
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
ToleranceZeroSuppress
ZeroSuppress
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace