RhinoCommon API
RenderSettings Properties
The RenderSettings type exposes the following members.
Properties
Name | Description
AmbientLight
 Gets or sets the ambient light color used in rendering.
AntialiasLevel
 Gets or sets antialias level, used for render quality
BackgroundColorBottom
 Gets or sets the background bottom color used in rendering.
BackgroundColorTop
 Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
BackgroundStyle
 How the viewport's backgroun should be filled.
DepthCue
 Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
Dithering
 Get the document dithering interface
FlatShade
 Gets or sets a value indicating whether to render using flat shading.
ImageDpi
 Number of dots/inch (dots=pixels) to use when printing and saving bitmaps. The default is 72.0 dots/inch.
ImageSize
 Gets or sets a value indicating the size of the rendering result if UseViewportSize is set to false. If UseViewportSize is set to true, then this value is ignored.
ImageUnitSystem
 unit system to use when converting image pixel size and dpi information into a print size. Default = inches
LinearWorkflow
 Get the document linear workflow interface
NamedView
 Get or set the given named view
RenderAnnotations
 Gets or sets a value indicating whether to instruct the rendering engine to show annotations, such as linear dimensions or angular dimensions.
RenderBackfaces
 Gets or sets a value indicating whether to render back faces.
RenderCurves
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
RenderIsoparams
 Gets or sets a value indicating whether to instruct the rendering engine to show isocurves.
RenderMeshEdges
 Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
RenderPoints
 Gets or sets a value indicating whether to instruct the rendering engine to show points.
RenderSource
 Gets or sets the render source RenderSettings.RenderingSources enumeration.
ScaleBackgroundToFit
 Gets or sets a value indicating whether to scale the wallpaper in the background or not. This is meaningful only if the viewport has a wallpaper and render settings are set to render Wallpaper into the background.
ShadowmapLevel
 0=none, 1=normal, 2=best.
Snapshot
 Set os get the given snapshot view
SpecificViewport
 Set or get the given specific viewport
TransparentBackground
 Gets or sets whether rendering should be done with transparent background.
UseHiddenLights
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
UseViewportSize
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
Top
See Also
Reference
RenderSettings Class
Rhino.Render Namespace