RhinoCommon API
Polyline Properties
The Polyline type exposes the following members.
Properties
Name | Description
IsClosed
 Gets a value that indicates whether this polyline is closed.
The polyline is considered to be closed if its start is identical to its endpoint.
IsValid
 Gets a value that indicates whether this polyline is valid.
Valid polylines have at least one segment, no Invalid points and no zero length segments.
Closed polylines with only two segments are also not considered valid.
Length
 Gets the total length of the polyline.
SegmentCount
 Gets the number of segments for this polyline.
Top
See Also
Reference
Polyline Class
Rhino.Geometry Namespace