RhinoCommon SDK
SubDFaceAccess Properties
The SubDFaceAccess type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of SubD faces.
First
Top
See Also
Reference
SubDFaceAccess Class
Rhino.Geometry.Collections Namespace