RhinoCommon API
PointCloud Properties
The PointCloud type exposes the following members.
Properties
Name | Description
ContainsColors
 Gets a value indicating whether or not the points in this pointcloud have colors assigned to them.
ContainsHiddenFlags
 Gets a value indicating whether or not the points in this pointcloud have hidden flags assigned to them.
ContainsNormals
 Gets a value indicating whether or not the points in this pointcloud have normals assigned to them.
Count
 Gets the number of points in this pointcloud.
HiddenPointCount
 Gets the number of points that have their Hidden flag set.
Item
 Gets the item at the given index.
Top
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace