RhinoCommon API
CommandEventArgs Properties
The CommandEventArgs type exposes the following members.
Properties
Name | Description
CommandEnglishName
 Gets the English name of the command that raised this event.
CommandId
 Gets the ID of the command that raised this event.
CommandLocalName
 Gets the name of the command that raised this event in the local language.
CommandPluginName
 Gets the name of the plug-in that this command belongs to. If the command is internal to Rhino, then this propert is an empty string.
CommandResult
 Gets the result of the command that raised this event. This value is only meaningful during EndCommand events.
Document
DocumentRuntimeSerialNumber
Top
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace