RhinoCommon API
CommandAliasList Properties
The CommandAliasList type exposes the following members.
Properties
Name | Description
Count
Returns the number of command alias in Rhino.
Top
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace