RhinoCommon API
ToolbarFile Properties
The ToolbarFile type exposes the following members.
Properties
Name | Description
GroupCount
Id
Name
Path
Full path to this file on disk
ToolbarCount
Top
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace