RhinoCommon API
Pen Properties
The ViewCaptureWriter.Pen type exposes the following members.
Properties
Name | Description
Color
Width
Top
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace