RhinoCommon API
Sun Properties
The Sun type exposes the following members.
Properties
Name | Description
Altitude
 Get the altitude for the sun. To set use SetPosition(azimuth, altitude)
Azimuth
 Get the azimuth for the sun. To set use SetPosition(azimuth, altitude)
DaylightSaving
Daylight savings time
DaylightSavingMinutes
Daylight saving minutes
Enabled
Turn the sun on/off in this document.
Latitude
Light
 Get a Light which represents the sun. If manual control is in effect, no sun calculation is performed; the function uses the values last used in calls to Azimuth, Altitude or Vector. If manual control is not in effect, the observer's position, date, time, time zone and daylight saving values are used to calculate the position of the sun.
Longitude
ManualControl
Set angles directly or use place/date/time
North
 Angle in degrees on world X-Y plane that should be considered north in the model. Angle is measured starting at X-Axis and travels counterclockwise. Y-Axis would be a north angle of 90 degrees.
SkylightOn |  Obsolete.
Turn skylight on or off.
TimeZone
 Measured in hours += UTC
Vector
Top
See Also
Reference
Sun Class
Rhino.Render Namespace