RhinoCommon API
File3dmPlugInDataTable Properties
The File3dmPlugInDataTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of File3dmPlugInData in this table.
Item
 Gets the File3dmPlugInData at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace