RhinoCommon API
BrepFace Properties
The BrepFace type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this face.
FaceIndex
Index of face in Brep.Faces array.
IsSurface
 Gets a value indicating whether the face is synonymous with the underlying surface. If a Face has no trimming curves then it is considered a Surface.
Loops
 Loops in this face.
OrientationIsReversed
 true if face orientation is opposite of natural surface orientation.
OuterLoop
 Every face has a single outer loop.
SurfaceIndex
 Surface index of the 3d surface geometry used by this face or -1
Top
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace