RhinoCommon API
PlugIn Properties
The PlugIn type exposes the following members.
Properties
Name | Description
AskOnLoadProtection
 If true, Rhino will display a warning dialog when load-protected plug-ins are attempting to load. If false, load-protected plug-ins will silently not load.
Assembly
Source assembly for this plug-in.
Description
 Returns the description of the plug-in, as found in the plug-in's assembly attributes.
Id
 Returns the Guid, or unique Id, of the plug-in.
InstalledPlugInCount
 Returns the number of installed Rhino plug-ins.
LicenseId
LoadAtStartup |  Obsolete.
LoadTime
 Plug-ins are typically loaded on demand when they are first needed. You can change this behavior to load the plug-in at during different stages in time by overriding this property.
Name
 Returns the name of the plug-in, as found in the plug-in's assembly attributes.
Settings
 Persistent plug-in settings.
SettingsDirectory
SettingsDirectoryAllUsers
Version
 Returns the version of the plug-in, as found in the plug-in's assembly attributes.
WindowPositionSettings
Top
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace