RhinoCommon API
ContentUuids Properties
The ContentUuids type exposes the following members.
Properties
Name | Description
AdvancedDotTextureType
BasicEnvironmentCCI
BasicEnvironmentType
BasicMaterialCCI
BasicMaterialType
BitmapTextureType
BlendMaterialCCI
BlendMaterialType
BlendTextureType
CompositeMaterialCCI
CompositeMaterialType
CrossHatchBumpTexture
CubeMapTextureType
DefaultEnvironmentInstance
DefaultMaterialInstance
DotBumpTexture
ExposureTextureType
EXRTextureType
FBmTextureType
GemMaterialType
GlassMaterialType
GradientTextureType
GraniteTextureType
GridTextureType
GritBumpTexture
HatchBumpTexture
HDRTextureType
LeatherBumpTexture
MarbleTextureType
MaskTextureType
MetalMaterialType
NoiseTextureType
PaintMaterialType
PerlinMarbleTextureType
PerturbingTextureType
PictureMaterialType
PlasterMaterialType
PlasticMaterialType
ProjectionChangerTextureType
RealtimeDisplayMaterialType
ResampleTextureType
SimpleBitmapTextureType
SingleColorTextureType
SpeckleBumpTexture
StuccoTextureType
Texture2DCheckerTextureType
Texture3DCheckerTextureType
TextureAdjustmentTextureType
TileTextureType
TurbulenceTextureType
WavesTextureType
WoodBumpTexture
WoodTextureType
Top
See Also
Reference
ContentUuids Class
Rhino.Render Namespace