RhinoCommon API
AngularDimension Properties
The AngularDimension type exposes the following members.
Properties
Name | Description
AngleFormat
AngleResolution
AngleRoundoff
AngleZeroSuppression
ArrowPoint1
ArrowPoint2
CenterPoint
DefPoint1
DefPoint2
DimlinePoint
In Rhino for Windows 6.5, this member is inherited from .DimensionNumericValue.
In Rhino for Windows 6.5, this member is inherited from .DimensionTextFormula.
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace