RhinoCommon API
ClippingPlaneSurface Properties
The ClippingPlaneSurface type exposes the following members.
Properties
Name | Description
Plane
 Gets or sets the clipping plane.
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace