RhinoCommon API
FileObjWriteOptions Properties
The FileObjWriteOptions type exposes the following members.
Properties
Name | Description
ActualFilePathOnMac
CreateNgons
 Setting to enable/diable the creation of ngons for the output
CullUnnecessaryVertexesInNgons
 Setting to determine whether interior colinear vertexes are part of the ngon.
EolType
ExportGroupNameLayerNames
 Setting to determine whether object, group or layer names will become "g"s in the OBJ output file
ExportMaterialDefinitions
 Setting to write an .mtl file and "usemtl"s in the obj file
ExportNormals
 Enable/disable export of vertex normals, if they exist.
ExportObjectNames
 Setting to determine what object names in Rhino will become in the OBJ output file
ExportOpenMeshes
 Enable/Disable bailing when an open mesh is encountered.
ExportTcs
 Enable/disable export of texture coordinates, if they exist.
ExportVcs
 Enable/disable export of vertex colors, if they exist.
IncludeUnweldedEdgesInNgons
 Setting to determine whether unwelded edges are ignored in the creation of an ngon.
MapZtoY
 Setting to transform Rhino's Z axis to OBJ's Y axis
MergeNestedGroupingNames
 Setting to merge nested layer or group names into a single OBJ group name
MeshParameters
 Mesh parameters to use when meshing geometry that is not already a mesh.
MeshType
MinNgonFaceCount
 Minimum number of faces to consider creation of ngon
ObjectType
SignificantDigits
 Number of significant digits to write out for floating point numbers
SortObjGroups
 Setting to enable/disable sorting of OBJ groups
TrimCurveType
 trimming curve option
UnderbarMaterialNames
 Enable/disable replacing white space with underbars in material names.
UseRelativeIndexing
 Determines whether to use relative indexing. TRUE = use relative (negative) indexing FALSE = use absolute (positive) indexing
UseSimpleDialog
 Determines whether to use the simple or detailed meshing dialog.
WrapLongLines
 Setting to enable/disable line wrapping with "\"s
Top
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace