RhinoCommon SDK
SubDFacePtr Properties
The SubDFacePtr type exposes the following members.
Properties
Name | Description
Below
Edges
EdgeVertexCount
Id
IsDefault
Next
 Links to next face on this level.
Previous
 Links to previous face on this level.
Status
SubD
Vertices
Top
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace