RhinoCommon SDK
AppearanceSettingsState Properties
The AppearanceSettingsState type exposes the following members.
Properties
Name | Description
CommandPromptBackgroundColor
Gets or sets the comand prompt background color.
CommandPromptHypertextColor
Gets or sets the comand prompt hypertext color.
CommandPromptTextColor
Gets or sets the command prompt text color.
CrosshairColor
Gets or sets the crosshair color.
CurrentLayerBackgroundColor
 Gets or sets the color used by the layer manager dialog as the background color for the current layer.
DefaultFontFaceName
 Gets or sets the name of the default font face.
DefaultLayerColor
 Gets or sets the default layer color.
DefaultObjectColor
Gets or sets the default object color.
EchoCommandsToHistoryWindow
Gets or sets a value that determines if command names are written to the history window.
EchoPromptsToHistoryWindow
Gets or sets a value that determines if prompt messages are written to the history window.
FeedbackColor
Gets or sets the feedback color.
FrameBackgroundColor
Gets or sets the frame background color.
GridThickLineColor
Gets or sets the color of the thick line in the grid.
GridThinLineColor
Gets or sets the color of the thin line in the grid.
GridXAxisLineColor
Gets or sets the color of X axis line in the grid.
GridYAxisLineColor
Gets or sets the color of Y axis line in the grid.
GridZAxisLineColor
Gets or sets the color of Z axis line in the grid.
LockedObjectColor
Gets or sets the color used to draw locked objects.
PageviewPaperColor
 CRhinoPageView paper background. A rectangle is drawn into the background of page views to represent the printed area. The alpha portion of the color is used to draw the paper blended into the background
SelectedObjectColor
 The color used to draw selected objects. The default is yellow, but this can be customized by the user.
ShowCrosshairs
Gets or sets a value that determines if cross hairs are visible.
ShowFullPathInTitleBar
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.
TrackingColor
Gets or sets the tracking color.
ViewportBackgroundColor
Gets or sets the viewport background color.
WorldCoordIconXAxisColor
Gets or sets the color of the world X axis of the world coordinates icon, appearing usually bottom left in viewports.
WorldCoordIconYAxisColor
Gets or sets the color of the world Y axis of the world coordinate icon, appearing usually bottom left in viewports.
WorldCoordIconZAxisColor
Gets or sets the color of the world Z axis of the world coordinate icon, appearing usually bottom left in viewports.
Top
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace