RhinoCommon API
RenderTexture Properties
The RenderTexture type exposes the following members.
Properties
Name | Description
LocalMappingTransform
 Gets the transformation that can be applied to the UVW vector to convert it from normalized texture space into locally mapped space (ie - with repeat, offset and rotation applied.)
RenderHashWithoutLocalMapping
 Render hash for texture excluding local mapping.
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace