RhinoCommon API
Skylight Properties
The Skylight type exposes the following members.
Properties
Name | Description
CustomEnvironment
CustomEnvironmentOn
Enabled
ShadowIntensity
Top
See Also
Reference
Skylight Class
Rhino.Render Namespace