RhinoCommon API
TextEntity Properties
The TextEntity type exposes the following members.
Properties
Name | Description
AnnotativeScalingEnabled
 Scale annotation according to detail scale factor in paperspace or by 1.0 in paperspace and not in a detail Otherwise, dimscale or text scale is used
FontIndex
 Gets or sets the index of font in document font table used by the text.
Justification
 Gets or sets the justification of text in relation to its base point.
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
In Rhino for Windows 6.25, this member is inherited from .AnnotationBaseMaskColor.
MaskEnabled
 Determines whether or not to draw a Text Mask
In Rhino for Windows 6.25, this member is inherited from .AnnotationBaseMaskEnabled.
MaskOffset
 distance around text to display mask
In Rhino for Windows 6.25, this member is inherited from .AnnotationBaseMaskOffset.
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
In Rhino for Windows 6.25, this member is inherited from .AnnotationBaseMaskUsesViewportColor.
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace