RhinoCommon API
ModelAidSettingsState Properties
The ModelAidSettingsState type exposes the following members.
Properties
Name | Description
AltPlusArrow
true mean Alt+arrow is used for nudging.
ControlPolygonDisplayDensity
Gets or sets the control polygon display density.
CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nudge step amount.
DisplayControlPolygon
Gets or sets the enabled state of Rhino's display control polygon.
ExtendToApparentIntersection
Gets or sets the enabled state of Rhino's extend to apparent intersections.
ExtendTrimLines
Gets or sets the enabled state of Rhino's extend trim lines.
GridSnap
Gets or sets the enabled state of Rhino's grid snap modeling aid.
HighlightControlPolygon
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
MousePickboxRadius
Gets or sets the radius of the mouse pick box in pixels.
NudgeKeyStep
Gets or sets the nudge step amount.
NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = uvn, -1 = not set.
Ortho
Gets or sets the enabled state of Rhino's ortho modeling aid.
OrthoAngle
Gets or sets the base orthogonal angle.
Osnap
Gets or sets the enabled state of Rhino's object snap modeling aid.
OsnapCursorMode
Gets or sets the OSnap cursor mode.
OsnapModes
 Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.
OsnapPickboxRadius
Enables or disables Rhino's planar modeling aid.
Planar
Gets or sets the enabled state of Rhino's Planar modeling aid.
PointDisplay
Gets or sets the point display mode.
ProjectSnapToCPlane
Gets or sets the enabled state of Rhino's Project modeling aid.
ShiftNudgeKeyStep
Gets or sets the Shift-key based nudge step amount.
SnapToLocked
Gets or sets the locked state of the snap modeling aid.
UniversalConstructionPlaneMode
Gets or sets the locked state of the snap modeling aid.
UseHorizontalDialog
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.
Top
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace