RhinoCommon SDK
ModelComponent Properties
The ModelComponent type exposes the following members.
Properties
Name | Description
ComponentStatus
 Gets or sets the component status of the model component.
ComponentType
 Gets the ModelComponentType for this object. Useful in switch statements.
HasId
 Returns a value indicating whether the component has an ID.
HasIndex
 Returns a value indicating whether the component has an Index.
HasName
 Returns a value indicating whether the component has a Name.
Id
 Gets or sets the ID of the current instance.
IdIsLocked
 Returns a value indicating whether the component ID is already locked.
Index
 Gets or sets the model component index attribute.
IndexIsLocked
 Returns a value indicating whether the component Index is already locked.
IsComponentStatusLocked
 The component status itself can be locked. This returns an indication.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
ON_DimStyle::DefaultMillimeterArchitecture
Name
 Gets or sets the name
NameIsLocked
 Returns a value indicating whether the component Name is already locked.
Top
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace