RhinoCommon API
ICurrentEnvironment_Get Properties
The ICurrentEnvironment_Get type exposes the following members.
Properties
Name | Description
ForBackground
ForBackground_CheckMode
ForLighting
ForReflectionAndRefraction
Top
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace