RhinoCommon API
RenderContentEventArgs Properties
The RenderContentEventArgs type exposes the following members.
Properties
Name | Description
Content
Document
EnvironmentUsage
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, ReflectionAndRefraction or Skylighting. Since 6.11
Reason
 Not when used in CurrentEnvironmentChanged (defaults to None).
Top
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace