RhinoCommon SDK
SubD Properties
The SubD type exposes the following members.
Properties
Name | Description
ActiveLevel
ActiveLevelSubDType
Edges
 Gets access to edges.
Faces
 Gets access to faces.
Level
Vertices
 Gets access to vertices.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace