RhinoCommon API
Field Properties
The Field type exposes the following members.
Properties
Name | Description
Key |  Obsolete.
 Field name value string passed to the constructor
Name
 Field name value string passed to the constructor.
Tag
 Gets or sets an object that contains data to associate with the field.
Top
See Also
Reference
Field Class
Rhino.Render.Fields Namespace