RhinoCommon API
DimStyleTable Properties
The DimStyleTable type exposes the following members.
Properties
Name | Description
BuiltInStyles
 Creates an array of default AnnotationStyle objects
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of dimstyles in the table.
In Rhino for Windows 6.22, this member is inherited from .CommonComponentTable<T>Count.
Current
 Returns an instance of the current DimensionStyle.
CurrentDimensionStyle
 Do not use. Use the Current property.
CurrentDimensionStyleIndex
CurrentId
CurrentIndex
Document
Document that owns this dimstyle table.
In Rhino for Windows 6.22, this member is inherited from .RhinoDocCommonTable<T>Document.
Item
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace