RhinoCommon API
DisplayConduit Properties
The DisplayConduit type exposes the following members.
Properties
Name | Description
Enabled
SpaceFilter
 If you want this conduit to only work in a specific space (model or page), then set this filter to that specific space. The default is None meaning no filter is applied
Top
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace