RhinoCommon API
File3dmPlugInData Properties
The File3dmPlugInData type exposes the following members.
Properties
Name | Description
PlugInId
 Plug-in this data is associated with
Top
See Also
Reference
File3dmPlugInData Class
Rhino.FileIO Namespace