RhinoCommon API
RevSurface Properties
The RevSurface type exposes the following members.
Properties
Name | Description
Angle
 Gets the start and end angles of revolution in radians. The interval angle must be increasing and satisfy RhinoMath.ZeroTolerance < Angle.Length<= 2.0 * System.Math.PI.
Axis
 Gets the axis of revolution.
Curve
 Gets the revolute curve.
Top
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace