RhinoCommon API
BitmapTable Properties
The BitmapTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Image.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
Gets the number of bitmaps in the table.
In Rhino for Windows 6.23, this member is inherited from .CommonComponentTable<T>Count.
Document
Gets the document that owns this bitmap table.
In Rhino for Windows 6.23, this member is inherited from .RhinoDocCommonTable<T>Document.
Item
 Conceptually, the bitmap table is an array of bitmaps. The operator[] can be used to get individual bitmaps.
Top
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace