RhinoCommon SDK
ViewTable Properties
The ViewTable type exposes the following members.
Properties
Name | Description
ActiveView
 Gets or Sets the active view.
Document
Document that owns this object table.
ModelSpaceIsActive
RedrawEnabled
Returns or sets (enable or disables) screen redrawing.
Top
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace