RhinoCommon SDK
File3dmObject Properties
The File3dmObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets the attributes that are linked with this document object.
Geometry
 Gets the geometry that is linked with this document object.
Name
 Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
Top
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace