RhinoCommon API
BlockEditCommand Properties
The BlockEditCommand type exposes the following members.
Properties
Name | Description
Replacement
 The current replacement command
Top
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace