RhinoCommon API
ParametersNames Properties
The PhysicallyBasedMaterial.ParametersNames type exposes the following members.
Properties
Name | Description
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Normal
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Smudge
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace