RhinoCommon SDK
Transform Properties
The Transform type exposes the following members.
Properties
Name | Description
Determinant
 The determinant of this 4x4 matrix.
Identity
 Gets a new identity transform matrix. An identity matrix defines no transformation.
IsIdentity
Return true if this Transform is the identity transform
IsValid
 Gets a value indicating whether or not this Transform is a valid matrix. A valid transform matrix is not allowed to have any invalid numbers.
Item
 Gets or sets the matrix value at the given row and column indixes.
M00
Gets or sets this[0,0].
M01
Gets or sets this[0,1].
M02
Gets or sets this[0,2].
M03
Gets or sets this[0,3].
M10
Gets or sets this[1,0].
M11
Gets or sets this[1,1].
M12
Gets or sets this[1,2].
M13
Gets or sets this[1,3].
M20
Gets or sets this[2,0].
M21
Gets or sets this[2,1].
M22
Gets or sets this[2,2].
M23
Gets or sets this[2,3].
M30
Gets or sets this[3,0].
M31
Gets or sets this[3,1].
M32
Gets or sets this[3,2].
M33
Gets or sets this[3,3].
SimilarityType
 Gets a value indicating whether or not the Transform maintains similarity. The easiest way to think of Similarity is that any circle, when transformed, remains a circle. Whereas a non-similarity Transform deforms circles into ellipses.
Unset
 Gets an XForm filled with RhinoMath.UnsetValue.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace