RhinoCommon SDK
SubDVertexSectorIterator Properties
The SubDVertexSectorIterator type exposes the following members.
Properties
Name | Description
CenterVertex
CurrentEdgeCcwNext
CurrentEdgeCcwNextFlipped
CurrentEdgeCcwPrev
CurrentEdgeCcwPrevFlipped
CurrentFace
CurrentFaceCenterVertexIndex
CurrentFaceFlipped
CurrentRingIndex
FirstFace
FirstFaceCenterVertexIndex
IsValid
Top
See Also
Reference
SubDVertexSectorIterator Class
Rhino.Geometry Namespace