RhinoCommon SDK
RhinoPageView Properties
The RhinoPageView type exposes the following members.
Properties
Name | Description
ActiveViewport
 The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
 (Overrides RhinoView.ActiveViewport.)
ActiveViewportID
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
 (Overrides RhinoView.ActiveViewportID.)
In Rhino for Windows 6.0 BETA, this member is inherited from .RhinoViewActiveViewportID.
PageHeight
 Height of the page in the document's PageUnitSystem
PageIsActive
 true if the page is active instead of any detail views. This occurs when the MainViewport.Id == ActiveViewportID.
PageName
Same as the MainViewport.Name.
PageNumber
 Gets or sets the runtime page number and updates the page number for all of the other pages. The first page has a value of 0
PageWidth
 Width of the page in the document's PageUnitSystem
Top
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace