RhinoCommon API
RadialDimension Properties
The RadialDimension type exposes the following members.
Properties
Name | Description
AnnotationType
CenterPoint
DimlinePoint
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
KneePoint
LeaderArrowBlockId
LeaderArrowSize
LeaderArrowType
LeaderCurveStyle
In Rhino for Windows 6.3, this member is inherited from .DimensionNumericValue.
RadiusPoint
TextAngleType |  (Overrides Dimension.TextAngleType.)
In Rhino for Windows 6.3, this member is inherited from .DimensionTextFormula.
TextLocation |  (Overrides Dimension.TextLocation.)
TextOrientation |  (Overrides Dimension.TextOrientation.)
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace