RhinoCommon API
ISettingsService Properties
The ISettingsService type exposes the following members.
Properties
Name | Description
RaiseChangedEventAfterWriting
 Return true if settings changed events should be raised immediately after writing the settings file.
SupportsAllUsers
 Return true if the settings system supports reading from the AllUsers location prior to the current user section. If this is true any settings read from AllUsers will be marked as read-only at runtime
UseFileWatchers
 Return true if the settings system should use file watchers when reading settings to determine when settings have changed so changed events can be raised.
Top
See Also
Reference
ISettingsService Interface
Rhino.Runtime Namespace