RhinoCommon API
RhinoReplaceObjectEventArgs Properties
The RhinoReplaceObjectEventArgs type exposes the following members.
Properties
Name | Description
Document
NewRhinoObject
ObjectId
OldRhinoObject
Top
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace