RhinoCommon API
ViewCaptureSettings Properties
The ViewCaptureSettings type exposes the following members.
Properties
Name | Description
ArrowheadSizeMillimeters
 arrowhead size in millimeters
CropRectangle
 Actual area of output rectangle that view capture is sent to.
DefaultPrintWidthMillimeters
 Line thickness used to print objects with no defined thickness (in mm)
Document
DrawAxis
DrawBackground
DrawBackgroundBitmap
DrawClippingPlanes
DrawGrid
DrawLights
DrawLockedObjects
DrawMargins
DrawSelectedObjectsOnly
DrawWallpaper
IsScaleToFit
 Returns true if the model has been scaled to fit.
IsValid
MediaSize
 Total size of the image or page in dots
ModelScaleType
OffsetAnchor
OutputColor
PointSizeMillimeters
 size of point objects in millimeters if scale <= 0 the size is minimized so points are always drawn as small as possible
RasterMode
Resolution
 Capture "density" in dots per inch
UsePrintWidths
WireThicknessScale
 scaling factor to apply to object print widths (typically 1.0). This is helpful when printing something at 1/2 scale and having all of the curves print 1/2 as thick
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace