RhinoCommon API
MeshInstance Properties
The MeshInstance type exposes the following members.
Properties
Name | Description
CastShadows
 Return true if mesh instance should cast shadows
GroupId
 Get identifier that specifies the grouping of these mesh instances - usually based on the object that this originally comprised.
InstanceId
 Get the instance identifier for this mesh instance.
MaterialId
 The Material CRC / RenderHash
MeshId
 Get the mesh identifier for this mesh instance.
MeshIndex
 Get the mesh index for this mesh instance.
ReceiveShadows
 Return true if mesh instance should receive shadows
RenderMaterial
 RenderMaterial associated with mesh instance
Transform
 Transform for the MeshInstance
Top
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace