RhinoCommon API
Skin Properties
The Skin type exposes the following members.
Properties
Name | Description
ActiveSkin
 Any time Rhino is running there is at most one skin being used (and possibly no skin). If a RhinoCommon based Skin class is being used, use ActiveSkin to get at the instance of this Skin class. May return null if no Skin is being used or if the skin is not a RhinoCommon based skin.
ApplicationName
If you want to provide a custom name for your skin.
MainRhinoIcon
If you want to provide a custom icon for your skin.
Settings
 Gets access to the skin persistent settings.
Top
See Also
Reference
Skin Class
Rhino.Runtime Namespace