RhinoCommon API
Layer Properties
The Layer type exposes the following members.
Properties
Name | Description
Color
 Gets or sets the display color for this layer.
ComponentStatus
 Gets or sets the status of the layer.
 (Overrides ModelComponent.ComponentStatus.)
ComponentType
 Returns Layer.
 (Overrides ModelComponent.ComponentType.)
FullPath
 Gets the full path to this layer. The full path includes nesting information.
Id
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
IgesLevel
 Gets or sets the IGES level for this layer.
IsDeleted
 Gets a value indicating whether this layer has been deleted and is currently in the Undo buffer.
IsExpanded
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
IsLocked
 Gets or sets a value indicating the locked state of this layer.
IsReference
 Gets a value indicting whether this layer is a referenced layer. Referenced layers are part of referenced documents.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsVisible
 Gets or sets the visibility of this layer.
LayerIndex
 Gets or sets the index of this layer.
LinetypeIndex
 Gets or sets the line-type index for this layer.
Name
Gets or sets the name of this layer.
ParentLayerId
 Gets the ID of the parent layer. Layers can be origanized in a hierarchical structure, in which case this returns the parent layer ID. If the layer has no parent, Guid.Empty will be returned.
PathSeparator
 The string "::" (colon,colon) is used to separate parent and child layer names.
PlotColor
 Gets or sets the plot color for this layer.
PlotWeight
 Gets or sets the weight of the plotting pen in millimeters. A weight of 0.0 indicates the "default" pen weight should be used. A weight of -1.0 indicates the layer should not be printed.
RenderMaterial
 Gets or sets the RenderMaterial for objects on this layer that have MaterialSource() == MaterialFromLayer. A null result indicates that no RenderMaterial has been assigned and the material created by the default Material constructor or the RenderMaterialIndex should be used.
RenderMaterialIndex
 Gets or sets the index of render material for objects on this layer that have MaterialSource() == MaterialFromLayer. A material index of -1 indicates no material has been assigned and the material created by the default Material constructor should be used.
SortIndex
 Runtime index used to sort layers in layer dialog.
UserStringCount
 Gets the amount of user strings.
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace