RhinoCommon API
Texture Properties
The Texture type exposes the following members.
Properties
Name | Description
ApplyUvwTransform
 If true then the UVW transform is applied to the texture otherwise the UVW transform is ignored.
Enabled
 If the texture is enabled then it will be visible in the rendered display otherwise it will not.
FileName
 Gets or sets a file name that is used by this texture.
NOTE: We are moving away from string-based FileName, and suggest the usage of the new FileReference class.
Also, this filename may well not be a path that makes sense on a user's computer because it was a path initially set on a different user's computer. If you want to get a workable path for this user, use the BitmapTable.Find function using this property.
FileReference
 Gets or sets a copy of the file reference that is used by this texture.
Remarks
After the get or the set method complete, you own the copy you received or passed in, and can Dispose() of it.
Id
 Gets the globally unique identifier of this texture.
MappingChannelId
TextureCombineMode
 Determines how this texture is combined with others in a material's texture list.
TextureType
 Controls how the pixels in the bitmap are interpreted
UvwTransform
 Transform to be applied to each instance of this texture if ApplyUvw is true
WrapU
 Texture wrapping mode in the U direction
WrapV
 Texture wrapping mode in the V direction
WrapW
 Texture wrapping mode in the W direction
Top
See Also
Reference
Texture Class
Rhino.DocObjects Namespace