RhinoCommon SDK
GetCone Properties
The GetCone type exposes the following members.
Properties
Name | Description
AllowInputAngle
ApexAngleDegrees
BaseAngleDegrees
Cap
ConeConstraint
 State of the cone/cyl constraint option. When the cone/cyl option is selected, the circle is being made as a base for a cone/cyl. By default the vertical cone/cyl option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Height
InDiameterMode
 Determines if the "size" value is reperesenting a radius or diameter
Top
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace