RhinoCommon SDK
SubDEdgeAccess Properties
The SubDEdgeAccess type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of SubD edges.
First
Top
See Also
Reference
SubDEdgeAccess Class
Rhino.Geometry.Collections Namespace