RhinoCommon API
OrdinateDimension Properties
The OrdinateDimension type exposes the following members.
Properties
Name | Description
DefPoint
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
In Rhino for Windows 6.26, this member is inherited from .DimensionNumericValue.
In Rhino for Windows 6.26, this member is inherited from .DimensionTextFormula.
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace