RhinoCommon SDK
SubDVertexPtr Properties
The SubDVertexPtr type exposes the following members.
Properties
Name | Description
Below
EdgeCount
Edges
EdgesOrdered
FaceCount
Faces
FacesOrdered
Id
IsTwoManifold
Location
Next
 Links to next vertex on this level.
Previous
 Links to previous vertex on this level.
Status
SubD
Tag
Top
See Also
Reference
SubDVertexPtr Structure
Rhino.Geometry Namespace