RhinoCommon API
NamedViewTable Properties
The NamedViewTable type exposes the following members.
Properties
Name | Description
Count
Number of named views in the table.
Document
Document that owns this table.
Item
 Conceptually, the named view table is an array of ViewInfo and their associated names. The indexing operator ([] in C#) can be used to get individual ViewInfo items.
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace