RhinoCommon API
LinearWorkflow Properties
The LinearWorkflow type exposes the following members.
Properties
Name | Description
Hash
 Linear workflow CRC
PostProcessFrameBuffer
 Linear workflow active state
PostProcessGamma
 Linear workflow gamma
PostProcessGammaReciprocal
 Linear workflow gamma
PreProcessColors
 Linear workflow active state
PreProcessGamma
 Linear workflow gamma
PreProcessTextures
 Linear workflow active state
Top
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace