RhinoCommon SDK
File3dmHistoryRecordTable Properties
The File3dmHistoryRecordTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of history records in this table.
Top
See Also
Reference
File3dmHistoryRecordTable Class
Rhino.FileIO Namespace