RhinoCommon SDK
PatchGetter Properties
The PatchGetter type exposes the following members.
Properties
Name | Description
SCount
XCount
Top
See Also
Reference
PatchGetter Class
Rhino.Geometry Namespace