RhinoCommon SDK
TextureMapping Properties
The TextureMapping type exposes the following members.
Properties
Name | Description
Id
 The unique Id for this texture mapping object.
MappingType
 Texture mapping type associated with this Mapping object.
NormalTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
PrimativeTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
UvwTransform
 Transform applied to mapping coordinate (u,v,w) to convert it into a texture coordinate.
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace