RhinoCommon API
ViewDisplayAttributes Properties
The DisplayPipelineAttributes.ViewDisplayAttributes type exposes the following members.
Properties
Name | Description
BlendGrid
DrawGrid
DrawGridAxes
DrawTransparentGridPlane
DrawWorldAxes
DrawZAxis
HorizontalViewportScale
ShowGridOnTop
UseDocumentGrid
VerticalViewportScale
WorldAxisColorX
WorldAxisColorY
WorldAxisColorZ
Top
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace