RhinoCommon SDK
Vector2f Properties
The Vector2f type exposes the following members.
Properties
Name | Description
X
 Gets or sets the X (first) component of this vector.
Y
 Gets or sets the Y (second) component of this vector.
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace