RhinoCommon API
EarthAnchorPoint Properties
The EarthAnchorPoint type exposes the following members.
Properties
Name | Description
Description
 Gets or sets the long form of the identifying information about this location.
EarthBasepointElevation
 Gets or sets the point elevation on earth, in meters.
EarthBasepointElevationZero
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
EarthBasepointLatitude
 Gets or sets a point latitude on earth, in decimal degrees. +90 = north pole, 0 = equator, -90 = south pole.
EarthBasepointLongitude
 Gets or sets the point longitude on earth, in decimal degrees.
0 = prime meridian (Greenwich meridian)
Values increase towards West
ModelBasePoint
Corresponding model point in model coordinates.
ModelEast
Earth directions in model coordinates.
ModelNorth
Earth directions in model coordinates.
Name
 Gets or sets the short form of the identifying information about this location.
Top
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace