RhinoCommon API
RhinoWindow Properties
The RhinoWindow type exposes the following members.
Properties
Name | Description
Handle
InvokeRequired
 See Control.InvokeRequired
Top
See Also
Reference
RhinoWindow Class
Rhino Namespace