RhinoCommon API
SweepTwoRail Properties
The SweepTwoRail type exposes the following members.
Properties
Name | Description
AngleToleranceRadians
ClosedSweep
 If the input rails are closed, ClosedSweep determines if the swept breps will also be closed.
MaintainHeight
SweepTolerance
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace