RhinoCommon API
Decal Properties
The Decal type exposes the following members.
Properties
Name | Description
CRC
 The decal CRC identifies a decal by its state. Multiple decals which would be exactly the same would have the same CRC and are culled from the system. If you store this value with the intention of using it to find the decal again later, you must update your stored value whenever the decal state changes. You can detect when a decal changes by watching for the OnUserDataTransformed event.
DecalMapping
 Gets the mapping of the decal.
DecalProjection
 Gets the decal's projection. Used only when mapping is planar.
EndLatitude
 Gets the end angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
EndLongitude
 Gets the end angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
Height
 Gets the height of the decal. Only used when mapping is cylindrical.
MapToInside
 Used only when mapping is cylindrical or spherical.
Origin
 Gets the origin of the decal in world space.
Radius
 Gets the radius of the decal. Only used when mapping is cylindrical or spherical.
StartLatitude
 Gets the start angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
StartLongitude
 Gets the start angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
TextureInstanceId
 Gets the texture ID for this decal.
Transparency
 Gets the decal's transparency in the range 0 to 1.
VectorAcross
 Gets the vector across. For cylindrical and spherical mapping, the vector is unitized.
VectorUp
 For cylindrical and spherical mapping, the vector is unitized.
Top
See Also
Reference
Decal Class
Rhino.Render Namespace