RhinoCommon API
RhinoTransformObjectsEventArgs Properties
The RhinoTransformObjectsEventArgs type exposes the following members.
Properties
Name | Description
ObjectCount
Objects
ObjectsWillBeCopied
Transform
Top
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace