RhinoCommon API
HatchPatternTable Properties
The HatchPatternTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of patterns in the table.
In Rhino for Windows 6.24, this member is inherited from .CommonComponentTable<T>Count.
CurrentHatchPatternIndex
 At all times, there is a "current" hatch pattern. Unless otherwise specified, new objects are assigned to the current hatch pattern. The current hatch pattern is never locked, hidden, or deleted.
Document
Document that owns this table.
In Rhino for Windows 6.24, this member is inherited from .RhinoDocCommonTable<T>Document.
Item
 Conceptually, the hatch pattern table is an array of hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by HatchPattern.IsDeleted.
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace