RhinoCommon API
ToolbarFileCollection Properties
The ToolbarFileCollection type exposes the following members.
Properties
Name | Description
Count
 Number of open toolbar files
Item
MruSidebarIsVisible
SidebarIsVisible
Top
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace