RhinoCommon SDK
SubDEdgePtr Properties
The SubDEdgePtr type exposes the following members.
Properties
Name | Description
Below
FaceCount
Id
Line
Next
 Links to next edge on this level.
Previous
 Links to previous edge on this level.
SectorCoefficientFrom
SectorCoefficientTo
Status
SubD
Tag
VertexFrom
VertexTo
Top
See Also
Reference
SubDEdgePtr Structure
Rhino.Geometry Namespace