RhinoCommon API
GetCylinder Properties
The GetCylinder type exposes the following members.
Properties
Name | Description
BothSidesOption
 Determine if the "both sides" option is enabled
Cap
CylinderConstraint
 State of the cone/cyl constraint option. When the cone/cyl option is selected, the circle is being made as a base for a cone/cyl. By default the vertical cone/cyl option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Height
 Height of cylinder
InDiameterMode
 Determines if the "size" value is reperesenting a radius or diameter
Top
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace