RhinoCommon SDK
MouseCallback Class
 Used for intercepting mouse events in the Rhino viewports.
Inheritance Hierarchy
System.Object
 Rhino.UI.MouseCallback
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class MouseCallback
Public MustInherit Class MouseCallback
The MouseCallback type exposes the following members.
Constructors
Name | Description
MouseCallback
Initializes a new instance of the MouseCallback class
Top
Properties
Name | Description
Enabled
Top
Methods
Name | Description
OnMouseDoubleClick
OnMouseDown
OnMouseEnter
OnMouseHover
OnMouseLeave
OnMouseMove
OnMouseUp
Top
See Also
Reference
Rhino.UI Namespace