RhinoCommon API
RhinoWindow Class
 Represents the top level window in Rhino
Inheritance Hierarchy
System.Object
 Rhino.RhinoWindow
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoWindow : IWin32Window
Public Class RhinoWindow
	Implements IWin32Window
The RhinoWindow type exposes the following members.
Properties
Name | Description
Handle
InvokeRequired
 See Control.InvokeRequired
Top
Methods
Name | Description
Invoke
Top
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino Namespace