RhinoCommon API
LoopFormula Enumeration
 Enumerates the alternative Loop implementations.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LoopFormula
Public Enumeration LoopFormula
Members
Member name | Value | Description
Loop | 0 |  The original Loop formula.
Warren | 1 |  Warren's improved formula.
WarrenWeimer | 2 |  The formula as explained by Weimer, improving over Warren's.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Geometry.MeshRefinements Namespace