RhinoCommon API
TextEntity Class
 Represents text geometry.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.TextEntity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class TextEntity : AnnotationBase
<SerializableAttribute>
Public Class TextEntity
	Inherits AnnotationBase
The TextEntity type exposes the following members.
Constructors
Name | Description
TextEntity()
 Initializes a new instance of the TextEntity class.
TextEntity(SerializationInfo, StreamingContext)
 Protected constructor used in serialization
Top
Properties
Name | Description
AnnotativeScalingEnabled
 Scale annotation according to detail scale factor in paperspace or by 1.0 in paperspace and not in a detail Otherwise, dimscale or text scale is used
FontIndex
 Gets or sets the index of font in document font table used by the text.
Justification
 Gets or sets the justification of text in relation to its base point.
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
In Rhino for Windows 6.27, this member is inherited from .AnnotationBaseMaskColor.
MaskEnabled
 Determines whether or not to draw a Text Mask
In Rhino for Windows 6.27, this member is inherited from .AnnotationBaseMaskEnabled.
MaskOffset
 distance around text to display mask
In Rhino for Windows 6.27, this member is inherited from .AnnotationBaseMaskOffset.
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
In Rhino for Windows 6.27, this member is inherited from .AnnotationBaseMaskUsesViewportColor.
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
Methods
Name | Description
Create
 Create Text geometry or null if input is invalid
CreateCurves
 Returns the outline curves.
CreateExtrusions
 Creates extrusions from the outline curves with specified height.
CreatePolySurfaces
 Creates breps from the outline curves with specified height.
CreateSurfaces
 Creates planar breps from the outline curves.
CreateWithRichText
 Create RichText geometry or null if input is invalid
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Explode
 Explodes this text entity into an array of curves.
In Rhino for Windows, this member is overridden by GetBoundingBox(Transform).
GetTextTransform
 Get the transform for this text object's text geometry
In Rhino for Windows, this member is overridden by NonConstOperation().
Transform(Transform, DimensionStyle)
 Transform the object by a 4x4 transform matrix and change text height override to accommodate scaling in the transform if necessary
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.Geometry Namespace