RhinoCommon API
PanelType Enumeration
 Panel type
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PanelType
Public Enumeration PanelType
Members
Member name | Value | Description
PerDoc | 0 |  Default panel type, creates a panel instance per document
System | 1 |  A System panel may appear in one or more container but the panel will be used for all open documents
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.UI Namespace