RhinoCommon API
ISettingsService Interface
 Settings serialization service
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ISettingsService
Public Interface ISettingsService
The ISettingsService type exposes the following members.
Properties
Name | Description
RaiseChangedEventAfterWriting
 Return true if settings changed events should be raised immediately after writing the settings file.
SupportsAllUsers
 Return true if the settings system supports reading from the AllUsers location prior to the current user section. If this is true any settings read from AllUsers will be marked as read-only at runtime
UseFileWatchers
 Return true if the settings system should use file watchers when reading settings to determine when settings have changed so changed events can be raised.
Top
Methods
Name | Description
DeleteSettingsFile
 Deletes the settings file.
ReadSettings
 Read settings XML contents into a Stream which will get passed to a XML document for parsing.
TestHarness
WriteSettings
 Writes the settings to OS specific location.
Top
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Runtime Namespace