RhinoCommon API
PhysicallyBasedMaterial.ParametersNames Class
 Helper class with fields containing the names of fields available in our PBR implementation.
Inheritance Hierarchy
System.Object
 Rhino.Render.PhysicallyBasedMaterial.ParametersNames
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ParametersNames
Public Class ParametersNames
The PhysicallyBasedMaterial.ParametersNames type exposes the following members.
Constructors
Name | Description
PhysicallyBasedMaterial.ParametersNames
Initializes a new instance of the PhysicallyBasedMaterial.ParametersNames class
Top
Properties
Name | Description
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Normal
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Smudge
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace