RhinoCommon API
TextureCombineMode Enumeration
 Determines how this texture is combined with others in a material's texture list.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureCombineMode
Public Enumeration TextureCombineMode
Members
Member name | Value | Description
None | 0
Modulate | 1 |  Modulate with material diffuse color
Decal | 2 |  Decal
Blend | 3 |  Blend texture with others in the material To "add" a texture, set BlendAmount = +1 To "subtract" a texture, set BlendAmount = -1
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.DocObjects Namespace