RhinoCommon API
TextureGeneration Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureGeneration"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureGeneration
Public Enumeration TextureGeneration
Members
Member name | Value | Description
Allow | 1
Disallow | 2
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Render Namespace