RhinoCommon API
LicenseBuildType Enumeration
License build contentType enumerations.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LicenseBuildType
Public Enumeration LicenseBuildType
Members
Member name | Value | Description
Unspecified | 0 | An unspecified build
Release | 100 | A release build (e.g. commercial, education, nfr, etc.)
Evaluation | 200 | A evaluation build
Beta | 300 | A beta build (e.g. wip)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.PlugIns Namespace