RhinoCommon API
LinearDimension Class
 Represents a linear dimension
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.LinearDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class LinearDimension : AnnotationBase
<SerializableAttribute>
Public Class LinearDimension
	Inherits AnnotationBase
The LinearDimension type exposes the following members.
Constructors
Name | Description
LinearDimension()
 Initializes a new instance of the LinearDimension class.
LinearDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
LinearDimension(Plane, Point2d, Point2d, Point2d)
Initializes a new instance of the LinearDimension class
Top
Properties
Name | Description
Aligned
 Gets or sets a value indicating whether this annotation is aligned.
AnnotationType
Arrowhead1End
 Gets the arrow head end of the first extension line.
Arrowhead2End
 Gets the arrow head end of the second extension line.
DimensionLinePoint
 Point on annotation plane where dimension line starts
DimensionStyleIndex
 Index of DimensionStyle in document DimStyle table used by the dimension.
DistanceBetweenArrowTips
 Gets the distance between arrow tips.
ExtensionLine1End
 End of the first extension line.
ExtensionLine2End
 End of the second extension line.
In Rhino for Windows 6.24, this member is inherited from .DimensionNumericValue.
In Rhino for Windows 6.24, this member is inherited from .DimensionTextFormula.
TextPosition
 Gets and sets the position of text on the plane.
In Rhino for Windows 6.24, this member is inherited from .DimensionTextPosition.
Top
Methods
Name | Description
Create
 Initialize Dimension parameters
In Rhino for Windows, this member is overridden by Dispose(Boolean).
FromPoints
 Initializes a new instance of the LinearDimension class, based on three points.
Get3dPoints
 Get locations of dimension's 3d points
In Rhino for Windows, this member is overridden by GetBoundingBox(Transform).
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
In Rhino for Windows, this member is overridden by NonConstOperation().
SetLocations
 Sets the three locations of the point, using two-dimensional points that refer to the plane of the annotation.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Geometry Namespace