RhinoCommon SDK
IRhRdkThumbnail Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkThumbnail"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IRhRdkThumbnail
Public Interface IRhRdkThumbnail
The IRhRdkThumbnail type exposes the following members.
Methods
Name | Description
Dib
GetDib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
See Also
Reference
Rhino.UI.Controls Namespace