RhinoCommon SDK
SubDEdgeDirPair Structure
[Missing <summary> documentation for "T:Rhino.Geometry.SubDEdgeDirPair"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public struct SubDEdgeDirPair
Public Structure SubDEdgeDirPair
The SubDEdgeDirPair type exposes the following members.
Constructors
Name | Description
SubDEdgeDirPair
Initializes a new instance of the SubDEdgeDirPair class
Top
Properties
Name | Description
Edge
Flipped
Top
Methods
Name | Description
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
Rhino.Geometry Namespace