RhinoCommon SDK
File3dmWriteOptions Class
Options used by File3dm.Write
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmWriteOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class File3dmWriteOptions
Public Class File3dmWriteOptions
The File3dmWriteOptions type exposes the following members.
Constructors
Name | Description
File3dmWriteOptions
 Initializes properties to defaults
Top
Properties
Name | Description
SaveAnalysisMeshes
 Include analysis meshes in the file. Default is true
SaveRenderMeshes
 Include Render meshes in the file. Default is true
SaveUserData
 Include custom user data in the file. Default is true
Version
 File version. Default is 5
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace