RhinoCommon API
Shapes Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DataSources.Shapes"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Shapes
Public Enumeration Shapes
Members
Member name | Value | Description
Square | 0
Wide | 1
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.Render.DataSources Namespace