RhinoCommon API
TextRunType Enumeration
[Missing <summary> documentation for "T:Rhino.Geometry.TextRunType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextRunType
Public Enumeration TextRunType
Members
Member name | Value | Description
None | 0
Text | 1
Newline | 2
Paragraph | 3
Column | 4
Field | 5
Fontdef | 6
Header | 7
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Geometry Namespace