RhinoCommon API
ClippingPlaneSurface Class
 Represents a planar surface that is used as clipping plane in viewports. A clipping plane object maintains a list of viewports that it clips against.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.PlaneSurface
 Rhino.Geometry.ClippingPlaneSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class ClippingPlaneSurface : PlaneSurface
<SerializableAttribute>
Public Class ClippingPlaneSurface
	Inherits PlaneSurface
The ClippingPlaneSurface type exposes the following members.
Constructors
Name | Description
ClippingPlaneSurface
 Protected constructor for internal use.
Top
Properties
Name | Description
Plane
 Gets or sets the clipping plane.
Top
Methods
Name | Description
AddClipViewportId
 Adds a viewport id to the list of viewports that this clipping plane clips.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
RemoveClipViewportId
 Removes a viewport id that this being clipped by this clipping plane.
ViewportIds
 Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Geometry Namespace