RhinoCommon API
ExtrudeCornerType Enumeration
 Corner types used for creating a tapered extrusion
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ExtrudeCornerType
Public Enumeration ExtrudeCornerType
Members
Member name | Value | Description
None | 0 | No Corner
Sharp | 1
Round | 2
Smooth | 3
Chamfer | 4
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Geometry Namespace