RhinoCommon SDK
ShowMessageButton Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageButton"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ShowMessageButton
Public Enumeration ShowMessageButton
Members
Member name | Value | Description
OK | 0
OKCancel | 1
AbortRetryIgnore | 2
YesNoCancel | 3
YesNo | 4
RetryCancel | 5
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI Namespace