RhinoCommon SDK
SubDVertexPtr Structure
 Efficiently manages a reference to a vertex in a SubD.
Contains connection information to faces and edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public struct SubDVertexPtr : IEquatable<SubDVertexPtr>
Public Structure SubDVertexPtr
	Implements IEquatable(Of SubDVertexPtr)
The SubDVertexPtr type exposes the following members.
Properties
Name | Description
Below
EdgeCount
Edges
EdgesOrdered
FaceCount
Faces
FacesOrdered
Id
IsTwoManifold
Location
Next
 Links to next vertex on this level.
Previous
 Links to previous vertex on this level.
Status
SubD
Tag
Top
Methods
Name | Description
AddEdge
AddFace
ClearEdges
ClearFaces
EdgeAt(Int32)
EdgeAt(Int32, Boolean)
EdgeFlipAt
EdgesTaggedCount
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(SubDVertexPtr)
FaceAt
FromSubDAndId
GetHashCode |  (Overrides ValueType.GetHashCode().)
GetSavedSubdivisionPoint
GetSectorIterator()
GetSectorIterator(SubDFacePtr, Boolean)
RemoveEdge
SetSavedSubdivisionPoint
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Equality
Inequality
Top
Fields
Name | Description
Default
Top
See Also
Reference
Rhino.Geometry Namespace