RhinoCommon API
RenderMaterial.StandardChildSlots Enumeration
 Defines enumerated constant values for use in TextureChildSlotName(RenderMaterial.StandardChildSlots) method.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum StandardChildSlots
Public Enumeration StandardChildSlots
Members
Member name | Value | Description
Diffuse | 100 |  Corresponds to ON_Texture::TYPE::bitmap_texture.
Transparency | 101 |  Corresponds to ON_Texture::transparancy_texture.
Bump | 102 |  Corresponds to ON_Texture::TYPE::bump_texture.
Environment | 103 |  Corresponds to ON_Texture::TYPE::emap_texture.
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Render Namespace