RhinoCommon SDK
SubDVertexSectorIterator Class
[Missing <summary> documentation for "T:Rhino.Geometry.SubDVertexSectorIterator"]
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDVertexSectorIterator
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class SubDVertexSectorIterator : ICloneable
Public NotInheritable Class SubDVertexSectorIterator
	Implements ICloneable
The SubDVertexSectorIterator type exposes the following members.
Properties
Name | Description
CenterVertex
CurrentEdgeCcwNext
CurrentEdgeCcwNextFlipped
CurrentEdgeCcwPrev
CurrentEdgeCcwPrevFlipped
CurrentFace
CurrentFaceCenterVertexIndex
CurrentFaceFlipped
CurrentRingIndex
FirstFace
FirstFaceCenterVertexIndex
IsValid
Top
Methods
Name | Description
AdvanceToNextFace
Dispose
Releases all resources used by the SubDVertexSectorIterator
Duplicate
Finalize |  (Overrides Object.Finalize().)
IncrementFace()
IncrementFace(Boolean, Boolean)
IncrementFaceToCrease
RecedeToPreviousFace
Reset
ResetToCurrentFace
ResetToFirstFace
Top
See Also
Reference
Rhino.Geometry Namespace