RhinoCommon API
Worksession Class
 Manages a list of models that are being used as reference geometry.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Worksession
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Worksession
Public NotInheritable Class Worksession
The Worksession type exposes the following members.
Properties
Name | Description
Document
 Gets the document that owns this worksession.
FileName
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
ModelCount
 Returns the number of models in the worksession. The active model will included in this count whether or not it has been saved.
ModelPaths
 Returns the paths to the models used by the worksession. If the active model has not been saved, then it will not be included in the output array.
RuntimeSerialNumber
 Unique serial number for the worksession while the application is running. This is not a persistent value.
Top
Methods
Name | Description
FileNameFromRuntimeSerialNumber
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
ModelPathFromSerialNumber
 Returns the path to a model, used by the worksession, given a reference model serial number
Top
See Also
Reference
Rhino.DocObjects Namespace