RhinoCommon API
it_strategy Enumeration
 Defines the collection type to iterate.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum it_strategy
Public Enumeration it_strategy
Members
Member name | Value | Description
ContentDataBase | 0
ContentSelection | 1
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Render Namespace