RhinoCommon SDK
SubDEdgePtr Structure
 Efficiently manages a reference to an edge in a SubD.
Contains connection information to faces and vertices.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public struct SubDEdgePtr : IEquatable<SubDEdgePtr>
Public Structure SubDEdgePtr
	Implements IEquatable(Of SubDEdgePtr)
The SubDEdgePtr type exposes the following members.
Properties
Name | Description
Below
FaceCount
Id
Line
Next
 Links to next edge on this level.
Previous
 Links to previous edge on this level.
SectorCoefficientFrom
SectorCoefficientTo
Status
SubD
Tag
VertexFrom
VertexTo
Top
Methods
Name | Description
ClearFaces
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(SubDEdgePtr)
FaceAt
GetHashCode |  (Overrides ValueType.GetHashCode().)
GetSavedSubdivisionPoint
OtherEnd
SetSavedSubdivisionPoint
ToString |  (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Equality
Inequality
Top
Fields
Name | Description
Default
UnsetSectorWeight
Top
See Also
Reference
Rhino.Geometry Namespace