RhinoCommon SDK
IPanelsService Interface
 For internal use, the IPanels service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public interface IPanelsService
Public Interface IPanelsService
The IPanelsService type exposes the following members.
Methods
Name | Description
ClosePanel
GetOpenPanelIds
GetPanel
IsPanelVisible
OpenPanel(Guid)
OpenPanel(Guid, Guid)
OpenPanelAsSibling
PanelDockBar
RegisterPanel
Top
See Also
Reference
Rhino.UI Namespace