RhinoCommon SDK
ObjectPropertiesPage.PropertyPageType Enumeration
 Standard page types, override PageType and return one of these types to replace a standard properties page with your page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum PropertyPageType
Public Enumeration PropertyPageType
Members
Member name | Value | Description
Material | 0 |  Replace the material page with this page, only works are the current render plug-in
Light | 1 |  Replace light page with this page, only works are the current render plug-in
Custom | 2 |  User defined custom page
Dimension | 4 |  If page is provided by Rhino and only dimensions are selected activate this page
Leader | 5 |  If page is provided by Rhino and leaders are selected activate this page
Text | 6 |  If page is provided by Rhino and only text objects are selected activate this page
Hatch | 7 |  If page is provided by Rhino and only hatch objects are selected activate this page
Dot | 8 |  If page is provided by Rhino and only dot objects are selected activate this page
TextureMapping | 9 |  If page is provided by Rhino and only texture mapping widget objects are selected activate this page
Detail | 10 |  If page is provided by Rhino and only detail objects are selected activate this page
ClippingPlane | 11 |  If page is provided by Rhino and only clipping plane objects are selected activate this page
NamedView | 12 |  If page is provided by Rhino and only named view widget objects are selected activate this page
Decal | 13 |  If page is provided by Rhino and only decal widget objects are selected activate this page
View | 14 |  If page is to be displayed when no objects are selected (ie - a view properties page)
See Also
Reference
Rhino.UI Namespace