RhinoCommon SDK
CustomBrepObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomBrepObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.BrepObject
 Rhino.DocObjects.Custom.CustomBrepObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class CustomBrepObject : BrepObject,
	IDisposable
Public MustInherit Class CustomBrepObject
	Inherits BrepObject
	Implements IDisposable
The CustomBrepObject type exposes the following members.
Constructors
Name | Description
CustomBrepObject()
Initializes a new instance of the CustomBrepObject class
CustomBrepObject(Brep)
Initializes a new instance of the CustomBrepObject class
Top
Properties
Name | Description
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomBrepObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomBrepObject and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace