RhinoCommon SDK
InstanceDefinition Class
 This is the same as InstanceDefinitionGeometry, but in a Rhino document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.Geometry.InstanceDefinitionGeometry
 Rhino.DocObjects.InstanceDefinition
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class InstanceDefinition : InstanceDefinitionGeometry
Public NotInheritable Class InstanceDefinition
	Inherits InstanceDefinitionGeometry
The InstanceDefinition type exposes the following members.
Properties
Name | Description
ArchiveFileStatus
 Returns the archive file status of a linked instance definition.
ComponentType
 Returns InstanceDefinition.
 (Overrides InstanceDefinitionGeometry.ComponentType.)
Description
Id |  (Overrides InstanceDefinitionGeometry.Id.)
Index
 Index of this instance definition in the index definition table.
 (Overrides ModelComponent.Index.)
IsDeleted
IsReference
 An object from a work session reference model is reference a reference object and cannot be modified. An object is a reference object if, and only if, it is on a reference layer.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsTenuous
LayerStyle
Name |  (Overrides InstanceDefinitionGeometry.Name.)
ObjectCount
 Number of objects this definition uses. This counts the objects that are used to define the geometry. This does NOT count the number of references to this instance definition.
SkipNestedLinkedDefinitions
 Controls how much geometry is read when a linked InstanceDefinition is updated.
SourceArchive
UpdateType
Url
 The hyperlink URL that is executed when the UrlDescription hyperlink is clicked on in the Insert and Block UI
UrlDescription
 The URL description displayed as a hyperlink in the Insert and Block UI
Top
Methods
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
CreatePreviewBitmap(DefinedViewportProjection, Size, Boolean)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size, Boolean)
Equals
 Equality is checked against InstanceDefinition.Id
 (Overrides Object.Equals(Object).)
GetContainers
 Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
GetHashCode
 Use Id.GetHashCode()
 (Overrides Object.GetHashCode().)
GetObjects
 Gets an array with the objects that belong to this instance definition.
GetReferences
 Gets a list of the CRhinoInstanceObjects (inserts) that contains a reference this instance definition.
InUse
 Determines whether the instance definition is referenced.
Object
 returns an object used as part of this definition.
UsesDefinition
 Determines if this instance definition contains a reference to another instance definition.
Top
See Also
Reference
Rhino.DocObjects Namespace