RhinoCommon SDK
DistanceDisplayMode Enumeration
[Missing <summary> documentation for "T:Rhino.UI.DistanceDisplayMode"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DistanceDisplayMode
Public Enumeration DistanceDisplayMode
Members
Member name | Value | Description
Decimal | 0
Fractional | 1
FeetInches | 2
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI Namespace