RhinoCommon API
HiddenLineDrawingSegment.Visibility Enumeration
 The different types of HiddenLineDrawingSegment visiblity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Visibility
Public Enumeration Visibility
Members
Member name | Value | Description
Unset | 0 |  Unset value
Visible | 1 |  Visible
Hidden | 2 |  Hidden
Duplicate | 3 |  Duplicate
Projecting | 4 |  Projects to a point (smaller than tolerance)
Clipped | 5 |  Clipped by clipping planes
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Geometry Namespace