RhinoCommon API
ViewCaptureSettings Class
 Used to hold the information required to generate high resolution output of a RhinoViewport. This is used for generating paper prints or image files
Inheritance Hierarchy
System.Object
 Rhino.Display.ViewCaptureSettings
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ViewCaptureSettings : IDisposable
Public Class ViewCaptureSettings
	Implements IDisposable
The ViewCaptureSettings type exposes the following members.
Constructors
Name | Description
ViewCaptureSettings()
Initializes a new instance of the ViewCaptureSettings class
ViewCaptureSettings(RhinoPageView, Double)
Initializes a new instance of the ViewCaptureSettings class
ViewCaptureSettings(RhinoView, Size, Double)
Initializes a new instance of the ViewCaptureSettings class
Top
Properties
Name | Description
ArrowheadSizeMillimeters
 arrowhead size in millimeters
CropRectangle
 Actual area of output rectangle that view capture is sent to.
DefaultPrintWidthMillimeters
 Line thickness used to print objects with no defined thickness (in mm)
Document
DrawAxis
DrawBackground
DrawBackgroundBitmap
DrawClippingPlanes
DrawGrid
DrawLights
DrawLockedObjects
DrawMargins
DrawSelectedObjectsOnly
DrawWallpaper
IsScaleToFit
 Returns true if the model has been scaled to fit.
IsValid
MediaSize
 Total size of the image or page in dots
ModelScaleType
OffsetAnchor
OutputColor
PointSizeMillimeters
 size of point objects in millimeters if scale <= 0 the size is minimized so points are always drawn as small as possible
RasterMode
Resolution
 Capture "density" in dots per inch
UsePrintWidths
WireThicknessScale
 scaling factor to apply to object print widths (typically 1.0). This is helpful when printing something at 1/2 scale and having all of the curves print 1/2 as thick
Top
Methods
Name | Description
Dispose
Actively reclaims unmanaged resources that this instance uses.
Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetMargins
 Get distances from the edge of the paper (MediaSize) to the CropRectangle in a defined unit system
GetModelScale
 Returns the model scale factor.
GetOffset
SetLayout
SetMargins
 Set distances from the edge of the paper (MediaSize) to the CropRectange in a defined unit system
SetModelScaleToFit
 Scales the model to fit.
SetModelScaleToValue
 Sets the model scale to a value.
SetOffset
SetViewport
Top
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Display Namespace