RhinoCommon API
TextHorizontalAlignment Enumeration
 Horizontal location of text attach point relative to text
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextHorizontalAlignment
Public Enumeration TextHorizontalAlignment
Members
Member name | Value | Description
Left | 0 |  Attach at left of text lines (Independent of glyphs being displayed.)
Center | 1 |  Attach point at center of text horizontal advance (not glyph bounding box)
Right | 2 |  Attach point at right text horizontal advance (not glyph bounding box)
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.DocObjects Namespace