RhinoCommon SDK
GetObjectGeometryFilter Delegate
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetObjectGeometryFilter"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public delegate bool GetObjectGeometryFilter(
	RhinoObject rhObject,
	GeometryBase geometry,
	ComponentIndex componentIndex
)
Public Delegate Function GetObjectGeometryFilter (
	rhObject As RhinoObject,
	geometry As GeometryBase,
	componentIndex As ComponentIndex
) As Boolean
Parameters
rhObject
Type: Rhino.DocObjects.RhinoObject
geometry
Type: Rhino.Geometry.GeometryBase
componentIndex
Type: Rhino.Geometry.ComponentIndex
Return Value
Type: Boolean
See Also
Reference
Rhino.Input.Custom Namespace