RhinoCommon API
MeshUnsafeLock Class
 Permits access to the underlying mesh raw data structures in an unsafe way.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshUnsafeLock
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class MeshUnsafeLock : IDisposable
Public NotInheritable Class MeshUnsafeLock
	Implements IDisposable
The MeshUnsafeLock type exposes the following members.
Methods
Name | Description
Release
 Releases the lock and updates the underlying unmanaged data structures.
VertexPoint3fArray
 Retrieves a pointer to the raw mesh vertex array, which uses coordinates defined with single precision floating point numbers.
Top
Remarks
This lock object needs to be disposed before using the Mesh in other calculations and this can be achieved with the using keyword (Using in VB.Net).
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.Geometry Namespace