RhinoCommon API
MaterialTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.MaterialTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MaterialTableEventType
Public Enumeration MaterialTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4
Current | 5
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.DocObjects.Tables Namespace