RhinoCommon API
Decals Class
Represents all the decals of an object.
Inheritance Hierarchy
System.Object
 Rhino.Render.Decals
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Decals : IEnumerable<Decal>,
	IEnumerable
Public Class Decals
	Implements IEnumerable(Of Decal), IEnumerable
The Decals type exposes the following members.
Methods
Name | Description
Add
 Add a new Decal to the decals list, use Decal.Create to create a new decal instance to add.
Clear
GetEnumerator
Remove
Top
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Render Namespace