RhinoCommon SDK
GetOption Class
 If you want to explicitly get string input, then use GetString class with options. If you only want to get options, then use this class (GetOption)
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetOption
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GetOption : GetBaseClass
Public Class GetOption
	Inherits GetBaseClass
The GetOption type exposes the following members.
Constructors
Name | Description
GetOption
Initializes a new instance of the GetOption class
Top
Methods
Name | Description
Get
 Call to get an option. A return value of "option" means the user selected a valid option. Use Option() the determine which option.
Top
See Also
Reference
Rhino.Input.Custom Namespace