RhinoCommon API
GetCylinder Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetCylinder"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetCylinder
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetCylinder : IDisposable
Public Class GetCylinder
	Implements IDisposable
The GetCylinder type exposes the following members.
Constructors
Name | Description
GetCylinder
Initializes a new instance of the GetCylinder class
Top
Properties
Name | Description
BothSidesOption
 Determine if the "both sides" option is enabled
Cap
CylinderConstraint
 State of the cone/cyl constraint option. When the cone/cyl option is selected, the circle is being made as a base for a cone/cyl. By default the vertical cone/cyl option not available but is not selected. By default the "Vertical" option applies to VerticalCircle.
DefaultSize
 Default radius or diameter (based on InDiameterMode)
Height
 Height of cylinder
InDiameterMode
 Determines if the "size" value is reperesenting a radius or diameter
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Get
 Perform the 'get' operation.
Top
See Also
Reference
Rhino.Input.Custom Namespace