RhinoCommon API
RenderWindow.Channel Class
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.Channel"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderWindow.Channel
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Channel : IDisposable
Public Class Channel
	Implements IDisposable
The RenderWindow.Channel type exposes the following members.
Methods
Name | Description
AddValue
 Add value to existing values at point x, y. If x or y are out of range, the function will fail and may crash Rhino.
Dispose()
Releases all resources used by the RenderWindow.Channel
Dispose(Boolean)
Releases the unmanaged resources used by the RenderWindow.Channel and optionally releases the managed resources
PixelSize
 Returns the size of the data in one pixel in the channel. For RDK standard channels, this value is always sizeof(float). For the special chanRGBA collective channel, this value is 4 * sizeof(float).
SetValue(Int32, Int32, Color4f)
 If x or y are out of range, the function will fail and may crash Rhino.
SetValue(Int32, Int32, Single)
 If x or y are out of range, the function will fail and may crash Rhino.
SetValues
 Set a pixel buffer
Top
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Render Namespace