RhinoCommon SDK
RhinoObject Class
 Represents an object in the document.
RhinoObjects should only ever be creatable by the RhinoDoc.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 More...
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoObject
Public Class RhinoObject
The RhinoObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the object attributes.
Document
 Gets the document that owns this object.
Geometry
 Gets the underlying geometry for this object.
All rhino objects are composed of geometry and attributes.
GripsOn
Gets or sets the activation state of object default editing grips.
GripsSelected
 true if grips are turned on and at least one is selected.
GroupCount
Number of groups object belongs to.
HasDynamicTransform
 True if the object has a dynamic transformation
Id
 Every object has a Guid (globally unique identifier, also known as UUID, or universally unique identifier). The default value is Guid.Empty.
 When an object is added to a model, the value is checked. If the value is Guid.Empty, a new Guid is created. If the value is not null but it is already used by another object in the model, a new Guid is created. If the value is not Guid.Empty and it is not used by another object in the model, then that value persists. When an object is updated, by a move for example, the value of ObjectId persists.
This value is the same as the one returned by this.Attributes.ObjectId.
IsDeletable
 Some objects cannot be deleted, like grips on lights and annotation objects.
IsDeleted
 true if the object is deleted. Deleted objects are kept by the document for undo purposes. Call RhinoDoc.UndeleteObject to undelete an object.
IsHidden
 An object must be in one of three modes: normal, locked or hidden. If an object is in normal mode, then the object's layer controls visibility and selectability. If an object is locked, then the object's layer controls visibility by the object cannot be selected. If the object is hidden, it is not visible and it cannot be selected.
IsInstanceDefinitionGeometry
 true if the object is used as part of an instance definition.
IsLocked
 An object must be in one of three modes: normal, locked or hidden. If an object is in normal mode, then the object's layer controls visibility and selectability. If an object is locked, then the object's layer controls visibility by the object cannot be selected. If the object is hidden, it is not visible and it cannot be selected.
IsNormal
 An object must be in one of three modes: normal, locked or hidden. If an object is in normal mode, then the object's layer controls visibility and selectability. If an object is locked, then the object's layer controls visibility by the object cannot be selected. If the object is hidden, it is not visible and it cannot be selected.
IsReference
 Gets a value indicating if an object is a reference object. An object from a work session reference model is a reference object and cannot be modified. An object is a reference object if, and only if, it is on a reference layer.
IsValid
 Tests an object to see if its data members are correctly initialized.
Name
 Rhino objects have optional text names. More than one object in a model can have the same name and some objects may have no name.
NextRuntimeSerialNumber
 Gets the runtime serial number that will be assigned to the next Rhino Object that is created.
ObjectType
 Gets the Rhino-based object type.
RuntimeSerialNumber
 Gets the objects runtime serial number.
Visible
Gets the object visibility.
Top
Methods
Name | Description
CommitChanges
 Moves changes made to this RhinoObject into the RhinoDoc.
CreateMeshes
 Create meshes used to render and analyze surface and polysrf objects.
DuplicateGeometry
 Constructs a deep (full) copy of the geometry.
EnableCustomGrips
Turns on/off the object's editing grips.
EnableVisualAnalysisMode
 Used to turn analysis modes on and off.
GetActiveVisualAnalysisModes
 Gets a list of currently enabled analysis modes for this object.
GetDynamicTransform
 While an object is being dynamically tranformed (dragged, rotated, ...), the current transformation can be retrieved and used for creating dynamic display.
GetGrips
 Returns grips for this object If grips are enabled. If grips are not enabled, returns null.
GetGroupList
 Allocates an array of group indices of length GroupCount. If GroupCount is 0, then this method returns null.
GetHighlightedSubObjects
 Gets a list of all highlighted subobjects.
GetMaterial
 Gets material that this object uses based on it's attributes and the document that the object is associated with. In the rare case that a document is not associated with this object, null will be returned.
GetMeshes
 Get existing meshes used to render and analyze surface and polysrf objects.
GetRenderMeshes
 Gets the render meshes of some objects.
GetRenderMeshParameters
 Meshing parameters that this object uses for generating render meshes. If the object's attributes do not have custom meshing parameters, then the document's meshing parameters are used.
GetSelectedSubObjects
Get a list of all selected sub-objects.
GetSubObjects
 Gets an array of sub-objects.
GetTextureChannels
 Get a list of the texture mapping channel Id's associated with object.
GetTextureMapping(Int32)
GetTextureMapping(Int32, Transform)
 Get objects texture mapping
Highlight
 Modifies the highlighting of the object.
HighlightSubObject
 Highlights a subobject.
InVisualAnalysisMode()
 Reports if any visual analysis mode is currently active for an object.
InVisualAnalysisMode(VisualAnalysisMode)
 Reports if a visual analysis mode is currently active for an object.
IsActiveInViewport
 Determine if this object is active in a particular viewport.
IsHighlighted
Check highlight state.
IsMeshable
 Returns true if the object is capable of having a mesh of the specified type
IsSelectable()
Reports if an object can be selected.
IsSelectable(Boolean, Boolean, Boolean, Boolean)
Reports if an object can be selected.
IsSelected
Check selection state.
IsSubObjectHighlighted
 Determines if a subobject is highlighted.
IsSubObjectSelectable
Reports if a subobject can be selected.
IsSubObjectSelected
Check sub-object selection state.
MemoryEstimate
 Computes an estimate of the number of bytes that this object is using in memory. Note that this is a runtime memory estimate and does not directly compare to the amount of space take up by the object when saved to a file.
MeshCount
 RhinoObjects can have several different types of meshes and different numbers of meshes. A b-rep can have a render and an analysis mesh on each face. A mesh object has a single render mesh and no analysis mesh. Curve, point, and annotation objects have no meshes.
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Mesh[], ObjectAttributes[])
Mesh Rhino Objects
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Boolean, Mesh[], ObjectAttributes[])
Mesh Rhino Objects
OnAddToDocument
 This call informs an object it is about to be added to the list of active objects in the document.
OnDeleteFromDocument
 This call informs an object it is about to be deleted. Some objects, like clipping planes, need to do a little extra cleanup before they are deleted.
OnDraw
 Called when Rhino wants to draw this object
OnDuplicate
 Called when this a new instance of this object is created and copied from an existing object
OnPick
 Called to determine if this object or some sub-portion of this object should be picked given a pick context.
OnPicked
 Called when this object has been picked
OnSelectionChanged
 Called when the selection state of this object has changed
OnSpaceMorph
 Called when a space morph has been applied to the geometry. Currently this only works for CustomMeshObject instances
OnTransform
 Called when a transformation has been applied to the geometry
Select(Boolean)
Selects an object.
Select(Boolean, Boolean)
Selects an object.
Select(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
Selects an object.
SelectSubObject
Reports if an object can be selected.
ShortDescription
 Gets a localized short descriptive name of the object.
UnhighlightAllSubObjects
 Removes highlighting from all subobjects.
UnselectAllSubObjects
 Removes selection from all subobjects.
Top
See Also
Reference
Rhino.DocObjects Namespace
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.BrepObject
 Rhino.DocObjects.ClippingPlaneObject
 Rhino.DocObjects.CurveObject
 Rhino.DocObjects.DetailViewObject
 Rhino.DocObjects.ExtrusionObject
 Rhino.DocObjects.GripObject
 Rhino.DocObjects.HatchObject
 Rhino.DocObjects.InstanceObject
 Rhino.DocObjects.LightObject
 Rhino.DocObjects.MeshObject
 Rhino.DocObjects.MorphControlObject
 Rhino.DocObjects.PointCloudObject
 Rhino.DocObjects.PointObject
 Rhino.DocObjects.SurfaceObject
 Rhino.DocObjects.TextDotObject