RhinoCommon API
GumballFrame Structure
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballFrame"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public struct GumballFrame
Public Structure GumballFrame
The GumballFrame type exposes the following members.
Properties
Name | Description
Plane
ScaleGripDistance
ScaleMode
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.UI.Gumball Namespace