RhinoCommon API
TextureMapping Class
 Represents a texture mapping.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Render.TextureMapping
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TextureMapping : CommonObject
Public Class TextureMapping
	Inherits CommonObject
The TextureMapping type exposes the following members.
Properties
Name | Description
ComponentType
 Returns TextureMapping.
 (Overrides ModelComponent.ComponentType.)
Id
 The unique Id for this texture mapping object.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
MappingType
 Texture mapping type associated with this Mapping object.
NormalTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
PrimativeTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
UvwTransform
 Transform applied to mapping coordinate (u,v,w) to convert it into a texture coordinate.
Top
Methods
Name | Description
CreateBoxMapping
Create a box projection texture mapping.
CreateCylinderMapping
Create a cylindrical projection texture mapping.
CreatePlaneMapping
Create a planar projection texture mapping
CreateSphereMapping
 Create a spherical projection texture mapping.
TryGetMappingBox
 Get a box projection from the texture mapping.
TryGetMappingCylinder
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingPlane
 Get plane mapping parameters from this texture mapping.
TryGetMappingSphere
 Get a spherical projection parameters from this texture mapping.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Render Namespace