RhinoCommon API
SmartTrackSettingsState Class
 Represents a snapshot of SmartTrackSettings.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.SmartTrackSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SmartTrackSettingsState
Public Class SmartTrackSettingsState
The SmartTrackSettingsState type exposes the following members.
Properties
Name | Description
ActivationDelayMilliseconds
Gets or sets the activation delay in milliseconds.
ActivePointColor
Gets or sets the active point color.
LineColor
Gets or sets the smart track line color.
MaxSmartPoints
Gets or sets the maximum number of smart points.
PointColor
Gets or sets the point color.
SmartOrtho
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
SmartTangents
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
TanPerpLineColor
Gets or sets the tangent and perpendicular line color.
UseDottedLines
Gets or sets a value indicating if lines are drawn dotted.
UseSmartTrack
Gets or sets if the 'smart track' feature is active.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.ApplicationSettings Namespace