RhinoCommon API
PhysicallyBasedMaterial Class
 Placeholder class for future PBR implementation
Inheritance Hierarchy
System.Object
 Rhino.Render.PhysicallyBasedMaterial
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.12
Syntax
public class PhysicallyBasedMaterial
Public Class PhysicallyBasedMaterial
The PhysicallyBasedMaterial type exposes the following members.
Constructors
Name | Description
PhysicallyBasedMaterial
Initializes a new instance of the PhysicallyBasedMaterial class
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace