RhinoCommon API
CrcRenderHashFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.CrcRenderHashFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CrcRenderHashFlags
Public Enumeration CrcRenderHashFlags
Members
Member name | Value | Description
Normal | 0
ExcludeLinearWorkflow | 1
ExcludeLocalMapping | 2
Reserved1 | 4
Reserved2 | 8
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Render Namespace