RhinoCommon API
IRhRdkContentThumbnail Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IRhRdkContentThumbnail : IRhRdkThumbnail
Public Interface IRhRdkContentThumbnail
	Inherits IRhRdkThumbnail
The IRhRdkContentThumbnail type exposes the following members.
Methods
Name | Description
ChildContent
GroupId
TopLevelContent
Top
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace