RhinoCommon API
ICurrentEnvironment Interface
[Missing <summary> documentation for "T:Rhino.Render.ICurrentEnvironment"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICurrentEnvironment : ICurrentEnvironment_Get
Public Interface ICurrentEnvironment
	Inherits ICurrentEnvironment_Get
The ICurrentEnvironment type exposes the following members.
Properties
Name | Description
ForAnyUsage
ForBackground
ForBackground_CheckMode
ForLighting
ForReflectionAndRefraction
Top
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.Render Namespace