RhinoCommon API
IRhinoUiDialogService Interface
 Used by Rhino.UI.Dialogs to access generic Eto dialogs from Rhino Common
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IRhinoUiDialogService
Public Interface IRhinoUiDialogService
The IRhinoUiDialogService type exposes the following members.
Methods
Name | Description
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowLineTypes
ShowListBox
ShowMultiListBox
ShowNumberBox
ShowPopupMenu
Top
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.UI Namespace