RhinoCommon SDK
SubDDisplayParameters Class
[Missing <summary> documentation for "T:Rhino.Geometry.SubDDisplayParameters"]
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDDisplayParameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class SubDDisplayParameters
Public Class SubDDisplayParameters
The SubDDisplayParameters type exposes the following members.
Constructors
Name | Description
SubDDisplayParameters
Initializes a new instance of the SubDDisplayParameters class
Top
Properties
Name | Description
DisplayDensity
Top
Methods
Name | Description
CreateFromDisplayDensity
Top
See Also
Reference
Rhino.Geometry Namespace