RhinoCommon API
CurveEvaluationSide Enumeration
 Defines enumerated values for the options that defines a curve evaluation side when evaluating kinks.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CurveEvaluationSide
Public Enumeration CurveEvaluationSide
Members
Member name | Value | Description
Default | 0 |  The default evaluation side.
Below | -1 |  The below evaluation side.
Above | 1 |  The above evaluation side.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Geometry Namespace