RhinoCommon API
IDialogService Interface
[Missing <summary> documentation for "T:Rhino.UI.IDialogService"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IDialogService
Public Interface IDialogService
The IDialogService type exposes the following members.
Methods
Name | Description
ObjectToWindowHandle
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowListBox
ShowMultiListBox
ShowNumberBox
WrapAsIWin32Window
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.UI Namespace