RhinoCommon API
InstanceReferenceGeometry Class
 Represents a reference to the geometry in a block definition.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.InstanceReferenceGeometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InstanceReferenceGeometry : GeometryBase
Public Class InstanceReferenceGeometry
	Inherits GeometryBase
The InstanceReferenceGeometry type exposes the following members.
Constructors
Name | Description
InstanceReferenceGeometry
 Constructor used when creating nested instance references.
Top
Properties
Name | Description
ParentIdefId
 The unique id for the parent instance definition of this instance reference.
Xform
Transformation for this reference.
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Geometry Namespace