RhinoCommon API
SupportOptions.RdkInitialLocation Enumeration
[Missing <summary> documentation for "T:Rhino.Render.SupportOptions.RdkInitialLocation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RdkInitialLocation
Public Enumeration RdkInitialLocation
Members
Member name | Value | Description
RenderContent | 0
LastOpenedFolder | 1
CustomFolder | 2
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.Render Namespace