RhinoCommon API
LightTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LightTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LightTableEventType
Public Enumeration LightTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4 | LightTable.Sort() potentially changed sort order.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.DocObjects.Tables Namespace