RhinoCommon SDK
Thumbnail Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.Thumbnail"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.Thumbnail
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class Thumbnail : IRhRdkThumbnail, IDisposable
Public Class Thumbnail
	Implements IRhRdkThumbnail, IDisposable
The Thumbnail type exposes the following members.
Constructors
Name | Description
Thumbnail
 Constructor for Thumbnail
Top
Properties
Name | Description
CppPointer
 Thumbnail c++ pointer
Top
Methods
Name | Description
Dib
Dispose
 Dispose for Thumbnail
Finalize
 Destructor for Thumbnail
 (Overrides Object.Finalize().)
GetDib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
See Also
Reference
Rhino.UI.Controls Namespace