RhinoCommon API
LightTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LightTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.LightTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LightTable : IEnumerable<LightObject>,
	IEnumerable
Public Class LightTable
	Implements IEnumerable(Of LightObject), IEnumerable
The LightTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of lights in the light table. Does not include Sun or Skylight.
Document
Document that owns this light table.
Item
Skylight
Sun
 Gets the Sun instance that is applied to the document.
If the RDK is loaded, an instance is always returned.
Top
Methods
Name | Description
Add(Light)
Add(Light, ObjectAttributes)
Delete(LightObject) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Find
FindIndex
 Retrieves a object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the LightObject with a given name.
Deleted lights have no name.
FindNameHash
 Finds a LightObject given its name hash.
GetEnumerator
Modify(Guid, Light)
Modify(Int32, Light)
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.DocObjects.Tables Namespace