RhinoCommon API
RenderContent.MatchDataResult Enumeration
 Return values for MatchData function
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MatchDataResult
Public Enumeration MatchDataResult
Members
Member name | Value | Description
None | 0
Some | 1
All | 2
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Render Namespace