RhinoCommon API
DynamicIconUsage Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DynamicIconUsage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DynamicIconUsage
Public Enumeration DynamicIconUsage
Members
Member name | Value | Description
TreeControl | 0 |  Dynamic icon appears in a tree control.
SubnodeControl | 1 |  Dynamic icon appears in a sub-node control (\see CRhRdkSubNodeCtrl)
ContentControl | 2 |  Dynamic icon appears in a content control (\see CRhRdkContentCtrl)
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Render Namespace