RhinoCommon API
MeshInstance Class
 Representation of ChangeQueue MeshInstance
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.MeshInstance
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MeshInstance
Public Class MeshInstance
The MeshInstance type exposes the following members.
Properties
Name | Description
CastShadows
 Return true if mesh instance should cast shadows
GroupId
 Get identifier that specifies the grouping of these mesh instances - usually based on the object that this originally comprised.
InstanceId
 Get the instance identifier for this mesh instance.
MaterialId
 The Material CRC / RenderHash
MeshId
 Get the mesh identifier for this mesh instance.
MeshIndex
 Get the mesh index for this mesh instance.
ReceiveShadows
 Return true if mesh instance should receive shadows
RenderMaterial
 RenderMaterial associated with mesh instance
Transform
 Transform for the MeshInstance
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace