RhinoCommon API
PlugInLoadTime Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.PlugInLoadTime"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PlugInLoadTime
Public Enumeration PlugInLoadTime
Members
Member name | Value | Description
Disabled | 0 | never load plug-in.
AtStartup | 1 | Load when Rhino starts.
WhenNeeded | 2 | (default) Load the first time a plug-in command used.
WhenNeededIgnoreDockingBars | 6 | Load the first time a plug-in command used NOT when restoring docking control bars.
WhenNeededOrOptionsDialog | 10 | When a plug-in command is used or the options dialog is shown.
WhenNeededOrTabbedDockBar | 18 | When a plug-in command is used or when a tabbed dockbar is loaded.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.PlugIns Namespace