RhinoCommon API
Dimension.ForceArrow Enumeration
 Arrowheads forced Inside, or Outside of extension lines, or moved to fit.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ForceArrow
Public Enumeration ForceArrow
Members
Member name | Value | Description
Auto | 0
Inside | 1
Outside | 2
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Geometry Namespace