RhinoCommon API
DimensionStyle Class
 Can also be considered an annotation style since it is used for more than just dimensions
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.DimensionStyle
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class DimensionStyle : CommonObject
<SerializableAttribute>
Public Class DimensionStyle
	Inherits CommonObject
The DimensionStyle type exposes the following members.
Constructors
Name | Description
DimensionStyle()
 Create a new non-document controlled annotation style
DimensionStyle(SerializationInfo, StreamingContext)
Initializes a new instance of the DimensionStyle class
Top
Properties
Name | Description
AlternateBelowLine
AlternateDimensionLengthDisplay
AlternateLengthFactor
AlternateLengthResolution
AlternatePrefix
AlternateRoundoff
AlternateSuffix
AlternateToleranceResolution
AlternateUnitsDisplay
AlternateZeroSuppress
AngleFormat
AngleResolution
AngleZeroSuppress
AngularRoundoff
ArcLengthSymbol
ArrowBlockId1
ArrowBlockId2
ArrowLength
ArrowType
ArrowType1
ArrowType2
BaselineSpacing
CentermarkSize
CenterMarkSize
CenterMarkType
ComponentType
 Returns ModelGeometry.
 (Overrides ModelComponent.ComponentType.)
DimensionLengthDisplay
DimensionLineExtension
DimensionScale
DimensionScaleValue
DimRadialTextAngleType
DimRadialTextLocation
DimRadialTextOrientation
DimTextAngleType
DimTextLocation
DimTextOrientation
DrawForward
DrawTextMask
ExtensionLineExtension
ExtensionLineOffset
FitArrow
FitText
FixedExtensionLength
FixedExtensionOn
Font
FontIndex
ForceDimensionLineBetweenExtensionLines
HasFieldOverrides
 Checks if any fields in this DimensionStyle are overrides
Id
In Rhino for Windows 6.23, this member is inherited from .ModelComponentId.
Index
In Rhino for Windows 6.23, this member is inherited from .ModelComponentIndex.
IsChild
 Tests if this DimensionStyle is a child of any other DimensionStyle
IsDeleted
IsReference
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LeaderArrowBlockId
LeaderArrowLength
LeaderArrowType
LeaderContentAngleType
 Style of leader content angle Horizontal Aligned Rotated
LeaderCurveType
LeaderHasLanding
LeaderLandingLength
LeaderTextHorizontalAlignment
LeaderTextOrientation
LeaderTextRotationDegrees
LeaderTextRotationRadians
 Angle of leader text for Rotated style
LeaderTextVerticalAlignment
LengthFactor
LengthFormat
LengthResolution
Linear display precision.
MaskColor
MaskColorSource
MaskOffset
Name
In Rhino for Windows 6.23, this member is inherited from .ModelComponentName.
ParentId
 Get or Set the Id of this DimensionStyle's parent. If ParentId is Guid.Empty, this DimensionStyle has no parent
Prefix
Roundoff
ScaleLeftLengthMillimeters
ScaleRightLengthMillimeters
StackFractionFormat
StackHeightScale
Suffix
SuppressArrow1
SuppressArrow2
SuppressExtension1
SuppressExtension2
TextAlignment
TextGap
TextHeight
TextHorizontalAlignment
TextMoveLeader
TextOrientation
TextRotation
TextUnderlined
TextVerticalAlignment
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
ToleranceZeroSuppress
ZeroSuppress
Top
Methods
Name | Description
AlternateDimensionLengthDisplayUnit
ClearAllFieldOverrides
 Sets all the fields in this DimensionStyle to be not overridden Does not change any dimstyle_id's or parent_id's
ClearFieldOverride
 Set the field as not overridden
CommitChanges
CopyFrom
 Copy settings from source dimension style without changing the name, Id or index of this DimensionStyle.
CreatePreviewBitmap
DimensionLengthDisplayUnit
Duplicate()
 Construct a deep (full) copy of this object.
Duplicate(String, Guid, Guid)
 Construct a deep (full) copy of this object.
IsChildOf
 Tests if this DimensionStyle is a child of a specific DimensionStyle
IsFieldOverriden
ScaleLengthValues
 Scales all length values by 'scale'
SetFieldOverride
 Set a field as overridden
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.DocObjects Namespace