RhinoCommon API
ViewCaptureWriter.VectorClipPathProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorClipPathProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorClipPathProc(
	int count,
	IntPtr points,
	int asBeziers
)
Public Delegate Sub VectorClipPathProc (
	count As Integer,
	points As IntPtr,
	asBeziers As Integer
)
Parameters
count
Type: System.Int32
points
Type: System.IntPtr
asBeziers
Type: System.Int32
See Also
Reference
Rhino.Runtime Namespace