RhinoCommon API
IndexPair Structure
 Represents two indices: I and J.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct IndexPair
<SerializableAttribute>
Public Structure IndexPair
The IndexPair type exposes the following members.
Constructors
Name | Description
IndexPair
 Initializes a new instance of IndexPair with two indices.
Top
Properties
Name | Description
Count
 Returns the amount of elements in this pair of indices, which is always 2.
I
 Gets or sets the first, I index.
Item
 Gets or sets a particular index of this structure.
Remarks
Only 0 and 1 are valid indices.
J
 Gets or sets the second, J index.
Top
Methods
Name | Description
Contains
 Determines whether the IndexPair contains a specific value.
CopyTo
 Copies the elements of the IndexPair to an Array, starting at a particular Array index.
GetEnumerator
 Gets an enumerator that goes over I and J, in this order.
IndexOf
 Determines the index of a specific item in IndexPair.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino Namespace