RhinoCommon API
LoadPlugInResult Enumeration
Result of attempting to load a plug-in
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LoadPlugInResult
Public Enumeration LoadPlugInResult
Members
Member name | Value | Description
Success | 0 | Successfully loaded
SuccessAlreadyLoaded | 1
ErrorUnknown | 2
See Also
Reference
Rhino.PlugIns Namespace