RhinoCommon API
Linetype Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Linetype"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Linetype
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Linetype : CommonObject
<SerializableAttribute>
Public Class Linetype
	Inherits CommonObject
The Linetype type exposes the following members.
Constructors
Name | Description
Linetype()
Initializes a new instance of the Linetype class
Linetype(SerializationInfo, StreamingContext)
Initializes a new instance of the Linetype class
Top
Properties
Name | Description
ComponentType
 Returns LinePattern.
 (Overrides ModelComponent.ComponentType.)
Id
 Gets the ID of this linetype object.
In Rhino for Windows 6.23, this member is inherited from .ModelComponentId.
IsDeleted
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
IsModified
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
IsReference
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LinetypeIndex
The index of this linetype.
Name
The name of this linetype.
PatternLength
Total length of one repeat of the pattern.
SegmentCount
Number of segments in the pattern.
Top
Methods
Name | Description
AppendSegment
Adds a segment to the pattern.
CommitChanges
Default
 Set linetype to default settings.
GetSegment
 Gets the segment information at a index.
ReadFromFile
 Reads linetypes from either a Rhino .3dm file or an AutoCAD .lin file.
RemoveSegment
Removes a segment in the linetype.
SetSegment
Sets the length and type of the segment at index.
SetSegments
Set all segments.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.DocObjects Namespace