RhinoCommon API
RenderWindow.RenderSuccessCode Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.RenderSuccessCode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RenderSuccessCode
Public Enumeration RenderSuccessCode
Members
Member name | Value | Description
Completed | 0
Failed | 1
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Render Namespace