RhinoCommon SDK
StackedDialogPage.RhinoCommonMessage Enumeration
 For internal use only.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum RhinoCommonMessage
Public Enumeration RhinoCommonMessage
Members
Member name | Value | Description
AttachedToTreeControl | 1 |  Sent when the page referenced is added to the tree control
See Also
Reference
Rhino.UI Namespace