RhinoCommon API
ShortcutKeySettings Class
 Contains static methods and properties to control keyboard shortcut keys
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.ShortcutKeySettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ShortcutKeySettings
Public NotInheritable Class ShortcutKeySettings
The ShortcutKeySettings type exposes the following members.
Methods
Name | Description
GetMacro
 Get macro associated with a given keyboard shortcut
SetMacro
 Set macro associated with a keyboard shortcut
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.ApplicationSettings Namespace