RhinoCommon API
AntialiasLevel Enumeration
 Provides the antialias levels used for render quality
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AntialiasLevel
Public Enumeration AntialiasLevel
Members
Member name | Value | Description
None | 0 |  Low quality
Draft | 1 |  Draft quality
Good | 2 |  Good quality
High | 3 |  High quality
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino Namespace