RhinoCommon API
ILocalizationService Interface
[Missing <summary> documentation for "T:Rhino.UI.ILocalizationService"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ILocalizationService
Public Interface ILocalizationService
The ILocalizationService type exposes the following members.
Methods
Name | Description
LocalizeCommandName
LocalizeDialogItem
LocalizeForm
LocalizeString
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.UI Namespace