RhinoCommon API
File3dmObject Class
 Used to store geometry table object definition and attributes in a File3dm.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmObject
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmObject
Public Class File3dmObject
The File3dmObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets the attributes that are linked with this document object.
ComponentType
 Returns ModelGeometry.
 (Overrides ModelComponent.ComponentType.)
Geometry
 Gets the geometry that is linked with this document object.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Name
 Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
Top
Methods
Name | Description
Equals(Object)
 Verified that two objects refer to the same object in a document.
 (Overrides Object.Equals(Object).)
Equals(File3dmObject)
 Verified that two File3dmObject items refer to the same object in a document.
GetHashCode()
 Provides an hash code for this item.
 (Overrides Object.GetHashCode().)
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.FileIO Namespace