RhinoCommon API
FilePdf Class
 Support for PDF file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePdf
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FilePdf
Public MustInherit Class FilePdf
The FilePdf type exposes the following members.
Constructors
Name | Description
FilePdf
Initializes a new instance of the FilePdf class
Top
Methods
Name | Description
AddPage(ViewCaptureSettings)
 Add a new page to this document and draw a viewport into it based on provided ViewCaptureSettings
AddPage(Int32, Int32, Int32)
 Add a blank page to this document
Create
 Create a new instance of a FilePdf class
DrawBitmap
 Draw a bitmap
DrawLine
 Draw a line
DrawPolyline
 Draw a polyline path
DrawText
 Draw text on a page
FirePreWriteEvent
 Called by the framework to fire a PreWrite event
PdfDocumentImplementation
 Get actual implementation of PdfDocument class
Write(Stream)
 Write pdf to a stream
Write(String)
 Write pdf to a file
Top
Events
Name | Description
PreWrite
 Fired immediately before a Pdf is written
Top
See Also
Reference
Rhino.FileIO Namespace