RhinoCommon SDK
ThumbnailViewModelFactory Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailViewModelFactory"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.FactoryBase
 Rhino.UI.Controls.InternalRdkViewModelFactory
 Rhino.UI.Controls.ThumbnailViewModelFactory
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class ThumbnailViewModelFactory : InternalRdkViewModelFactory
Public Class ThumbnailViewModelFactory
	Inherits InternalRdkViewModelFactory
The ThumbnailViewModelFactory type exposes the following members.
Constructors
Name | Description
ThumbnailViewModelFactory
Initializes a new instance of the ThumbnailViewModelFactory class
Top
Methods
Name | Description
Get |  (Overrides FactoryBase.Get(Guid).)
Top
See Also
Reference
Rhino.UI.Controls Namespace