RhinoCommon SDK
it_Flags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.it_Flags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[FlagsAttribute]
public enum it_Flags
<FlagsAttribute>
Public Enumeration it_Flags
Members
Member name | Value | Description
it_Normal | 0
it_IncludeChildren | 1
it_IncludeSingleProxies | 2
it_IncludeMultiProxies | 4
it_IncludeAutoDeleted | 8
it_UpdateProxies | 268435456
See Also
Reference
Rhino.Render Namespace