RhinoCommon API
Mesh Class
 Represents a geometry type that is defined by vertices and faces.
This is often called a face-vertex mesh.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Mesh
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Mesh : GeometryBase
<SerializableAttribute>
Public Class Mesh
	Inherits GeometryBase
The Mesh type exposes the following members.
Constructors
Name | Description
Mesh()
Initializes a new empty mesh.
Mesh(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
ComponentStates
 Gets access to the vertex hidden/visibility collection in this mesh. This is a runtime property and it is not saved in the 3dm file.
DisjointMeshCount
 Gets the number of disjoint (topologically unconnected) pieces in this mesh.
FaceNormals
 Gets access to the face normal collection in this mesh.
Faces
 Gets access to the mesh face list.
HasCachedTextureCoordinates
 Will return true if SetCachedTextureCoordinates has been called; otherwise will return false.
IsClosed
 Gets a value indicating whether a mesh is considered to be closed (solid). A mesh is considered solid when every mesh edge borders two or more faces.
Ngons
 Gets access to the mesh ngon list.
Ngons represent groups of Faces (triangles + quads).
Faces are used to tessellate an Ngon internally.
When a triangle or quad is referenced in the Ngon list, it is no longer visualized and conceived as a single entity, but takes part of the Ngon.
If you need to get access to both Ngons and the faces that are not referenced by Ngons, that is, all polygons that are visible in the mesh, then use the GetNgonAndFacesEnumerable() helper method.
Normals
 Gets access to the vertex normal collection in this mesh.
PartitionCount
 Number of partition information chunks stored on this mesh based on the last call to CreatePartitions
TextureCoordinates
 Gets access to the vertex texture coordinate collection in this mesh.
TopologyEdges
 Gets the MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.
TopologyVertices
 Gets the MeshTopologyVertexList object associated with this mesh.
This object stores vertex connectivity and the indices of vertices that were unified while computing the edge topology.
VertexColors
 Gets access to the (optional) vertex color collection in this mesh.
Vertices
 Gets access to the vertices set of this mesh.
Top
Methods
Name | Description
Append
 Appends a copy of another mesh to this one and updates indices of appended mesh parts.
ClearSurfaceData
 Removes surface parameters, curvature parameters and surface statistics from the mesh.
ClearTextureData
 Removes all texture coordinate information from this mesh.
ClosestMeshPoint
 Gets the point on the mesh that is closest to a given test point. Similar to the ClosestPoint function except this returns a MeshPoint class which includes extra information beyond just the location of the closest point.
ClosestPoint(Point3d)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Double)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Vector3d, Double)
 Gets the point on the mesh that is closest to a given test point.
CollapseFacesByArea
 Collapses multiple mesh faces, with areas less than LessThanArea and greater than GreaterThanArea, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
CollapseFacesByByAspectRatio
 Collapses a multiple mesh faces, determined by face aspect ratio, based on criteria found in Stan Melax's polygon reduction, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
CollapseFacesByEdgeLength
 Collapses multiple mesh faces, with greater/less than edge length, based on the principles found in Stan Melax's mesh reduction PDF, see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
ColorAt(MeshPoint)
 Evaluate a mesh color at a set of barycentric coordinates.
ColorAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Compact
 Removes any unreferenced objects from arrays, reindexes as needed and shrinks arrays to minimum required size.
ComputeAutoCreaseInformation
 Do not use this method. Length: top.Mesh.Vertices.Count
ComputeThickness(IEnumerable<Mesh>, Double)
 Compute thickness metrics for this mesh.
ComputeThickness(IEnumerable<Mesh>, Double, CancellationToken)
 Compute thickness metrics for this mesh.
ComputeThickness(IEnumerable<Mesh>, Double, Double, CancellationToken)
 Compute thickness metrics for this mesh.
CopyFrom
 Copies mesh values into this mesh from another mesh.
CreateBooleanDifference
 Computes the solid difference of two sets of Meshes.
CreateBooleanIntersection
 Computes the solid intersection of two sets of meshes.
CreateBooleanSplit
 Splits a set of meshes with another set.
CreateBooleanUnion
 Computes the solid union of a set of meshes.
CreateContourCurves(Mesh, Plane)
 Constructs contour curves for a mesh, sectioned at a plane.
CreateContourCurves(Mesh, Point3d, Point3d, Double)
 Constructs contour curves for a mesh, sectioned along a linear axis.
CreateFromBox(BoundingBox, Int32, Int32, Int32)
 Constructs new mesh that matches a bounding box.
CreateFromBox(Box, Int32, Int32, Int32)
 Constructs new mesh that matches an aligned box.
CreateFromBox(IEnumerable<Point3d>, Int32, Int32, Int32)
 Constructs new mesh from 8 corner points.
CreateFromBrep(Brep)
 Constructs a mesh from a brep.
CreateFromBrep(Brep, MeshingParameters)
 Constructs a mesh from a brep.
CreateFromClosedPolyline
 Attempts to create a Mesh that is a triangulation of a closed polyline.
CreateFromCone
Constructs a mesh cone
CreateFromCurvePipe
 Constructs a new mesh pipe from a curve.
CreateFromCylinder
Constructs a mesh cylinder
CreateFromLines
 Creates a mesh by analizing the edge structure that could result from the extraction of edges from an original mesh.
CreateFromPlanarBoundary(Curve, MeshingParameters)
 Do not use this overload. Use version that takes a tolerance parameter instead.
CreateFromPlanarBoundary(Curve, MeshingParameters, Double)
 Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
CreateFromPlane
 Constructs a planar mesh grid.
CreateFromSphere
 Constructs a mesh sphere.
CreateFromSurface(Surface)
 Constructs a mesh from a surface
CreateFromSurface(Surface, MeshingParameters)
 Constructs a mesh from a surface
CreateFromTessellation
 Attempts to create a mesh that is a triangulation of a list of points, projected on a plane, including its holes and fixed edges.
CreateIcoSphere
 Constructs a icospherical mesh. A mesh icosphere differs from a standard UV mesh sphere in that it's vertices are evenly distributed. A mesh icosphere starts from an icosahedron (a regular polyhedron with 20 equilateral triangles). It is then refined by splitting each triangle into 4 smaller triangles. This splitting can be done several times.
CreatePartitions
 In ancient times (or modern smartphone times), some rendering engines were only able to process small batches of triangles and the CreatePartitions() function was provided to partition the mesh into subsets of vertices and faces that those rendering engines could handle.
CreatePatch
 Construct a mesh patch from a variety of input geometry.
CreateQuadSphere
 Constructs a quad mesh sphere. A quad mesh sphere differs from a standard UV mesh sphere in that it's vertices are evenly distributed. A quad mesh sphere starts from a cube (a regular polyhedron with 6 square sides). It is then refined by splitting each quad into 4 smaller quads. This splitting can be done several times.
CreateRefinedCatmullClarkMesh
 Instantiates a new mesh that represents a Catmull-Clark subdivision of the mesh.
CreateRefinedLoopMesh
 Instantiates a new mesh that represents a Loop subdivision of the mesh.
DestroyPartition
 Destroys mesh partition.
DestroyTopology
 Removes topology data, forcing all topology information to be recomputed.
DestroyTree
 Destroys the mesh vertex access tree.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Duplicate
 Constructs a copy of this mesh. This is the same as DuplicateMesh().
 (Overrides GeometryBase.Duplicate().)
DuplicateMesh
Constructs a copy of this mesh. This is the same as Duplicate().
EvaluateMeshGeometry
 If the mesh has SurfaceParameters, the surface is evaluated at these parameters and the mesh geometry is updated.
ExplodeAtUnweldedEdges
 Explode the mesh into submeshes where a submesh is a collection of faces that are contained within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share the edge have unique mesh vertexes (not mesh topology vertexes) at both ends of the edge.
ExtendSelectionByEdgeRidge
 Suggests an extension of a selection set by using information related with topology and alignment.
ExtendSelectionByFaceLoop
 Suggests an extension of a face selection set by using information related with topology and alignment.
ExtractNonManifoldEdges
 Extracts, or removes, non-manifold mesh edges.
FileHole
 Given a starting "naked" edge index, this function attempts to determine a "hole" by chaining additional naked edges together until if returns to the start index. Then it triangulates the closed polygon and either adds the faces to the mesh.
FillHoles
 Attempts to determine "holes" in the mesh by chaining naked edges together. Then it triangulates the closed polygons adds the faces to the mesh.
Flip
Reverses the direction of the mesh.
GetCachedTextureCoordinates
 Call this method to get cached texture coordinates for a texture mapping with the specified Id.
GetNakedEdgePointStatus
 Returns an array of bool values equal in length to the number of vertices in this mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is not completely surrounded by faces.
GetNakedEdges
 Returns all edges of a mesh that are considered "naked" in the sense that the edge only has one face.
GetNgonAndFacesCount
 Retrieves the count of items that GetNgonAndFacesEnumerable() will provide.
GetNgonAndFacesEnumerable
 Retrieves a complete enumerable, i.e., one that provides an iterator over every face that is present, no matter if defined as a triangle, a quad, or a strictly over-four-sided ngon.
GetOutlines(Plane)
 Constructs the outlines of a mesh projected against a plane.
GetOutlines(RhinoViewport)
 Constructs the outlines of a mesh. The projection information in the viewport is used to determine how the outlines are projected.
GetOutlines(ViewportInfo, Plane)
 Constructs the outlines of a mesh.
GetPartition
 Retrieves a partition. See CreatePartitions(Int32, Int32) for details.
GetUnsafeLock
 Allows to obtain unsafe pointers to the underlying unmanaged data structures of the mesh.
HealNakedEdges
 Attempts to "heal" naked edges in a mesh based on a given distance. First attempts to move vertexes to neighboring vertexes that are within that distance away. Then it finds edges that have a closest point to the vertex within the distance and splits the edge. When it finds one it splits the edge and makes two new edges using that point.
IsManifold
 Gets a value indicating whether or not the mesh is manifold. A manifold mesh does not have any edge that borders more than two faces.
IsPointInside
 Determines if a point is inside a solid mesh.
In Rhino for Windows, this member is overridden by NonConstOperation().
NormalAt(MeshPoint)
 Evaluate a mesh normal at a set of barycentric coordinates.
NormalAt(Int32, Double, Double, Double, Double)
 Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
Offset(Double)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Same as Mesh.Offset(distance, false)
Offset(Double, Boolean)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function.
Offset(Double, Boolean, Vector3d)
 Makes a new mesh with vertices offset a distance along the direction parameter. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function.
OnSwitchToNonConst
 Performs some memory cleanup if necessary
 (Overrides GeometryBase.OnSwitchToNonConst().)
PointAt(MeshPoint)
 Evaluate a mesh at a set of barycentric coordinates.
PointAt(Int32, Double, Double, Double, Double)
 Evaluates a mesh at a set of barycentric coordinates. Barycentric coordinates must be assigned in accordance with the rules as defined by MeshPoint.T.
PullPointsToMesh
 Pulls a collection of points to a mesh.
RebuildNormals
 Removes mesh normals and reconstructs the face and vertex normals based on the orientation of the faces.
Reduce(ReduceMeshParameters)
Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean)
 Reduce polygon count
Reduce(Int32, Boolean, Int32, Boolean, CancellationToken, IProgress<Double>, String)
Reduce polygon count
ReleaseUnsafeLock
 Updates the Mesh data with the information that was stored via the MeshUnsafeLock.
SetCachedTextureCoordinates
 Set cached texture coordinates using the specified mapping.
SetTextureCoordinates
 Set texture coordinates using given mapping and applying given transform. Set lazy to false to generate texture coordinates right away.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
Smooth(Double, Boolean, Boolean, Boolean, Boolean, SmoothingCoordinateSystem, Plane)
 Smooths a mesh by averaging the positions of mesh vertices in a specified region.
SolidOrientation
 Determines orientation of a "solid" mesh.
Split(Mesh)
 Split a mesh with another mesh.
Split(IEnumerable<Mesh>)
 Split a mesh with a collection of meshes.
Split(Plane)
 Split a mesh by an infinite plane.
SplitDisjointPieces
 Splits up the mesh into its unconnected pieces.
UnifyNormals()
 Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function does not modify mesh vertex normals, it rearranges the mesh face winding and face normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
UnifyNormals(Boolean)
 Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function does not modify mesh vertex normals, it rearranges the mesh face winding and face normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
Unweld
 Makes sure that faces sharing an edge and having a difference of normal greater than or equal to angleToleranceRadians have unique vertexes along that edge, adding vertices if necessary.
UnweldEdge
 Adds creases to a smooth mesh by creating coincident vertices along selected edges.
Volume
 Compute volume of the mesh.
Weld
 Makes sure that faces sharing an edge and having a difference of normal greater than or equal to angleToleranceRadians share vertexes along that edge, vertex normals are averaged.
WithDisplacement
 Constructs new mesh from the current one, with displacement applied to it.
WithEdgeSoftening
 Constructs new mesh from the current one, with edge softening applied to it.
WithShutLining
 Constructs new mesh from the current one, with shut lining applied to it.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Geometry Namespace