RhinoCommon API
ImportOptionsSections Enumeration
 Standard CRhImportOptions sections to import
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ImportOptionsSections
Public Enumeration ImportOptionsSections
Members
Member name | Value | Description
AdvancedDisplay | 0
Alias | 1
Appearance | 2
ChooseOneObject | 3
ControlPointContextMenu | 4
CursorToolTip | 5
Display | 6
File | 7
General | 8
Grid | 9
ModelAid | 10
Mouse | 11
ObjectContextMenu | 12
SearchPath | 13
ShortcutKey | 14
Smarttrack | 15
View | 16
ViewportContextMenu | 17
ToolPaletteSettings | 18 |  Tool palette settings for Mac, ignored for Windows
Count | 19 |  Must always be the last item
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Runtime Namespace