RhinoCommon SDK
BrepSurfaceList Class
 Provides access to all the underlying surfaces in a Brep object.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.BrepSurfaceList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepSurfaceList : IEnumerable<Surface>,
	IEnumerable
Public Class BrepSurfaceList
	Implements IEnumerable(Of Surface), IEnumerable
The BrepSurfaceList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of surfaces in a brep.
Item
 Gets the Surface at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
GetEnumerator
 Gets an enumerator that visits all surfaces.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace