RhinoCommon API
ConeConstraint Enumeration
[Missing <summary> documentation for "T:Rhino.Input.Custom.ConeConstraint"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ConeConstraint
Public Enumeration ConeConstraint
Members
Member name | Value | Description
None | 0
Vertical | 1
AroundCurve | 2
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Input.Custom Namespace