RhinoCommon API
ViewportType Enumeration
[Missing <summary> documentation for "T:Rhino.Display.ViewportType"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ViewportType
Public Enumeration ViewportType
Members
Member name | Value | Description
StandardModelingViewport | 0
PageViewMainViewport | 1
DetailViewport | 2
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Display Namespace