RhinoCommon API
CollapsibleSectionHolderImpl.CREATEFROMCPPPROC Delegate
[Missing <summary> documentation for "T:Rhino.UI.Controls.CollapsibleSectionHolderImpl.CREATEFROMCPPPROC"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate IntPtr CREATEFROMCPPPROC(
	IntPtr hwndParent
)
Public Delegate Function CREATEFROMCPPPROC (
	hwndParent As IntPtr
) As IntPtr
Parameters
hwndParent
Type: System.IntPtr
Return Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.UI.Controls Namespace