RhinoCommon API
TextureGraphInfo.Axis Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureGraphInfo.Axis"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Axis
Public Enumeration Axis
Members
Member name | Value | Description
kU | 0
kV | 1
kW | 2
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Render Namespace