RhinoCommon API
ClippingPlaneObject Class
 Represents the object of a clipping plane, stored in the Rhino document and with attributes.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.ClippingPlaneObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ClippingPlaneObject : RhinoObject
Public Class ClippingPlaneObject
	Inherits RhinoObject
The ClippingPlaneObject type exposes the following members.
Properties
Name | Description
ClippingPlaneGeometry
 Gets the clipping plane surface.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
In Rhino for Windows 6.24, this member is inherited from .CommonObjectIsValid.
Top
Methods
Name | Description
AddClipViewport
 Adds a viewport to the list of viewports that this clipping plane clips.
RemoveClipViewport
 Removes a viewport from the list of viewports that this clipping plane clips.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.DocObjects Namespace