RhinoCommon API
ViewCaptureWriter Class
 Callback system used by SVG and PDF exporter to generate documents
Inheritance Hierarchy
System.Object
 Rhino.Runtime.ViewCaptureWriter
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class ViewCaptureWriter
Public MustInherit Class ViewCaptureWriter
The ViewCaptureWriter type exposes the following members.
Constructors
Name | Description
ViewCaptureWriter
Initializes a new instance of the ViewCaptureWriter class
Top
Properties
Name | Description
Dpi
Top
Methods
Name | Description
Draw
DrawBitmap
DrawCircle
DrawPath
DrawRectangle
DrawScreenText
FillPolygon
PopClipPath
PushClipPath(RectangleF)
PushClipPath(ViewCaptureWriter.PathPoint[])
SetClipPath
Top
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.Runtime Namespace