RhinoCommon API
Toolbar Class
[Missing <summary> documentation for "T:Rhino.UI.Toolbar"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Toolbar
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Toolbar
Public NotInheritable Class Toolbar
The Toolbar type exposes the following members.
Properties
Name | Description
BitmapSize
Id
Name
TabSize
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.UI Namespace