RhinoCommon SDK
IRhRdkContentThumbnail Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkContentThumbnail"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IRhRdkContentThumbnail : IRhRdkThumbnail
Public Interface IRhRdkContentThumbnail
	Inherits IRhRdkThumbnail
The IRhRdkContentThumbnail type exposes the following members.
Methods
Name | Description
ChildContent
GroupId
TopLevelContent
Top
See Also
Reference
Rhino.UI.Controls Namespace