RhinoCommon API
FileImportPlugIn Class
[Missing <summary> documentation for "T:Rhino.PlugIns.FileImportPlugIn"]
Inheritance Hierarchy
System.Object
 Rhino.PlugIns.PlugIn
 Rhino.PlugIns.FileImportPlugIn
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FileImportPlugIn : PlugIn
Public MustInherit Class FileImportPlugIn
	Inherits PlugIn
The FileImportPlugIn type exposes the following members.
Constructors
Name | Description
FileImportPlugIn
Initializes a new instance of the FileImportPlugIn class
Top
Properties
Name | Description
Top
Methods
Name | Description
AddFileTypes
DisplayOptionsDialog
MakeReferenceTableName
ReadFile
Top
Events
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.PlugIns Namespace