RhinoCommon API
Panels.FloatPanelMode Enumeration
 Used by the FloatPanel method to detemine if the floating panel should be shown or hidden.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FloatPanelMode
Public Enumeration FloatPanelMode
Members
Member name | Value | Description
Show | 0 |  Show the floating panel
Hide | 1 |  Hide the floating panel
Toggle | 2 |  Toggle the visibility state
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.UI Namespace