RhinoCommon API
ActiveSpace Enumeration
Defines the current working space.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ActiveSpace
Public Enumeration ActiveSpace
Members
Member name | Value | Description
None | 0 | There is no working space.
ModelSpace | 1 | 3d modeling or "world" space.
PageSpace | 2 | page/layout/paper/printing space.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.DocObjects Namespace