RhinoCommon API
OpenGLSettingsState Class
 Represents a sapshot of OpenGLSettings
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.OpenGLSettingsState
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class OpenGLSettingsState
Public Class OpenGLSettingsState
The OpenGLSettingsState type exposes the following members.
Properties
Name | Description
AntialiasLevel
 AA level used in OpenGL viewports
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.ApplicationSettings Namespace