RhinoCommon API
BinaryArchiveMode Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.BinaryArchiveMode"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum BinaryArchiveMode
Public Enumeration BinaryArchiveMode
Members
Member name | Value | Description
Unknown | 0
Read | 1
Write | 2
ReadWrite | 3
Read3dm | 5
Write3dm | 6
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.FileIO Namespace