RhinoCommon API
GroupTable Class
 Group tables store the list of groups in a Rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.GroupTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class GroupTable
Public NotInheritable Class GroupTable
The GroupTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of groups in the group table.
In Rhino for Windows 6.24, this member is inherited from .CommonComponentTable<T>Count.
Document
Document that owns this group table.
In Rhino for Windows 6.24, this member is inherited from .RhinoDocCommonTable<T>Document.
Top
Methods
Name | Description
Add()
Adds a new empty group to the group table.
Add(IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Add(String)
Adds a new empty group to the group table.
Add(String, IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
AddToGroup(Int32, IEnumerable<Guid>)
 Adds a list of objects to an existing group.
AddToGroup(Int32, Guid)
 Adds an object to an existing group.
ChangeGroupName
Delete(Int32)
 Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo will work with groups. Call IsDeleted() to determine if a group is deleted.
Delete(Group) |  (Overrides CommonComponentTable<T>.Delete(T).)
Find
Finds a group with a given name.
FindIndex
 Retrieves a Group object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Linetype given its name. Returns the instance, rather than the index.
FindNameHash
 Finds a Linetype given its name hash.
GroupMembers
 Gets an array of all of the objects in a group.
GroupName
GroupNames
GroupObjectCount
Hide
IsDeleted
Lock
Show
Undelete
Unlock
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.DocObjects.Tables Namespace