RhinoCommon API
ValidateResult Enumeration
ValidateProductKeyDelegate result code.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ValidateResult
Public Enumeration ValidateResult
Members
Member name | Value | Description
Success | 1 | The product key or license is validated successfully.
ErrorShowMessage | 0 |  There was an error validating the product key or license, the license manager show an error message.
ErrorHideMessage | -1 |  There was an error validating the product key or license. The validating delegate will show an error message, not the license manager.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.PlugIns Namespace