RhinoCommon SDK
AngularDimension Class
 Represents a dimension of an entity that can be measured with an angle.
This entity refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.AngularDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class AngularDimension : AnnotationBase
<SerializableAttribute>
Public Class AngularDimension
	Inherits AnnotationBase
The AngularDimension type exposes the following members.
Constructors
Name | Description
AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
AngularDimension(Arc, Double)
 Create an angular dimension from a give arc
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace