RhinoCommon API
FileType Class
[Missing <summary> documentation for "T:Rhino.FileIO.FileType"]
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileType
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileType
Public Class FileType
The FileType type exposes the following members.
Constructors
Name | Description
FileType
Initializes a new instance of the FileType class
Top
Properties
Name | Description
Description
Extension
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.FileIO Namespace