RhinoCommon API
FilterContentByUsage Enumeration
 Content collection filter value
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FilterContentByUsage
Public Enumeration FilterContentByUsage
Members
Member name | Value | Description
None | 0 |  No filter in use
Used | 1 |  Display only used contents
Unused | 2 |  Display only unused contents
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.Render Namespace