RhinoCommon SDK
ClassArrayObjRef Class
 Represents a wrapper to an unmanaged "array" (list) of CRhinoObjRef instances.
Wrapper for a C++ ON_ClassArray of CRhinoObjRef
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.ClassArrayObjRef
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ClassArrayObjRef : IDisposable
Public NotInheritable Class ClassArrayObjRef
	Implements IDisposable
The ClassArrayObjRef type exposes the following members.
Constructors
Name | Description
ClassArrayObjRef()
 Initializes a new ClassArrayObjRef instance.
ClassArrayObjRef(IEnumerable<ObjRef>)
 Initializes a new instances from a set of ObjRefs
Top
Properties
Name | Description
Count
 Gets the number of CRhinoObjRef instances in this array.
Top
Methods
Name | Description
Add
 Adds an ObjRef to the list.
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace