RhinoCommon API
DocumentEventArgs Class
 Provides document information for RhinoDoc events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocumentEventArgs
 Rhino.DocumentOpenEventArgs
 Rhino.DocumentSaveEventArgs
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DocumentEventArgs : EventArgs
Public Class DocumentEventArgs
	Inherits EventArgs
The DocumentEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document for this event. This field might be null.
DocumentId
 Gets the document Id of the document for this event.
DocumentSerialNumber
 Gets the uniques document serial number for this event
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino Namespace