RhinoCommon API
ViewCaptureWriter.VectorPolylineProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorPolylineProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorPolylineProc(
	int argb,
	float thickness,
	int dashed,
	int count,
	IntPtr points
)
Public Delegate Sub VectorPolylineProc (
	argb As Integer,
	thickness As Single,
	dashed As Integer,
	count As Integer,
	points As IntPtr
)
Parameters
argb
Type: System.Int32
thickness
Type: System.Single
dashed
Type: System.Int32
count
Type: System.Int32
points
Type: System.IntPtr
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.Runtime Namespace