RhinoCommon API
ClassIdAttribute Class
 Useful for legacy UserData
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.DocObjects.Custom.ClassIdAttribute
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ClassIdAttribute : Attribute
Public NotInheritable Class ClassIdAttribute
	Inherits Attribute
The ClassIdAttribute type exposes the following members.
Constructors
Name | Description
ClassIdAttribute
Initializes a class id attrbute.
Top
Properties
Name | Description
Id
 Gets the associated style.
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.DocObjects.Custom Namespace