RhinoCommon SDK
SubD.VertexFacetType Enumeration
Summarizes the number of edges in faces in the whole object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum VertexFacetType
Public Enumeration VertexFacetType
Members
Member name | Value | Description
Unset | 0 | Not a valid vertex face type.
Tri | 3 | All faces are triangular.
Quad | 4 | All faces are quads.
Ngon | 5 | Edge count of faces is constant and > 4.
Mixed | 255 | Edge count of faces is not constant.
See Also
Reference
Rhino.Geometry Namespace