RhinoCommon SDK
SubD.ConvexCornerOption Enumeration
 Defines how convex corners are treated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ConvexCornerOption
Public Enumeration ConvexCornerOption
Members
Member name | Value | Description
Unset | 0 | The option is not set.
None | 1 | No convex coners.
AtMeshCorner | 2 | A convext subd corner will appear at input mesh/ boundary vertices where the corner angle <= MaximumConvexCornerAngleRadians() and the number of edges the end at the vertex is <= MaximumConvexCornerEdgeCount().
See Also
Reference
Rhino.Geometry Namespace