RhinoCommon API
SphereSphereIntersection Enumeration
 Represents all possible cases of a Sphere|Sphere intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SphereSphereIntersection
Public Enumeration SphereSphereIntersection
Members
Member name | Value | Description
None | 0 |  Spheres do not intersect.
Point | 1 |  Spheres touch at a single point.
Circle | 2 |  Spheres intersect at a circle.
Overlap | 3 |  Spheres are identical.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Geometry.Intersect Namespace