RhinoCommon SDK
Style Enumeration
 Defines bitwise mask flags for different styles of commands, such as Hidden or DoNotRepeat.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum Style
<FlagsAttribute>
Public Enumeration Style
Members
Member name | Value | Description
None | 0 |  No flag is defined.
Hidden | 1 |  Also known as a "test" command. The command name does not auto-complete when typed on the command line an is therefore not discoverable. Useful for writing commands that users don't normally have access to.
ScriptRunner | 2 |  For commands that want to run scripts as if they were typed at the command line (like RhinoScript's RunScript command)
Transparent | 4 |  Transparent commands can be run inside of other commands. The command does not modify the contents of the model's geometry in any way. Examples of transparent commands include commands that change views and toggle snap states. Any command that adds or deletes, a view cannot be transparent.
DoNotRepeat | 8 |  The command should not be repeated by pressing "ENTER" immediately after the command finishes.
NotUndoable | 16 |  By default, all commands are undoable.
See Also
Reference
Rhino.Commands Namespace