RhinoCommon API
TransformRigidType Enumeration
 Lists all possible outcomes for rigid transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TransformRigidType
Public Enumeration TransformRigidType
Members
Member name | Value | Description
RigidReversing | -1 |  Transformation is an orientation reversing isometry.
NotRigid | 0 |  Transformation is not an orthogonal transformation.
Rigid | 1 |  Transformation is an rigid transformation.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Geometry Namespace