RhinoCommon SDK
SubD.SubDType Enumeration
 Subdivision algorithm.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum SubDType
Public Enumeration SubDType
Members
Member name | Value | Description
Unset | 0 |  Not a valid subdivision type.
TriLoopWarren | 3 |  Built-in Loop-Warren triangle with Bernstein-Levin-Zorin creases and darts.
QuadCatmullClark | 4 |  Built-in Catmull-Clark quad with Bernstein-Levin-Zorin creases and darts.
CustomTri | 5 |  Custom triangle face algorithm. (Not built-in. Provided for use by 3rd party developers.)
CustomQuad | 6 |  Custom quad facet algorithm. (Not built-in. Provided for use by 3rd party developers.)
Custom | 7 |  Custom algorithm. (Not built-in. Provided for use by 3rd party developers.)
See Also
Reference
Rhino.Geometry Namespace