RhinoCommon SDK
NurbsCurvePointList Class
 Provides access to the control points of a nurbs curve.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.NurbsCurvePointList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class NurbsCurvePointList : IEnumerable<ControlPoint>,
	IEpsilonComparable<NurbsCurvePointList>, IEnumerable
Public Class NurbsCurvePointList
	Implements IEnumerable(Of ControlPoint), IEpsilonComparable(Of NurbsCurvePointList),
	IEnumerable
The NurbsCurvePointList type exposes the following members.
Properties
Name | Description
ControlPolygonLength
 Gets the length of the polyline connecting all control points.
Count
 Gets the number of control points in this curve.
Item
 Gets or sets the control point location at the given index.
Top
Methods
Name | Description
ChangeEndWeights
 Use a combination of scaling and reparameterization to change the end weights to the specified values.
ControlPolygon
 Constructs a polyline through all the control points. Note that periodic curves generate a closed polyline with fewer points than control-points.
EnsurePrivateCopy
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
MakeNonRational
 Sets all the control points to 1.0.
MakeRational
 Turns the curve into a Rational nurbs curve.
SetPoint(Int32, Point3d)
 Sets a specific control-point.
SetPoint(Int32, Point4d)
 Sets a specific weighted control-point.
SetPoint(Int32, Double, Double, Double, Double)
 Sets a specific control-point.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace