RhinoCommon API
DisplayPipelineAttributes.BoundingBoxDisplayMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.BoundingBoxDisplayMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum BoundingBoxDisplayMode
Public Enumeration BoundingBoxDisplayMode
Members
Member name | Value | Description
None | 0
OnDuringDynamicDisplay | 2
OnAlways | 1
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.Display Namespace