RhinoCommon API
SmartTrackSettings Class
 Contains static methods and properties that target the Smart Track feature behavior.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.SmartTrackSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class SmartTrackSettings
Public NotInheritable Class SmartTrackSettings
The SmartTrackSettings type exposes the following members.
Properties
Name | Description
ActivationDelayMilliseconds
Gets or sets the activation delay in milliseconds.
ActivePointColor
Gets or sets the active point color.
LineColor
Gets or sets the smart track line color.
MaxSmartPoints
Gets or sets the maximum number of smart points.
PointColor
Gets or sets the point color.
SmartOrtho
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
Orthogonal lines are then drawn automatically.
SmartTangents
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
TanPerpLineColor
Gets or sets the tangent and perpendicular line color.
UseDottedLines
Gets or sets a value indicating if lines are drawn dotted.
UseSmartTrack
Gets or sets if the Smart Track feature is active.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings.
GetDefaultState
 Gets the Smart Track factory settings.
UpdateFromState
 Updates from a particular setting state.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.ApplicationSettings Namespace