RhinoCommon API
IRhRdkContentThumbnailList_Sizes Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum IRhRdkContentThumbnailList_Sizes
Public Enumeration IRhRdkContentThumbnailList_Sizes
Members
Member name | Value | Description
Tiny | 0 | Tiny thumbnails.
Small | 1 | Small thumbnails.
Medium | 2 | Medium thumbnails.
Large | 3 | Large thumbnails.
Custom | 4 | Custom-sized thumbnails.
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace