RhinoCommon API
Mesh Class
 Representation of ChangeQueue Mesh
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.Mesh
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Mesh
Public Class Mesh
The Mesh type exposes the following members.
Properties
Name | Description
Attributes
 Get object attributes of object associated to this mesh. This will be possible only after returning true from ChangeQueue.ProvideOriginalObject()
Mapping
 Get the mapping for this mesh.
Object
 Get a copy of the original RhinoObject this Mesh is created from. Possible only after return true from ChangeQueue.ProvideOriginalObject(). Access this only with a using(var o = mesh.Object) {} construct. Note that the object is free floating, i.e. not part of a document.
SingleMapping
 Get texture mapping info as single mapping
Top
Methods
Name | Description
GetMeshes
 Get a SimpleArrayMeshPointer containing all meshes for the related Mesh
Id
 Get the Object Guid this mesh is for.
Top
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.Render.ChangeQueue Namespace