RhinoCommon SDK
ObjectPlotColorSource Enumeration
 Defines enumerated values for the source of plotting/printing color of single objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ObjectPlotColorSource
Public Enumeration ObjectPlotColorSource
Members
Member name | Value | Description
PlotColorFromLayer | 0 | use plot color assigned to layer.
PlotColorFromObject | 1 | use plot color assigned to object.
PlotColorFromDisplay | 2 | use display color.
PlotColorFromParent | 3 |  for objects with parents (like objects in instance references, use parent plot color) if no parent, treat as plot_color_from_layer.
See Also
Reference
Rhino.DocObjects Namespace