RhinoCommon SDK
IRhRdkThumbnailList Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkThumbnailList"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IRhRdkThumbnailList
Public Interface IRhRdkThumbnailList
The IRhRdkThumbnailList type exposes the following members.
Methods
Name | Description
Add
Clear
Get
GetGridMetrics
GetSize
GetStatisticsHeaderHeight
Mode
SetClientText
SetCustomBitmapSize
SetMode
SetShowLabels
Shape
ShowLabels
UUID
Top
See Also
Reference
Rhino.UI.Controls Namespace