RhinoCommon API
GumballPickResult Class
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballPickResult"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Gumball.GumballPickResult
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GumballPickResult
Public Class GumballPickResult
The GumballPickResult type exposes the following members.
Properties
Name | Description
Mode
Top
Methods
Name | Description
SetToDefault
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.UI.Gumball Namespace