RhinoCommon API
AppearanceSettings Class
 Provides static methods and properties to deal with the appearance of the application.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.AppearanceSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class AppearanceSettings
Public NotInheritable Class AppearanceSettings
The AppearanceSettings type exposes the following members.
Properties
Name | Description
CommandPromptBackgroundColor
 Gets or sets the color of the command prompt background.
CommandPromptHypertextColor
 Gets or sets the color of the command prompt hypertext.
CommandPromptPosition
 Gets or sets the command prompt position.
CommandPromptTextColor
 Gets or sets the color of the command prompt text.
CrosshairColor
 Gets or sets the color of the crosshair icon.
CurrentLayerBackgroundColor
 Gets or sets the color used by the layer manager dialog as the background color for the current layer.
DefaultFontFaceName
 Gets or sets the default font face name used in Rhino.
DefaultLayerColor
 Gets or sets the default layer color.
DefaultObjectColor
 Gets or sets the default color for new objects.
EchoCommandsToHistoryWindow
Gets or sets a value that determines if command names are written to the history window.
EchoPromptsToHistoryWindow
Gets or sets a value that determines if prompt messages are written to the history window.
EditCandidateColor
 Gets or sets the color of objects that are eligible to be edited.
FeedbackColor
 Gets or sets the feedback color.
FrameBackgroundColor
 Gets or sets the background color of the frame.
GridThickLineColor
 Gets or sets the color of the thick line of the grid.
GridThinLineColor
 Gets or sets the color of the thin line of the grid.
GridXAxisLineColor
 Gets or sets the color of the X axis of the grid.
GridYAxisLineColor
 Gets or sets the color of the Y axis of the grid.
GridZAxisLineColor
 Gets or sets the color of the Z axis of the grid.
LanguageIdentifier
Gets or sets the language identifier.
LockedObjectColor
color used to draw locked objects.
MenuVisible
Gets or sets a value that determines if the File menu is visible.
PageviewPaperColor
 Gets or sets the paper background. A rectangle is drawn into the background of page views to represent the printed area. The alpha portion of the color is used to draw the paper blended into the background
PreviousLanguageIdentifier
 Gets or sets the previous language identifier.
SelectedObjectColor
 The color used to draw selected objects. The default is yellow, but this can be customized by the user.
ShowCrosshairs
Gets or sets a value that determines if cross hairs are visible.
ShowFullPathInTitleBar
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.
ShowSideBar
 Should the side bar be displayed
TrackingColor
 Gets or sets the tracking color.
UsePaintColors
 Gets or sets a value indicating if logical paint colors should be used.
ViewportBackgroundColor
 Gets or sets the viewport background color.
WorldCoordIconXAxisColor
 Gets or sets the color of the world coordinate X axis.
WorldCoordIconYAxisColor
 Gets or sets the color of the world coordinate Y axis.
WorldCoordIconZAxisColor
 Gets or sets the color of the world coordinate Z axis.
Top
Methods
Name | Description
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
GetPaintColor
 Gets the .Net library color that is currently associated with a paint color.
GetWidgetColor
 Gets the .Net library color that is currently associated with a widget color.
InitialMainWindowPosition
 Location where the Main Rhino window attempts to show when the application is first started.
RestoreDefaults
 Commits the default settings as the current settings.
SetPaintColor(PaintColor, Color)
 Sets the logical paint color association to a spacific .Net library color, without forced UI update.
SetPaintColor(PaintColor, Color, Boolean)
 Sets the logical paint color association to a spacific .Net library color.
SetWidgetColor(WidgetColor, Color)
 Sets the logical widget color association to a spacific .Net library color, without forced UI update.
SetWidgetColor(WidgetColor, Color, Boolean)
 Sets the logical widget color association to a spacific .Net library color.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.ApplicationSettings Namespace