RhinoCommon API
ViewCaptureSettings.ColorMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.ViewCaptureSettings.ColorMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ColorMode
Public Enumeration ColorMode
Members
Member name | Value | Description
DisplayColor | 0
PrintColor | 1
BlackAndWhite | 2
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Display Namespace