RhinoCommon SDK
IRhRdkContentThumbnailList_Sizes Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkContentThumbnailList_Sizes"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum IRhRdkContentThumbnailList_Sizes
Public Enumeration IRhRdkContentThumbnailList_Sizes
Members
Member name | Value | Description
Tiny | 0 | Tiny thumbnails.
Small | 1 | Small thumbnails.
Medium | 2 | Medium thumbnails.
Large | 3 | Large thumbnails.
Custom | 4 | Custom-sized thumbnails.
See Also
Reference
Rhino.UI.Controls Namespace