RhinoCommon API
AngleDisplayMode Enumeration
 Defines enumerated values for the display of angles.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AngleDisplayMode
Public Enumeration AngleDisplayMode
Members
Member name | Value | Description
Degrees | 0 |  Shows angle in decimal degrees
DMS | 1 |  Show angle as degree,minute,second.
Grads | 2 |  Show angle as grads.
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.DocObjects Namespace