RhinoCommon SDK
Texture Class
 Represents a texture that is mapped on objects.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Texture
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Texture : CommonObject
<SerializableAttribute>
Public Class Texture
	Inherits CommonObject
The Texture type exposes the following members.
Constructors
Name | Description
Texture()
 Initializes a new texture.
Texture(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
ApplyUvwTransform
 If true then the UVW transform is applied to the texture otherwise the UVW transform is ignored.
Enabled
 If the texture is enabled then it will be visible in the rendered display otherwise it will not.
FileName
 Gets or sets a file name that is used by this texture.
NOTE: We are moving away from string-based FileName, and suggest the usage of the new FileReference class.
Also, this filename may well not be a path that makes sense on a user's computer because it was a path initially set on a different user's computer. If you want to get a workable path for this user, use the BitmapTable.Find function using this property.
FileReference
 Gets or sets a copy of the file reference that is used by this texture.
Remarks
After the get or the set method complete, you own the copy you received or passed in, and can Dispose() of it.
Id
 Gets the globally unique identifier of this texture.
MappingChannelId
TextureCombineMode
 Determines how this texture is combined with others in a material's texture list.
TextureType
 Controls how the pixels in the bitmap are interpreted
UvwTransform
 Transform to be applied to each instance of this texture if ApplyUvw is true
WrapU
 Texture wrapping mode in the U direction
WrapV
 Texture wrapping mode in the V direction
WrapW
 Texture wrapping mode in the W direction
Top
Methods
Name | Description
GetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
SetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
SetRGBBlendValues
 If the TextureCombineMode is Blend, then the blending function for RGB is determined by
 new rgb = colorcolor + a0[0]*(current RGB) + a1[1]*(texture RGB) + a2[2]*min(current RGB,texture RGB) + a3[3]*max(current RGB,texture RGB)
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace