RhinoCommon SDK
SubDEdgeAccess Class
 Provides access to the edge and edge-related functionality of a SubD.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDEdgeAccess
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class SubDEdgeAccess : IEnumerable<SubDEdgePtr>,
	IEnumerable
Public Class SubDEdgeAccess
	Implements IEnumerable(Of SubDEdgePtr), IEnumerable
The SubDEdgeAccess type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of SubD edges.
First
Top
Methods
Name | Description
Add
 Adds a new edge to the end of the SubDEdgePtr list.
GetEnumerator
Top
See Also
Reference
Rhino.Geometry.Collections Namespace