RhinoCommon API
WaitCursor Class
[Missing <summary> documentation for "T:Rhino.UI.WaitCursor"]
Inheritance Hierarchy
System.Object
 Rhino.UI.WaitCursor
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class WaitCursor : IDisposable
Public Class WaitCursor
	Implements IDisposable
The WaitCursor type exposes the following members.
Constructors
Name | Description
WaitCursor
Initializes a new instance of the WaitCursor class
Top
Methods
Name | Description
Clear
Dispose
Releases all resources used by the WaitCursor
Set
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.UI Namespace