RhinoCommon API
SupportOptions.RdkTextureSize Enumeration
[Missing <summary> documentation for "T:Rhino.Render.SupportOptions.RdkTextureSize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RdkTextureSize
Public Enumeration RdkTextureSize
Members
Member name | Value | Description
Size1 | 128
Size2 | 256
Size3 | 512
Size4 | 1024
Size5 | 2048
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Render Namespace