RhinoCommon API
SimulatedEnvironment.BackgroundProjections Enumeration
[Missing <summary> documentation for "T:Rhino.Render.SimulatedEnvironment.BackgroundProjections"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum BackgroundProjections
Public Enumeration BackgroundProjections
Members
Member name | Value | Description
Planar | 0
Spherical | 1
Emap | 2
Box | 3
Automatic | 4
Lightprobe | 5
Cubemap | 6
VerticalCrossCubemap | 7
HorizontalCrossCubemap | 8
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.Render Namespace