RhinoCommon API
CreatePreviewReason Enumeration
 Reason the content preview is being generated
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CreatePreviewReason
Public Enumeration CreatePreviewReason
Members
Member name | Value | Description
ContentChanged | 0
ViewChanged | 1
RefreshDisplay | 2
UpdateBitmap | 3
Other | 99
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Render Namespace