RhinoCommon API
ViewInfo Class
 Represents the name and orientation of a View (and named view).
views can be thought of as cameras.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ViewInfo
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ViewInfo : IDisposable
Public Class ViewInfo
	Implements IDisposable
The ViewInfo type exposes the following members.
Constructors
Name | Description
ViewInfo(UInt32)
 Construct the ViewInfo for active viewport of given doc.
ViewInfo(RhinoViewport)
 Access to the ViewInfo for given RhinoViewport
Top
Properties
Name | Description
FocalBlurAperture
 Gets or sets the Focal blur aperture of the active viewport
FocalBlurDistance
 Gets or sets the Focal blur distance of the active viewport
FocalBlurJitter
 Gets or sets the Focal blur jitter of the active viewport
FocalBlurMode
 Gets or sets the Focal blur mode of the active viewport
FocalBlurSampleCount
 Gets or sets the Focal blur sample count of the active viewport
Name
 Gets or sets the name of the NamedView.
ShowWallpaperInGrayScale
 True if wallpaper (if any) is to be shown in gray scale in this view.
Viewport
 Gets the viewport, or viewing frustum, associated with this view.
WallpaperFilename
 Get filename for wallpaper set to this view, if any.
WallpaperHidden
 True if wallpaper (if any) is to be hidden from this view.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.DocObjects Namespace