RhinoCommon API
DimensionStyleArrowType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.DimensionStyleArrowType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DimensionStyleArrowType
Public Enumeration DimensionStyleArrowType
Members
Member name | Value | Description
SolidTriangle | 0 | 2:1
Dot | 1
Tick | 2
ShortTriangle | 3 | 1:1
Arrow | 4
Rectangle | 5
LongTriangle | 6 | 4:1
LongerTriangle | 7 | 6:1
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
Rhino.DocObjects Namespace