RhinoCommon API
CreaseEdges Enumeration
 Defines the way naked edges are handled.
 Namespace: Rhino.PrivateMeshCommands.MeshTypes
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CreaseEdges
Public Enumeration CreaseEdges
Members
Member name | Value | Description
NakedFixed | 0 |  Naked edges will not move or be modified.
NakedSmooth | 1 |  The naked edge will tend toward a spline.
CornerFixedOtherCreased | 2 |  Corners (2-sided vertices) will be fixed, while other naked vertices will tend toward a spline.
Auto | 3 |  Unwelded vertices become creases, and welded are smooth.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.PrivateMeshCommands.MeshTypes Namespace