RhinoCommon SDK
SubDFacePtr Structure
 Efficiently manages a reference to a polygonal face in a SubD, with any number of sides.
Contains connection information to vertices and edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public struct SubDFacePtr : IEquatable<SubDFacePtr>,
	IComparable<SubDFacePtr>
Public Structure SubDFacePtr
	Implements IEquatable(Of SubDFacePtr), IComparable(Of SubDFacePtr)
The SubDFacePtr type exposes the following members.
Properties
Name | Description
Below
Edges
EdgeVertexCount
Id
IsDefault
Next
 Links to next face on this level.
Previous
 Links to previous face on this level.
Status
SubD
Vertices
Top
Methods
Name | Description
AddEdgeFaceConnection
CompareTo
EdgeAt(Int32)
EdgeAt(Int32, Boolean)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(SubDFacePtr)
GetHashCode |  (Overrides ValueType.GetHashCode().)
GetSavedSubdivisionPoint
IndexOf(SubDEdgePtr)
IndexOf(SubDVertexPtr)
RemoveEdge(Int32)
RemoveEdge(SubDEdgePtr)
SetSavedSubdivisionPoint
ToString |  (Overrides ValueType.ToString().)
VertexAt
Top
Operators
Name | Description
Equality
Inequality
Top
Fields
Name | Description
Default
Top
See Also
Reference
Rhino.Geometry Namespace