RhinoCommon SDK
AnnotationExtensions Class
 Extends AnnotationBase
Inheritance Hierarchy
System.Object
 Rhino.Geometry.AnnotationExtensions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static class AnnotationExtensions
<ExtensionAttribute>
Public NotInheritable Class AnnotationExtensions
The AnnotationExtensions type exposes the following members.
Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
Top
See Also
Reference
Rhino.Geometry Namespace