RhinoCommon API
ToolbarFileCollection Class
[Missing <summary> documentation for "T:Rhino.UI.ToolbarFileCollection"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarFileCollection
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ToolbarFileCollection : IEnumerable<ToolbarFile>,
	IEnumerable
Public NotInheritable Class ToolbarFileCollection
	Implements IEnumerable(Of ToolbarFile), IEnumerable
The ToolbarFileCollection type exposes the following members.
Properties
Name | Description
Count
 Number of open toolbar files
Item
MruSidebarIsVisible
SidebarIsVisible
Top
Methods
Name | Description
FindByName
FindByPath
GetEnumerator
Open
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.UI Namespace