RhinoCommon API
RenderPanelType Enumeration
 Contains the custom user interfaces that may be provided
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RenderPanelType
Public Enumeration RenderPanelType
Members
Member name | Value | Description
RenderWindow | 0 |  A custom control panel added to the render output window.
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Render Namespace