RhinoCommon API
CylinderConstraint Enumeration
[Missing <summary> documentation for "T:Rhino.Input.Custom.CylinderConstraint"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CylinderConstraint
Public Enumeration CylinderConstraint
Members
Member name | Value | Description
None | 0
Vertical | 1
AroundCurve | 2
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Input.Custom Namespace