RhinoCommon SDK
PatchGetter Class
[Missing <summary> documentation for "T:Rhino.Geometry.PatchGetter"]
Inheritance Hierarchy
System.Object
 Rhino.Geometry.PatchGetter
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class PatchGetter
Public Class PatchGetter
The PatchGetter type exposes the following members.
Constructors
Name | Description
PatchGetter
Initializes a new instance of the PatchGetter class
Top
Properties
Name | Description
SCount
XCount
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace