RhinoCommon API
LinearWorkflow Class
 This is the interface to linear workflow settings.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.LinearWorkflow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LinearWorkflow : DocumentOrFreeFloatingBase
Public NotInheritable Class LinearWorkflow
	Inherits DocumentOrFreeFloatingBase
The LinearWorkflow type exposes the following members.
Constructors
Name | Description
LinearWorkflow()
 Create an utility object not associated with any document
LinearWorkflow(LinearWorkflow)
 Create utility object not associated with any document from another object
Top
Properties
Name | Description
Hash
 Linear workflow CRC
PostProcessFrameBuffer
 Linear workflow active state
PostProcessGamma
 Linear workflow gamma
PostProcessGammaReciprocal
 Linear workflow gamma
PreProcessColors
 Linear workflow active state
PreProcessGamma
 Linear workflow gamma
PreProcessTextures
 Linear workflow active state
Top
Methods
Name | Description
CopyFrom
 Create a copy of linearworkflow
 (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Equals
 Compare two LinearWorkflow objects. They are considered equal when their Hashes match.
 (Overrides Object.Equals(Object).)
GetHashCode
 Get hash code for this object. It is the Hash property cast to int.
 (Overrides Object.GetHashCode().)
Top
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Render Namespace