RhinoCommon SDK
RenderSettings.FocalBlurModes Enumeration
 Possible modes for focal blur
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum FocalBlurModes
Public Enumeration FocalBlurModes
Members
Member name | Value | Description
None | 0 |  No focal blur
Automatic | 1 |  Automatic focal blur, focus on selected object
Manual | 2 |  Manually specify all focal blur settings
See Also
Reference
Rhino.Render Namespace