RhinoCommon API
CursorMode Enumeration
 Defines enumerated constant values for particular OSnap cursor colors.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CursorMode
Public Enumeration CursorMode
Members
Member name | Value | Description
None | 0 |  No OSnap cursor.
BlackOnWhite | 1 |  Black on white OSnap cursor.
WhiteOnBlack | 2 |  White on black OSnap cursor.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.ApplicationSettings Namespace