RhinoCommon API
UndoRedo Class
 This class contains the event for UndoRedoChanged that is fired from RDK .
Inheritance Hierarchy
System.Object
 Rhino.Render.UndoRedo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class UndoRedo
Public NotInheritable Class UndoRedo
The UndoRedo type exposes the following members.
Events
Name | Description
UndoRedoChanged
 This event is raised when undo/redo occurs in rdk.
Top
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Render Namespace