RhinoCommon API
CurvatureAnalysisSettings.CurvatureStyle Enumeration
 Curvature analysis styles
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CurvatureStyle
Public Enumeration CurvatureStyle
Members
Member name | Value | Description
Gaussian | 0 |  Gaussian curvature
Mean | 1 |  Mean curvature
MinRadius | 2 |  Minimum radius curvature
MaxRadius | 3 |  Maximum radius curvature
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.ApplicationSettings Namespace