RhinoCommon SDK
RenderMaterial.PreviewBackgroundType Enumeration
 The default scene background for the image that appears in preview panes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum PreviewBackgroundType
Public Enumeration PreviewBackgroundType
Members
Member name | Value | Description
None | 1
Checkered | 2
See Also
Reference
Rhino.Render Namespace