RhinoCommon API
NamedParametersEventArgs Class
 Dictionary style class used for named callbacks from C++ -> .NET
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Runtime.NamedParametersEventArgs
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NamedParametersEventArgs : EventArgs
Public Class NamedParametersEventArgs
	Inherits EventArgs
The NamedParametersEventArgs type exposes the following members.
Methods
Name | Description
SetBool
 Set a bool value for a given key name
SetDouble
 Set a double value for a given key name
SetInt
 Set an int value for a given key name
SetString
 Set a string value for a given key name
TryGetBool
 Try to get a bool value for a given key name
TryGetDouble
 Try to get a double value for a given key name
TryGetInt
 Try to get an int value for a given key name
TryGetString
 Try to get a string value for a given key name
Top
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Runtime Namespace