RhinoCommon API
LoadReturnCode Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.LoadReturnCode"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LoadReturnCode
Public Enumeration LoadReturnCode
Members
Member name | Value | Description
Success | 1
ErrorShowDialog | 0
ErrorNoDialog | -1
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.PlugIns Namespace