RhinoCommon API
RenderWindow Class
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderWindow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderWindow : IDisposable
Public Class RenderWindow
	Implements IDisposable
The RenderWindow type exposes the following members.
Properties
Name | Description
SessionId
Top
Methods
Name | Description
AddChannel
 Add a channel to the frame buffer in addition to the fixed Red, Green, Blue and Alpha channels.
AddWireframeChannel
 A wireframe channel will not be added if none of the document properties settings indicate that one is needed. In other words, Rhino will not generate an empty wireframe channel just for the fun of it.
ChannelId
Create
Dispose
Releases all resources used by the RenderWindow
EndAsyncRender
 Must be called when an asynchronous render has finished or ended for any reason.
FromSessionId
GetAdjust
 Get an ImageAdjust instance containing current image adjusting settings for this RenderWindow
GetBitmap
Invalidate
 Invalidate the entire view window so that the pixels get painted.
InvalidateArea
OpenChannel
SaveDibAsBitmap
 Save current Dib of RenderWindow as file Helper function for debugging purposes.
SaveRenderImageAs(String, Boolean)
 Like RenderWindow.SaveRenderImageAs(string,Guid,bool), but with Guid set to Guid.Empty.
SaveRenderImageAs(String, Guid, Boolean)
 Save current RenderWindow contents as an image file with the given name. The filetype will be determine. Pass in render engine Guid if an engine implements saving to a format that is not supported by Rhino. Guid.Empty if there is no need for that.
SetAdjust
 Set new ImageAdjust to use. An ImageAdjust instance can be obtained by first querying for one using GetAdjust()
SetProgress
 Accepts a rendering progress value to inform the user of the rendering advances.
SetRGBAChannelColors(Rectangle, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
SetRGBAChannelColors(Size, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
SetSize
SetView
Size
Top
Events
Name | Description
Cloned
Top
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Render Namespace