RhinoCommon API
HatchPattern Class
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchPattern"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.HatchPattern
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class HatchPattern : CommonObject
<SerializableAttribute>
Public Class HatchPattern
	Inherits CommonObject
The HatchPattern type exposes the following members.
Constructors
Name | Description
HatchPattern()
Initializes a new instance of the HatchPattern class
HatchPattern(SerializationInfo, StreamingContext)
Initializes a new instance of the HatchPattern class
Top
Properties
Name | Description
ComponentType
 Returns HatchPattern.
 (Overrides ModelComponent.ComponentType.)
Description
FillType
Index
 Index in the hatch pattern table for this pattern. -1 if not in the table.
IsDeleted
 Deleted hatch patterns are kept in the runtime hatch pattern table so that undo will work with hatch patterns. Call IsDeleted to determine to determine if a hatch pattern is deleted.
IsReference
 Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the document are "normal" or "reference". Reference hatch patterns are not saved.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Name
In Rhino for Windows 6.26, this member is inherited from .ModelComponentName.
Top
Methods
Name | Description
CreatePreviewGeometry
 Creates preview line segments of the hatch pattern.
ReadFromFile
 Reads hatch pattern definitions from a file.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.DocObjects Namespace