RhinoCommon SDK
DimensionStyle.LengthDisplayFormat Enumeration
 Defines display formats for distances.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LengthDisplayFormat
Public Enumeration LengthDisplayFormat
Members
Member name | Value | Description
Decimal | 0 | Decimal units.
Fractional | 1 | Fractional units.
FeetInches | 2 | Feet and Inches.
FeetDecimalInches | 3 | Feet and Decimal Inches.
See Also
Reference
Rhino.DocObjects Namespace