RhinoCommon API
RenderContent.ChangeContexts Enumeration
 Context of a change to content parameters.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ChangeContexts
Public Enumeration ChangeContexts
Members
Member name | Value | Description
UI | 0 |  Change occurred as a result of user activity in the content's UI.
Drop | 1 |  Change occurred as a result of drag and drop.
Program | 2 |  Change occurred as a result of internal program activity.
Ignore | 3 |  Change can be disregarded.
Tree | 4 |  Change occurred within the content tree (e.g., nodes reordered).
Undo | 5 |  Change occurred as a result of an undo.
FieldInit | 6 |  Change occurred as a result of a field initialization.
Serialize | 7 |  Change occurred during serialization (loading).
See Also
Reference
Rhino.Render Namespace