RhinoCommon API
PipeCapMode Enumeration
Defines styles used for creating Brep pipes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PipeCapMode
Public Enumeration PipeCapMode
Members
Member name | Value | Description
None | 0 | No cap.
Flat | 1 | Caps with planar surface.
Round | 2 | Caps with hemispherical surface.
See Also
Reference
Rhino.Geometry Namespace