RhinoCommon API
RenderContentEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContentEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderContentEventArgs
 Rhino.Render.RenderContentChangedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderContentEventArgs : EventArgs
Public Class RenderContentEventArgs
	Inherits EventArgs
The RenderContentEventArgs type exposes the following members.
Properties
Name | Description
Content
Document
EnvironmentUsage
 Meaningful for CurrentEnvironmentChanged event. Will be one of Background, ReflectionAndRefraction or Skylighting. Since 6.11
Reason
 Not when used in CurrentEnvironmentChanged (defaults to None).
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Render Namespace