RhinoCommon SDK
IStackedDialogPageService Interface
 For internal use, the IStackedDialogPageService service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IStackedDialogPageService
Public Interface IStackedDialogPageService
The IStackedDialogPageService type exposes the following members.
Methods
Name | Description
GetImageHandle
 Convert image to platform specific unmanaged pointer
GetNativePageWindow
 Get the unmanaged pointer associated with the pages content control
NewObjectPropertiesDialogPagePointer
RedrawPageControl
 Redraw the specified control.
SelectedObjects
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI Namespace