RhinoCommon SDK
SubD.SubDFacetType Enumeration
 SubD::FacetType reports the default facet type for subdivision algorithms.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum SubDFacetType
Public Enumeration SubDFacetType
Members
Member name | Value | Description
Unset | 0 |  Not a valid facet type.
Tri | 3 |  Triangle
Quad | 4 |  Quadrangle
See Also
Reference
Rhino.Geometry Namespace