RhinoCommon API
PlugInType Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.PlugInType"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[FlagsAttribute]
public enum PlugInType
<FlagsAttribute>
Public Enumeration PlugInType
Members
Member name | Value | Description
None | 0
Render | 1
FileImport | 2
FileExport | 4
Digitizer | 8
Utility | 16
DisplayPipeline | 32
DisplayEngine | 64
Any | 127
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.PlugIns Namespace