RhinoCommon SDK
IRhRdkThumbnailList_Shapes Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkThumbnailList_Shapes"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum IRhRdkThumbnailList_Shapes
Public Enumeration IRhRdkThumbnailList_Shapes
Members
Member name | Value | Description
Square | 0 | Square thumbnails.
Wide | 1 | Wide thumbnails.
See Also
Reference
Rhino.UI.Controls Namespace