RhinoCommon SDK
CommandStyleAttribute Class
 Decorates commands to provide styles.
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.Commands.CommandStyleAttribute
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class CommandStyleAttribute : Attribute
Public NotInheritable Class CommandStyleAttribute
	Inherits Attribute
The CommandStyleAttribute type exposes the following members.
Constructors
Name | Description
CommandStyleAttribute
 Initializes a new command style attribute class.
Top
Properties
Name | Description
Styles
 Gets the associated style.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Commands Namespace