RhinoCommon API
ViewCapture Class
 Used to hold the information required to generate high resolution output of a RhinoViewport. This is used for generating paper prints or image files
Inheritance Hierarchy
System.Object
 Rhino.Display.ViewCapture
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ViewCapture
Public Class ViewCapture
The ViewCapture type exposes the following members.
Constructors
Name | Description
ViewCapture
Initializes a new instance of the ViewCapture class
Top
Properties
Name | Description
DrawAxes
DrawGrid
DrawGridAxes
Height
 Height of capture in Pixels
Preview
RealtimeRenderPasses
ScaleScreenItems
TransparentBackground
Width
 Width of capture in Pixels
Top
Methods
Name | Description
CaptureToBitmap(RhinoView)
CaptureToBitmap(ViewCaptureSettings)
CaptureToSvg
Top
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.Display Namespace