RhinoCommon API
HostUtils Class
 Contains static methods to deal with teh runtime environment.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.HostUtils
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class HostUtils
Public NotInheritable Class HostUtils
The HostUtils type exposes the following members.
Properties
Name | Description
ComputerSerialNumber
 Gets the serial number of the computer running Rhino.
DeviceId
 The DeviceId is a unique, stable ID that anonymously identifies the device that Rhino is running on. It is computed based on hardware information that should not change when the OS is upgraded, or if commonly modified hardware are added or removed from the computer. The machine-specific information is hashed using a cryptographic hash to make it anonymous.
DeviceName
 Name of the computer running Rhino. If the computer is part of a Windows Domain, the computer name has "@[DOMAIN]" appended.
RunningInMono
 Tests if this process is currently executing under the Mono runtime.
RunningInRhino
 Tests if RhinoCommon is currently executing inside of the Rhino.exe process. There are other cases where RhinoCommon could be running; specifically inside of Visual Studio when something like a windows form is being worked on in the resource editor or running stand-alone when compiled to be used as a version of OpenNURBS.
RunningOnOSX
 Tests if this process is currently executing on the Mac OSX platform.
RunningOnWindows
 Tests if this process is currently executing on the Windows platform.
SendDebugToCommandLine
 Gets or sets whether debug messages are printed to the command line.
Top
Methods
Name | Description
AutoInstallPlugInFolder
 Gets the auto install plug-in folder for machine or current user.
CallFromCoreRhino
 Don't change this function in ANY way unless you chat with Steve first! This function is called by Rhino on initial startup and the signature must be exact
CheckForRdk
 Determines if the RDK is loaded.
ClearFpuExceptionStatus
 Clear FPU exception and busy flags (Intel assembly fnclex)
CreateCommands(PlugIn)
 Parses a plugin and create all the commands defined therein.
CreateCommands(IntPtr, Assembly)
 Parses a plugin and create all the commands defined therein.
CreatePlugIn
 Instantiates a plug-in type and registers the associated commands and classes.
DebugDumpToString(BezierCurve)
 Gets the debug dumps. This is a text description of the geometric contents. DebugDump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
DebugDumpToString(GeometryBase)
 Gets the debug dumps. This is a text description of the geometric contents. DebugDump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
DebugString(String)
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
DebugString(String, Object[])
 Prints a debug message to the Rhino Command Line. The message will only appear if the SendDebugToCommandLine property is set to true.
DisplayOleAlerts
 Defines if Ole alerts ("Server busy") alerts should be visualized.
This function makes no sense on Mono.
ExceptionReport(Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
ExceptionReport(String, Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
FileNameEndsWithRhinoBackupExtension
 Strip file extension from file name and check to see if it is a valid Rhino backup file extension.
FileNameEndsWithRhinoExtension
 Strip file extension from file name and check to see if it is a valid Rhino file extension.
GetAbsolutePath
 Call this method to convert a relative path to an absolute path relative to the specified path.
GetActivePlugInVersionFolders
 Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
GetAssemblySearchPaths
 Returns list of directory names where additional assemblies (plug-ins, DLLs, Grasshopper components) may be located
GetPlatformService<T>()
For internal use only
GetPlatformService<T>(String, String)
For internal use only. Loads an assembly for dependency injection via IPlatformServiceLocator.
GetRhinoDotNetAssembly
 Only works on Windows. Returns null on Mac.
InitializeRhinoCommon
 Makes sure all static RhinoCommon components is set up correctly. This happens automatically when a plug-in is loaded, so you probably won't have to call this method.
InitializeRhinoCommon_RDK
 Makes sure all static RhinoCommon RDK components are set up correctly. This happens automatically when the RDK is loaded, so you probably won't have to call this method.
InitializeZooClient
 Initializes the ZooClient and Rhino license manager, this should get called automatically when RhinoCommon is loaded so you probably won't have to call this method.
InPlaceConstCast
 DO NOT USE UNLESS YOU ARE CERTAIN ABOUT THE IMPLICATIONS.
This is an expert user function which should not be needed in most cases. This function is similar to a const_cast in C++ to allow an object to be made temporarily modifiable without causing RhinoCommon to convert the class from const to non-const by creating a duplicate.
You must call this function with a true parameter, make your modifications, and then restore the const flag by calling this function again with a false parameter. If you have any questions, please contact McNeel developer support before using!
IsManagedDll
 Inspects a dll to see if it is compiled as native code or as a .NET assembly
IsRhinoBackupFileExtension
 Check to see if the file extension is a valid Rhino file extension.
IsRhinoFileExtension
 Check to see if the file extension is a valid Rhino file extension.
RecordInitInstanceTime
 Used to help record times at startup with the -stopwatch flag to help determine bottlenecks in start up speed
RegisterDynamicCommand
 Adds a new dynamic command to Rhino.
RhinoCommonExceptionHandler
 For internal use only!!! Unhanded exception handler, writes stack trace to RhinoDotNet.txt file
SetInShutDown
 Informs the runtime that the application is shutting down.
ShutDownRhinoCommon_RDK
 Makes sure all static RhinoCommon RDK components are de-initialized so they aren't calling into space when the RDK is unloaded.
UnhandledThreadException
 Exception handler for exceptions occurring on the UI thread
Top
Events
Name | Description
OnExceptionReport
 Is raised when an exception is reported with one of the ExceptionReport(Exception) method.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.Runtime Namespace