RhinoCommon SDK
RealtimeDisplayMode Class
 Base class for implementing real-time display modes in .NET
Inheritance Hierarchy
System.Object
 Rhino.Render.RealtimeDisplayMode
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class RealtimeDisplayMode
Public MustInherit Class RealtimeDisplayMode
The RealtimeDisplayMode type exposes the following members.
Constructors
Name | Description
RealtimeDisplayMode
Initializes a new instance of the RealtimeDisplayMode class
Top
Properties
Name | Description
LinearWorkflow
 Returns the LinearWorkflow data for this realitime display mode.
Top
Methods
Name | Description
CaptureProgress
 Override to communicate the progress of a capture.
ComputeViewportCrc
 Compute viewport CRC for the given ViewInfo
CreateWorld
 Implement if you need to handle the initial CreateWorld call initiated by the display pipeline system. Note that this is not the same as the CreateWorld call in Rhino.Render.ChangeQueue.ChangeQueue, although related.
DrawOpenGl
GetRealtimeViewport(IntPtr)
 Retrieve RealtimeDisplayMode instance that the IntPtr refers to.
GetRealtimeViewport(IntPtr, Boolean)
Retrieve RealtimeDisplayMode instance. If create is set to true then a new instance is created if not found, null is returned for false.
GetRenderSize
 Get the current render resolution for the running render session.
GetView
 Get ViewInfo that has been registered with this RealtimeDisplayMode instance.
HudAllowEditMaxPasses
 Override to allow maximum pass editing. By default disabled.
HudCustomStatusText
 Override to display status of the render engine.
HudLastRenderedPass
 Override to communicate the last completed pass. Can be shown in the HUD
HudMaximumPasses
 Override to communicate the maximum passes count currently in use for the render session. Can be shown in the HUD
HudProductName
 Override to return the name of your product. This will be printed in the HUD.
HudRendererLocked
 Implement to support locking in the viewport
HudRendererPaused
 Implement to support pausing and resuming in the viewport
HudShow
 Override if you want to hide the HUD. Shown by default
HudShowControls
 Show control buttons on the realtime display HUD. By default these are shown, override this function and return false if HUD controls aren't needed.
HudShowCustomStatusText
 Override to show status text in HUD. By default disabled.
HudShowMaxPasses
 Override to show maximum passes in HUD. By default disabled.
HudShowPasses
 Override to show current pass in HUD. By default disabled.
HudStartTime
IsCompleted
 Implement to tell if your render engine has completed a frame for drawing into the viewport
IsFrameBufferAvailable
 Implement to tell the render pipeline that a framebuffer is ready
IsRendererStarted
 Override to tell the started state of your render engine.
LastRenderedPass
 Implement to communicate last completed pass to the underlying system.
OnRenderSizeChanged
 Override to restart your render engine
RegisterDisplayModes(PlugIn)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in.
RegisterDisplayModes(Assembly, Guid)
 Find and register classes that derive from RealtimeDisplayMode from the given plug-in. The plug-in is found in the given assembly
RemoveRealtimeViewport
 Remove RealtimeDisplayMode instance from internal dictionary.
SetView
 Set ViewInfo for this RealtimeDisplayMode instance.
ShowCaptureProgress
 Override if you want to i.e. hide the progress dialog for capture progress.
ShutdownRenderer
 Override to shutdown your render engine
SignalRedraw
 Use to signal the underlying pipeline a redraw is wanted. This can be used for instance when a renderer has completed a pass which should be updated in the associated viewport.
StartRenderer
 Override to start your render engine
UnregisterDisplayModes(PlugIn)
UnregisterDisplayModes(Assembly, Guid)
Top
Events
Name | Description
HudLockButtonPressed
 Listen tot his event if you want to handle the lock button control
HudPauseButtonPressed
 Listen tot his event if you want to handle the pause button control
HudPlayButtonPressed
 Listen to this event if you want to handle the play button control.
HudProductNamePressed
 Listen tot his event if you want to handle a press on the product name component
HudStatusTextPressed
 Listen tot his event if you want to handle a press on the status text component
HudTimePressed
 Listen tot his event if you want to handle a press press on the time component
HudUnlockButtonPressed
 Listen tot his event if you want to handle the unlock button control
MaxPassesChanged
 Listen to this if you want to handle changes in maximum pass count through the HUD.
OnDisplayPipelineSettingsChanged
OnDrawMiddleground
OnInitFramebuffer
Top
See Also
Reference
Rhino.Render Namespace