RhinoCommon SDK
DisplayPipelineAttributes Class
 Represents display pipeline settings, such as "show transparency" and "show grips".
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class DisplayPipelineAttributes : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class DisplayPipelineAttributes
	Implements IDisposable, ISerializable
The DisplayPipelineAttributes type exposes the following members.
Constructors
Name | Description
DisplayPipelineAttributes
Initializes a new instance of the DisplayPipelineAttributes class
Top
Properties
Name | Description
CurveColor
Color used for drawing curves
CurveThickness
Pixel thickness for curves
DisableConduits
DisableTransparency
EnglishName
Id
IgnoreHighlights
LocalName
LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects
MeshSpecificAttributes
ObjectColor
PointRadius
PointStyle
RealtimeDisplayId
 Get the ID of the realtime display engine attached to the view. This will be Guid.Empty if no realtime display engine is in use. This can be the case for instance when starting a _Render session for a realtime viewport integration. That still would cause this ID to be Guid.Empty.
ShadingEnabled
Draw shaded meshes and surfaces
ShowCurves
Draw curves
ShowGrips
UseAssignedObjectMaterial
 Gets whether objects ought to be drawn using their assigned rendering material.
UseCustomObjectColor
 Gets whether objects ought to be drawn using a custom color.
UseCustomObjectMaterial
 Gets whether objects ought to be drawn using a custom material.
ViewSpecificAttributes
XrayAllObjects
Top
Methods
Name | Description
Dispose()
Releases all resources used by the DisplayPipelineAttributes
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayPipelineAttributes and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetObjectData
Top
See Also
Reference
Rhino.Display Namespace