RhinoCommon SDK
MeshSmoothingCoordinateSystem Enumeration
 The direction of the smoothing used by Rhino.Geometry.Mesh.Smooth.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum MeshSmoothingCoordinateSystem
Public Enumeration MeshSmoothingCoordinateSystem
Members
Member name | Value | Description
World | 0 |  World coordinates
CPlane | 1 |  Construction plane coordinates
Object | 2 |  Object u, v, and n coordinates
See Also
Reference
Rhino.Geometry Namespace