RhinoCommon SDK
IRhRdkThumbnailList_Modes Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkThumbnailList_Modes"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum IRhRdkThumbnailList_Modes
Public Enumeration IRhRdkThumbnailList_Modes
Members
Member name | Value | Description
Grid | 0 | Big thumbnails like Explorer icon mode (default).
List | 1 | Small thumbnails and info on right like Explorer report mode.
Tree | 2 | Tree view mode.
See Also
Reference
Rhino.UI.Controls Namespace