RhinoCommon API
PreviewSceneServer Class
 PreviewSceneServer
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PreviewSceneServer
Public Class PreviewSceneServer
The PreviewSceneServer type exposes the following members.
Constructors
Name | Description
PreviewSceneServer
 Constructor for PreviewSceneServer
Top
Properties
Name | Description
CppPointer
 The CppPointer of PreviewSceneServer
Top
Methods
Name | Description
ApplyRotation
 Set Scene Server Rotation
Dispose
 Dispose for PreviewSceneServer
Finalize
 Destructor for PreviewSceneServer
 (Overrides Object.Finalize().)
Top
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.Render Namespace