RhinoCommon API
ViewEventArgs Class
[Missing <summary> documentation for "T:Rhino.Display.ViewEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.ViewEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ViewEventArgs : EventArgs
Public Class ViewEventArgs
	Inherits EventArgs
The ViewEventArgs type exposes the following members.
Properties
Name | Description
View
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.Display Namespace