RhinoCommon API
DisplayModeDescription Class
 Description of a how Rhino will display in a viewport. These are the modes that are listed under "Advanced display" in the options dialog.
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayModeDescription
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class DisplayModeDescription : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class DisplayModeDescription
	Implements IDisposable, ISerializable
The DisplayModeDescription type exposes the following members.
Properties
Name | Description
AllowObjectAssignment
AmbientOcclusionId
ArtisticId
DisplayAttributes
EnglishName
GhostedId
Id
InMenu
LocalName
PenId
PipelineLocked
RaytracedId
RenderedId
RenderedShadowsId
ShadedId
ShadedPipelineRequired
SupportsShadeCommand
SupportsShading
TechId
WireframeId
WireframePipelineRequired
XRayId
Top
Methods
Name | Description
AddDisplayMode(String)
 Adds a new display mode.
AddDisplayMode(DisplayModeDescription)
CopyDisplayMode
 Copies an existing display mode.
DeleteDiplayMode
 Deletes an existing display mode.
Dispose()
Releases all resources used by the DisplayModeDescription
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayModeDescription and optionally releases the managed resources
ExportToFile
 Exports a DisplayModeDescription to a Windows-style .ini file.
Finalize |  (Overrides Object.Finalize().)
FindByName
GetDisplayMode
GetDisplayModes
 Gets all display mode descriptions that Rhino currently knows about.
ImportFromFile
 Imports a DisplayModeDescription from a Windows-style .ini file.
UpdateDisplayMode
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Display Namespace