RhinoCommon SDK
Ray3d Structure
 Represents an immutable ray in three dimensions, using position and direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Ray3d : ISerializable, IEquatable<Ray3d>,
	IEpsilonComparable<Ray3d>
<SerializableAttribute>
Public Structure Ray3d
	Implements ISerializable, IEquatable(Of Ray3d),
	IEpsilonComparable(Of Ray3d)
The Ray3d type exposes the following members.
Constructors
Name | Description
Ray3d
 Initializes a new Ray3d instance.
Top
Properties
Name | Description
Direction
 Gets the direction vector of this ray.
Position
 Gets the starting position of this ray.
Top
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Ray3d and has the same values as the present ray.
 (Overrides ValueType.Equals(Object).)
Equals(Ray3d)
 Determines whether the specified Ray3d has the same value as the present ray.
GetHashCode
 Computes a hashing number that represents the current ray.
 (Overrides ValueType.GetHashCode().)
PointAt
 Evaluates a point along the ray.
Top
Operators
Name | Description
Equality
 Determines whether two Ray3d have equal values.
Inequality
 Determines whether two Ray3d have different values.
Top
See Also
Reference
Rhino.Geometry Namespace