RhinoCommon API
RadialDimension Class
 Represents a dimension of a circular entity that can be measured with radius or diameter.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.RadialDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class RadialDimension : AnnotationBase
<SerializableAttribute>
Public Class RadialDimension
	Inherits AnnotationBase
The RadialDimension type exposes the following members.
Constructors
Name | Description
RadialDimension()
Initializes a new instance of the RadialDimension class
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
RadialDimension(Circle, Point3d, Double)
 Construct a radial dimension from 3d input
RadialDimension(Point3d, Point3d, Vector3d, Vector3d, Double)
 Construct a radial dimension from 3d input
Top
Properties
Name | Description
AnnotationType
CenterPoint
DimlinePoint
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
KneePoint
LeaderArrowBlockId
LeaderArrowSize
LeaderArrowType
LeaderCurveStyle
LeaderTextHorizontalAlignment
 Gets or sets the horizontal alignment of the radial dimension's text
In Rhino for Windows 6.22, this member is inherited from .DimensionNumericValue.
RadiusPoint
TextAngleType |  (Overrides Dimension.TextAngleType.)
In Rhino for Windows 6.22, this member is inherited from .DimensionTextFormula.
TextLocation |  (Overrides Dimension.TextLocation.)
TextOrientation |  (Overrides Dimension.TextOrientation.)
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Get3dPoints
 Get locations of dimension's 3d points
In Rhino for Windows, this member is overridden by GetBoundingBox(Transform).
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Geometry Namespace