RhinoCommon SDK
SubDVertexDirPair Structure
[Missing <summary> documentation for "T:Rhino.Geometry.SubDVertexDirPair"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public struct SubDVertexDirPair
Public Structure SubDVertexDirPair
The SubDVertexDirPair type exposes the following members.
Constructors
Name | Description
SubDVertexDirPair
Initializes a new instance of the SubDVertexDirPair class
Top
Properties
Name | Description
Flipped
Vertex
Top
Methods
Name | Description
ToString |  (Overrides ValueType.ToString().)
Top
See Also
Reference
Rhino.Geometry Namespace