RhinoCommon SDK
Centermark Class
 Represents a centermark
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.Centermark
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class Centermark : Dimension
<SerializableAttribute>
Public Class Centermark
	Inherits Dimension
The Centermark type exposes the following members.
Constructors
Name | Description
Centermark()
Initializes a new instance of the Centermark class
Centermark(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
Top
Methods
Name | Description
Create
 Create a new centermark
Top
See Also
Reference
Rhino.Geometry Namespace