RhinoCommon API
File3dm Class
 Represents a 3dm file, which is stored using the OpenNURBS file standard.
The 3dm format is the main Rhinoceros storage format.
Visit http://www.opennurbs.com/ for more details.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dm
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dm : IDisposable
Public Class File3dm
	Implements IDisposable
The File3dm type exposes the following members.
Constructors
Name | Description
File3dm
 Initializes a new instance of a 3dm file.
Top
Properties
Name | Description
AllDimStyles
 Dimension Styles in this file.
AllGroups
 Grpups in this file.
AllHatchPatterns
 Hatch patterns in this file.
AllInstanceDefinitions
 Instance definitions in this file
AllLayers
 Layers in this file.
AllLinetypes
 Linetypes in this file.
AllMaterials
 Materials in this file.
AllNamedConstructionPlanes
 Named construction planes in this file.
AllNamedViews
 Named views in this file.
AllViews
 Views that represent the RhinoViews which are displayed when Rhino loads this file.
ApplicationDetails
 Gets or sets details for the application that wrote this file.
ApplicationName
 Gets or sets the name of the application that wrote this file.
ApplicationUrl
 Gets or sets a URL for the application that wrote this file.
Created
 Get the DateTime that this file was originally created. If the value is not set in the 3dm file, then DateTime.MinValue is returned
CreatedBy
 Gets a string that names the user who created the file.
DimStyles
 Dimension Styles in this file.
HatchPatterns
 Hatch patterns in this file
HistoryRecords
 History records stored in this file
InstanceDefinitions
 Instance definitions in this file.
LastEdited
 Get the DateTime that this file was last edited. If the value is not set in the 3dm file, then DateTime.MinValue is returned
LastEditedBy
 Gets a string that names the user who last edited the file.
Layers
 Layers in this file.
Linetypes
 Linetypes in this file.
Manifest
 Retrieves the manifest with all object descriptions in this file.
Materials
 Materials in this file.
NamedConstructionPlanes
 Named construction planes in this file.
NamedViews
 Named views in this file.
Notes
 Gets or sets the model notes.
Objects
 Gets access to the File3dmObjectTable class associated with this file, which contains all objects.
PlugInData
 Custom plug-in data in this file. This data is not attached to any geometry or attributes
Revision
 Gets or sets the revision number.
Settings
 Settings include tolerance, and unit system, and defaults used for creating views and objects.
StartSectionComments
 Gets or sets the start section comments, which are the comments with which the 3dm file begins.
Strings
 Document user strings in this file
Views
 Views that represent the RhinoViews which are displayed when Rhino loads this file.
Top
Methods
Name | Description
Audit
 This function is only kept for forward assembly compatibility.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Dump
Prepares a text dump of the entire model.
DumpSummary
Prepares a text dump of model properties and settings.
DumpToTextLog
Prepares a text dump of the entire model.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetPreviewImage
 Preview image used for file explorer
IsValid(String)
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
IsValid(TextLog)
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
Polish
 This function is only kept for forward assembly compatibility.
Read(String)
 Reads a 3dm file from a specified location.
Read(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter)
 Reads a 3dm file from a specified location.
ReadApplicationData
 Reads only the application information from an existing 3dm file.
ReadArchiveVersion
 Reads only the archive 3dm version from an existing 3dm file.
ReadDimensionStyles
 Read the dimension styles table out of a 3dm file.
ReadNotes
Reads only the notes from an existing 3dm file.
ReadPreviewImage
 Attempts to read the preview image out of a 3dm file.
ReadRevisionHistory
 Quickly check a file for it's revision information. This function does not read the entire file, just what it needs to get revision information out
ReadWithLog(String, String)
 Read a 3dm file from a specified location and log any archive reading errors.
ReadWithLog(String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter, String)
 Reads a 3dm file from a specified location.
SetPreviewImage
 Preview image used for file explorer
Write(String, File3dmWriteOptions)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
Write(String, Int32)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
WriteWithLog(String, Int32, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
WriteWithLog(String, File3dmWriteOptions, String)
 Writes contents of this model to an openNURBS archive. If the model is not valid, then Write will refuse to write it.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.FileIO Namespace