RhinoCommon API
TextureType Enumeration
 The TextureType controls how the pixels in the bitmap are interpreted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureType
Public Enumeration TextureType
Members
Member name | Value | Description
None | 0
Bitmap | 1 |  Standard image texture
Bump | 2 |  bump map
Transparency | 3 |  value = alpha
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.DocObjects Namespace