RhinoCommon SDK
EdgeAdjacency Enumeration
 Enumerates all possible Topological Edge adjacency types.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum EdgeAdjacency
Public Enumeration EdgeAdjacency
Members
Member name | Value | Description
None | 0 |  Edge is not used by any faces and is therefore superfluous.
Naked | 1 |  Edge is used by a single face.
Interior | 2 |  Edge is used by two adjacent faces.
NonManifold | 3 |  Edge is used by three or more adjacent faces.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace