RhinoCommon API
OptionsDialogPage Class
[Missing <summary> documentation for "T:Rhino.UI.OptionsDialogPage"]
Inheritance Hierarchy
System.Object
 Rhino.UI.StackedDialogPage
 Rhino.UI.OptionsDialogPage
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class OptionsDialogPage : StackedDialogPage
Public MustInherit Class OptionsDialogPage
	Inherits StackedDialogPage
The OptionsDialogPage type exposes the following members.
Constructors
Name | Description
OptionsDialogPage
Initializes a new instance of the OptionsDialogPage class
Top
Properties
Name | Description
Top
Methods
Name | Description
RunScript
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.UI Namespace