RhinoCommon SDK
OrdinateDimension Class
 Represents an ordinate dimension
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.OrdinateDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class OrdinateDimension : Dimension
<SerializableAttribute>
Public Class OrdinateDimension
	Inherits Dimension
The OrdinateDimension type exposes the following members.
Constructors
Name | Description
OrdinateDimension()
Initializes a new instance of the OrdinateDimension class
OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
DefPoint
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
Top
Extension Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
 (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry Namespace