RhinoCommon API
RenderContentKind Enumeration
 Defines constant values for all render content kinds, such as material, environment or texture.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[FlagsAttribute]
public enum RenderContentKind
<FlagsAttribute>
Public Enumeration RenderContentKind
Members
Member name | Value | Description
None | 0
Material | 1
Environment | 2
Texture | 4
See Also
Reference
Rhino.Render Namespace