RhinoCommon API
Sun Class
 Represents the Sun on a little portion of Earth.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Sun
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Sun : DocumentOrFreeFloatingBase, IDisposable
Public Class Sun
	Inherits DocumentOrFreeFloatingBase
	Implements IDisposable
The Sun type exposes the following members.
Constructors
Name | Description
Sun
 Create a non-document controlled Sun
Top
Properties
Name | Description
Altitude
 Get the altitude for the sun. To set use SetPosition(azimuth, altitude)
Azimuth
 Get the azimuth for the sun. To set use SetPosition(azimuth, altitude)
DaylightSaving
Daylight savings time
DaylightSavingMinutes
Daylight saving minutes
Enabled
Turn the sun on/off in this document.
Latitude
Light
 Get a Light which represents the sun. If manual control is in effect, no sun calculation is performed; the function uses the values last used in calls to Azimuth, Altitude or Vector. If manual control is not in effect, the observer's position, date, time, time zone and daylight saving values are used to calculate the position of the sun.
Longitude
ManualControl
Set angles directly or use place/date/time
North
 Angle in degrees on world X-Y plane that should be considered north in the model. Angle is measured starting at X-Axis and travels counterclockwise. Y-Axis would be a north angle of 90 degrees.
SkylightOn |  Obsolete.
Turn skylight on or off.
TimeZone
 Measured in hours += UTC
Vector
Top
Methods
Name | Description
AltitudeFromValues
ColorFromAltitude
Get sun color based on altitude.
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Dispose
Releases all resources used by the Sun
Finalize |  (Overrides FreeFloatingBase.Finalize().)
GetDateTime
Here
JulianDay
SetDateTime
SetPosition(Double, Double)
 Sets position of the Sun based on azimuth and altitude values. Using this function will also set sun to manual.
SetPosition(DateTime, Double, Double)
 Sets position of the sun based on physical location and time.
SunDirection
TwilightZone
Top
Events
Name | Description
Changed
 This event is raised when a Sun property value is changed.
Top
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Render Namespace