RhinoCommon API
StringTable Class
 Collection of document user data strings
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.StringTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class StringTable
Public NotInheritable Class StringTable
The StringTable type exposes the following members.
Properties
Name | Description
Count
 The number of user data strings in the current document.
Document
Document that owns this object table.
DocumentDataCount
DocumentUserTextCount
Top
Methods
Name | Description
Delete(String)
Delete(String, String)
 Removes user data strings from the document.
GetEntryNames
 Return list of all entry names for a given section of user data strings in the document.
GetKey
GetSectionNames
 Returns a list of all the section names for user data strings in the document.
By default a section name is a key that is prefixed with a string separated by a backslash.
GetValue(Int32)
GetValue(String)
GetValue(String, String)
 Gets a user data string from the document.
SetString(String, String)
 Adds or sets a user data string to the document.
SetString(String, String, String)
 Adds or sets a user data string to the document.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.DocObjects.Tables Namespace