RhinoCommon API
PickContext.MeshHitFlag Enumeration
[Missing <summary> documentation for "T:Rhino.Input.Custom.PickContext.MeshHitFlag"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeshHitFlag
Public Enumeration MeshHitFlag
Members
Member name | Value | Description
Invalid | -1
Vertex | 0
Edge | 1
Face | 2
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Input.Custom Namespace