RhinoCommon API
BlockEditCommand Class
 This class may be used to replace the built in BlockEdit command with a plug-in version. Make sure to make your plug-in a load at startup plug-in when replacing the command to ensure the command is properly overridden.
Inheritance Hierarchy
System.Object
 Rhino.Commands.BlockEditCommand
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class BlockEditCommand
Public MustInherit Class BlockEditCommand
The BlockEditCommand type exposes the following members.
Constructors
Name | Description
BlockEditCommand
Initializes a new instance of the BlockEditCommand class
Top
Properties
Name | Description
Replacement
 The current replacement command
Top
Methods
Name | Description
InBlockEditMode
 Call this method to determine if a document is being blocked edited.
IsBlockEditing
 Called to determine if the specified document was not block edit mode.
ReplaceWith
 Call this method to register your replacement command, the last command registered will be called.
RunCommand
 Called by the internal BlockEdit command when the command is executed.
Top
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.Commands Namespace