RhinoCommon API
FileObjWriteOptions.CurveType Enumeration
 Type of curve used for trimmed surfaces
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CurveType
Public Enumeration CurveType
Members
Member name | Value | Description
Polyline | 0 |  Polyline approximation, see comments for AngleTolRadians
Nurbs | 1
Version Information
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.FileIO Namespace