RhinoCommon API
DocumentOrFreeFloatingBase Class
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Dithering
 Rhino.Render.GroundPlane
 Rhino.Render.LinearWorkflow
 Rhino.Render.Skylight
 Rhino.Render.Sun
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class DocumentOrFreeFloatingBase : FreeFloatingBase
Public MustInherit Class DocumentOrFreeFloatingBase
	Inherits FreeFloatingBase
The DocumentOrFreeFloatingBase type exposes the following members.
Methods
Name | Description
BeginChange
 Call this function before making any change to this object (calling a setter) otherwise undo will not work correctly. Calls to BeginChange must be paired with a call to EndChange.
EndChange
 See BeginChange
Top
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Render Namespace