RhinoCommon API
FileObj Class
 Support for obj file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileObj
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class FileObj
Public NotInheritable Class FileObj
The FileObj type exposes the following members.
Methods
Name | Description
Read
Write
Write an obj file based on the contents of a RhinoDoc
Top
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.FileIO Namespace