RhinoCommon API
RenderContentSerializer Class
 Used to import and export custom render content types such as materials, environments and textures. You must override RenderPlugIn.RenderContentSerializers() and return an array of derived RenderContentSerializer class types to add to the content browsers.
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContentSerializer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class RenderContentSerializer
Public MustInherit Class RenderContentSerializer
The RenderContentSerializer type exposes the following members.
Constructors
Name | Description
RenderContentSerializer
 Protected constructor to be called from derived class
Top
Properties
Name | Description
CanRead
 If true then the file type can be imported and will be included in the file open box when importing the specified render content type.
CanWrite
 If true then the file type can be exported and will be included in the file save box when exporting the specified render content type.
ContentType
 Type of content created when importing or exporting this file type.
EnglishDescription
 English string describing this plug-in
FileExtension
 File extension associated with this serialize object
LocalDescription
 Localized plug-in description
Top
Methods
Name | Description
Read
 Called to when importing a file, file should be parsed and converted to a valid RenderContent object.
RegisterSerializer
 Register the RenderContentSerializer
Write
 Called to save a custom RenderContent object as an external file.
Top
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Render Namespace