RhinoCommon SDK
RenderSettings Class
 Contains settings used in rendering.
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderSettings
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderSettings : IDisposable
Public Class RenderSettings
	Implements IDisposable
The RenderSettings type exposes the following members.
Constructors
Name | Description
RenderSettings()
 Initialize a new instance of the RenderSettings class.
RenderSettings(RenderSettings)
 Initialize new instance of the RenderSettings class.
Top
Properties
Name | Description
AmbientLight
 Gets or sets the ambient light color used in rendering.
AntialiasLevel
 Gets or sets antialias level, used for render quality
BackgroundColorBottom
 Gets or sets the background bottom color used in rendering.
BackgroundColorTop
 Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
BackgroundStyle
 How the viewport's backgroun should be filled.
DepthCue
 Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
Dithering
 Get the document dithering interface
FlatShade
 Gets or sets a value indicating whether to render using flat shading.
ImageDpi
 Number of dots/inch (dots=pixels) to use when printing and saving bitmaps. The default is 72.0 dots/inch.
ImageSize
 Gets or sets a value indicating the size of the rendering result if UseViewportSize is set to false. If UseViewportSize is set to true, then this value is ignored.
ImageUnitSystem
 unit system to use when converting image pixel size and dpi information into a print size. Default = inches
LinearWorkflow
 Get the document linear workflow interface
RenderAnnotations
 Gets or sets a value indicating whether to instruct the rendering engine to show annotations, such as linear dimensions or angular dimensions.
RenderBackfaces
 Gets or sets a value indicating whether to render back faces.
RenderCurves
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
RenderIsoparams
 Gets or sets a value indicating whether to instruct the rendering engine to show isocurves.
RenderMeshEdges
 Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
RenderPoints
 Gets or sets a value indicating whether to instruct the rendering engine to show points.
ScaleBackgroundToFit
 Gets or sets a value indicating whether to scale the wallpaper in the background or not. This is meaningful only if the viewport has a wallpaper and render settings are set to render Wallpaper into the background.
ShadowmapLevel
 0=none, 1=normal, 2=best.
TransparentBackground
 Gets or sets whether rendering should be done with transparent background.
UseHiddenLights
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
UseViewportSize
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
In Rhino for Windows 6.0 BETA, this member is inherited from .CommonObjectDispose().
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
In Rhino for Windows 6.0 BETA, this member is inherited from .CommonObjectDispose(Boolean).
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
In Rhino for Windows, this member is overridden by Finalize().
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace