RhinoCommon API
ContentCollectionIterator Class
[Missing <summary> documentation for "T:Rhino.Render.ContentCollectionIterator"]
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentCollectionIterator
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ContentCollectionIterator : IDisposable
Public NotInheritable Class ContentCollectionIterator
	Implements IDisposable
The ContentCollectionIterator type exposes the following members.
Constructors
Name | Description
ContentCollectionIterator
Initializes a new instance of the ContentCollectionIterator class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
DeleteThis
Dispose
Releases all resources used by the ContentCollectionIterator
Finalize |  (Overrides Object.Finalize().)
First
Next
Top
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Render Namespace