RhinoCommon API
ModifierKey Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ModifierKey"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[FlagsAttribute]
public enum ModifierKey
<FlagsAttribute>
Public Enumeration ModifierKey
Members
Member name | Value | Description
None | 0
Control | 1
Shift | 2
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.UI Namespace