RhinoCommon API
DecalMapping Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DecalMapping"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DecalMapping
Public Enumeration DecalMapping
Members
Member name | Value | Description
Planar | 0 |  Planar mapping. Uses projection, origin, up and across vectors (not unitized).
Cylindrical | 1 |  Cylindrical mapping. Uses origin, up, across, height, radius, latitude start and stop.
Spherical | 2 |  Spherical mapping. Uses origin, up, across, radius, latitude/longitude start and stop.
UV | 3 |  UV mapping.
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Render Namespace