RhinoCommon API
File3dmHistoryRecordTable Class
 Table of custom data provided by plug-ins
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmHistoryRecordTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmHistoryRecordTable
Public Class File3dmHistoryRecordTable
The File3dmHistoryRecordTable type exposes the following members.
Properties
Name | Description
Count
 Gets the number of history records in this table.
Top
Methods
Name | Description
Clear
 Remove all entries from this table
Dump
Prepares a text dump of table.
Top
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
Rhino.FileIO Namespace