RhinoCommon SDK
SubDFaceAccess Class
 Provides access to the face and face-related functionality of a SubD.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDFaceAccess
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class SubDFaceAccess : IEnumerable<SubDFacePtr>,
	IEnumerable
Public Class SubDFaceAccess
	Implements IEnumerable(Of SubDFacePtr), IEnumerable
The SubDFaceAccess type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of SubD faces.
First
Top
Methods
Name | Description
Add
 Adds a new edge to the end of the SubDEdgePtr list.
GetEnumerator
Top
See Also
Reference
Rhino.Geometry.Collections Namespace