RhinoCommon SDK
LayerTableEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LayerTableEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.LayerTableEventArgs
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class LayerTableEventArgs : EventArgs
Public Class LayerTableEventArgs
	Inherits EventArgs
The LayerTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
LayerIndex
NewState
OldState
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace