RhinoCommon API
Utilities.ShowContentChooserResults Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Utilities.ShowContentChooserResults"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ShowContentChooserResults
Public Enumeration ShowContentChooserResults
Members
Member name | Value | Description
None | 0 |  No choice (user cancelled).
New | 1 |  User chose from 'New' tab. uuidOut is the type id.
Copy | 2 |  User chose from 'Existing' tab with 'copy' radio button checked. uuidOut is the instance id.
Instance | 3 |  User chose from 'Existing' tab with 'instance' radio button checked. uuidOut is the instance id.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Render Namespace