RhinoCommon API
LinearDimensionObject Class
 Rhino Object that represents a linear dimension geometry and attributes
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.LinearDimensionObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class LinearDimensionObject : AnnotationObjectBase
Public Class LinearDimensionObject
	Inherits AnnotationObjectBase
The LinearDimensionObject type exposes the following members.
Properties
Name | Description
DimensionStyle
 Gets the DimensionStyle associated with this LinearDimensionObject.
In Rhino for Windows 6.25, this member is inherited from .DimensionObjectDimensionStyle.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
In Rhino for Windows 6.25, this member is inherited from .CommonObjectIsValid.
LinearDimensionGeometry
 Get the dimension geometry for this object.
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.DocObjects Namespace