RhinoCommon API
UserDataList Class
Represents a collection of user data.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.UserDataList
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UserDataList
Public Class UserDataList
The UserDataList type exposes the following members.
Properties
Name | Description
Count
Number of UserData objects in this list.
Item
 Retrieve through indexer. Read-only access.
Top
Methods
Name | Description
Add
 If the userdata is already in a different UserDataList, it will be removed from that list and added to this list.
Contains
 Checks for the existence of a specific type of userdata in this list Both .NET and native userdata is checked
Find
 Finds a specific data type in this regulated collection.
GetEnumerator
 Get enumerator for UserDataList
Purge
 Removes all user data from this geometry.
Remove
 Remove the userdata from this list
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.DocObjects.Custom Namespace