RhinoCommon API
CurveOrientation Enumeration
 Defines enumerated values for closed curve orientations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CurveOrientation
Public Enumeration CurveOrientation
Members
Member name | Value | Description
Undefined | 0 |  Unable to compute the curve's orientation.
Clockwise | -1 |  The curve's orientation is clockwise in the xy plane.
CounterClockwise | 1 |  The curve's orientation is counter clockwise in the xy plane.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Geometry Namespace