RhinoCommon API
DescriptionType Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.DescriptionType"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DescriptionType
Public Enumeration DescriptionType
Members
Member name | Value | Description
Organization | 0
Address | 1
Country | 2
Phone | 3
WebSite | 4
Email | 5
UpdateUrl | 6
Fax | 7
Icon | 8
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.PlugIns Namespace