RhinoCommon SDK
GetBoxMode Enumeration
 Enumerates all Box getter modes.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum GetBoxMode
Public Enumeration GetBoxMode
Members
Member name | Value | Description
All | 0 |  All modes are allowed.
Corner | 1 |  The base rectangle is created by picking the two corner points.
ThreePoint | 2 |  The base rectangle is created by picking three points.
Vertical | 3 |  The base vertical rectangle is created by picking three points.
Center | 4 |  The base rectangle is created by picking a center point and a corner point.
See Also
Reference
Rhino.Input Namespace