RhinoCommon API
RenderTabs Class
[Missing <summary> documentation for "T:Rhino.Render.RenderTabs"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderTabs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RenderTabs
Public NotInheritable Class RenderTabs
The RenderTabs type exposes the following members.
Methods
Name | Description
FromRenderSessionId
 Get the instance of a render tab associated with a specific render session, this is useful when it is necessary to update a control from a RenderPipeline
RegisterTab
 Register custom render user interface with Rhino. This should only be done in RegisterRenderTabs(RenderTabs). Panels registered after RegisterRenderTabs(RenderTabs) is called will be ignored. If the class includes a public method "void DoHelp()" the method will get called when F1 is pressed and the custom tab is active.
SessionIdFromTab
 Get the session Id that created the specified tab object.
Top
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.Render Namespace