RhinoCommon API
RegionContainment Enumeration
 Defines enumerated values for closed curve/closed curve relationships.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RegionContainment
Public Enumeration RegionContainment
Members
Member name | Value | Description
Disjoint | 0 |  There is no common area between the two regions.
MutualIntersection | 1 |  The two curves intersect. There is therefore no full containment relationship either way.
AInsideB | 2 |  Region bounded by curveA (first curve) is inside of curveB (second curve).
BInsideA | 3 |  Region bounded by curveB (second curve) is inside of curveA (first curve).
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Geometry Namespace