RhinoCommon API
GripStatus Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.GripStatus"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.GripStatus
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GripStatus
Public Class GripStatus
The GripStatus type exposes the following members.
Properties
Name | Description
Culled
Visible
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.DocObjects.Custom Namespace