RhinoCommon API
ICurrentEnvironment_Get Interface
[Missing <summary> documentation for "T:Rhino.Render.ICurrentEnvironment_Get"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface ICurrentEnvironment_Get
Public Interface ICurrentEnvironment_Get
The ICurrentEnvironment_Get type exposes the following members.
Properties
Name | Description
ForBackground
ForBackground_CheckMode
ForLighting
ForReflectionAndRefraction
Top
See Also
Reference
Rhino.Render Namespace