RhinoCommon API
BrepVertex Class
 Brep vertex information
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Point
 Rhino.Geometry.BrepVertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BrepVertex : Point
Public Class BrepVertex
	Inherits Point
The BrepVertex type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this vertex.
VertexIndex
 Gets the index of this vertex in the Brep.Vertices collection.
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
EdgeIndices
 Gets the indices of all edges associated with this vertex.
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Geometry Namespace