RhinoCommon SDK
CommandLineOption Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.CommandLineOption"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.CommandLineOption
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class CommandLineOption
Public NotInheritable Class CommandLineOption
The CommandLineOption type exposes the following members.
Properties
Name | Description
CurrentListOptionIndex
EnglishName
Index
Top
Methods
Name | Description
IsValidOptionName
 Test a string to see if it can be used as an option name in any of the RhinoGet::AddCommandOption...() functions.
IsValidOptionValueName
 Test a string to see if it can be used as an option value in RhinoGet::AddCommandOption, RhinoGet::AddCommandOptionToggle, or RhinoGet::AddCommandOptionList.
Top
See Also
Reference
Rhino.Input.Custom Namespace