RhinoCommon SDK
DrawForegroundEventArgs Class
[Missing <summary> documentation for "T:Rhino.Display.DrawForegroundEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.DrawForegroundEventArgs
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class DrawForegroundEventArgs : DrawEventArgs
Public Class DrawForegroundEventArgs
	Inherits DrawEventArgs
The DrawForegroundEventArgs type exposes the following members.
Properties
Name | Description
DrawWorldAxes
WorldAxesDrawn
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace