RhinoCommon API
GetCancel Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetCancel"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetCancel
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetCancel : GetBaseClass
Public Class GetCancel
	Inherits GetBaseClass
The GetCancel type exposes the following members.
Constructors
Name | Description
GetCancel
Initializes a new instance of the GetCancel class
Top
Properties
Name | Description
Progress
ProgressMessage
ProgressReporting
Token
Top
Methods
Name | Description
Wait<TResult>
WaitAll<TResult>
Top
Events
Name | Description
TaskCompleted
Top
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Input.Custom Namespace