RhinoCommon SDK
TextObject Class
 Represents a text object in a document.
This is a wrapper for CRhinoAnnotationText.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.TextObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class TextObject : AnnotationObjectBase
Public Class TextObject
	Inherits AnnotationObjectBase
The TextObject type exposes the following members.
Properties
Name | Description
TextGeometry
 Gets the text entity geometry of this text object.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace