RhinoCommon API
ViewInfoFocalBlurModes Enumeration
 The different focal blur modes of the ViewInfo
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ViewInfoFocalBlurModes
Public Enumeration ViewInfoFocalBlurModes
Members
Member name | Value | Description
None | 0 |  No focal blur
Automatic | 1 | Autofocus on selected objects
Manual | 2 | Fully manual focus
Version Information
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.DocObjects Namespace