RhinoCommon API
HiddenLineDrawingPoint.Visibility Enumeration
 The different types of HiddenLineObjectPoint visiblity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Visibility
Public Enumeration Visibility
Members
Member name | Value | Description
Unset | 0 |  Unset value
Visible | 1 |  Visible
Hidden | 2 |  Hidden
Duplicate | 3 |  Duplicate
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Geometry Namespace