RhinoCommon API
TurnOnGripsEventHandler Delegate
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.TurnOnGripsEventHandler"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void TurnOnGripsEventHandler(
	RhinoObject rhObj
)
Public Delegate Sub TurnOnGripsEventHandler (
	rhObj As RhinoObject
)
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.DocObjects.Custom Namespace