RhinoCommon API
Skylight Class
[Missing <summary> documentation for "T:Rhino.Render.Skylight"]
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Skylight
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Skylight : DocumentOrFreeFloatingBase
Public NotInheritable Class Skylight
	Inherits DocumentOrFreeFloatingBase
The Skylight type exposes the following members.
Constructors
Name | Description
Skylight()
 Create an utility object not associated with any document
Skylight(Skylight)
 Create an utility object not associated with any document from another object
Top
Properties
Name | Description
CustomEnvironment
CustomEnvironmentOn
Enabled
ShadowIntensity
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Top
Events
Name | Description
Changed
 This event is raised when a Skylight property value is changed.
Top
Version Information
Rhino for Windows
Supported in: 6.23
See Also
Reference
Rhino.Render Namespace