RhinoCommon API
IPanel Interface
[Missing <summary> documentation for "T:Rhino.UI.IPanel"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IPanel
Public Interface IPanel
Methods
Name | Description
PanelClosing(UInt32)
PanelClosing(UInt32, Boolean)
PanelHidden(UInt32)
PanelHidden(UInt32, ShowPanelReason)
PanelShown(UInt32)
PanelShown(UInt32, ShowPanelReason)
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.UI Namespace