RhinoCommon SDK
MorphControlObject Class
 Represents a MorphControl in a document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.MorphControlObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MorphControlObject : RhinoObject
Public Class MorphControlObject
	Inherits RhinoObject
The MorphControlObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace