RhinoCommon API
FileObjWriteOptions.GeometryType Enumeration
 (trimmed) NURBS surfaces may be exported as either NURBS or meshes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum GeometryType
Public Enumeration GeometryType
Members
Member name | Value | Description
Nurbs | 0
Mesh | 1
Version Information
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.FileIO Namespace