RhinoCommon SDK
PickContext.MeshPickStyle Enumeration
[Missing <summary> documentation for "T:Rhino.Input.Custom.PickContext.MeshPickStyle"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum MeshPickStyle
Public Enumeration MeshPickStyle
Members
Member name | Value | Description
WireframePicking | 0 | Checks for vertex and edge hits
ShadedModePicking | 1 | Checks for face hits
VertexOnlyPicking | 2 | Returns false if no vertices are hit
See Also
Reference
Rhino.Input.Custom Namespace