RhinoCommon SDK
RenderContentCollection Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContentCollection"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContentCollection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class RenderContentCollection : IDisposable,
	IEnumerable
Public NotInheritable Class RenderContentCollection
	Implements IDisposable, IEnumerable
The RenderContentCollection type exposes the following members.
Constructors
Name | Description
RenderContentCollection()
Initializes a new instance of the RenderContentCollection class
RenderContentCollection(IntPtr)
Initializes a new instance of the RenderContentCollection class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Add
Append
Clear
ContentAt
Count
Dispose
Releases all resources used by the RenderContentCollection
Finalize |  (Overrides Object.Finalize().)
Find_Sel
GetEnumerator
GetSearchPattern
Iterator
Remove
Set
SetKind
SetSearchPattern
Top
See Also
Reference
Rhino.Render Namespace