RhinoCommon API
FileObjWriteOptions.AsciiEol Enumeration
 End of Line
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AsciiEol
Public Enumeration AsciiEol
Members
Member name | Value | Description
Crlf | 0 |  MicroSoft
Lf | 1 |  UNIX
Cr | 2 |  Apple
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.FileIO Namespace