RhinoCommon SDK
EarthAnchorPoint Class
 Contains information about the model's position in latitude, longitude, and elevation for GIS mapping applications.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.EarthAnchorPoint
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class EarthAnchorPoint : IDisposable
Public Class EarthAnchorPoint
	Implements IDisposable
The EarthAnchorPoint type exposes the following members.
Constructors
Name | Description
EarthAnchorPoint
 Initializes a new instance of the EarthAnchorPoint class.
Top
Properties
Name | Description
Description
 Gets or sets the long form of the identifying information about this location.
EarthBasepointElevation
 Gets or sets the point elevation on earth, in meters.
EarthBasepointElevationZero
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
EarthBasepointLatitude
 Gets or sets a point latitude on earth, in decimal degrees. +90 = north pole, 0 = equator, -90 = south pole.
EarthBasepointLongitude
 Gets or sets the point longitude on earth, in decimal degrees.
0 = prime meridian (Greenwich meridian)
Values increase towards West
ModelBasePoint
Corresponding model point in model coordinates.
ModelEast
Earth directions in model coordinates.
ModelNorth
Earth directions in model coordinates.
Name
 Gets or sets the short form of the identifying information about this location.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetModelCompass
 Returns a plane in model coordinates whose X axis points East, Y axis points North and Z axis points Up. The origin is set to ModelBasepoint.
GetModelToEarthTransform
 Gets a transformation from model coordinates to earth coordinates. This transformation assumes the model is small enough that the curvature of the earth can be ignored.
Top
See Also
Reference
Rhino.DocObjects Namespace