RhinoCommon API
Font Class
Defines a format for text.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Font
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Font
Public NotInheritable Class Font
The Font type exposes the following members.
Constructors
Name | Description
Font(String)
Initializes a new instance of the Font class
Font(String, Font.FontWeight, Font.FontStyle, Boolean, Boolean)
Initializes a new instance of the Font class
Top
Properties
Name | Description
Bold
Description
 Returns a long description that includes family, face, weight, stretch and style information. Generally not useful for finding matching fonts.
EnglishFaceName
 Returns English Facename
EnglishFamilyName
EnglishQuartetName
FaceName
 Returns Facename
FamilyName
FamilyPlusFaceName
 Returns concatinated Family and Face names
IsEngravingFont
IsSimulated
IsSingleStrokeFont
IsSymbolFont
Italic
LogfontName
 Returns Windows Logfont Facename
PointSize
PostScriptName
 Returns the Font PostScriptName - "Apple font name"
QuartetName
RichTextFontName
 Returns the Font RichTextFontName used in RTF strings: {\\fonttbl...{\\fN RichTextFontName;}...}
Strikeout
Style
Underlined
Weight
Top
Methods
Name | Description
AvailableFontFaceNames
FromQuartetProperties
InstalledFonts()
InstalledFonts(String)
InstalledFontsAsQuartets
Top
See Also
Reference
Rhino.DocObjects Namespace