RhinoCommon SDK
SubD Class
 Represents a surface geometry type that is defined by a control net, crease information and a refinement level.
This is often called a subdivision surface.
Warning: this object is exposed for early testing. It might change without notice.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.SubD
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class SubD : GeometryBase
<SerializableAttribute>
Public Class SubD
	Inherits GeometryBase
The SubD type exposes the following members.
Constructors
Name | Description
SubD
Initializes a new empty SubD surface.
Top
Properties
Name | Description
ActiveLevel
ActiveLevelSubDType
Edges
 Gets access to edges.
Faces
 Gets access to faces.
Level
Vertices
 Gets access to vertices.
Top
Methods
Name | Description
ChamferVertex
 Removes a vertex and inserts a face using some parameters.
CreateFromMesh
Dispose(Boolean)
Releases the unmanaged resources used by the SubD and optionally releases the managed resources
 (Overrides GeometryBase.Dispose(Boolean).)
GetLimitSurfaceInPatches
OnSwitchToNonConst |  (Overrides GeometryBase.OnSwitchToNonConst().)
SetSubDType
Subdivide(Int32, SubD.SubDType, Int32)
Subdivide(Int32, SubD.SubDType, Int32, Int32)
SubDTypeFromInt
ToLimitSurfaceMesh(Int32)
ToLimitSurfaceMesh(SubDDisplayParameters)
ToLimitSurfaceMesh(Int32, SubD.SubDType)
UpdateAllTagsAndSectorCoefficients
Top
See Also
Reference
Rhino.Geometry Namespace