RhinoCommon API
CullFaceMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.CullFaceMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CullFaceMode
Public Enumeration CullFaceMode
Members
Member name | Value | Description
DrawFrontAndBack | 0
DrawFrontFaces | 1
DrawBackFaces | 2
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Display Namespace