RhinoCommon API
SumSurface Class
 Represents a sum surface, or an extrusion of a curve along a curved path.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.SumSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class SumSurface : Surface
<SerializableAttribute>
Public Class SumSurface
	Inherits Surface
The SumSurface type exposes the following members.
Constructors
Name | Description
SumSurface
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
Create
 Constructs a new sum surface by extruding a curve A along a path B.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Geometry Namespace