RhinoCommon API
LineCylinderIntersection Enumeration
 Represents all possible cases of a Line|Cylinder intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LineCylinderIntersection
Public Enumeration LineCylinderIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Single | 1 |  One intersection.
Multiple | 2 |  Two intersections.
Overlap | 3 |  Line lies on cylinder.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.Geometry.Intersect Namespace