RhinoCommon API
ModelComponentType Enumeration
 The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ModelComponentType
Public Enumeration ModelComponentType
Members
Member name | Value | Description
Unset | 0 | No value set.
Image | 1 | Embedded image (bitmap) components.
TextureMapping | 2 | Texture mapping.
RenderMaterial | 3 | Render material.
LinePattern | 4 | Line pattern (linetype).
Layer | 5 | Layer.
Group | 6 | Group.
TextStyle | 7 | Text style.
DimStyle | 8 | AnnotationDimension style.
RenderLight | 9 | Render light.
HatchPattern | 10 | Hatch pattern.
InstanceDefinition | 11 | Instance definition.
ModelGeometry | 12 | Model objects (points, curves, surfaces, ..., annotation, page details, ...), including objects referenced by instance definitions.
HistoryRecord | 13 | History record.
Mixed | 254 | Multiple component types. Used when a component type filter must include all explicit component types.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.DocObjects Namespace