RhinoCommon SDK
SubDVertexAccess Class
 Provides access to the vertices and vertex-related functionality of a SubD.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDVertexAccess
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class SubDVertexAccess : IEnumerable<SubDVertexPtr>,
	IEnumerable
Public Class SubDVertexAccess
	Implements IEnumerable(Of SubDVertexPtr), IEnumerable
The SubDVertexAccess type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of SubD vertices.
First
Top
Methods
Name | Description
Add(SubD.SubDVertexTag, Point3d)
 Adds a new vertex to the end of the Vertex list.
Add(SubD.SubDVertexTag, Double, Double, Double)
 Adds a new vertex to the end of the Vertex list.
AddVertices(SubD.SubDVertexTag, IEnumerable<Point3d>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts double-precision points.
AddVertices(SubD.SubDVertexTag, IEnumerable<Point3f>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
Find
GetEnumerator
GetUnboundSectorIterator
 This iterator needs to be reset before any use is sensible.
RemoveVertexAndConnections(Int32)
 Removes a vertex from the subD. All connected parts are removed, too.
RemoveVertexAndConnections(Int32[])
 Removes some vertices from the subD.
TryFind
Top
See Also
Reference
Rhino.Geometry.Collections Namespace