RhinoCommon API
DecalProjection Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DecalProjection"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DecalProjection
Public Enumeration DecalProjection
Members
Member name | Value | Description
Forward | 0 | Project forward
Backward | 1 | Project backward
Both | 2 | Project forward and backward
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Render Namespace