RhinoCommon API
Dithering Class
 This is the interface to linear workflow settings.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.Dithering
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class Dithering : DocumentOrFreeFloatingBase
Public NotInheritable Class Dithering
	Inherits DocumentOrFreeFloatingBase
The Dithering type exposes the following members.
Constructors
Name | Description
Dithering()
 Create an utility object not associated with any document
Dithering(Dithering)
 Create an utility object not associated with any document from another object
Top
Properties
Name | Description
Method
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Top
See Also
Reference
Rhino.Render Namespace