RhinoCommon API
BrepFace Class
 Provides strongly-typed access to brep faces.
A Brep face is composed of one surface and trimming curves.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.SurfaceProxy
 Rhino.Geometry.BrepFace
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BrepFace : SurfaceProxy
Public Class BrepFace
	Inherits SurfaceProxy
The BrepFace type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this face.
FaceIndex
Index of face in Brep.Faces array.
IsSurface
 Gets a value indicating whether the face is synonymous with the underlying surface. If a Face has no trimming curves then it is considered a Surface.
Loops
 Loops in this face.
MaterialChannelIndex
 This face's rendering material channel index.
OrientationIsReversed
 true if face orientation is opposite of natural surface orientation.
OuterLoop
 Every face has a single outer loop.
SurfaceIndex
 Surface index of the 3d surface geometry used by this face or -1
Top
Methods
Name | Description
AdjacentEdges
 Gets the indices of all the BrepEdges that delineate this Face.
AdjacentFaces
 Gets the indices of all the BrepFaces that surround (are adjacent to) this face.
ChangeSurface
 Expert user tool that replaces the 3d surface geometry use by the face.
ClearMaterialChannelIndex
 Clear this face's rendering material channel index.
CreateExtrusion
 Extrude a face in a Brep.
DraftAnglePoint
 Returns the surface draft angle and point at a parameter.
DuplicateFace
 Duplicate a face from the brep to create new single face brep.
DuplicateSurface
 Gets a copy to the untrimmed surface that this face is based on.
GetMesh
 Obtains a reference to a specified type of mesh for this brep face.
IsPointOnFace
 Tests if a parameter space point is on the interior of a trimmed face.
PullPointsToFace
 Pulls one or more points to a brep face.
RebuildEdges
 Rebuild the edges used by a face so they lie on the surface.
RemoveHoles
 Remove all inner loops, or holes, from a Brep face.
SetDomain
 Sets the surface domain of this face.
 (Overrides Surface.SetDomain(Int32, Interval).)
SetMesh
 Sets a reference to a specified type of mesh for this brep face.
ShrinkFace
 Shrinks the underlying untrimmed surface of this Brep face close to trimming boundaries. Shrinking a surface is like extending smoothly, only backwards. knot of full multiplicity are added where you want the surface to be cut off. Then the remaining control points are thrown away.
ShrinkSurfaceToEdge
 Shrinks the underlying untrimmed surface of this Brep face right to the trimming boundaries. Note, shrinking the trimmed surface can sometimes cause problems later since having the edges so close to the trimming boundaries can cause commands that use the surface edges as input to fail.
Split(IEnumerable<Curve>, Double)
 Split this face using 3D trimming curves.
TrimAwareIsoCurve
 Similar to IsoCurve function, except this function pays attention to trims on faces and may return multiple curves.
TrimAwareIsoIntervals
 Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
UnderlyingSurface
 Gets the untrimmed surface that is the base of this face.
Top
See Also
Reference
Rhino.Geometry Namespace