RhinoCommon API
SupportOptions Class
[Missing <summary> documentation for "T:Rhino.Render.SupportOptions"]
Inheritance Hierarchy
System.Object
 Rhino.Render.SupportOptions
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class SupportOptions
Public NotInheritable Class SupportOptions
The SupportOptions type exposes the following members.
Methods
Name | Description
AlwaysShowSunPreview
AutoSaveKeepAmount
AutoSaveRenderings
CheckSupportFilesBeforeRendering
CombineEditors
CustomLibraryPath
CustomPaths
DarkPreviewCheckerColor
EnablePreviewJobLog
HarvestContentParameters
LabelFormatLoc
LabelFormatUtc
LastNavigatedLocation
LibrariesInitialLocation
LibrariesInitialLocationCustomFolder
LightPreviewCheckerColor
MaxPreviewCacheMB
MaxPreviewSeconds
MultithreadedTextureEvaluation
PreferNativeRenderer
PreferredUnpackFolder
PreviewCustomRenderMeshes
SetAlwaysShowSunPreview
SetAutoSaveKeepAmount
SetAutoSaveRenderings
SetCheckSupportFilesBeforeRendering
SetCombineEditors
SetCustomLibraryPath
SetCustomPaths
SetHarvestContentParameters
SetLabelFormatLoc
SetLabelFormatUtc
SetLastNavigatedLocation
SetLibrariesInitialLocation
SetLibrariesInitialLocationCustomFolder
SetMultithreadedTextureEvaluation
SetPreferNativeRenderer
SetPreferredUnpackFolder
SetPreviewCustomRenderMeshes
SetShowCustom
SetShowDetailsPanel
SetShowDocuments
SetShowRenderContent
SetSupportSharedUIs
SetTextureSize |  Obsolete.
SetUseDefaultLibraryPath
SetUsePreviewCache
SetUseQuickInitialPreview
ShowCustom
ShowDetailsPanel
ShowDocuments
ShowRenderContent
SupportSharedUIs
SupportSharedUIsNoCache
TextureSize
UseDefaultLibraryPath
UsePreview
UsePreviewCache
UseQuickInitialPreview
UseRenderedPreview
Top
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Render Namespace