RhinoCommon API
Font.FontOrigin Enumeration
 Platform where font originated. This information is useful when searching for appropriate substitues.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FontOrigin
Public Enumeration FontOrigin
Members
Member name | Value | Description
Unset | 0 |  Not set.
Unknown | 1 |  Origin unknown. Changing an ON_Font characteristic like weight or sytle sets the origin to unknown.
WindowsFont | 2 |  Set from a Windows IDWriteFont by ON_Font::SetFromDWriteFont() or a Windows LOGFONT by ON_Font::SetFromWindowsLogFont() and FaceName and WindowLogfontName match a font installed on a Windows device.
AppleFont | 3 |  Set from an Apple NSFont of font name by ON_Font::SetFromAppleFont() and PostScriptName() and FamilyName() match a font installed on an Apple device. or iOS computer.
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.DocObjects Namespace