RhinoCommon API
DisplayPipelineAttributes.ContextsForDraw Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.ContextsForDraw"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ContextsForDraw
Public Enumeration ContextsForDraw
Members
Member name | Value | Description
Unset | 0
FilePreview | 1
ViewCapture | 2
Printing | 3
UIPreview | 4
Mask | 5
RenderOverlays | 6
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Display Namespace