RhinoCommon SDK
CustomRenderMeshProvider2 Class
[Missing <summary> documentation for "T:Rhino.Render.CustomRenderMeshProvider2"]
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomRenderMeshProvider
 Rhino.Render.CustomRenderMeshProvider2
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class CustomRenderMeshProvider2 : CustomRenderMeshProvider
Public MustInherit Class CustomRenderMeshProvider2
	Inherits CustomRenderMeshProvider
The CustomRenderMeshProvider2 type exposes the following members.
Constructors
Name | Description
CustomRenderMeshProvider2
Initializes a new instance of the CustomRenderMeshProvider2 class
Top
Properties
Name | Description
Top
Methods
Name | Description
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, Boolean).)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace