RhinoCommon API
SceneServerData Class
 The Scene Server Data used by the PreviewSceneServer
Inheritance Hierarchy
System.Object
 Rhino.Render.SceneServerData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SceneServerData
Public Class SceneServerData
The SceneServerData type exposes the following members.
Constructors
Name | Description
SceneServerData
 Constructor for SceneServerData
Top
Properties
Name | Description
CppPointer
 The CppPointer of SceneServerData
Top
Methods
Name | Description
Dispose
 Dispose for SceneServerData
Finalize
 Destructor for SceneServerData
 (Overrides Object.Finalize().)
Top
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Render Namespace