RhinoCommon SDK
MeshFace Structure
 Represents the values of the four indices of a mesh face quad.
If the third and fourth values are the same, this face represents a triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct MeshFace
<SerializableAttribute>
Public Structure MeshFace
The MeshFace type exposes the following members.
Constructors
Name | Description
MeshFace(Int32, Int32, Int32)
 Constructs a new triangular Mesh face.
MeshFace(Int32, Int32, Int32, Int32)
 Constructs a new quadrangular Mesh face.
Top
Properties
Name | Description
A
 Gets or sets the first corner index of the mesh face.
B
 Gets or sets the second corner index of the mesh face.
C
 Gets or sets the third corner index of the mesh face.
D
 Gets or sets the fourth corner index of the mesh face. If D equals C, the mesh face is considered to be a triangle rather than a quad.
IsQuad
 Gets a value indicating whether or not this mesh face is a quad. A mesh face is considered to be a triangle when C does not equal D, thus it is possible for an Invalid mesh face to also be a quad.
IsTriangle
 Gets a value indicating whether or not this mesh face is a triangle. A mesh face is considered to be a triangle when C equals D, thus it is possible for an Invalid mesh face to also be a triangle.
Item
 Gets or sets the vertex index associated with an entry in this face.
Unset
 Gets an Unset MeshFace. Unset faces have Int32.MinValue for all corner indices.
Top
Methods
Name | Description
Flip
 Reverses the orientation of the face by swapping corners. The first corner is always maintained.
IsValid()
 Gets a value indicating whether or not this mesh face is considered to be valid. Note that even valid mesh faces could potentially be invalid in the context of a specific Mesh, if one or more of the corner indices exceeds the number of vertices on the mesh. If you want to perform a complete validity check, use IsValid(int) instead.
IsValid(Int32)
 Gets a value indicating whether or not this mesh face is considered to be valid. Unlike the simple IsValid function, this function takes upper bound indices into account.
Set(Int32, Int32, Int32)
 Sets all the corners for this face as a triangle.
Set(Int32, Int32, Int32, Int32)
 Sets all the corners for this face as a quad.
Top
See Also
Reference
Rhino.Geometry Namespace