RhinoCommon SDK
RenderEnvironment.Usage Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderEnvironment.Usage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[FlagsAttribute]
public enum Usage
<FlagsAttribute>
Public Enumeration Usage
Members
Member name | Value | Description
None | 0
Background | 1
ReflectionAndRefraction | 2
Skylighting | 4
AnyUsage | 7
See Also
Reference
Rhino.Render Namespace