RhinoCommon API
PointFaceRelation Enumeration
 Enumerates the possible point/BrepFace spatial relationships.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PointFaceRelation
Public Enumeration PointFaceRelation
Members
Member name | Value | Description
Exterior | 0 |  Point is on the exterior (the trimmed part) of the face.
Interior | 1 |  Point is on the interior (the existing part) of the face.
Boundary | 2 |  Point is in limbo.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Geometry Namespace