RhinoCommon API
ViewCaptureWriter.VectorPathProc Delegate
[Missing <summary> documentation for "T:Rhino.Runtime.ViewCaptureWriter.VectorPathProc"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void VectorPathProc(
	int begin,
	int argb
)
Public Delegate Sub VectorPathProc (
	begin As Integer,
	argb As Integer
)
Parameters
begin
Type: System.Int32
argb
Type: System.Int32
Version Information
Rhino for Windows
Supported in: 6.24
See Also
Reference
Rhino.Runtime Namespace