RhinoCommon SDK
BrepSolidOrientation Enumeration
 Enumerates all possible Solid Orientations for a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BrepSolidOrientation
Public Enumeration BrepSolidOrientation
Members
Member name | Value | Description
None | 0 |  Brep is not a Solid.
Inward | -1 |  Brep is a Solid with inward facing normals.
Outward | 1 |  Brep is a Solid with outward facing normals.
Unknown | 2 |  Breps is a Solid but no orientation could be computed.
See Also
Reference
Rhino.Geometry Namespace