RhinoCommon SDK
SubD.SubDVertexTag Enumeration
 SubD::VertexTag identifies the type of subdivision vertex. Different tags use different subdivision algorithms to determine where the subdivision point and limit point are located. There are toplological constraints that restrict which tags can be assigned.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum SubDVertexTag
Public Enumeration SubDVertexTag
Members
Member name | Value | Description
Unset | 0 |  Not a valid vertex tag and the default value for ON_SubDVertex::m_vertex_tag. This encourages developers to thoughtfully initialize ON_SubDVertex::m_vertex_tag.
Smooth | 1 |  Must be an interior vertex. All edges ending at a smooth vertex must be tagged as ON_SubD::EdgeTag::Smooth.
Crease | 2 |  Can be an iterior or a boundary vertex. Exactly two edges ending at a crease vertex must be tagged as ON_SubD::EdgeTag::Crease. All other edges ending at a crease must be tagged as tagON_SubD::EdgeTag::smooth.
Corner | 3 |  Can be an iterior, boundary or isolated vertex. The location of a corner vertex is fixed. The all subdivision points and the limit point are at the initial vertex location. The edges ending at a corner vertex can be smooth or crease edges.
Dart | 4 |  Must be an interior vertex. Exactly one edge ending at a dart vertex must be tagged as ON_SubD::EdgeTag::Smooth. All other edges ending at a dart vertex must be tagged as tagON_SubD::EdgeTag::smooth.
See Also
Reference
Rhino.Geometry Namespace