RhinoCommon API
CoordinateSystem Enumeration
 Defines enumerated values for coordinate systems to use as references.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CoordinateSystem
Public Enumeration CoordinateSystem
Members
Member name | Value | Description
World | 0 |  The world coordinate system. This has origin (0,0,0), X unit axis is (1, 0, 0) and Y unit axis is (0, 1, 0).
Camera | 1 |  The camera coordinate system.
Clip | 2 |  The clip coordinate system.
Screen | 3 |  The screen coordinate system.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.DocObjects Namespace