RhinoCommon API
HatchPatternTable Class
 All of the hatch pattern definitions contained in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.HatchPatternTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class HatchPatternTable : IEnumerable<HatchPattern>,
	IEnumerable
Public NotInheritable Class HatchPatternTable
	Implements IEnumerable(Of HatchPattern), IEnumerable
The HatchPatternTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of patterns in the table.
In Rhino for Windows 6.5, this member is inherited from .CommonComponentTable<T>Count.
CurrentHatchPatternIndex
 At all times, there is a "current" hatch pattern. Unless otherwise specified, new objects are assigned to the current hatch pattern. The current hatch pattern is never locked, hidden, or deleted.
Document
Document that owns this table.
In Rhino for Windows 6.5, this member is inherited from .RhinoDocCommonTable<T>Document.
Item
 Conceptually, the hatch pattern table is an array of hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by HatchPattern.IsDeleted.
Top
Methods
Name | Description
Add
 Adds a new hatch pattern with specified definition to the table.
Delete(HatchPattern) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(HatchPattern, Boolean)
Find
 Finds the hatch pattern with a given name. Search ignores case.
FindIndex
 Retrieves a HatchPattern object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the hatch pattern with a given name. Search ignores case.
FindNameHash
 Finds a HatchPattern given its name hash.
GetEnumerator
In Rhino for Windows 6.5, this member is inherited from .CommonComponentTable<T>GetEnumerator().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.DocObjects.Tables Namespace