RhinoCommon SDK
Interpolator Class
 Exposes a set of standard numeric interpolation algorithms.
Inheritance Hierarchy
System.Object
 Rhino.Collections.RhinoList<Double>
 Rhino.Geometry.Interpolator
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class Interpolator : RhinoList<double>
Public Class Interpolator
	Inherits RhinoList(Of Double)
The Interpolator type exposes the following members.
Constructors
Name | Description
Interpolator()
 Constructs a new, empty Interpolator.
Interpolator(IEnumerable<Double>)
 Constructs an Interpolator from a collection of numbers.
Interpolator(Int32)
 Constructs an empty Interpolator with a certain capacity.
Interpolator(RhinoList<Double>)
 Copy all the numbers from an existing RhinoList.
Interpolator(Int32, Double)
 Constructs a new Interpolator with a specified amount of numbers.
Top
Properties
Name | Description
Cyclical
 Gets or sets a value indicating whether or not the values inside this Interpolator are to be treated as cyclical (i.e. circular).
Top
Methods
Name | Description
InterpolateCatmullRom
 Sample the list of numbers with Catmull-Rom interpolation.
InterpolateCosine
 Sample the list of numbers with cosine interpolation.
InterpolateCubic
 Sample the list of numbers with cubic interpolation.
InterpolateLinear
 Sample the list of numbers with linear interpolation.
InterpolateNearestNeighbour
 Sample the list of numbers with Nearest Neighbour interpolation.
Top
See Also
Reference
Rhino.Geometry Namespace