RhinoCommon API
SurfaceProxy Class
 Provides a base class to brep faces and other surface proxies.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.SurfaceProxy
 Rhino.Geometry.BrepFace
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SurfaceProxy : Surface
Public Class SurfaceProxy
	Inherits Surface
The SurfaceProxy type exposes the following members.
Constructors
Name | Description
SurfaceProxy
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Geometry Namespace