RhinoCommon API
RhinoReplaceObjectEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoReplaceObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoReplaceObjectEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoReplaceObjectEventArgs : EventArgs
Public Class RhinoReplaceObjectEventArgs
	Inherits EventArgs
The RhinoReplaceObjectEventArgs type exposes the following members.
Properties
Name | Description
Document
NewRhinoObject
ObjectId
OldRhinoObject
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.DocObjects Namespace