RhinoCommon API
Point3dGrid Class
 Represents a rectangular grid of 3D points.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Point3dGrid
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Point3dGrid : GeometryBase
<SerializableAttribute>
Public Class Point3dGrid
	Inherits GeometryBase
The Point3dGrid type exposes the following members.
Constructors
Name | Description
Point3dGrid()
 Initializes a rectangular grid of points, with no points in it.
Point3dGrid(Int32, Int32)
 Initializes a rectangular grid of points with a given number of columns and rows.
Point3dGrid(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.Geometry Namespace