RhinoCommon API
GumballScaleMode Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballScaleMode"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum GumballScaleMode
Public Enumeration GumballScaleMode
Members
Member name | Value | Description
Independent | 0
XY | 1
YZ | 2
ZX | 3
XYZ | 4
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.UI.Gumball Namespace