RhinoCommon API
RenderPrimitiveType Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderPrimitiveType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RenderPrimitiveType
Public Enumeration RenderPrimitiveType
Members
Member name | Value | Description
None | 0
Mesh | 1
Sphere | 2
Plane | 3
Box | 4
Cone | 5
Version Information
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.Render Namespace