RhinoCommon API
RenderMaterial Class
[Missing <summary> documentation for "T:Rhino.Render.RenderMaterial"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContent
 Rhino.Render.RenderMaterial
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class RenderMaterial : RenderContent
Public MustInherit Class RenderMaterial
	Inherits RenderContent
The RenderMaterial type exposes the following members.
Constructors
Name | Description
RenderMaterial
Initializes a new instance of the RenderMaterial class
Top
Properties
Name | Description
DefaultPreviewBackgroundType
 Set or get the default scene background for the image that appears in preview panes
DefaultPreviewGeometryType
 Set or get the default geometry that appears in preview panes
DefaultPreviewSize
 The default preview geometry size
GemMaterialGuid
GlassMaterialGuid
MetalMaterialGuid
PaintMaterialGuid
PictureMaterialGuid
PlasterMaterialGuid
PlasticMaterialGuid
SmellsLikeGem
SmellsLikeGlass
SmellsLikeMetal
SmellsLikePaint
SmellsLikePlaster
SmellsLikePlastic
SmellsLikeTexturedGem
SmellsLikeTexturedGlass
SmellsLikeTexturedMetal
SmellsLikeTexturedPaint
SmellsLikeTexturedPlaster
SmellsLikeTexturedPlastic
Top
Methods
Name | Description
CreateBasicMaterial(Material)
 Constructs a new basic material from a Material.
CreateBasicMaterial(Material, RhinoDoc)
GetTextureAmountFromUsage
GetTextureFromUsage
GetTextureOnFromUsage
HandleTexturedValue<T>
 Handle a textured content field. Values will be read into an instance of TexturedColor
SimulateMaterial(Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
SimulateMaterial(Material, Boolean)
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
TextureChildSlotName
 Override this function to provide information about which texture is used for the standard (ie - defined in ON_Texture) texture channels.
Top
See Also
Reference
Rhino.Render Namespace