RhinoCommon SDK
SubD.InteriorCreaseOption Enumeration
 Defines how interior creases are treated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum InteriorCreaseOption
Public Enumeration InteriorCreaseOption
Members
Member name | Value | Description
Unset | 0 | The interior creases option is not defined.
None | 1 | No interior creases.
AtMeshCrease | 2 | An interior subd crease will appear along coincident mesh edges where the angle between coindident vertex normals >= MinimumCreaseAngleRadians().
AtMeshEdge | 3 | An interior subd crease will appear all coincident mesh edges. Input mesh vertex normals are ignored.
See Also
Reference
Rhino.Geometry Namespace