RhinoCommon API
CullObjectEventArgs Class
[Missing <summary> documentation for "T:Rhino.Display.CullObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.CullObjectEventArgs
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CullObjectEventArgs : DrawEventArgs
Public Class CullObjectEventArgs
	Inherits DrawEventArgs
The CullObjectEventArgs type exposes the following members.
Properties
Name | Description
CullObject
RhinoObject
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rhino.Display Namespace