RhinoCommon API
PickStyle Enumeration
 Provides picking values that describe common CAD picking behavior.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PickStyle
Public Enumeration PickStyle
Members
Member name | Value | Description
None | 0
PointPick | 1
WindowPick | 2
CrossingPick | 3
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.27
See Also
Reference
Rhino.Input.Custom Namespace