RhinoCommon API
MeshingParameterStyle Enumeration
 Type of Mesh Parameters used by the RhinoDoc for meshing objects
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MeshingParameterStyle
Public Enumeration MeshingParameterStyle
Members
Member name | Value | Description
None | 0 | No style
Fast | 1
Quality | 2
Custom | 9
PerObject | 10
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Geometry Namespace