RhinoCommon API
InstanceDefinitionGeometry Class
 Represents a block definition in a File3dm. This is the same as Rhino.DocObjects.InstanceDefinition, but not associated with a RhinoDoc.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.InstanceDefinitionGeometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class InstanceDefinitionGeometry : GeometryBase
Public Class InstanceDefinitionGeometry
	Inherits GeometryBase
The InstanceDefinitionGeometry type exposes the following members.
Constructors
Name | Description
InstanceDefinitionGeometry
 Initializes a new block definition.
Top
Properties
Name | Description
ComponentType
 Returns InstanceDefinition.
 (Overrides ModelComponent.ComponentType.)
Description
 Gets or sets the description of the definition.
Id
 unique id for this instance definition
In Rhino for Windows 6.26, this member is inherited from .ModelComponentId.
In Rhino for Windows 6.26, this member is inherited from .CommonObjectIsDocumentControlled.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Name
 Gets or sets the name of the definition.
In Rhino for Windows 6.26, this member is inherited from .ModelComponentName.
Top
Methods
Name | Description
GetObjectIds
 list of object ids in the instance geometry table
In Rhino for Windows 6.26, this member is inherited from .CommonObjectOnSwitchToNonConst().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Geometry Namespace