RhinoCommon SDK
FileObjReadOptions Class
 Options used when reading an obj file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileObjReadOptions
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class FileObjReadOptions
Public Class FileObjReadOptions
The FileObjReadOptions type exposes the following members.
Constructors
Name | Description
FileObjReadOptions
Initializes a new instance of the FileObjReadOptions class
Top
Properties
Name | Description
IgnoreTextures
 Determines whether textures are read from the .mtl file, if it exists.
MapYtoZ
 Setting to transform OBJ's Y axis to Rhino's Z axis
MorphTargetOnly
 TODO
ReverseGroupOrder
 Determines how groups/layers are nested when reading an obj file. Left to Right (default = false) or Right to Left (true)
Split32BitTextures
UseObjGroupsAs
UseObjObjects
 Determines whether or not "o"s in the obj file will be interpreted as objects in the Rhino model
Top
Methods
Name | Description
GetTransform
 Calculates the YToZ transform.
Top
Fields
Name | Description
ReadOptions
 Rhino's FileReadOptions passed into ReadFile
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.FileIO Namespace