RhinoCommon API
BitmapEntry Class
 Rhino.DocObjects.Tables.BitmapTable entry
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.BitmapEntry
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class BitmapEntry : CommonObject
<SerializableAttribute>
Public Class BitmapEntry
	Inherits CommonObject
The BitmapEntry type exposes the following members.
Constructors
Name | Description
BitmapEntry
 serialization constructor
Top
Properties
Name | Description
ComponentType
 Returns Image.
 (Overrides ModelComponent.ComponentType.)
FileName
The name of this bitmap.
IsReference
 Gets a value indicting whether this bitmap is a referenced bitmap. Referenced bitmaps are part of referenced documents.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
Save
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.25
See Also
Reference
Rhino.DocObjects Namespace