RhinoCommon API
WriteFileResult Enumeration
[Missing <summary> documentation for "T:Rhino.PlugIns.WriteFileResult"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum WriteFileResult
Public Enumeration WriteFileResult
Members
Member name | Value | Description
Cancel | -1
Failure | 0
Success | 1
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.PlugIns Namespace