RhinoCommon API
ShowMessageIcon Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageIcon"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ShowMessageIcon
Public Enumeration ShowMessageIcon
Members
Member name | Value | Description
None | 0
Error | 16
Hand | 16
Stop | 16
Question | 32
Exclamation | 48
Warning | 48
Information | 64
Asterisk | 64
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.22
See Also
Reference
Rhino.UI Namespace