RhinoCommon API
TextureRenderHashFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureRenderHashFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureRenderHashFlags
Public Enumeration TextureRenderHashFlags
Members
Member name | Value | Description
ExcludeLocalMapping | 1
Version Information
Rhino for Windows
Supported in: 6.26
See Also
Reference
Rhino.Render Namespace