RhinoCommon API
LineCircleIntersection Enumeration
 Represents all possible cases of a Line|Circle intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LineCircleIntersection
Public Enumeration LineCircleIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Single | 1 |  One intersection.
Multiple | 2 |  Two intersections.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.3
See Also
Reference
Rhino.Geometry.Intersect Namespace