RhinoCommon SDK
PickMode Enumeration
 Picking can happen in wireframe or shaded display mode
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PickMode
Public Enumeration PickMode
Members
Member name | Value | Description
Wireframe | 1
Shaded | 2
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Input.Custom Namespace